{"quest":{"name":"You Can Count on It","location":"The Firmament","id":69615,"patch":5.5,"sort":1502,"unlocksFunction":1,"eventIcon":71341,"issuer":1035529,"target":1036490,"genre":84,"journal":["Francel is delighted to see two familiar faces in quick succession."],"objectives":["Find the suspiciously familiar man.","Speak with Maurilette.","Speak with Maelie.","Speak with Maelie again."],"dialogue":[{"name":"FRANCEL","text":"<span class=\"highlight\">Forename</span>! What a coincidence that you should be here too!"},{"name":"FRANCEL","text":"Nary a moment ago, I caught sight of another familiar face─though his attire, I noted, was anything but familiar."},{"name":"FRANCEL","text":"Ere I could hail our mutual friend, he hurried off in the direction of Ser Vaindreau's Grace. It seemed as though he did not wish to be seen, but if you are curious, mayhap you would like to seek him out."},{"name":"FRANCEL","text":"Did you find our friend? Lest you've forgotten, he was headed in the direction of Ser Vaindreau's Grace, and was attired in an unfamiliar fashion."},{"name":"CHARLEMEND","text":"...<span class=\"highlight\">Forename</span>!? What in the Fury's name are you doing here!?"},{"name":"CHARLEMEND","text":"Er...not that it is for me─a person you most assuredly do not know─to say where you should or shouldn't be. Nay, I was merely expressing my surprise at being in the presence of a great hero."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"If you say so, my lord. But why are you dressed like that?"},{"name":"A1","text":"Are you feeling well, Lord Charlemend?"},{"name":"CHARLEMEND","text":"(-Charlemend-)Ack, and there I thought I had disguised myself meticulously..."},{"name":"CHARLEMEND","text":"(-Charlemend-)I suppose I ought to explain."},{"name":"CHARLEMEND","text":"(-Charlemend-)You see, I had learned that Ser Vaindreau's Grace is presently recruiting aides, and came here to present myself for consideration."},{"name":"CHARLEMEND","text":"(-Charlemend-)As an aide, I would provide support to the chirurgeons and nurses, such as managing supplies and seeing to the patients' everyday needs."},{"name":"CHARLEMEND","text":"(-Charlemend-)While such staff are not fully fledged employees, they are afforded the chance to learn the healer's craft while earning a living wage. Not that I require such things, mind you."},{"name":"CHARLEMEND","text":"(-Charlemend-)...I recently had occasion to speak with a knight of my house, you see─one who was maimed in the line of duty. And I was made keenly aware that I was not doing enough to provide for those who had given me leal service. By working here, I hope to redress my negligence in some small way."},{"name":"CHARLEMEND","text":"(-Charlemend-)But that is not the whole of it, if truth be told."},{"name":"CHARLEMEND","text":"(-Charlemend-)'Tis also my hope that my service would set an example for my fellow nobles, many of whom struggle to accept that all Ishgardians are equal in the Fury's eyes. They cling to the old ways, and look down upon the commonfolk."},{"name":"CHARLEMEND","text":"(-Charlemend-)Yet now that I stand here, I find my courage has deserted me. The prospect of undergoing scrutiny is proving to be somewhat daunting, and I can't bring myself to step through the infirmary doors..."},{"name":"CHARLEMEND","text":"(-Charlemend-)Forgive me, <span class=\"highlight\">Forename</span>, but will you not put in a good word on my behalf to the chief nurse within? Maurilette is her name, and she has charge over recruitment."},{"name":"CHARLEMEND","text":"With the hero of Ishgard vouching for me, surely I will not be refused!"},{"name":"MAURILETTE","text":"Greetings and welcome to Ser Vaindreau's Grace. If I may say so, you appear as hale and whole as they come. I assume you are here to visit a patient?"},{"name":"MAURILETTE","text":"Oh, you wish to recommend someone as an aide? Coming from a renowned hero, it must be a fine candidate indeed!"},{"name":"CHARLEMEND","text":"...Ahem. Begging your pardons, but I'm given to understand that the infirmary is presently recruiting aides."},{"name":"MAURILETTE","text":"Why, Lord Charlemend! To what do we owe the honor of your visit? If you wish to make another kind donation, our staff upstairs would be glad to attend you."},{"name":"CHARLEMEND","text":"What!? Can every man and his chocobo see through my disguise!?"},{"name":"CHARLEMEND","text":"&lt;sigh&gt; Never mind... Now, while I'm always pleased to donate, that is not my primary purpose today. I wish to be considered for an aide position."},{"name":"MAURILETTE","text":"An <span class=\"emphasis\">aide</span> position? Are...are you certain of this, my lord?"},{"name":"CHARLEMEND","text":"I am. And in this capacity, I bid you think of me not as the Count de Durendaire, but simply another Ishgardian."},{"name":"MAURILETTE","text":"Well, if this is your wish..."},{"name":"MAURILETTE","text":"I should mention that there is another applicant─an orphan girl by the name of Maelie."},{"name":"MAURILETTE","text":"I believe you are acquainted with her, <span class=\"highlight\">Forename</span>. She is the one who fell from the Vault and was saved by a white dragon."},{"name":"MAURILETTE","text":"Truth be told, she is too young for the work. But seeing her enthusiasm, I am minded to give her a chance."},{"name":"MAURILETTE","text":"If it isn't too much trouble, my lor─er...I mean, Charlemend, may I ask you to fetch her from Rolanberry Field? I would speak with the two of you together."},{"name":"CHARLEMEND","text":"Of course. I shall go at once."},{"name":"CHARLEMEND","text":"You know the girl, yes? If you aren't otherwise occupied, perhaps you can come along and introduce us."},{"name":"CHARLEMEND","text":"Hmmm, could she be the one...?"},{"name":"MAURILETTE","text":"You should find Maelie at Rolanberry Field. I eagerly await your return."},{"name":"MAELIE","text":"Oh, it's you! Who's the old man? Your friend?"},{"name":"CHARLEMEND","text":"<span class=\"emphasis\">This</span> is Maelie? Good gods, that she should be so young..."},{"name":"CHARLEMEND","text":"Ah, but where are my manners? My name is Charlemend, and I've been instructed to bring you to Ser Vaindreau's Grace. Lady Maurilette wishes to have words with the two of us regarding the aide position."},{"name":"MAELIE","text":"Really!? Oh, perhaps she'll let me work at the infirmary after all!"},{"name":"MAELIE","text":"And you want to work there too, do you? Come on, let's hurry!"},{"name":"CHARLEMEND","text":"Such a lively child..."},{"name":"MAURILETTE","text":"There you all are."},{"name":"MAELIE","text":"I'm here, Maurilette! You wanted to speak with me? About workin' here?"},{"name":"MAURILETTE","text":"That's correct, little one."},{"name":"MAURILETTE","text":"My thanks for fetching her, Charlemend."},{"name":"MAURILETTE","text":"Now then, I requested your presence for no other reason than to ask you a question: why do you wish to work here?"},{"name":"MAELIE","text":"Well, ever since <span class=\"highlight\">Forename</span> and Vidofnir helped me, I've wanted to be someone who can help others."},{"name":"MAELIE","text":"It don't matter who they are or where they're from. I want to help <span class=\"emphasis\">everyone</span>."},{"name":"MAURILETTE","text":"That is a wonderful desire. But know that to work at the infirmary is to be responsible for no less than the lives of others. There will be trying times, but come what may, you cannot forsake your duty."},{"name":"MAURILETTE","text":"For instance, there may be patients who judge you not less, but more harshly, on account of your being a child. But you cannot allow yourself to be discouraged."},{"name":"MAURILETTE","text":"And at a bare minimum, you will be expected to know your letters and numbers, for lives could well depend on it. Do you think you will be equal to the task?"},{"name":"MAELIE","text":"Well, they teach us letters and numbers at the orphanage...but I'm not much good at it."},{"name":"MAURILETTE","text":"And you, Charlemend. I feel obliged to point out that many of our patients are commoners who once served nobles as soldiers."},{"name":"MAURILETTE","text":"When they discover your identity, there are those who may assume the worst of you. That you are, for instance─and forgive me my bluntness─an eccentric nobleman indulging a whim. They may not speak their minds, but their conduct towards you will be more than telling."},{"name":"MAURILETTE","text":"In the face of such disdain, do you think you will be able to perform your duties?"},{"name":"CHARLEMEND","text":"I offer my services in the full awareness that some may not take kindly to my presence. Regardless of how I am treated, I am determined to perform my duties to the best of my ability."},{"name":"CHARLEMEND","text":"Be that as it may, I confess I do not always know how best to relate to the commonfolk. And I fear it may cause me to struggle to win the patients' trust..."},{"name":"Q2","text":"What will you say?"},{"name":"Q2","text":"You've won over foreign merchants. You can win over your own people."},{"name":"Q2","text":"It may not be easy, but I have faith in you."},{"name":"CHARLEMEND","text":"Rest assured none of this deters me from my course. If there is one thing I have learned, it is that <span class=\"emphasis\">anyone</span> can learn─so long as they are willing. And for a blessing, I am in the presence of an ideal teacher."},{"name":"CHARLEMEND","text":"If you would be so kind as to teach me about your world, child, I would be glad to tutor you in letters and numbers."},{"name":"CHARLEMEND","text":"As individuals, we may have shortcomings, but together we can overcome them to better serve the needs of those in our care."},{"name":"MAELIE","text":"I'm willin' to learn too, Maurilette! So please, give us a chance!"},{"name":"MAURILETTE","text":"Very well, I believe I have heard enough. On behalf of all of us at Ser Vaindreau's Grace, I welcome the two of you to our crew. Though I have spoken some stern words, know that I will be there to help you on your way."},{"name":"MAURILETTE","text":"Now, without further ado, I shall assign you your first task. Our stores of daily necessities are dwindling, and I would like you to replenish them. As we have no regular supplier at this time, you may procure the items from wherever you deem fit."},{"name":"CHARLEMEND","text":"We shall set about it at once. The first step will be to seek out sources for that which we require..."},{"name":"CHARLEMEND","text":"...Yet why procure from just anyone when we already have an eminently capable artisan among us?"},{"name":"CHARLEMEND","text":"<span class=\"highlight\">Forename</span>, your skills are known far and wide. We would be most assured were you to consent to being our supplier."},{"name":"MAURILETTE","text":"Wonderful. With you providing them, we can look forward to necessities of the highest quality."},{"name":"MAURILETTE","text":"On that subject, are you perchance familiar with the House of Splendors? The consortium has recently come to Ishgard, and operates a stall just outside the infirmary."},{"name":"MAURILETTE","text":"On that subject, are you perchance familiar with the House of Splendors? The consortium contributes to welfare projects in our nation, and operates a stall just outside the infirmary."},{"name":"MAURILETTE","text":"Should you require materials for your work, you would do well to seek them out."}],"reward":{"items":[{"num":3,"id":12861,"one":1,"hq":1},{"num":3,"id":12866,"one":1,"hq":1}]},"reqs":{"jobs":[{"lvl":70,"id":35}],"questsType":"all","quests":[69538,69496]},"next":[69616]},"partials":[{"type":"npc","id":"1035529","obj":{"i":1035529,"n":"Francel","l":3435,"q":2}},{"type":"npc","id":"1036490","obj":{"i":1036490,"n":"Maelie","l":3435,"q":1}},{"type":"item","id":"12861","obj":{"i":12861,"n":"Baked Onion Soup","l":125,"c":24116,"t":46}},{"type":"item","id":"12866","obj":{"i":12866,"n":"Stuffed Cabbage Rolls","l":125,"c":24206,"t":46,"p":891}},{"type":"quest","id":"69538","obj":{"i":69538,"n":"Smiles Cross the Sky","g":83,"l":"The Firmament","s":22,"f":1}},{"type":"quest","id":"69496","obj":{"i":69496,"n":"The Brume Lifts","g":84,"l":"The Firmament","s":1501,"f":1}},{"type":"quest","id":"69616","obj":{"i":69616,"n":"Those Who Serve","g":84,"l":"The Firmament","s":1503,"f":1}}]}