{"quest":{"name":"Reaching Out","location":"Zadnor","id":69622,"patch":5.55,"sort":304,"unlocksFunction":1,"eventIcon":71341,"issuer":1036656,"target":1036656,"genre":76,"journal":["Mikoto is ready to send you back out into the field."],"objectives":["Investigate the designated location.","Speak with Mikoto."],"dialogue":[{"name":"SYSTEM","text":"A Resistance rank of [#1] is required to proceed with this quest."},{"name":"MIKOTO","text":"The Resistance is preparing to secure a new outpost. After an analysis of the area, however, I regret to say there is nowhere near enough residual aether to power the barrier."},{"name":"MIKOTO","text":"To make matters worse, its rather awkward location requires us to redirect multiple currents to sustain a sufficient flow of energy."},{"name":"LILJA","text":"That's where these beauties come in─the defluxion aether manipulators, Mark II and Mark III! What sets them apart from the first model, you may ask...? Well, apart from the name, not a lot, but they <span class=\"emphasis\">are</span> newer, if that counts for anything!"},{"name":"MIKOTO","text":"Though we both wish we could go with you, I fear we would only slow you down. Please, be safe out there."},{"name":"MIKOTO","text":"(-Mikoto-)You have reached the designated location, yes? Readying transmission protocols."},{"name":"MIKOTO","text":"(-Mikoto-)So far, so good. Has the D.A.M. burrowed into the ground?"},{"name":"MIKOTO","text":"(-Mikoto-)Excellent. Proceed to the next site, and stay vigilant─there is no telling when you may encounter imperial forces."},{"name":"MIKOTO","text":"(-Mikoto-)Excellent. Return to the outpost and we shall handle the rest."},{"name":"MIKOTO","text":"(-Mikoto-)Imperials? They didn't get the better of you, did they? No... I suppose you wouldn't be contacting me if they did. &lt;sigh&gt; I really must learn not to jump to conclusions... Ahem."},{"name":"MIKOTO","text":"(-Mikoto-)The D.A.M. appears to be fully operational. How are things there?"},{"name":"MIKOTO","text":"(-Mikoto-)Excellent. Proceed to the next site, and stay vigilant─there is no telling when you may encounter imperial forces."},{"name":"MIKOTO","text":"(-Mikoto-)Excellent. Return to the outpost and we shall handle the rest."},{"name":"MIKOTO","text":"Welcome back. Our sensors detect steady streams of aether flowing toward the site of the new outpost."},{"name":"MIKOTO","text":"Now it is up to the Resistance to drive away the imperials. Once they have, a substantial confluence of energy should be available to power a new barrier."},{"name":"LILJA","text":"Well, everything seems to be under control here, so I'd better get going."},{"name":"LILJA","text":"Oh, right. Mikoto's gathered some promising data to help the chief deal with the <span class=\"emphasis\">Dalriada</span>."},{"name":"MIKOTO","text":"It pertains to my findings on the inner workings of the crystal foci. I believe it may be of use to him."},{"name":"LILJA","text":"The chief said he'd be heading back to Doma after finishing maintenance on Seiryu's Wall. Rather than drag him all the way back here, it seems quicker if I take the data to him myself. But don't worry─I'll be back before you know it."},{"name":"LILJA","text":"Ah, before I go... Mikoto. Is there anything else you'd like me to pass on to Cid?"},{"name":"LILJA","text":"It's not good to keep your emotions bottled up like that, you know. Why don't you tell him how you feel?"},{"name":"MIKOTO","text":"How I f─ &lt;gasp&gt; Lilja! That is wholly and utterly unprofessional! I-I would never... <span class=\"emphasis\">He</span> would never! And even if we did, we...<br>This is neither the time nor the place to discuss such matters!"},{"name":"LILJA","text":"I think it is. I've seen far too many people live to regret words left unspoken."},{"name":"LILJA","text":"Just think on it, will you? And try not to miss me while I'm away!"},{"name":"MIKOTO","text":"Um... Is there any chance you could forget that entire conversation?"},{"name":"MIKOTO","text":"I was only joking, but thank you for trying!"},{"name":"MIKOTO","text":"To tell the truth, since entering the Studium, my life has had but one singular purpose─the pursuit of knowledge. Yet for all my research and scholarly works, I never learned what it truly means to live."},{"name":"MIKOTO","text":"At least, that is what Moenbryda would tell me. She would often admonish me, always insisting I spend time with the other students, or at the very least step away from my dusty tomes for some fresh air."},{"name":"MIKOTO","text":"Perhaps she hoped I might find someone I cherished more than my books, though sadly she never had the chance to see it."},{"name":"MIKOTO","text":"Cid is truly a remarkable man, and I'll not deny our shared interest in the sciences. During the short time we've worked together, we've become good friends."},{"name":"MIKOTO","text":"And as his friend, I understand the great burdens of his mind. Even now, he struggles to break free from his ties to the Empire and his father's terrible legacy..."},{"name":"MIKOTO","text":"Which is why I wish to do all within my power to support him. As a friend, mind you. My feelings toward Cid are similar to those I felt for Moenbryda─respect and admiration."},{"name":"MIKOTO","text":"As much as I hate to disappoint Lilja, that is the way of things. So please, don't read too deeply into it."},{"name":"MIKOTO","text":"M-Master Gerolt! What are you doing here?"},{"name":"GEROLT","text":"Better question'd be what are <span class=\"emphasis\">you</span> doin' here? Should be you payin' the visit to Cid in Doma."},{"name":"GEROLT","text":"Nothin' to be embarrassed about, lass. All romances have to start somewhere, and I agree the two o' ye make a good match."},{"name":"GEROLT","text":"But you need to act quick. Even <span class=\"emphasis\">I</span> can see the man's a fine glass of ale, and I reckon it won't be long afore some pretty thing snatches him up to take a swig."},{"name":"RIAN","text":"Well? Is it ready?"},{"name":"MENENIUS","text":"The modifications will require more time."},{"name":"RIAN","text":"You can't be serious! It's been ages since the damn thing was excavated. Have the engineers been sitting around with their thumbs up their arses all this time!?"},{"name":"MENENIUS","text":"Far from it. Given that this is unexplored territory, we must proceed with caution."},{"name":"RIAN","text":"Tell that to the Resistance soldiers a stone's throw from our bloody front door. It won't be long before they tear it down."},{"name":"RIAN","text":"Why not withdraw to Dalmasca? Surely they can finish their modifications on the way back?"},{"name":"MENENIUS","text":"Withdraw? You would abandon everything we have labored for here in Bozja? And that is not all we stand to lose... Surely, you have not forgotten the events of Castrum Meridianum?"},{"name":"RIAN","text":"I only know what I've heard, that Gaius's pet ended up biting the hand that fed it before turning the place upside down."},{"name":"MENENIUS","text":"Not quite the wording used in the reports, but accurate enough... Knowing his plans would soon be thwarted, he deployed an anti-eikon warmachina in a final attempt to drive back the Eorzean forces. He could not contain its power, and because of his hubris, the castrum was wiped off the map."},{"name":"MENENIUS","text":"In short, the relics of the Allagans are not to be trifled with. It takes but one mistake for our plans to fall to ruin."},{"name":"RIAN","text":"And yet Sicinius has seen fit to scurry off to some far-flung hole when he's needed most. This was <span class=\"emphasis\">his</span> scheme, not ours. He should be the one overseeing all this."},{"name":"MENENIUS","text":"...Perhaps you should put this pent-up frustration of yours to use outside. After all, in light of Misija's recent failure, it now falls to us to rout the Resistance."},{"name":"RIAN","text":"Really? You're <span class=\"emphasis\">asking</span> me to go out there? Hah, it's about damn time!"},{"name":"MENENIUS","text":"Hmph. Somehow I knew you would relish the opportunity to get your hands dirty."},{"name":"RIAN","text":"Oh, I assure you they'll be absolutely filthy by the time I return."},{"name":"MIKOTO","text":"It seems the Resistance already has their sights set on another potential outpost site. I can only hope they secure the location without heavy losses."},{"name":"SYSTEM","text":"The next quest can be accepted by speaking with Dmitar after reaching Resistance rank [#1] or higher."}],"reward":{"gil":979,"gcseal":500000},"reqs":{"jobs":[{"lvl":71,"id":142}],"quests":[69628]},"next":[69629]},"partials":[{"type":"npc","id":"1036656","obj":{"i":1036656,"n":"Mikoto","l":3662,"q":1}},{"type":"quest","id":"69628","obj":{"i":69628,"n":"Where Eagles Roost","g":76,"l":"Zadnor","s":303,"f":1}},{"type":"quest","id":"69629","obj":{"i":69629,"n":"In Their Shadow","g":76,"l":"Zadnor","s":305,"f":1}}]}