{"quest":{"name":"Rising Calm","location":"Ul'dah","id":69627,"patch":5.55,"sort":300,"icon":101068,"eventIcon":71221,"issuer":1036686,"target":1036689,"genre":202,"journal":["Kipih Jakkya is looking around in consternation.<br>※This quest is available for a limited time only.","Kipih Jakkya, reporter for Gridanian tabloid <span class=\"emphasis\">The Raven</span>, shares with you the details of her latest potential scoop. It would seem she is hot on the trail of some mysterious figure responsible for buying up a suspicious quantity of Nymeia lilies, but needs someone familiar with Ul'dah to assist in her investigations. Perhaps the notables of the Quicksand can aid in your inquiries.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Mistress Momodi herself fields your questions, the description you provide reminding her of a request made by the infamous “wandering minstrel” involving the transport of a sizable cargo to the Alchemists' Guild. Although conceding the similarities may be mere coincidence, you nevertheless decide to pay a visit to Guildmaster Severian.","The self-absorbed Severian almost dismisses you out of hand, but at the last moment recalls a task to process a vast quantity of floral material. His brief flicker of interest in the subject soon extinguished, the guildmaster directs you to speak with the guild's steadfast receptionist, Deitrich, for the details.","Without revealing the nature of the finished product, Deitrich explains that the fruits of their labor are to be distributed amongst the populace over the course of the Rising. If Kipih would learn more, it seems there is no recourse left but to accost the minstrel himself. It is time to return to the Quicksand.","After digesting the information you brought back from the Alchemists' Guild, Kipih agrees that an “on the spot” interview is in order. According to the Quicksand's clientele, the minstrel should be preparing to put on a performance in the vicinity of the Ruby Road Exchange.","The wandering minstrel welcomes your questions, relieved to hear that his surprise was not inadvertently spoiled. On the contrary, rather than turn you away, the nomadic musician insists that you participate in his plan to distribute bundles of custom-made potpourri to the masses. Kipih suggests that the two of you return to the Quicksand, whence news of your aromatic offerings should reach a wide and varied audience.","You finish handing out your bundles of calming potpourri, warmed by the knowledge that your efforts will help soothe hearts yet suffering from the violence of the Calamity. Return to the wandering minstrel at the Ruby Road Exchange and report the completion of your task.","You locate the itinerant bard, and Kipih is moved to share her own memories of the Calamity. The exchange inspires the minstrel, who composes a verse dedicated to the continued safe passage of those who yet ascend the path out of catastrophe and despair. Without warning, you are transported beyond the boundaries of time and space, to meet and speak with the enigmatic Naoki Yoshida. Upon your return to “reality,” the minstrel favors you with yet another composition, compounding his wishes that you─indeed, all who seek to survive in this world─are afforded the smoothest road possible for the journey still to come."],"objectives":["Speak with Momodi at the Quicksand.","Speak with Severian at the Alchemists' Guild.","Speak with Deitrich.","Return to Kipih Jakkya at the Quicksand.","Speak with the wandering minstrel at the Ruby Road Exchange.","Speak with Kipih Jakkya at the Quicksand.","Speak with the wandering minstrel at the Ruby Road Exchange."],"dialogue":[{"name":"KIPIHJAKKYA","text":"<span class=\"highlight\">Forename</span>!? What an astonishing coincidence!"},{"name":"KIPIHJAKKYA","text":"...What do you mean, who am I? I'm Kipih Jakkya, reporter for <span class=\"emphasis\">The Raven</span>! You helped me investigate that “visitor from another world,” remember!?"},{"name":"KIPIHJAKKYA","text":"Anyway, this is perfect─I could use your assistance with another story. Assuming you have the time, that is?"},{"name":"KIPIHJAKKYA","text":"Oh, you're an adventurer, are you? Was there something I can assist you with...?"},{"name":"KIPIHJAKKYA","text":"...Now that I think about it, perhaps it is <span class=\"emphasis\">you</span> who can assist <span class=\"emphasis\">me</span>."},{"name":"KIPIHJAKKYA","text":"I am Kipih Jakkya, reporter for Gridania's leading tabloid, <span class=\"emphasis\">The Raven</span>! Might I steal a moment of your time?"},{"name":"KIPIHJAKKYA","text":"So, here's the thing. Just recently, an unusual visitor cut through Gridania's markets like a scythe, in a frenzy to purchase every Nymeia lily available. And I mean all of them!"},{"name":"KIPIHJAKKYA","text":"For what purpose, I hear you ask? Well, my friend, I sense the answer to that question will provide the basis for my next scoop, so I did some nosing around."},{"name":"KIPIHJAKKYA","text":"No one I talked to could put a name to our mysterious flower fancier, but by all accounts, he and his cargo hold of lilies had departed for Ul'dah. Not wanting the trail to grow cold, I quickly grabbed my quill and notepad, and boarded an airship myself..."},{"name":"KIPIHJAKKYA","text":"...And was quickly reminded of how hard it is to chase a story in unfamiliar territory. You know this town and its people well enough though, don't you? What say you to lending a hand to my investigative efforts?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'd be happy to!"},{"name":"A1","text":"I suppose if you need a guide..."},{"name":"KIPIHJAKKYA","text":"Wonderful! Then we've no time to lose."},{"name":"KIPIHJAKKYA","text":"First things first, we pay a visit to the nearest drinking establishment. The local tavern is always the best place to pick up tidbits of gossip and rumor!"},{"name":"KIPIHJAKKYA","text":"If I recall correctly, the proprietress here serves the Adventurers' Guild in the same capacity as our Mother Miounne does in Gridania. For one so petite, she certainly exudes a commanding presence."},{"name":"MOMODI","text":"My, my, those are some serious faces. What can I do for you this fine <span class=\"alternative-container\"><span class=\"alternative\">evenin'</span><span class=\"alternative\">mornin'</span><span class=\"alternative\">afternoon</span></span>?"},{"name":"MOMODI","text":"Oooh, playin' reporter, are we? Sounds like fun. Let's hear your questions, then."},{"name":"KIPIHJAKKYA","text":"Ahem. We are attempting to track down a particular someone who purchased a suspiciously large number of Nymeia lilies in Gridania before transporting them here to Ul'dah. Any idea of who this person might be?"},{"name":"MOMODI","text":"Hmmm. We've more than our fair share of traders comin' and goin', and a large shipment arrivin' in the city is hardly a noteworthy occurrence."},{"name":"MOMODI","text":"But now that you mention it... I do remember this florid minstrel fellow who came in just the other day. Said he'd pulled in from Gridania, and needed help haulin' a hefty delivery to the Alchemists' Guild."},{"name":"MOMODI","text":"He's actually a familiar face in these parts. Never did get his name, though, strangely enough..."},{"name":"KIPIHJAKKYA","text":"...A nameless traveler arriving from Gridania with a sizable cargo to move. That sounds promising!"},{"name":"MOMODI","text":"Like I said, it was just a request to move cargo."},{"name":"MOMODI","text":"Before you run off to a possible dead end with the alchemists, I suggest you fish for more information inside the Quicksand. After all, where else can you find so many gossipy adventurers crammed into one spot?"},{"name":"KIPIHJAKKYA","text":"That certainly makes sense. Between the two of us, however, I see no reason why we cannot do both!"},{"name":"KIPIHJAKKYA","text":"I shall stay here and interview the clientele, while you chase down our other lead at the Alchemists' Guild. What do you think?"},{"name":"KIPIHJAKKYA","text":"Then that will be our plan! Once you've spoken with the potion mixers, make your way back here and we can discuss any new revelations."},{"name":"KIPIHJAKKYA","text":"Asking the right questions is a reporter's most vital skill. I'll soon have these adventurers spilling the stories we need to hear!"},{"name":"MOMODI","text":"It might be as you already know this, but Severian, the alchemists' guildmaster, can be an...uncooperative sort. Probably best that you're the one who's goin' to talk with him."},{"name":"SEVERIAN","text":"Ah, my loyal assistant! What brings you to the guild at this hour? ...Hah! As if I paid attention to the mundane concerns of “timekeeping.” Have you some stimulating morsel of esoteric wisdom to share?"},{"name":"SEVERIAN","text":"You brought questions? ...For a tabloid piece!? Think you that I, a thrall to academic exertion, have even a moment to spare on such trivialities!?"},{"name":"SEVERIAN","text":"So boldly do you approach a master of his profession. I warn you: this matter best be deserving of the precious moments you steal away from my unending research."},{"name":"SEVERIAN","text":"You question me for a <span class=\"emphasis\">tabloid</span> piece!? Away with you! I refuse to waste another instant on this trivial nonsense!"},{"name":"SEVERIAN","text":"Ah, but just a moment... Perhaps there is a shred of scholarly value to this after all. I vaguely recall the flamboyant character of whom you speak, and his request to process a vast quantity of floral material..."},{"name":"SEVERIAN","text":"'Tis laughable that I would undertake such a menial chore, of course, so I assigned the task to my subordinates. If you wish to discuss the tedious details, Deitrich is your man."},{"name":"SEVERIAN","text":"Go and bother Deitrich, now. Persist with your pestering, and I shall enlist you as a test subject for experimental elixirs."},{"name":"DEITRICH","text":"Why, I should be delighted to assist you. This is regarding that large delivery of Nymeia lilies...?"},{"name":"DEITRICH","text":"Yes, the guild did accept a task involving said flowers, as commissioned by a nomadic minstrel gentleman."},{"name":"DEITRICH","text":"And though I cannot reveal the nature of what we produced, I can tell you that it shall be distributed amongst the populace as part of the events of the Rising. If you wish to know more, then might I suggest you speak to the gentleman himself?"},{"name":"SEVERIAN","text":"The minstrel's request was not daunting for its complexity, merely for its sheer volume. And we could not rely on─or indeed, even expect─the briefest assistance from Master Severian..."},{"name":"MOMODI","text":"Master Severian was his usual prickly self, then? In a way, it's reassurin'─like all is right with the world."},{"name":"KIPIHJAKKYA","text":"Adventurer, you're back! Did the alchemists offer up any new information?"},{"name":"KIPIHJAKKYA","text":"So to summarize: this famously unnamed minstrel of nomadic inclination commissioned the manufacture of some as-yet-unknown item to be handed out during the Rising..."},{"name":"KIPIHJAKKYA","text":"Oh, I heartily agree that we should speak with him directly. And as luck may have it, I've just discovered that he means to put on a performance at the Ruby Road Exchange."},{"name":"KIPIHJAKKYA","text":"I think it's time for one of my patented “on the spot” interviews, don't you?"},{"name":"KIPIHJAKKYA","text":"If we hurry over, we can catch him before he takes the stage."},{"name":"KIPIHJAKKYA","text":"That colorful fellow there must be our minstrel..."},{"name":"KIPIHJAKKYA","text":"Greetings, sir! I'm terribly sorry to interrupt, but you <span class=\"emphasis\">are</span> the famous “wandering minstrel,” are you not?"},{"name":"WANDERINGMINSTREL","text":"I am indeed. And what might I do for you fine people?"},{"name":"WANDERINGMINSTREL","text":"I am indeed..."},{"name":"WANDERINGMINSTREL","text":"And look whom you've brought to see me! Was there aught I might do for you fine people?"},{"name":"KIPIHJAKKYA","text":"I've been following you, to be perfectly honest. I am curious to learn more about the wagonload of lilies you turned over to the alchemists...not to mention your plans to distribute the results of their work."},{"name":"WANDERINGMINSTREL","text":"You followed me!? But how did y─? I mean, why would you...?"},{"name":"WANDERINGMINSTREL","text":"Ah, a writer for <span class=\"emphasis\">The Raven</span>... That explains much. And did you also learn what I tasked the alchemists to create? Is the coeurl out of the bag for all to smell?"},{"name":"KIPIHJAKKYA","text":"No, I... We were hoping you might tell us."},{"name":"WANDERINGMINSTREL","text":"Good, then my surprise remains unspoiled. The plan, if you must know, is to hand out bundles of potpourri to all and sundry during the Rising."},{"name":"KIPIHJAKKYA","text":"As in...flowers mixed with spices? That aromatic stuff you see in bowls on parlor tables and the like?"},{"name":"WANDERINGMINSTREL","text":"The very same. Except <span class=\"emphasis\">my</span> potpourri will delight the eyes as much as the nose, thanks to the alchemical wizardry infused by my co-conspirators."},{"name":"WANDERINGMINSTREL","text":"Yet even without such enhancements, the scent of Nymeia lilies is known to promote calm and tranquility."},{"name":"WANDERINGMINSTREL","text":"The Rising is a time of remembrance. Of mourning. It is a time when sorrow can overwhelm folk who lost friends and loved ones in the Seventh Umbral Calamity."},{"name":"WANDERINGMINSTREL","text":"It is my hope that the lily's gentle perfume will afford such burdened souls a modicum of peace during this ofttimes melancholy memorial."},{"name":"KIPIHJAKKYA","text":"Oh my... What a genuinely lovely idea!"},{"name":"WANDERINGMINSTREL","text":"Only just this moment we were making arrangements for a, ahem, “showcase” of my humble talents, where I shall hand out potpourri bundles to the audience."},{"name":"WANDERINGMINSTREL","text":"Again, I am glad we met ere you inadvertently spread word of our little surprise gift. ...I trust you now have sufficient detail to write your article?"},{"name":"KIPIHJAKKYA","text":"Oh, yes! I have plenty to work with, thank you!"},{"name":"WANDERINGMINSTREL","text":"Splendid. Now, since you've joined the inner circle, so to speak, we must have you play a role in the performance."},{"name":"WANDERINGMINSTREL","text":"Hah, you needn't fret so─I merely wish for your assistance in passing out potpourri. I can supply the crowd at the show, but it would be most helpful if you might deliver bundles to some other part of town."},{"name":"KIPIHJAKKYA","text":"Oh, we would be happy to! And it could only help me flesh out the story!"},{"name":"KIPIHJAKKYA","text":"Let's head back to the Quicksand, adventurer. If we hand out bundles there, then we can be sure to cover folk from every corner of the city!"},{"name":"WANDERINGMINSTREL","text":"We were low on helping hands to tell the truth, so this has worked out for the best. Please, come and meet me at the Ruby Road Exchange once you've finished with your task."},{"name":"WANDERINGMINSTREL","text":"Ah, the hour of my performance draws near. Many times have I taken the stage in my life, yet that thrill of anticipatory terror never fails to run through me."},{"name":"MOMODI","text":"...Potpourri? Aye, hand out as much as you like─anythin' to overpower the scent of sweat-stained adventurer!"},{"name":"KIPIHJAKKYA","text":"Let's get to work, shall we?"},{"name":"MIMIO","text":"(-???-)What is it you are giving out there, adventurer?"},{"name":"MIMIO","text":"Ah, I know this scent... Nymeia lily, yes?"},{"name":"MIMIO","text":"The flower is often placed on the graves of the fallen, a practice with which I am, alas, intimately familiar. Why choose this particular bloom?"},{"name":"MIMIO","text":"I see. Perhaps the perfume does remind one of the peace of repose, rather than the violence which took our companions from us. It would seem the minstrel has given the matter some thought."},{"name":"MIMIO","text":"For Carteneau veterans such as myself, the season of the Rising can be a torment...like the throbbing pain of an old wound. I will keep this bundle close, I think, and breathe in its calm whenever I feel my thoughts turning grim."},{"name":"MOMODI","text":"Keepin' busy there, ain't you, <span class=\"highlight\">Forename</span>? I know it's for the Risin' and all, but it tickles me to see a hero of your stature handin' out presents like a simple errand <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>."},{"name":"MOMODI","text":"Keepin' busy there, ain't you, <span class=\"highlight\">Forename</span>? I know it's for the Risin' and all, but it tickles me to see a promisin' adventurer such as yourself handin' out presents like a simple errand <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>."},{"name":"MOMODI","text":"I mean, ever since the first time we met, you've always been the type to lend aid where it's needed."},{"name":"MOMODI","text":"And you haven't changed one bit. Makes me happy, it does...not to mention a little misty-eyed."},{"name":"MOMODI","text":"The good you've done for folk will linger on─an unshakable foundation for your future. Keep goin' the way you're goin', my friend, and we'll all be the better for it."},{"name":"MOMODI","text":"Here, why don't you let me have whatever bundles you've got left and I'll put them together with the ones I took from your reporter friend. If we leave a basketful out on the guild counter, I guarantee they'll hand themselves out before the Risin' is over."},{"name":"KIPIHJAKKYA","text":"Mistress Momodi took a goodly amount off my hands, but I think we've done our fair share of the work. We should go and see the minstrel, and let him know we've completed our task!"},{"name":"KIPIHJAKKYA","text":"I wonder if that potpourri also loosens tongues... It seems everyone who took a bundle had a Rising tale to tell, be it a short remembrance or a lingering stroll down memory lane."},{"name":"MOMODI","text":"That potpourri of yours is fairly flyin' off the counter. I don't know if it's just the scent or what, but it's proven popular with the patrons."},{"name":"MIMIO","text":"Seems everything I see at this time of year reminds me of fallen friends. But with your gift on hand to salve my senses, the memories will be bittersweet...as opposed to simply bitter."},{"name":"WANDERINGMINSTREL","text":"The reporter and her most-qualified assistant return. The performance went well, I must say, but what of your story research? Were the townsfolk willing to share any moving material?"},{"name":"KIPIHJAKKYA","text":"Yes, they were unexpectedly forthcoming. I was regaled with many an anecdote from those who lived through the Calamity, and privileged to hear their treasured memories of those who did not."},{"name":"KIPIHJAKKYA","text":"Back when the Calamity was poised to strike, I had only just earned my reporter's quill. I was rushing around town, questioning adventurers and taking notes..."},{"name":"KIPIHJAKKYA","text":"But as Dalamud descended ever lower, the streets erupted into chaos. It was then that I fled with my younger brother to the border and relative safety. There were a few less-prudent friends and colleagues who might still be here if they had done the same."},{"name":"KIPIHJAKKYA","text":"In the years since, the world has risen from the ashes. I've done my best to rise along with it, but there are things I cannot─nay, should not─forget. Such are the thoughts which blossom in my mind when I breathe in that potpourri's perfume."},{"name":"KIPIHJAKKYA","text":"I've enjoyed our collaboration this day, adventurer, and I shall attempt to write a piece that does it justice. What say you to “Rising Calm” as a title?"},{"name":"WANDERINGMINSTREL","text":"How fitting. I look forward to reading it."},{"name":"WANDERINGMINSTREL","text":"I, too, sense the stirring of a new composition. A hopeful verse, dedicated to the continued safe passage of those who yet ascend the path out of catastrophe and despair..."},{"name":"YOSHIDANAOKI","text":"(-???-)Greetings, Warrior of Light."},{"name":"YOSHIDANAOKI","text":"(-???-)You needn't be alarmed."},{"name":"YOSHIDANAOKI","text":"(-???-)This is a world that exists outside your reality. Could it be a dream? A flight of fancy conjured by your weary mind? Perhaps...or perhaps not."},{"name":"YOSHIDANAOKI","text":"It is a pleasure to make your acquaintance. My name is Naoki Yoshida, and you have my most heartfelt thanks for gracing this world with your presence, and your deeds of surpassing courage and valor."},{"name":"YOSHIDANAOKI","text":"What a pleasure it is to welcome you here again, <span class=\"highlight\">Forename</span>. And what a privilege that your chosen trail should run alongside mine for so long."},{"name":"YOSHIDANAOKI","text":"On a day such as today, I hope you will forgive me a brief bout of nostalgia."},{"name":"YOSHIDANAOKI","text":"It has been an entire decade since I first came to this world. I was a stranger here, a traveler in a troubled land, and the quest for its salvation consumed my every moment."},{"name":"YOSHIDANAOKI","text":"Countless trials were met and overcome, and the world not only survived─it flourished. This victory we owe to those who persevered alongside us; to those who explored and nurtured and loved this realm as much as we."},{"name":"YOSHIDANAOKI","text":"...Yes, it is you of whom I speak. Of our indomitable adventurers."},{"name":"YOSHIDANAOKI","text":"Ten years is a long time, yes, but for me the number holds no special significance. It is simply a count of the passage of days."},{"name":"YOSHIDANAOKI","text":"Success, however, would not have come without that accumulation of daily effort, and that is what makes it a milestone worth marking. Thank you for staying the course with us these many years."},{"name":"YOSHIDANAOKI","text":"I will keep making plans for this world for the foreseeable future. It has become a part of my life, and to see it grow is an adventure in itself..."},{"name":"YOSHIDANAOKI","text":"Rest well, Warrior of Light, for a grand convergence of events approaches. May the road upon which you must embark become the greatest of all journeys."},{"name":"YOSHIDANAOKI","text":"...Until we meet again, my friend."},{"name":"KIPIHJAKKYA","text":"What a moving rendition..."},{"name":"KIPIHJAKKYA","text":"And now I really must head home to write that article. You have my gratitude, <span class=\"highlight\">Forename</span>─I would still be floundering in the street without your assistance. Until we meet again!"},{"name":"WANDERINGMINSTREL","text":"A great many lives were lost in the flames of the Calamity, not to mention the chaos which followed. Yet it is the survivors who must face the challenges of living in this new era we have salvaged. To you, the champion in the vanguard of our efforts, I dedicate these verses..."},{"name":"WANDERINGMINSTREL","text":"Scarred by the falling of fiery stars, the land is reborn with new life.♪<br>God-slayer struck by an echoing roar, heavens ring with the promise of strife.♪"},{"name":"WANDERINGMINSTREL","text":"Beast and man, both, seek freedom or death in bloody inferno untamed.♪<br>By unbroken hopes, from a sky long undimmed shall the darkness of eld be reclaimed.♪"},{"name":"WANDERINGMINSTREL","text":"A merciless gale, an unending road, if this be the path we are fated,♪<br>Then pray be our dawn in the rift betwixt worlds, your soul's splendid light unabated.♪"},{"name":"WANDERINGMINSTREL","text":"I really must apologize for pressing you into service for my potpourri scheme. I tend to consider adventurers as fellow wanderers, and call upon the assistance of your kind with little reservation."},{"name":"WANDERINGMINSTREL","text":"...As for the gifts themselves, there was another reason as to why I chose the Nymeia lily. Traditionally, the bloom is said to represent a prayer for safe passage."},{"name":"WANDERINGMINSTREL","text":"The way ahead yet promises more hardship, and I wanted, at the very least, to wish you─all of you─the smoothest road for the coming journey."},{"name":"SYSTEM","text":"You have unlocked the jigsaw puzzle mini-game. To play mini-games, open the toy chest found in any inn room."}],"reward":{"items":[{"id":33711},{"num":10,"id":33710}]},"reqs":{"jobs":[{"lvl":15,"id":1}]}},"partials":[{"type":"npc","id":"1036686","obj":{"i":1036686,"n":"Kipih Jakkya","l":40,"q":1}},{"type":"npc","id":"1036689","obj":{"i":1036689,"n":"Wandering Minstrel","l":40,"q":1}},{"type":"item","id":"33711","obj":{"i":33711,"n":"Red Moon Parasol","l":1,"c":58016,"t":61}},{"type":"item","id":"33710","obj":{"i":33710,"n":"Nymeia Potpourri","l":1,"c":22632,"t":85,"p":19}}]}