{"quest":{"name":"Renewed Focus","location":"Zadnor","id":69623,"patch":5.55,"sort":306,"unlocksFunction":1,"eventIcon":71341,"issuer":1036746,"target":1036657,"genre":76,"journal":["Bajsaljen's furrowed brow suggests the tide of battle may be turning for the worse."],"objectives":["Speak with Lilja.","Investigate the designated location.","Speak with Lilja."],"dialogue":[{"name":"SYSTEM","text":"A Resistance rank of [#1] is required to proceed with this quest."},{"name":"BAISHAEN","text":"Blade <span class=\"highlight\">Surname</span>. We have urgent tidings from the field."},{"name":"BAISHAEN","text":"Our spies dispatched to the enemy encampment have at last uncovered the reason for the IVth Legion relocating to Zadnor."},{"name":"BAISHAEN","text":"This plateau is home to a number of Allagan ruins, which are what drew Menenius here."},{"name":"CID","text":"(-Familiar Voice-)This isn't the first time the Empire has shown an interest in such relics..."},{"name":"BAISHAEN","text":"Ah, I am glad you could join us. May I ask to what you are referring?"},{"name":"CID","text":"This is all reminiscent to the XIVth Legion's excavation of the Allagan ruins in Ala Mhigo. It was there that they discovered the Ultima Weapon..."},{"name":"BAISHAEN","text":"By the gods... The similarities are striking."},{"name":"MARSHAK","text":"Our scouts report that the imperials have unearthed a vast relic. They describe it as “monstrous to behold.”"},{"name":"CID","text":"So we <span class=\"emphasis\">do</span> have another Allagan abomination to contend with. Wonderful..."},{"name":"MARSHAK","text":"Its excavation was completed some time ago, but they have yet to finish loading it onto the <span class=\"emphasis\">Dalriada</span>."},{"name":"CID","text":"Perhaps they have something else in mind. It's more likely Menenius is testing it first. Or maybe...he's planning to test it on us."},{"name":"MARSHAK","text":"Knowing the imperials, I daresay you are right. All the more reason we must break through the enemy lines and bring their schemes to an end."},{"name":"BAISHAEN","text":"Cid, can we assume your unexpected return means you have found a way to combat the <span class=\"emphasis\">Dalriada</span>?"},{"name":"CID","text":"Yes, I believe so."},{"name":"CID","text":"After analyzing the data Mikoto provided on the crystal focus, we should be able to put its energies to good use. Hopefully with explosive results."},{"name":"MIKOTO","text":"You...wish to make a bomb of the crystal focus?"},{"name":"LILJA","text":"Not exactly. After reading over your analysis of its unique aetherial signature, we thought it warranted an investigation of practical applications."},{"name":"LILJA","text":"We found that with a little help from us, the focus is able to attune to the wavelength of ceruleum and cause it to destabilize."},{"name":"MIKOTO","text":"Ceruleum has ever been known to be a volatile substance. If it can be agitated by energy emitted from the crystal focus, then..."},{"name":"CID","text":"Precisely. We can ignite the very lifeblood of the warship, destroying it from within!"},{"name":"CID","text":"That's our theory, at any rate. Unfortunately, the crystal focus doesn't possess the energy we require for that level of destabilization."},{"name":"LILJA","text":"Don't worry, though. The chief's already thought of a solution, and it's right here in Zadnor."},{"name":"CID","text":"Luckily for us, the aether that permeated the land at the time of the Bozja incident is at our disposal."},{"name":"CID","text":"If we can use that residual energy to momentarily overcharge the crystal focus, it should release a pulse potent enough to detonate the ceruleum."},{"name":"CID","text":"Even if we can't destroy the warship, the engines would at least be severely damaged."},{"name":"MIKOTO","text":"Should your plan succeed, it would cease to be a threat, if only for a short while."},{"name":"CID","text":"Hopefully, this will give us the opening we need. The aetherwave amplifier I designed for the task should have arrived in Doma by now, but we still have to find a way of transporting it and the crystal focus behind enemy lines."},{"name":"BWAGI","text":"You'll not find an airship faster than Ba'Gamnan's pride and joy, the <span class=\"emphasis\">Ia'sar</span>. Rinok can have it here in no time at all."},{"name":"CID","text":"Perfect. Once it arrives, I'll see to shielding its engine against the crystal focus."},{"name":"BAISHAEN","text":"For our part, we will launch a diversionary assault on a nearby camp to draw their attention away from the <span class=\"emphasis\">Ia'sar</span>. If, by some chance, we are able to advance on the <span class=\"emphasis\">Dalriada</span>'s position, all the better."},{"name":"CID","text":"I like the way you think, Bajsaljen."},{"name":"CID","text":"I've a job for you as well, <span class=\"highlight\">Forename</span>. We're going to need to place another D.A.M. near the aether current closest to the <span class=\"emphasis\">Dalriada</span>."},{"name":"CID","text":"I've made a few modifications to allow for manual redirection of the aether it collects. When the <span class=\"emphasis\">Ia'sar</span> passes overhead, I want you to channel it directly to us."},{"name":"MIKOTO","text":"So you mean to fly into enemy territory and release this burst of energy from the sky? But any number of things could go wrong, not to mention how dangerous it is!"},{"name":"CID","text":"Which is why I intend to pilot the <span class=\"emphasis\">Ia'sar</span> myself. I need to be on board to trigger the pulse, and lest you forget, I don't just build airships, I pilot them, too."},{"name":"BAISHAEN","text":"I am sorry, Cid, but I cannot allow it. If anything should happen to you..."},{"name":"CID","text":"I have to, Bajsaljen. For you, and for the people of Bozja. To make amends for what happened all those years ago."},{"name":"BWAGI","text":"I should warn you, Ia'sar means “tornado” in the Dalmascan tongue, and like its namesake, our ship is wild and unforgiving. Luckily for you, Rinok is one of a select few ever to have mastered her. She will take the helm."},{"name":"MIKOTO","text":"...I would accompany you as well."},{"name":"CID","text":"There's no need to put yourself in harm's way, Mikoto. Your place is here, helping the others."},{"name":"MIKOTO","text":"Well, the truth is, I... I had another vision. Of the two of us aboard the <span class=\"emphasis\">Ia'sar</span>."},{"name":"MIKOTO","text":"We were successful in overcharging the crystal focus and, as you predicted, it rendered the imperials' warship inoperable. <span class=\"highlight\">Forename</span> too bore witness to this vision."},{"name":"CID","text":"Is that so?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It's true."},{"name":"A2","text":"(Give the gravest of nods.)"},{"name":"CID","text":"In that case, you'll be coming with us."},{"name":"BAISHAEN","text":"If Mikoto has foreseen it, our victory is assured... I will have our soldiers make ready at once!"},{"name":"CID","text":"Mikoto, would you mind accompanying me to Doma? The aetherwave amplifier still needs a little fine-tuning, and I could do with a touch of your scholarly knowledge."},{"name":"LILJA","text":"There you are! I've tried locating a current close to the imperials' warship, but there's nothing in range of the spectrometer. If we're to have any chance of finding one, I'm going to need you to place a sensor out there."},{"name":"LILJA","text":"Oh, and so you know, we've asked Bwagi to operate the D.A.M. once it's in place. With the fighting on the southern front dying down, he thought his time would be better spent helping us here. "},{"name":"LILJA","text":"I've marked an ideal spot on your map. When the sensor is set, contact me via linkpearl and I'll fire up the spectrometer."},{"name":"LILJA","text":"(-Lilja-)Soldiers, eh? By the sounds of it, they didn't put up much of a fight. Well, whenever you're ready, I'm standing by."},{"name":"LILJA","text":"(-Lilja-)Signal detected. Everything seems to be working as it should. You're clear to head back, <span class=\"highlight\">Forename</span>."},{"name":"LILJA","text":"Thanks again for your help. It shouldn't be long before the analysis is complete."},{"name":"LILJA","text":"While we wait for the results, I have to ask..."},{"name":"LILJA","text":"That vision you and Mikoto saw. She's hiding something, isn't she?"},{"name":"LILJA","text":"I know Mikoto would never lie to us, but I can't help but think she's not telling us the whole truth."},{"name":"BWAGI","text":"Mikoto is not the only one withholding information. Whatever you are hiding, I suggest you spit it out."},{"name":"BWAGI","text":"Surely we should consult Bajsaljen and the others, no? There must be something we can do to prevent Mikoto from falling."},{"name":"LILJA","text":"Mikoto said her visions of the future aren't something that might happen, but <span class=\"emphasis\">will</span> happen. One way or another, she's going to fall."},{"name":"LILJA","text":"And don't forget─we were all there in her vision, preoccupied with one thing or another. &lt;sigh&gt; It's hopeless..."},{"name":"BWAGI","text":"Nonsense! Our fates are only decided when we let others decide them for us. Cheer up, lass. We will find a way to save her."},{"name":"LILJA","text":"Right... &lt;sniffle&gt; Of course. There's still hope."},{"name":"QUEENGUNNHILDR","text":"You forget yourself... You forget the duty of Gunnhildr.<br>There can be no Bozja without her children."},{"name":"LILJA","text":"I don't know what I'd do if something were to happen to any of you."},{"name":"LILJA","text":"So you can be damn sure I'll do my part to keep everyone safe. I promise!"},{"name":"SYSTEM","text":"The next quest can be accepted by speaking with Bajsaljen after reaching Resistance rank [#1] or higher."}],"reward":{"gil":1053,"gcseal":630000},"reqs":{"jobs":[{"lvl":71,"id":142}],"quests":[69629]},"next":[69624]},"partials":[{"type":"npc","id":"1036746","obj":{"i":1036746,"n":"Bajsaljen","l":3662,"q":2}},{"type":"npc","id":"1036657","obj":{"i":1036657,"n":"Lilja","l":3662,"q":2}},{"type":"quest","id":"69629","obj":{"i":69629,"n":"In Their Shadow","g":76,"l":"Zadnor","s":305,"f":1}},{"type":"quest","id":"69624","obj":{"i":69624,"n":"March of the Bloody Queen","g":76,"l":"Zadnor","s":307,"f":1}}]}