{"quest":{"name":"Resolve Unshaken","location":"Zadnor","id":69621,"patch":5.55,"sort":302,"unlocksFunction":1,"eventIcon":71341,"issuer":1036752,"target":1036657,"genre":76,"journal":["The knowing look in Mikoto's eyes suggests it may be time to get to work."],"objectives":["Investigate the designated location.","Speak with Mikoto.","Speak with Lilja.","Speak with Bajsaljen.","Speak with Lilja."],"dialogue":[{"name":"SYSTEM","text":"A Resistance rank of [#1] is required to proceed with this quest."},{"name":"SYSTEM","text":"Certain decisions made during the course of this quest will affect the story in subsequent quests. These decisions cannot be changed once this quest is completed."},{"name":"SYSTEM","text":"Please note, however, that these decisions will not affect rewards received upon quest completion."},{"name":"MIKOTO","text":"Sorry to have kept you waiting, <span class=\"highlight\">Forename</span>. We have finally found a suitable location for the Ironworks' device."},{"name":"LILJA","text":"And you'll be pleased to hear the D.A.M.'s are ready to go. Some of our finest work yet, if I do say so myself."},{"name":"MIKOTO","text":"Once in place, Bajsaljen has asked we redirect the aether currents to the newly secured outpost."},{"name":"MIKOTO","text":"I will mark on your map the location where the device must be set."},{"name":"MIKOTO","text":"When you have finished, contact us via this linkpearl and we shall handle the rest."},{"name":"MIKOTO","text":"I shall pray for your safe return, <span class=\"highlight\">Forename</span>."},{"name":"MIKOTO","text":"(-Mikoto-)The D.A.M. is ready, <span class=\"highlight\">Forename</span>. Readying transmission protocols now."},{"name":"MIKOTO","text":"(-Mikoto-)All systems appear to be normal. Can you confirm the D.A.M. has burrowed into the ground?"},{"name":"MIKOTO","text":"(-Mikoto-)Then everything is as it should be. You're free to return to camp."},{"name":"MIKOTO","text":"Welcome back. The D.A.M.'s appear to be working as planned, though it will take some time for the diversion of the aether current to be complete."},{"name":"MIKOTO","text":"We will continue to monitor the situation from here. Should the D.A.M.'s be in need of fine-tuning, however, we may have to call on you again."},{"name":"LILJA","text":"Sensors indicate faint traces of aether drifting toward the designated location, and the energy signature is growing stronger. Before long, we'll have made a brand-new current leading straight to the outpost!"},{"name":"CID","text":"Mikoto, nooo!!!"},{"name":"LILJA","text":"Mikoto...? It's another vision, isn't it?"},{"name":"LILJA","text":"And you saw it too, didn't you? What is it? What did you see?"},{"name":"MIKOTO","text":"It's nothing, Lilja. Really. Just a dizzy spell, is all. I will be fine after a short rest."},{"name":"LILJA","text":"Mikoto, there's no need to put on a brave face. You said before these visions of yours can't be changed, but... That doesn't mean we can't help."},{"name":"MIKOTO","text":"That's very kind of you, Lilja, but I promise you I'm fine. For now, let's all concentrate on the task at hand."},{"name":"LILJA","text":"All right... But if you ever need to talk, I'll be right here."},{"name":"MIKOTO","text":"I understand your concern, truly. But even if we were to tell the others, there is nothing they can do to change what I saw─what <span class=\"emphasis\">we</span> saw."},{"name":"MIKOTO","text":"No battle is won without sacrifice, and I have made peace with what is to come."},{"name":"MIKOTO","text":"I imagine Moenbryda was very much the same in her last moments. She never turned her eyes from the truth, the inevitable, no matter how harsh it may be. It is a quality you both share, and one I strive to emulate."},{"name":"MIKOTO","text":"Come now, <span class=\"highlight\">Forename</span>, let's not assume the worst. After all, we know naught of what happens before or after that brief glimpse into the future."},{"name":"LILJA","text":"Thanks again for your help with the D.A.M. Once the new outpost is secure, you can be certain we'll get to work right away on erecting a barrier."},{"name":"LILJA","text":"In the meantime, perhaps you'd be willing to share what you and Mikoto saw...?<br>On second thought, forget I said anything. Like she said, it's all fine. Let's get back to it, eh?"},{"name":"LILJA","text":"Ah, speaking of getting to work, I think Bajsaljen was asking after you. Probably wants to talk strategy before their next mission."},{"name":"BAISHAEN","text":"Blade <span class=\"highlight\">Surname</span>. Thank you for coming. I wished to speak with you about Misija."},{"name":"BAISHAEN","text":"As you may recall, it was my intention to have her stand trial once the IVth Legion was routed, and Bozja's lands made secure. But there are those who demand we make an example of her, and the cries for her execution grow louder by the day."},{"name":"BAISHAEN","text":"It is my belief that we must first establish a rule of law, where those convicted of crimes may be given due process. In the case of imperial captives, an exchange of prisoners should be considered a viable alternative."},{"name":"BAISHAEN","text":"I do not deny that the crimes she has committed are grave indeed. Yet the fact remains, Misija was a soldier, working under the orders of Gabranth and the IVth Legion. I am hesitant to carry out so harsh a judgment when it is her superiors who should be held accountable."},{"name":"BAISHAEN","text":"But such is the nature of war... Soldiers forced to perform terrible, terrible deeds at the behest of a select few. As commander, I know all too well the weight my orders carry. The day may come that I am made to answer for the acts committed in my name."},{"name":"BAISHAEN","text":"But today, it is Misija who stands accused. Gabranth has yet to be brought before us, and the people demand justice be served, one way or another."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'll not deny she has a troubled past, but if it were up to me... I would put her to death."},{"name":"A2","text":"I agree with you, Bajsaljen. The blame lies with Menenius and Gabranth."},{"name":"A3","text":"It's not my place to give counsel on such grave matters, but I trust you will make the right decision."},{"name":"BAISHAEN","text":"When the time comes, I will keep your words in mind. Thank you, Blade <span class=\"highlight\">Surname</span>."},{"name":"LILJA","text":"Why the furrowed brow? Was it something Bajsaljen said?"},{"name":"LILJA","text":"...Sorry, I shouldn't pry. I'll get back to work."},{"name":"SYSTEM","text":"The next quest can be accepted by speaking with Dmitar after reaching Resistance rank [#1] or higher."}],"reward":{"gil":979,"gcseal":367500,"items":[{"num":5,"id":33768},{"num":5,"id":33769},{"num":5,"id":33770}]},"reqs":{"jobs":[{"lvl":71,"id":142}],"quests":[69620]},"next":[69628]},"partials":[{"type":"npc","id":"1036752","obj":{"i":1036752,"n":"Mikoto","l":3662,"q":2}},{"type":"npc","id":"1036657","obj":{"i":1036657,"n":"Lilja","l":3662,"q":2}},{"type":"item","id":"33768","obj":{"i":33768,"n":"Forgotten Fragment of History","l":1,"c":20045,"t":63}},{"type":"item","id":"33769","obj":{"i":33769,"n":"Forgotten Fragment of Rage","l":1,"c":20045,"t":63}},{"type":"item","id":"33770","obj":{"i":33770,"n":"Forgotten Fragment of Ferocity","l":1,"c":20045,"t":63}},{"type":"quest","id":"69620","obj":{"i":69620,"n":"A New Playing Field","g":76,"l":"Gangos","s":301,"f":1}},{"type":"quest","id":"69628","obj":{"i":69628,"n":"Where Eagles Roost","g":76,"l":"Zadnor","s":303,"f":1}}]}