{"quest":{"name":"Fowl Demands","location":"Old Gridania","id":69625,"patch":5.5,"sort":211,"icon":101066,"eventIcon":71221,"issuer":1036539,"target":1036567,"genre":199,"journal":["Jihli Aliapoh greets you with anxious enthusiasm.<br>※This quest is available for a limited time only.","Jihli Aliapoh shares with you her prophetic dream for this year's Hatching–tide, a vision wherein rabbits and chickens work paw in claw to decorate the town for the annual event. She explains, however, that there has been a slight hiccup in the preparations, and asks that you look for her egg-collecting colleague Nonotta at the Greatloam Growery.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You find Nonotta in costume at the Greatloam Growery, and she introduces you to Master Pawlin─the owner of a flock of excitable chickens. After listening to Nonotta's woes, you are suddenly tasked with facing down an escaped hen. Gazing deep into the feathery fiend's soulless eyes, you sense quite distinctly that the flock wants Pawlin to dish out their extra-special feed...","Pawlin confirms that he does indeed have a special mix for extra-special occasions. Once they have finished feeding the voracious birds, however, an exhausted and miserable Nonotta pleads with you to undertake the perilous duty of egg collection. She stands ready to send you off with a basket and a prayer."],"objectives":["Survey the area from the designated location.","Speak with Pawlin."],"dialogue":[{"name":"JIHLIALIAPOH","text":"Come one, come all, for the season of Hatching–tide is here once more!"},{"name":"JIHLIALIAPOH","text":"Oh, <span class=\"highlight\">Forename</span>! How delightful to see you again!"},{"name":"JIHLIALIAPOH","text":"I am Jihli Aliapoh, and it's a pleasure to make your acquaintance on this most blessed occasion."},{"name":"JIHLIALIAPOH","text":"Don't tell me... You are an adventurer, yes? Well, you certainly have the inquisitive nature of one, at any rate! May I ask your name?"},{"name":"JIHLIALIAPOH","text":"Well then, <span class=\"highlight\">Forename</span>, I should probably mention that Hatching–tide all began with a vision I had before the Seventh Umbral Calamity, in which the Twelve Archons delivered unto me a message."},{"name":"JIHLIALIAPOH","text":"From atop their giant, decorated eggs they called to me: “Arise, young Dreamer, and make ready the vessels for our return.” When I awoke, I quickly set about filling the realm with all manner of painted ovoids. And thus did this joyous yearly celebration come to be!"},{"name":"JIHLIALIAPOH","text":"I must say, the prophetic dream I had <span class=\"emphasis\">this</span> year was even more fantastical than usual. I was assailed with images of rabbits and chickens who worked together, paw in claw, to construct a wondrous backdrop for our festival."},{"name":"JIHLIALIAPOH","text":"Always before when we made efforts to recreate my visions, the fates rewarded us with some special occurrence."},{"name":"JIHLIALIAPOH","text":"And already it has begun. No sooner had I donned my bunny costume than a chicken-suited poultry farmer arrived in town with a flock of feathery charges, and offered to lend his assistance! Just as I foresaw!"},{"name":"JIHLIALIAPOH","text":"There has, however, been one tiny bump in the road... You don't happen to have a few moments to spare, do you?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'm always up for an eggspedition!"},{"name":"A1","text":"How many moments, eggsactly...?"},{"name":"JIHLIALIAPOH","text":"Oh, it's just a simple errand, really─I promise not to take up too much of your time!"},{"name":"JIHLIALIAPOH","text":"It's just that my good friend Nonotta went to collect eggs from the poultry farmer, and...well...she should have returned by now."},{"name":"JIHLIALIAPOH","text":"I'm certain it's nothing serious! ...But I would be ever so grateful if you could pay a visit to the Greatloam Growery and see what's keeping her."},{"name":"NONOTTA","text":"(-Odd “Chicken”-)This is truly eggsasperating..."},{"name":"NONOTTA","text":"<span class=\"highlight\">Forename</span>? It's me─Nonotta! How might I be of service?"},{"name":"NONOTTA","text":"If you're in search of Nonotta, well congratulations─you've found me! So, er...who are you, and what might I do for you?"},{"name":"NONOTTA","text":"Jihli was worried, you say? Right. I should probably explain."},{"name":"NONOTTA","text":"...But before we delve into that, I should introduce you to Master Pawlin."},{"name":"PAWLIN","text":"Greetings! Yes! I am responsible for the little darlings! We heard word of this delightfully egg-centric festival taking place in Gridania, and simply had to be a part of it!"},{"name":"NONOTTA","text":"Er, by “little darlings” he means the chickens. And they seem to be a touch out of sorts at the moment."},{"name":"NONOTTA","text":"The idea was to have them on hand to lay fresh eggs for us, and I've been trying to help soothe a whole barnful of ruffled feathers..."},{"name":"NONOTTA","text":"But even wearing the costume didn't stop me from being battered by charging chickens or spattered with fresh droppings. Honestly, I'm not sure what was injured more, my body or my pride."},{"name":"PAWLIN","text":"The poor dears are simply not used to travel! Please don't think less of them if they act a bit rambunctious!"},{"name":"2021ESTCHICKEN","text":"(-???-)Bok-bok BAKAWK!"},{"name":"NONOTTA","text":"Oh gods!"},{"name":"PAWLIN","text":"My precious sweetling, no!"},{"name":"NONOTTA","text":"Er, <span class=\"highlight\">Forename</span>... If you planned on being heroic today, now is the time!"},{"name":"2021ESTCHICKEN","text":"...Bok."},{"name":"SYSTEM","text":"As you stare into the eyes of the feathered fiend, you feel a brief connection being made..."},{"name":"SYSTEM","text":"<span class=\"emphasis\">Hand over the fancy feed, and I'll give you the eggs you need.</span><br>Thus spake those black, soulless eyes. ...At least, you <span class=\"emphasis\">think</span> that's what they said."},{"name":"NONOTTA","text":"H-How did you do that!? I thought it was preparing to go on a rampage!"},{"name":"PAWLIN","text":"Hm? You think the little darlings want their “fancy feed”?"},{"name":"PAWLIN","text":"Well, I <span class=\"emphasis\">do</span> have a special mix I developed with the help of a professional Bismarck culinarian...for extra-special occasions. And I suppose this qualifies!"},{"name":"PAWLIN","text":"It's dreadfully expensive even in small amounts, but how could I withhold a treat from my beloved beauties!"},{"name":"PAWLIN","text":"I think I have enough fancy feed for everyone. Come, Nonotta─the ladies await their feast!"},{"name":"NONOTTA","text":"R-Right! Hatching–tide must go on!"},{"name":"PAWLIN","text":"(-Pawlin-)Now, now, my little darlings, you needn't be so─ Ow! Such a feisty welcome! If we could just─ Ow ow ow! Not the fingers!"},{"name":"NONOTTA","text":"(-Nonotta-)Please! We're just trying to─ Oof! Oh no! The feed's gone everywhere!"},{"name":"PAWLIN","text":"Phew. That seemed to cheer them up immensely. I suspect we'll have some eggs to collect in rather short order!"},{"name":"NONOTTA","text":"Cheer them up? They've worked themselves into an absolute frenzy..."},{"name":"PAWLIN","text":"...Perhaps our adventurous friend here would like to try <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> hand at egg collecting? I'll even give you one of my spare “work suits” to wear!"},{"name":"NONOTTA","text":"What a, er, <span class=\"emphasis\">wonderful</span> opportunity for you! Sort out your gear, say your prayers, and we can have you filling a basket with eggs in no time. Just say the word!"}],"reward":{"items":[{"id":33653},{"id":33654}]},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[69626]},"partials":[{"type":"npc","id":"1036539","obj":{"i":1036539,"n":"Jihli Aliapoh","l":53,"q":2}},{"type":"npc","id":"1036567","obj":{"i":1036567,"n":"Pawlin","l":53,"q":1}},{"type":"item","id":"33653","obj":{"i":33653,"n":"Chicken Head","l":1,"c":41827,"t":34,"p":1000}},{"type":"item","id":"33654","obj":{"i":33654,"n":"Chicken Suit","l":1,"c":42740,"t":35,"p":1000}},{"type":"quest","id":"69626","obj":{"i":69626,"n":"A Poultry Sum","g":199,"l":"Old Gridania","s":212}}]}