{"quest":{"name":"A Poultry Sum","location":"Old Gridania","id":69626,"patch":5.5,"sort":212,"icon":101067,"eventIcon":71221,"issuer":1036541,"target":1036539,"genre":199,"journal":["Nonotta is in need of your egg-collecting eggcellence.<br>※This quest is available for a limited time only.","You indicate your readiness to brave the gauntlet of bellicose beaks, and Nonotta sends you over to Pawlin and the Dreamer's Run.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You speak with Pawlin, who unlocks the door to his little darlings' temporary home. Enter the Dreamer's Run, and do your part to save Hatching–tide by collecting eggs in the FATE “An Eggsistential Threat.”<br><br>※The FATE “An Eggsistential Threat” can only be completed as a Disciple of War or Magic.","You have ventured into the Dreamer's Run and claimed its yolk-filled treasures. Report your success to Nonotta.","Duly impressed by your unparalleled egg-collecting skills, Nonotta showers you with praise and gratitude. It is past time your precious cargo was conveyed to Jihli where she anxiously awaits at Mih Khetto's Amphitheatre.","Jihli joyously accepts your hard-won eggs, and turns her attention to the important tasks of baking and painting. Meanwhile, Nonotta asks that you accompany her to the front of the amphitheatre, where you are to distribute gifts of thanks to the multitude of Hatching–tide helpers.","While Nonotta is busy removing the poultry-based filth from her costume, you hand out presents to an eclectic group of pleasantly surprised festival decorators. Your current task complete, you can now report to Jihli for further instructions.","Jihli thanks you once more for your assistance, before remarking on the unusual number of moogles and sylphs in attendance. The celebration, it seems, is a grand success. Jihli's final instructions to you are simple: throw yourself in amongst the rabbits and the chickens, and join in the festival fun!"],"objectives":["Speak with Pawlin.","Complete the FATE “An Eggsistential Threat” in the Dreamer's Run.","Speak with Nonotta.","Speak with Jihli Aliapoh.","Speak with Nonotta.","Speak with Jihli Aliapoh."],"dialogue":[{"name":"NONOTTA","text":"Are you ready to brave the poultry gauntlet? I'm sure you have a preferred adventuring wardrobe, but if you wouldn't mind...I think you should wear the costume while you work!"},{"name":"NONOTTA","text":"To business, then! The entrance to the chicken enclosure is locked up tight─just give the nod to Master Pawlin and he'll let you in. We're counting on you, <span class=\"highlight\">Forename</span>!"},{"name":"NONOTTA","text":"Where I have failed, you must prevail. It simply wouldn't be Hatching-tide without eggs!"},{"name":"PAWLIN","text":"I'm sure you'll do just fine!"},{"name":"JIHLIALIAPOH","text":"Have you found Nonotta yet? Perhaps she was distracted by the Growery's fine flowerbeds..."},{"name":"PAWLIN","text":"Ready? Then into the chicken run you go!"},{"name":"SYSTEM","text":"The FATE “An Eggsistential Threat” can only be completed as a Disciple of War or Magic."},{"name":"Q1","text":"Enter the Dreamer's Run?"},{"name":"NONOTTA","text":"<span class=\"highlight\">Forename</span>! Your egg-collecting skills are unparalleled! I don't know how to thank you!"},{"name":"PAWLIN","text":"Truly, that was a masterful display!"},{"name":"PAWLIN","text":"I am, however, somewhat concerned that my bellicose beauties may harm themselves in their excited state. If you would be so kind as to make the delivery, I should like to remain here and keep an eye on the chicken run."},{"name":"NONOTTA","text":"Certainly!"},{"name":"NONOTTA","text":"I imagine poor Jihli must be frantic. Let us convey this precious cargo back to the amphitheatre straightaway!"},{"name":"NONOTTA","text":"If I'm to be wearing this costume for the duration of the festivities, I think a quick wash is in order..."},{"name":"JIHLIALIAPOH","text":"Welcome back, <span class=\"highlight\">Forename</span>! I hear the egg collecting was not quite so simple an errand as we'd imagined."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"It was an eggsperience, that's for sure!"},{"name":"A2","text":"I've seen the seventh hell, and it was full of chickens."},{"name":"JIHLIALIAPOH","text":"You are an example to us all! Nonotta and I are most fortunate to have your assistance!"},{"name":"JIHLIALIAPOH","text":"A veritable purgatory of poultry, you say? And yet you persevered nonetheless! Nonotta and I are most fortunate to have your assistance!"},{"name":"JIHLIALIAPOH","text":"With your hard-won bounty in hand, we can now proceed to the important task of baking cookies and painting eggs for the children."},{"name":"NONOTTA","text":"Er, I am loath to impose upon you so soon after that harrowing ordeal, but I wonder if I might ask you another favor?"},{"name":"NONOTTA","text":"Simply put, I need you to hand out tokens of gratitude to our tireless helpers, who will soon return from setting up all the Hatching–tide decorations."},{"name":"NONOTTA","text":"Such a duty should fall upon me, of course, but this soiled suit requires an immediate and thorough scrubbing..."},{"name":"NONOTTA","text":"Wonderful! Come to the front of the amphitheatre, and I'll have the gifts laid out for you in just a moment."},{"name":"JIHLIALIAPOH","text":"Please convey my regards to our most-appreciated assistants!"},{"name":"NONOTTA","text":"Here are the gifts I mentioned. I put together three different sets, but you can hand out whichever seems appropriate."},{"name":"NONOTTA","text":"Thank you again. I'm sure your choices will be perfect!"},{"name":"NONOTTA","text":"Meanwhile, I shall see to cleansing the filth from my costume. Once you've finished with the presents, you can report directly to Jihli!"},{"name":"Q3","text":"Begin distributing the gifts?"},{"name":"KANESENNA","text":"Greetings. We have come to report the completion of our part in the decorations."},{"name":"KANESENNA","text":"'Tis a joyful duty to assist with the Hatching–tide adornments, knowing that every inhabitant of Gridania might enjoy the festivities. I hope you, too, will take a moment to join in this rare chance for revelry."},{"name":"KANESENNA","text":"...In charge of rewarding festival helpers, you say? I've not done aught so grand as to merit a reward, but in the spirit of the occasion I shall humbly accept your gift."},{"name":"Q4","text":"Which gift set will you choose from?"},{"name":"A4","text":"The rabbit and chicken stuffed toys."},{"name":"A4","text":"The painted eggs filled with treats."},{"name":"A4","text":"The opulent Archon eggs."},{"name":"KANESENNA","text":"My, what charming little toys."},{"name":"KANESENNA","text":"If you'll take the rabbit, then I shall claim this adorable chicken."},{"name":"BODYGUARD01623","text":"A gift from y-you...? I shall treasure it always!"},{"name":"KANESENNA","text":"My, what lovely colors... And judging by this scent, there are baked treats hiding within. A perfect accompaniment for my morning tea."},{"name":"KANESENNA","text":"Well, isn't this exquisite... It shall grace my mantle as a memento of these happy celebrations."},{"name":"KANESENNA","text":"Such a lovely surprise! Now, if you will pray excuse us..."},{"name":"MIOUNNE","text":"Hah, why am I not surprised to see you here? We had a guild meeting scheduled, but you know how adventurers are─we just had to get involved in the celebrations."},{"name":"MOMODI","text":"And seein' how the Dreamers always do such a nice job of decoratin' Ul'dah, I figured this was the perfect chance for me to return the favor."},{"name":"BADERON","text":"Eh? Passin' out presents to us laborers, are ye? Far be it from me to refuse a gift given freely!"},{"name":"Q5","text":"Which gift set will you choose from?"},{"name":"A5","text":"The rabbit and chicken stuffed toys."},{"name":"A5","text":"The painted eggs filled with treats."},{"name":"A5","text":"The opulent Archon eggs."},{"name":"MOMODI","text":"Oooh, those are just darlin', ain't they? Not exactly a match for the Quicksand's decor, though, so I might need to keep 'em in my room..."},{"name":"MIOUNNE","text":"Ah, these are the type they fill with baked delights! There's nothing better than enjoying a sweet treat after a hard day's work."},{"name":"BADERON","text":"Don't go 'oardin' 'em all to yerself now. I've got time for a quick bite an' a cup o' Mother Miounne's best tea afore I make the trip back to Limsa Lominsa."},{"name":"MOMODI","text":"Sounds like a grand idea. Count me in!"},{"name":"BADERON","text":"Now ain't that a delicate beauty! But where's a safe spot to put it? Wouldn't survive two days in the Wench, considerin' the unsteady state o' me regular clientele..."},{"name":"MIOUNNE","text":"We'd best be off and leave you to your business, then. Do come visit us at the Canopy when duty permits!"},{"name":"KURENAI","text":"<span class=\"highlight\">Forename</span>! You are also taking part in this curious festival? I confess I find it passing strange to be speaking with you thus beyond the boundaries of the Ruby Sea."},{"name":"SANANA","text":"When I said I was headed this way to scout market prices, I was informed─not asked, mind you─that Her Highness here would accompany me in “an effort to better understand the outside world.” Do me a favor and keep this from Shiosai, would you?"},{"name":"KURENAI","text":"You say we are to be rewarded? I had thought our inclusion in the ritual painting of the chicken eggs was reward enough, and now you offer me gifts. I am overwhelmed by your generosity!"},{"name":"Q6","text":"Which gift set will you choose from?"},{"name":"A6","text":"The rabbit and chicken stuffed toys."},{"name":"A6","text":"The painted eggs filled with treats."},{"name":"A6","text":"The opulent Archon eggs."},{"name":"KURENAI","text":"Oh, are these...little animal dolls? And so wonderfully soft to the touch!"},{"name":"SANANA","text":"Oho, I know a treat-filled egg when I see one. It's interesting how the presentation makes the contents feel that much more special... In fact, I reckon I could sell these for a profit if you weren't just giving them away."},{"name":"KURENAI","text":"Such delicate and splendid artifice. And you call this an “Ar-kon” egg? Nay, 'tis far too precious a treasure for me to accept."},{"name":"SANANA","text":"I thought you came with me to experience the “outside”? It's customary to receive eggs on Hatching–tide, so please, just take the gift."},{"name":"KURENAI","text":"Yes, I suppose you are right. After all, this would be the perfect souvenir for Hisui!"},{"name":"KURENAI","text":"&lt;sigh&gt; I shall make one last turn around town, then I suppose I should return home. I pray we meet again soon in Tamamizu!"},{"name":"FUFUCHA","text":"I don't know if my sense for decoration is all that appealing, but I seem to have made a feathered friend. She must be from the flock belonging to Master Pawlin."},{"name":"FUFUCHA","text":"Watching the struggles from afar, I had come to the conclusion that chickens are troublesome creatures, yet this one seems docile enough. So far, she's been content to follow me around as I put the finishing touches on my adornments. Is it my costume, I wonder...?"},{"name":"FUFUCHA","text":"A gift? For me? I feel somewhat guilty accepting a reward for an activity I so thoroughly enjoyed...but if you insist!"},{"name":"Q7","text":"Which gift set will you choose from?"},{"name":"A7","text":"The rabbit and chicken stuffed toys."},{"name":"A7","text":"The painted eggs filled with treats."},{"name":"A7","text":"The opulent Archon eggs."},{"name":"FUFUCHA","text":"These toys are certainly soft and pleasant to hold, yet I cannot help but wonder what kind of plant fiber was used in their construction. Curse of the professional botanist, I'm afraid."},{"name":"FUFUCHA","text":"Are these the eggs they fill with treats? That would explain the delicious aroma. Just what I need after a hard day's work in the planting fields."},{"name":"FUFUCHA","text":"These Archon eggs are exquisite, aren't they? Speaking from the viewpoint of one who provides raw materials to artisans, I am thrilled to see my humble contributions transformed into such works of art."},{"name":"2021ESTCHICKEN","text":"Bok-bok BAKAWK!"},{"name":"FUFUCHA","text":"You like it too, do you? Then I shall display it in a place of pride, where it shall serve as a memento of our brief and unusual companionship."},{"name":"FUFUCHA","text":"Now, I think it's time I returned this wayward hen to her owner. Fare you well!"},{"name":"NONOTTA","text":"Thank you for taking care of that little task─I was finally able to take a scrubbing brush to my outfit. Oh, and please do tell Jihli our helpers have been rewarded!"},{"name":"JIHLIALIAPOH","text":"<span class=\"highlight\">Forename</span>, my thanks for your assistance! Our little tokens were well received, I hope?"},{"name":"JIHLIALIAPOH","text":"I'm glad to hear it!"},{"name":"JIHLIALIAPOH","text":"Once my own tasks were complete, I found myself veritably surrounded by sylphs and moogles! I suppose the hustle and bustle of the festival must have piqued their curiosity."},{"name":"JIHLIALIAPOH","text":"The moogles seem particularly focused on wheedling cookie after cookie out of me... We shall have to call upon Master Pawlin for more eggs so I can bake another batch."},{"name":"JIHLIALIAPOH","text":"But putting these trifling troubles and setbacks aside, our rabbits and chickens have done a fabulous job with the Hatching–tide decorations─the event is a huge success!"},{"name":"JIHLIALIAPOH","text":"And after all you've done to contribute, you deserve to head out and enjoy it!"},{"name":"SYSTEM","text":"Speak with Nonotta if you wish to replay the gift-giving task from the quest “A Poultry Sum.”"},{"name":"SYSTEM","text":"You can also repeat the FATE “An Eggsistential Threat” by speaking with Pawlin at the Greatloam Growery."},{"name":"SYSTEM","text":"You have unlocked the Egg Hunter Riggy mini-game. To play mini-games, open the toy chest found in any inn room."}],"reward":{"gil":420},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[69625]}},"partials":[{"type":"npc","id":"1036541","obj":{"i":1036541,"n":"Nonotta","l":53,"q":1}},{"type":"npc","id":"1036539","obj":{"i":1036539,"n":"Jihli Aliapoh","l":53,"q":2}},{"type":"quest","id":"69625","obj":{"i":69625,"n":"Fowl Demands","g":199,"l":"Old Gridania","s":211}}]}