{"quest":{"name":"March of the Bloody Queen","location":"Zadnor","id":69624,"patch":5.55,"sort":307,"icon":101070,"unlocksFunction":1,"eventIcon":71341,"issuer":1036746,"target":1032881,"genre":76,"journal":["The look of steely resolve in Bajsaljen's eyes suggests the hour of battle draws nigh.","The Resistance stands ready to march against the IVth Legion in the hopes of distracting them long enough for Cid to carry out his plan. If all goes well, the <span class=\"emphasis\">Dalriada</span> will be disabled, perhaps giving Bajsaljen and his troops the edge needed to rout the imperials once and for all.","Lilja has finished work on the D.A.M., and has even found the ideal location at which to set it. However, a number of final adjustments have to be made on-site, meaning that she must accompany you out onto the battlefield.","While seeking a suitable spot to set the D.A.M., you are assaulted by a small unit of IVth Legion soldiers. They prove no match for your martial prowess, and it is not long before you and Lilja resume preparing the D.A.M.","With the D.A.M. in place, the Resistance is ready to set their plan in motion. What they were not expecting, however, was for the <span class=\"emphasis\">Dalriada</span> to roar to life. Undeterred by the not-so-small setback of the imperial warship entering the fray, Cid succeeds in activating the aetherwave amplifier, and the <span class=\"emphasis\">Dalriada</span> is forced to make an emergency landing. The sight of this emboldens the Resistance, and so they prepare to press forward.","The <span class=\"emphasis\">Dalriada</span> has been rendered inoperable, but it remains to be seen what armaments yet remain within. Even so, there may never come a finer opportunity for the Resistance to strike, and Bajsaljen intends to seize it. He asks that you accompany his troops into the warship, and at last put an end to the IVth Legion's schemes to control Bozja.<br><br>※Players may enter the Dalriada via the associated critical engagement.","With Lyon and Menenius defeated, the IVth Legion's plans appear to have fallen to ruin. There is no time to revel in your victory, however, for the Allagan weapon, which lay dormant in the ship, breaks free from its confines. It takes to the sky and begins amassing energy to release in an attack of cataclysmic proportions. Before delivering its fatal blow to the people of Bozja, however, Queen Gunnhildr appears, her holy blade in hand. The two entities clash overhead, the ensuing explosion claiming both the Allagan weapon and the queen.","The threat of the IVth Legion and their Allagan weapon is no more. You thought to speak with Bajsaljen, but Marsak informs you he has already returned to Gangos. After your many travails together, the Resistance leader would no doubt welcome you to reflect on this historic victory.","You expect to find Bajsaljen in the midst of merrymaking, but instead he is already hard at work setting the foundation for a new Bozja. The myriad factions that comprised the Resistance originally came together out of necessity, but if all goes to plan, the dream of a united Bozja may very well soon become a reality.","The fight for freedom is won, and now work to rebuild may begin in earnest. Only time will tell what manner of nation Bozja will become, but you have every confidence it will prove a beacon of peace and prosperity to which others will aspire."],"objectives":["Speak with Lilja.","Investigate the designated location.","Speak with Bajsaljen.","Enter the Dalriada.","Speak with Marsak.","Return to Gangos.","Speak with Marsak.","Speak with Bajsaljen."],"dialogue":[{"name":"SYSTEM","text":"A Resistance rank of [#1] is required to proceed with this quest."},{"name":"BAISHAEN","text":"Blade <span class=\"highlight\">Surname</span>. We have finished preparations for a full-scale assault. We will keep the imperials occupied, while Cid executes his plan to disable the <span class=\"emphasis\">Dalriada</span>."},{"name":"CID","text":"Our work on the aetherwave amplifier is complete, and the crystal focus has been mounted on board the <span class=\"emphasis\">Ia'sar</span>. That said, it's hard to gauge the range of the pulse it will generate. In the event things don't go to plan, have your men ready to disperse."},{"name":"MIKOTO","text":"You have nothing to worry about, Cid. The amplifier will work. I have seen it."},{"name":"RINOK","text":"<span class=\"highlight\">Forename</span>, it's been far too long. A pity our meeting is under such dire circumstances. But never fear, Cid and Mikoto'll be in good hands aboard the <span class=\"emphasis\">Ia'sar</span>."},{"name":"BWAGI","text":"The amplifier has been loaded onto the ship, and the engine has been insulated against the blast."},{"name":"LILJA","text":"That's not all. The Mark IV D.A.M. is ready to go, and I've found just the place to put it."},{"name":"MARSHAK","text":"Our plan for the upcoming battle is twofold. First and foremost, we must draw the enemy's attention on the ground, affording the crew of the <span class=\"emphasis\">Ia'sar</span> the opportunity to disable the warship."},{"name":"MARSHAK","text":"This will throw their forces into disarray, granting us the opportunity to press forward and, gods willing, remove the head of their detachment here in Bozja."},{"name":"BAISHAEN","text":"We speak, of course, of their commander Menenius sas Lanatus. It will be no easy endeavor, however, for we must also contend with the likes of Lyon rem Helsos and his entourage of beasts. Nevertheless, we mustn't lose heart. Remain vigilant, remember your training, and I have faith the day will be ours."},{"name":"BAISHAEN","text":"For Bozja!!!"},{"name":"LILJA","text":"Well, I guess we'd better get to work too, eh? First things first: setting up the D.A.M."},{"name":"LILJA","text":"The location is right there, on your map. Trouble is, there are a few final adjustments that have to be made on-site, meaning I'll have to come along. You can handle any imperials that show up...right?"},{"name":"LILJA","text":"Everything's set, Chief. Sending the coordinates now."},{"name":"CID","text":"(-Cid-)We'll be there as soon as we can.<br>Rinok, Mikoto, it's time to head out.<br>Did you get all that, Bajsaljen?"},{"name":"BAISHAEN","text":"(-Bajsaljen-)We will hold their attention for as long as we can. Godsspeed."},{"name":"LILJA","text":"&lt;gasp&gt; Oh, no! The warship...!"},{"name":"BAISHAEN","text":"Damn it! Are we too late?"},{"name":"MARSHAK","text":"Sir, look!"},{"name":"BAISHAEN","text":"The <span class=\"emphasis\">Ia'sar</span>... Gods, please let his plan work."},{"name":"LILJA","text":"Ahhh!!!"},{"name":"CID","text":"What in the seven hells was that!?"},{"name":"MIKOTO","text":"Could it be the Allagan weapon is operational?"},{"name":"IMPERIALSOLDIERA04088","text":"Sir, the target is too small to score a direct hit!"},{"name":"MENENIUS","text":"They won't be so lucky a second time. Fire again!"},{"name":"IMPERIALSOLDIERB04088","text":"Y-Yes, sir! Energy levels at 45%..."},{"name":"MIKOTO","text":"Bad news, I'm afraid. The amplifier has been damaged and we've lost the coordinates of the D.A.M!"},{"name":"CID","text":"Of all the rotten luck!"},{"name":"CID","text":"(-Cid-)Did you catch that, Lilja? We've lost the coordinates!"},{"name":"CID","text":"(-Cid-)Quickly, send up a flare!"},{"name":"LILJA","text":"Understood, Chief!"},{"name":"CID","text":"There!"},{"name":"MIKOTO","text":"(-Mikoto-)Now! Activate the D.A.M!"},{"name":"CID","text":"Come on, don't fail me now!"},{"name":"IMPERIALSOLDIERA04088","text":"The engines─they've shut down! Preparing for emergency landing!"},{"name":"MENENIUS","text":"What!?"},{"name":"CID","text":"Mikoto, nooo!!!"},{"name":"CID","text":"Take us down. Now!"},{"name":"RINOK","text":"Right!"},{"name":"FRAN","text":"(-???-)Your Sharlayan companion is safe, though I cannot say the same for you at present. It would behoove you to retreat."},{"name":"CID","text":"What? Who is this?"},{"name":"FRAN","text":"Fran. General of the Dalmascan resistance. We may save the pleasantries for when you are returned to Camp Vrdelnis."},{"name":"CID","text":"(-Cid-)Fran...? Right, Jenomis has told me about you.<br>All right, heading back now."},{"name":"FRAN","text":"<span class=\"highlight\">Forename</span>. Bwagi said I would find you here. From what I gather, you are no stranger to conflict with the imperials."},{"name":"FRAN","text":"Should they be defeated here, it will deal a heavy blow to the IVth Legion, who yet occupy my homeland of Dalmasca. One by one, we will reclaim those lands that were stolen from us."},{"name":"FRAN","text":"And be it the Empire or any other would-be tyrant, we will never surrender to those who would deny us our freedom."},{"name":"FRAN","text":"I suspect we are of a similar mind on such matters, and I am honored to have the opportunity to fight at your side."},{"name":"ROSTIK","text":"Soon it will all be over. Oh Father... Would that you could have lived to see this day."},{"name":"BAISHAEN","text":"Our plan worked, Blade <span class=\"highlight\">Surname</span>! The <span class=\"emphasis\">Dalriada</span> was forced to make an abrupt landing after the amplifier released its pulse, just as Cid predicted."},{"name":"BAISHAEN","text":"We did not all emerge from the encounter unscathed, however. Lilja was badly wounded. We have done what we can for her, but she needs proper medical attention."},{"name":"CID","text":"I've already spoken with Lord Hien, and his chirurgeons are ready and awaiting her arrival in Doma."},{"name":"CID","text":"Could I trouble you for use of the <span class=\"emphasis\">Ia'sar</span>?"},{"name":"BWAGI","text":"Yes, we'd be glad to help."},{"name":"MIKOTO","text":"I would accompany her to Doma as well, if that's all right."},{"name":"MIKOTO","text":"This wouldn't have happened if not for me..."},{"name":"CID","text":"You may have glimpsed the future, but you didn't see everything. There was no way of knowing for certain what would happen to any of us."},{"name":"CID","text":"Using the amplifier was my plan, but we all knew the risks involved, including Lilja. This is a war we're fighting, after all."},{"name":"CID","text":"But this is hardly the time to discuss such matters. We have a long journey ahead of us, and I daresay your healing magicks will be of great comfort to her until we reach Doma."},{"name":"BAISHAEN","text":"While they tend to our wounded comrade, let us deliver the final blow to the enemy. With the <span class=\"emphasis\">Dalriada</span> disabled, and reinforcements newly arrived from Dalmasca, we may never have a finer opportunity to strike."},{"name":"FRAN","text":"We will offer whatever assistance we can if it means defeating the IVth Imperial Legion."},{"name":"FRAN","text":"Though we can offer little in the way of materiel, I have brought several vehicles which I believe will prove helpful in this final endeavor."},{"name":"BAISHAEN","text":"General Fran, you have our gratitude. I will see they are put to good use."},{"name":"BAISHAEN","text":"It is time we make ready. The coming battle will decide the fate of Bozja."},{"name":"BAISHAEN","text":"But as we have seen, our enemy is willing to employ any means at their disposal, no matter how reckless or deplorable. We have reason to believe they have obtained a deadly new weapon, and we must be prepared to adapt our strategy as the situation warrants."},{"name":"BAISHAEN","text":"Blade <span class=\"highlight\">Surname</span>. May we count on your assistance one last time?"},{"name":"Q2","text":"What will you say?"},{"name":"A1","text":"We <span class=\"emphasis\">will</span> free Bozja. Together!"},{"name":"A2","text":"One way or another, we're putting an end to this."},{"name":"BAISHAEN","text":"And there you have it! Time and again <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> has fought at our side, and we have overcome many a foe. Now, we stride into battle once more, and by the grace of the gods, victory will be ours!"},{"name":"BAISHAEN","text":"'Tis true the imperials' presence in the sky is greatly diminished, but Menenius has yet to reveal this Allagan weapon of his. And that is to say nothing of Lyon and his beasts."},{"name":"BAISHAEN","text":"Our victory will not be easily won, but I have faith that, together, we will prevail in the end."},{"name":"RIAN","text":"For godssake, boy. What did I tell you about bowing out with a bit of grace? It's over, Menenius. We've lost."},{"name":"MENENIUS","text":"Even so, the relic cannot...<span class=\"emphasis\">must</span> not fall into the hands of the Bozjans. I will have it jettisoned from the <span class=\"emphasis\">Dalriada</span> into the ruins whence it came. Once our troops have been evacuated, I will engage the ship's self-destruct sequence and seal the entrance, keeping the relic beyond the reach of those savages."},{"name":"MENENIUS","text":"Meanwhile, you are to take the rest of our detachment back to Dalmasca and crush the resistance. Then─and only then─are you to return here and reclaim Gabranth's weapon. Am I understood?"},{"name":"RIAN","text":"So it's the coward's way out, is it? Not man enough to face him after your resounding failure?"},{"name":"MENENIUS","text":"It was I Gabranth entrusted with the <span class=\"emphasis\">Dalriada</span>, his final hope of claiming these lands as his own. If that hope is to die here, then I would perish with it. I have naught but my life to offer to make amends for all we have lost."},{"name":"RIAN","text":"Look, Menenius, everyone's bound to have a spot of bad luck eventually, even you. Now isn't the time for drastic measures."},{"name":"RIAN","text":"As much as I'd enjoy seeing an arrogant, forked-tongued prig such as yourself go down in a fiery ball of ruin, I know Gabranth still has a part for you to play."},{"name":"RIAN","text":"If you want to bury the relic, fine─I'll even help you. But when we're done, we go and speak with him <span class=\"emphasis\">together</span> and explain what happened. All right?"},{"name":"MENENIUS","text":"Your stubbornness never ceases to confound me."},{"name":"RIAN","text":"Good. If that's what it takes to get through to you, I'll be as stubborn as I like."},{"name":"MENENIUS","text":"Hmph. And you would call me the arrogant one."},{"name":"SYSTEM","text":"You may now access the critical engagement “the Dalriada.”"},{"name":"SYSTEM","text":"This critical engagement will be initiated when a sufficient number of players with access to the Dalriada are present in Zadnor."},{"name":"SYSTEM","text":"Furthermore, by completing other skirmishes and critical engagements, the time required before the Dalriada can be initiated again will be reduced. "},{"name":"SYSTEM","text":"Be sure to prepare lost actions from the lost finds cache, as they may prove key to turning the tide of battle."},{"name":"BAISHAEN","text":"I know not what Menenius has unearthed in the ruins, but I would rather not afford him time to employ it."},{"name":"BAISHAEN","text":"Let us be swift, Blade <span class=\"highlight\">Surname</span>, and put an end to him and the IVth Legion."},{"name":"BAISHAEN","text":"Blade <span class=\"highlight\">Surname</span>! Thank goodness you are unharmed."},{"name":"BAISHAEN","text":"What is this place...?"},{"name":"BAISHAEN","text":"Lyon!? Menenius!?"},{"name":"BAISHAEN","text":"Everyone! Fall back, now!"},{"name":"RIAN","text":"Menenius, you fool! ...It's not supposed to end like this!"},{"name":"BAISHAEN","text":"<span class=\"emphasis\">This</span> is the Allagan relic!?"},{"name":"FRAN","text":"By the gods... It will destroy us all!"},{"name":"MEESIYA","text":"In the name of Queen Gunnhildr, I will not allow you to harm these children of Bozja."},{"name":"BAISHAEN","text":"Queen Gunnhildr, she...she saved us."},{"name":"MARSHAK","text":"Oh Misija..."},{"name":"MEESIYA","text":"No... Leave me be..."},{"name":"BAISHAEN","text":"Please, Misija, you must hold on. I promised you we will rebuild Bozja, and I want you to see it for yourself."},{"name":"MEESIYA","text":"For...what purpose...? Remorse? Repentance?"},{"name":"MEESIYA","text":"Do not...misunderstand, Bajsaljen..."},{"name":"MEESIYA","text":"I...care not...for forgiveness.<br>Today...I fulfilled my duty...to the queen... Nothing more."},{"name":"MEESIYA","text":"I am a Bozjan, yes. But also an imperial... A traitor..."},{"name":"MEESIYA","text":"Justice...must be served. The people...demand it."},{"name":"MEESIYA","text":"Fulfill your duty... As I have mine... Please..."},{"name":"Q3","text":"What will you do?"},{"name":"A1","text":"Grant her request."},{"name":"A2","text":"Leave her be."},{"name":"Q4","text":"What will you do?"},{"name":"A3","text":"Grant her request."},{"name":"A4","text":"Leave her be."},{"name":"MEESIYA","text":"Thank you..."},{"name":"BAISHAEN","text":"No, Blade <span class=\"highlight\">Surname</span>. She is gone."},{"name":"BAISHAEN","text":"If it must be done, I will do it."},{"name":"BAISHAEN","text":"Farewell, Misija. Until we meet again..."},{"name":"BAISHAEN","text":"No, Blade <span class=\"highlight\">Surname</span>. This is not your burden to bear."},{"name":"BAISHAEN","text":"Your sacrifice will not be forgotten, Misija. And I pray it need never again be repeated."},{"name":"BAISHAEN","text":"Please, Blade <span class=\"highlight\">Surname</span>. Let me grant her this final mercy."},{"name":"BAISHAEN","text":"Good-bye, Misija. May the queen bless you and keep you..."},{"name":"MARSHAK","text":"At long last, victory is ours. There are still remnants of the IVth Legion to contend with, but I believe it is safe to say the war for Bozja is over."},{"name":"MARSHAK","text":"Many of our brothers and sisters were lost on our path to freedom, but I take heart in knowing that their sacrifices were not in vain. That our dream of a new Bozja will finally come true."},{"name":"MARSHAK","text":"Bajsaljen has returned to Gangos, and I have no doubt he would be glad for your company."},{"name":"MARSHAK","text":"...Misija? We thought it best if her remains were not returned to Gangos. To some, she was naught more than a hated enemy, and even in death, she would be an object of their scorn. But rest assured, I will see to it personally that she is given a proper burial."},{"name":"BAISHAEN","text":"Blade <span class=\"highlight\">Surname</span>. Words can scarcely convey my gratitude for all you have done for the people of Bozja."},{"name":"BAISHAEN","text":"Though the fight for Bozja is over, our work is far from done. When faced with the IVth Legion, the Bozjan Resistance stood as a united, cohesive unit. But I now foresee disputes between its various factions as they seek to pursue their individual aims."},{"name":"BAISHAEN","text":"For that reason, I wish to first create a council of leaders, that we might discuss and establish laws to govern our people."},{"name":"BAISHAEN","text":"I have already begun drafting documents that may one day serve as our constitution, though it remains to be seen if they will meet with the others' approval."},{"name":"BAISHAEN","text":"You see, I have chosen to base a number of my writings on the principles of the IVth Legion."},{"name":"MARSHAK","text":"With all due respect, sir, I do not think it wise to openly admit to borrowing from the <span class=\"emphasis\">imperial doctrine</span> of all things. The people would be up in arms!"},{"name":"BAISHAEN","text":"They deserve to know the truth, Marsak, and I have my reasons for choosing such an approach."},{"name":"BAISHAEN","text":"While many of us dedicated ourselves to the Resistance, there are those who would rather live in peace, even if that means submitting to imperial rule. Some, like Misija, saw the Empire's ways as preferable to our own."},{"name":"BAISHAEN","text":"To discard everything that came as a result of the occupation would cause more harm than good. There are many things introduced by the imperials from which we stand to benefit, and it would be foolish to dismiss them simply because they came from the enemy."},{"name":"BAISHAEN","text":"Make no mistake─the Bozja I intend to build will be free of discrimination and poverty. A nation of the people, by the people, and for the people. As such, it will require the understanding and cooperation of all."},{"name":"BAISHAEN","text":"A great deal of blood has been shed that we might come this far, and I pray we never forget, that we may never again have to endure such tragedy."},{"name":"CID","text":"(-Familiar Voice-)Well, I for one have every confidence that you will lead Bozja to a bright and prosperous future. If Ala Mhigo and Doma are able to thrive, I see no reason why Bozja can't do the same."},{"name":"BAISHAEN","text":"Cid. Mikoto. Welcome back."},{"name":"CID","text":"And here I thought you might actually take a moment to enjoy your hard-earned victory. Such steadfast dedication to rebuilding Bozja is proof enough the people are in good hands."},{"name":"MARSHAK","text":"Did Lilja not return with you? Has she yet to recover?"},{"name":"CID","text":"It was touch and go at first, extracting the shrapnel from her stomach, but she's doing much better now. You should have seen her protesting when we insisted she stay behind to rest."},{"name":"LILJA","text":"(-Lilja-)<span class=\"highlight\">Forename</span>! I was worried sick about you. Right when you needed me most, I let my guard down... Sorry I couldn't be there with you to the end."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You did your best, and that's all I could ask for."},{"name":"A2","text":"Never mind that. How are your wounds?"},{"name":"LILJA","text":"(-Lilja-)That... That means a lot coming from you. &lt;sniffle&gt; More than you know..."},{"name":"LILJA","text":"(-Lilja-)I've never felt better! As a matter of fact, I was about to gather my things and head back to─gah! My stomach!"},{"name":"CID","text":"Sounds like the chirurgeons are taking good care of you, Lilja, and I trust you won't be giving them any trouble. It'd be a shame if I had to send Jessie to keep an eye on you."},{"name":"LILJA","text":"(-Lilja-)Jessie!? ...I think I'd prefer the shrapnel."},{"name":"GEROLT","text":"What in the─ &lt;hic&gt; Why're ye all standin' about like a bunch o' prissy─ &lt;hic&gt; prissy ol' maids? Ye <span class=\"emphasis\">won</span>, didn't ye? Relax! Come an' have a pint or two! Or three! &lt;hic&gt;"},{"name":"FRAN","text":"Wheresoever your path may lead, it seems fortune sees fit to smile upon you. Not only have you led the Resistance to rout the IVth Legion, by some miracle the weapon they unearthed from these lands was also vanquished. On behalf of the people of Dalmasca, you have my sincerest thanks."},{"name":"FRAN","text":"Of course, the war is not truly over until we have dealt with Gabranth. He is no doubt planning his next move, and I intend to be prepared for our next encounter with the imperials. When that time comes, I daresay we would benefit from your assistance. "},{"name":"FRAN","text":"Until the next time. Perhaps in Dalmasca."},{"name":"BAISHAEN","text":"Another nation freed, following in the footsteps of Doma and Ala Mhigo. A dream realized thanks in part to one troubled soul whom I shall never forget for all my days."},{"name":"BAISHAEN","text":"In the eyes of the people she will forever remain a criminal. A traitor. Yet it was she who delivered us from certain destruction."},{"name":"BAISHAEN","text":"Her crimes were said to be unforgivable, but what of ours? Was it not our callousness, our animus, that fueled her hatred?"},{"name":"BAISHAEN","text":"I squandered every opportunity to guide her, ignored every unspoken plea for help. Her loss is a scar on my heart that will never heal. A ceaseless reminder of my inadequacy and shame."},{"name":"MIKOTO","text":"Can you sense anything?"},{"name":"MIKOTO","text":"Then it is as I thought. The last of the blade's residual aether is spent. The queen is no more..."},{"name":"MARSHAK","text":"Who could have foreseen that Misija would carry on Queen Gunnhildr's duty? Protecting her people to the very last."},{"name":"MARSHAK","text":"Did she believe her final act could effect change in the world? Or, perhaps, did she at last find the means to do so within herself? An arduous task in either case. &lt;sigh&gt; A pity we will never know."},{"name":"BAISHAEN","text":"The lady of blades, Save the Queen, was returned to us. Devoid of the queen's grace, perhaps, but not of her hopes for a brighter tomorrow, nor Misija's for a better Bozja."},{"name":"BAISHAEN","text":"Indeed, their hopes shall live on. In me, in Marsak, in all of our people. The lives lost for our freedom will not have done so in vain, this I swear. Bozja <span class=\"emphasis\">will</span> rise again. A land of peace and prosperity they would be proud to call home."},{"name":"BAISHAEN","text":"From the <span class=\"emphasis\">Chronicles of the Bozjan Revolution</span><br>Bajsaljen Ulgasch"},{"name":"MARSHAK","text":"If you are looking for Mikoto and the others, they have all returned to their homes. I expect you, too, will be leaving us before long. Though if I may be frank, I believe I speak for many when I say we are reluctant to see you go."},{"name":"MARSHAK","text":"Were it possible, I would ask you to stay and help us in the rebuilding of Bozja, but I understand there are other worldly matters that require your attention."},{"name":"MARSHAK","text":"We shall forever be in your debt, Blade <span class=\"highlight\">Surname</span>. Wherever duty demands you go, know that you always have allies here in Bozja. Farewell."},{"name":"SYSTEM","text":"Meanwhile, at Valnain in Dalmasca..."},{"name":"GABRANTH","text":"...Thank you, Lyon. You are dismissed."},{"name":"RIAN","text":"That's all? Menenius is dead and that's all you have to say?"},{"name":"GABRANTH","text":"What would you have me say, then?"},{"name":"RIAN","text":"You could at least acknowledge one of your most loyal followers gave his life for the sake of your ambitions."},{"name":"GABRANTH","text":"Menenius understood such sacrifice was inevitable, and by all accounts he did not waver when faced with his demise. Such strength is needed if we are to succeed."},{"name":"GABRANTH","text":"Time is short, Lyon... <span class=\"emphasis\">My</span> time is short..."},{"name":"RIAN","text":"So...it finally caught up with you. A damned shame."},{"name":"GABRANTH","text":"Lest the soldiers begin to believe failure may go without consequence, I would have you sent to the gaols in Menenius's stead. I trust this will not pose a problem for you?"},{"name":"RIAN","text":"...Fine."},{"name":"SICINIUS","text":"(-Sicinius mal Vellutus-)Legatus Gabranth, sir."},{"name":"SICINIUS","text":"(-Sicinius mal Vellutus-)We have recovered the relics Menenius unearthed in the Bozjan ruins."},{"name":"SYSTEM","text":"Certain <span class=\"highlight\">Field Record</span> entries have been updated under Collection in the Duty section of the main menu."},{"name":"SYSTEM","text":"New gear can now be purchased from the Resistance supplier at Camp Vrdelnis."},{"name":"SYSTEM","text":"This new gear can be purchased in exchange for Bozjan platinum coins."}],"reward":{"gil":3000,"items":[{"id":33814},{"id":33815},{"id":33816},{"id":33817}]},"reqs":{"jobs":[{"lvl":71,"id":142}],"quests":[69623]},"next":[69630,69631]},"partials":[{"type":"npc","id":"1036746","obj":{"i":1036746,"n":"Bajsaljen","l":3662,"q":2}},{"type":"npc","id":"1032881","obj":{"i":1032881,"n":"Marsak","l":3478,"q":6}},{"type":"item","id":"33814","obj":{"i":33814,"n":"Field Notes on Cid","l":1,"c":26603,"t":61}},{"type":"item","id":"33815","obj":{"i":33815,"n":"Field Notes on Fran","l":1,"c":26603,"t":61}},{"type":"item","id":"33816","obj":{"i":33816,"n":"Field Notes on Hien","l":1,"c":26603,"t":61}},{"type":"item","id":"33817","obj":{"i":33817,"n":"Field Notes on Noah","l":1,"c":26603,"t":61}},{"type":"quest","id":"69623","obj":{"i":69623,"n":"Renewed Focus","g":76,"l":"Zadnor","s":306,"f":1}},{"type":"quest","id":"69630","obj":{"i":69630,"n":"An Honor to Serve","g":0,"l":"Zadnor","s":311,"f":1}},{"type":"quest","id":"69631","obj":{"i":69631,"n":"A Ruined Opportunity","g":76,"l":"Gangos","s":312,"r":1,"f":1}}]}