{"quest":{"name":"Spare Parts","location":"Gangos","id":69633,"patch":5.55,"sort":351,"icon":101072,"unlocksFunction":1,"eventIcon":71341,"issuer":1032905,"target":1032905,"genre":76,"usedItems":[33757,33758],"journal":["Zlatan has learned what the House of Splendors seeks in exchange for a reagent.","As Zlatan explains, the House of Splendors has reached an agreement with goblin metalworkers in Idyllshire to supply the Resistance with the reagent needed to refine your weapon. In exchange, you have been asked to provide two varieties of mechanical parts─compact axles and springs, thirty of each.<br><br>※Mechanical parts can be obtained by participating in skirmishes and critical engagements in Zadnor, as well as any of the normal Alexander 8-man raids. The Unrestricted Party option cannot be enabled when clearing the aforementioned duties.","You return with an assortment of mechanical parts, and after verifying everything is accounted for, Regana's colleague, Seika, hands over the reagent. With the transaction concluded, she takes her leave, but not before proposing an extended contract for additional shipments of reagent. Gerolt promptly refuses, but Seika appears unperturbed by the rejection. This reaction leaves Zlatan wondering if there was more to her proposal than meets the eye."],"objectives":["Deliver the compact axles and compact springs to Zlatan at Gangos."],"dialogue":[{"name":"ZLATAN","text":"As Gerolt mentioned, we will require some manner of reagent to bind the crystal's aether to the weapon."},{"name":"ZLATAN","text":"For this particular transaction, the House of Splendors is but an intermediary for the manufacturer. Goblin metalworkers of some renown in Idyllshire, apparently."},{"name":"ZLATAN","text":"According to Regana, despite the material requiring the use of some sort of special forge, she was able to negotiate a reasonable agreement. It still struck me as rather a lopsided deal in their favor, but we have little choice but to take her word for it..."},{"name":"ZLATAN","text":"For our part in the bargain, we've been asked to procure two varieties of mechanical parts. They must be of the highest quality if we are to appease the goblins' discerning eyes."},{"name":"ZLATAN","text":"Supposedly, the parts in question are commonly found in an apparatus employed by the Illuminati as well as the Empire's forces. We've been asked to collect thirty of each."},{"name":"SYSTEM","text":"The requested mechanical parts can be obtained by participating in skirmishes and critical engagements in Zadnor."},{"name":"SYSTEM","text":"They may also be obtained by completing any of the normal Alexander 8-man raids."},{"name":"ZLATAN","text":"We've been asked for compact springs and axles, thirty of each. I'm sure you encounter plenty of imperials in your line of work, and possibly even a few Illuminati, both of which should possess the parts we seek."},{"name":"SYSTEM","text":"The requested mechanical parts can be obtained by participating in skirmishes and critical engagements in Zadnor."},{"name":"SYSTEM","text":"They may also be obtained by completing any of the normal Alexander 8-man raids."},{"name":"ZLATAN","text":"Seika, the House of Splendors representative overseeing this transaction, has arrived with the reagent. May I assume you have the requested parts?"},{"name":"SEIKA","text":"Hmmm. Yes, everything appears to be in order. As agreed, here is the reagent."},{"name":"GEROLT","text":"Wait, I know you. Well, <span class=\"emphasis\">of</span> you, at any rate. Good o' you to be takin' time away from yer forge just to make a delivery."},{"name":"SEIKA","text":"Think nothing of it. Having carried out my fair share of weapon repairs and alterations, I'd be lying if I said I wasn't curious to see what it might be used for."},{"name":"SEIKA","text":"Unfortunately, it took me longer to get here than I expected, so I'd better get back to my other commissions. When you are finished here, perhaps we could discuss your work over drinks in Idyll─"},{"name":"REGANA","text":"Ahem!"},{"name":"SEIKA","text":"A-Ah! Yes. Before I leave, there was a proposal I wished to make."},{"name":"SEIKA","text":"A wholesale contract for subsequent shipments of reagent."},{"name":"SEIKA","text":"As a fellow artisan, I'm sure you can appreciate the convenience of a surplus stock. What's more, such a contract would eliminate much of the clerical work in requesting more from our goblin colleagues."},{"name":"ZLATAN","text":"We will eventually have need of more reagent, but enough to warrant a wholesale contract...?"},{"name":"SEIKA","text":"Just think of it as a friendly agreement between artisans."},{"name":"GEROLT","text":"Sorry, lass, the answer's no! I'd rather boil me own head than agree to any more deals with the House of Splendors, of all bloody places!"},{"name":"ZLATAN","text":"You must forgive Gerolt, he is not usually so...forthright in these negotiations. That said, I cannot help but suspect Mistress Rowena has some ulterior motive in allowing such a contract to be signed on her behalf."},{"name":"SEIKA","text":"Well, you are free to believe what you will. With or without this contract, so long as the goblins get their parts, we can continue to do business."},{"name":"SEIKA","text":"My invitation to Idyllshire still stands, by the way. I hope you'll consider it when your work here has finished."},{"name":"ZLATAN","text":"Hmm... If she would still welcome Gerolt in Idyllshire after his little outburst, perhaps her offer truly <span class=\"emphasis\">was</span> in good faith."},{"name":"SYSTEM","text":"Through your various dealings with the House of Splendors, you have acquired all the materials needed to refine your Resistance weapon. Speak with Gerolt to proceed to the next phase in his plan."}],"reward":{"gil":615},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69632]},"next":[69636]},"partials":[{"type":"npc","id":"1032905","obj":{"i":1032905,"n":"Zlatan","l":3478,"q":12}},{"type":"item","id":"33757","obj":{"i":33757,"n":"Compact Axle","l":1,"c":23107,"t":63}},{"type":"item","id":"33758","obj":{"i":33758,"n":"Compact Spring","l":1,"c":20920,"t":63}},{"type":"quest","id":"69632","obj":{"i":69632,"n":"What Dreams Are Made Of","g":76,"l":"Gangos","s":350,"f":1}},{"type":"quest","id":"69636","obj":{"i":69636,"n":"A Done Deal","g":76,"l":"Gangos","s":354,"f":1}}]}