{"quest":{"name":"To Give Voice","location":"Gridania","id":69639,"patch":6.0,"sort":111,"icon":101090,"unlocksFunction":1,"eventIcon":71341,"issuer":1038411,"target":1038411,"genre":184,"journal":["The Keeper of the Entwined Serpents is eager to resume the hunt.","After sifting through a mountain of reports, the Order of the Twin Adder has found a common thread: of late, Gleipnir has been most frequently sighted in the South Shroud. Kan–E–Senna has already departed for Rootslake and bid you meet her there.","Together with the Elder Seedseer you seek out her sister, Raya–O–Senna, who has made her home in the southern marshlands. Their pleasant reunion is undercut by tension, as fear of Gleipnir grips the remote community. Although none of its residents have come to harm, Raya–O believes that it is only a matter of time before the blasphemy strikes. She urges her sister to entreat the elementals for aid, but the Elder Seedseer is reluctant to do so just yet. For now, she decides to speak with the people of Camp Tranquil, that she might assuage their fears and assure them that this crisis will soon pass.","The people of Camp Tranquil are understandably nervous, but Kan–E–Senna's calming presence seems to be having a positive effect.<br><br>※You must be accompanied by Kan–E–Senna to complete this task. Speak with her again should you become separated.","The people yearn to give voice to their concerns, and the Elder Seedseer is more than willing to lend them an ear. The Keeper of the Entwined Serpents, too, recognizes there is much to be gained by visiting others.","Speaking with the people of Camp Tranquil has bolstered Kan–E–Senna's resolve, but before you can resume your hunt for Gleipnir, a flustered Wood Wailer arrives and explains that a group of Gridanians has fled their homes to seek refuge in Thanalan. Per the Elder Seedseer's earlier instruction, however, all are to remain within the safety of the camp until the threat has passed. Nevertheless, the people are adamant that they be allowed to cross the border, and the Wood Wailers are but few, and so the Elder Seedseer goes to resolve the situation before it comes to a head.","Kan–E–Senna attempts to calm the people, but to no avail, for one youth grows panicked upon realizing he has been marked by Gleipnir's poison. Before it can claim his life, however, despair takes hold of his heart, and he turns into a beast. The man beside him recoils in shock and, after crying out for his lost companion, undergoes a similar transformation. Both must be slain before they flee and spread terror throughout the Twelveswood.","Though the beasts are soon laid to rest with no further lives lost, the Elder Seedseer remains distraught. Perhaps you can offer her a shoulder to lean on...","Though Kan–E–Senna is shaken, she maintains her composure as she implores the people to return to their homes. The incident serves as a stark reminder that while Gleipnir is indeed a danger to the realm, despair can be even more deadly, transforming the distraught into beasts. The Elder Seedseer finally accepts that she must seek the aid of the great one, but there are preparations that must be seen to beforehand. The Keeper of the Entwined Serpents at the Adders' Nest, however, may have further instructions for you.","It will take some time before Kan–E–Senna is ready to commune with the great one. In the meantime, her attendant asks that you prepare both mentally and physically.<br><br>※The next role quest will be available from the Keeper of the Entwined Serpents upon reaching level 87 in any tank class."],"objectives":["Speak with Kan–E–Senna at Rootslake.","Speak with Kan–E–Senna and have her accompany you.","Speak with the people of Camp Tranquil while Kan–E–Senna is accompanying you.","Speak with the Keeper of the Entwined Serpents while Kan–E–Senna is accompanying you.","Speak with the Wood Wailer sentry at the Lower Paths.","Defeat the beasts.","Speak with Kan–E–Senna.","Speak with the Keeper of the Entwined Serpents at the Adders' Nest."],"dialogue":[{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"We have followed up on every report concerning Gleipnir─even those that beggared belief. The most promising suggest the blasphemy is currently stalking the South Shroud."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"We are to proceed there at once, for there is no telling when it might strike again. The Elder Seedseer is already en route to Rootslake. Let us not keep her waiting."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"No sign of the beast yet, thankfully. A single glimpse of Gleipnir might send the people running, and we would be hard-pressed to restore order."},{"name":"KANESENNA","text":"Greetings, <span class=\"highlight\">Forename</span>. As luck would have it, my sister Raya–O frequents Camp Tranquil. We would do well to meet with her first, for she may have knowledge of this threat that can aid us in our search."},{"name":"KANESENNA","text":"It has been too long, Raya–O."},{"name":"RAYAOSENNA","text":"Kan–E! I was afraid this situation might force your arrival. Would that this reunion was under more joyous circumstances."},{"name":"RAYAOSENNA","text":"And you are here to serve as protector to my sister, yes? I commend your courage. Gleipnir, like all blasphemies, is a fearsome foe that we must nevertheless rise to meet as one."},{"name":"RAYAOSENNA","text":"It is heartening to see her joined by the bearer of A–Towa's will. Unfortunately, Gleipnir's poison cannot be cured by any healing force known to us, as I'm sure you have already learned. Nevertheless, I have faith that together we will find a way to defeat it."},{"name":"KANESENNA","text":"Every moment is crucial, so let us dispense with further pleasantries. Have you received word of Gleipnir's whereabouts?"},{"name":"RAYAOSENNA","text":"I have. It recently ambushed a poor traveler, who succumbed to his wounds soon thereafter. A tragic and increasingly common tale."},{"name":"RAYAOSENNA","text":"No others in Camp Tranquil have come to harm, but some claim they feel a presence in the distant trees. Staring at them with a malicious intensity. They struggle to find the courage to venture beyond the safety of the camp."},{"name":"KANESENNA","text":"While its victims exhibit symptoms reminiscent of the Creeping Death, Gleipnir's corruption seems only to affect those who have been assaulted by the blasphemy itself."},{"name":"KANESENNA","text":"We have yet to confirm a single instance of it spreading from one individual to another."},{"name":"RAYAOSENNA","text":"That's somewhat reassuring, but it will provide little comfort to the people here, I think."},{"name":"RAYAOSENNA","text":"If Gleipnir comes, any defense we mount will come at great cost. Those who fall wounded will invariably die."},{"name":"RAYAOSENNA","text":"I'm at a loss, and the people under my care can see it. They grow tense and bicker amongst themselves─some even accused me of standing idly by while this monster roams free. As if I'm not doing all that I can!"},{"name":"KANESENNA","text":"I...I apologize. Would that I had come to you sooner. Would that there were more I could offer you..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Not every burden is yours to bear, Kan–E."},{"name":"A1","text":"Perhaps the elementals could help?"},{"name":"RAYAOSENNA","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> is right. It is the duty of all Seedseers to face this threat, and so we should do so together─with the aid of the elementals as well!"},{"name":"KANESENNA","text":"Under different circumstances I would agree, but their strength has waned since the Calamity, and I am reluctant to impose upon them. Indeed, when I open my thoughts to the elementals...I shudder to hear their distress."},{"name":"RAYAOSENNA","text":"The elementals cry out for succor as loudly as the people do─this I know you feel, Kan–E. Gleipnir poses a threat to all life in the Twelveswood, and as such we should face it as one."},{"name":"KANESENNA","text":"Their strength has waned since the Calamity, and I am reluctant to impose upon them. Nay, as Seedseers, it is our duty to first expend every option available to us, and spare them further distress."},{"name":"KANESENNA","text":"Once we have laid low the blasphemy, the elementals will be at peace."},{"name":"RAYAOSENNA","text":"Well then, how do you propose we go about that?"},{"name":"KANESENNA","text":"First allow me to speak with the people here and assure them that all will be well. That Gridania's resolve to weather this storm remains steadfast."},{"name":"RAYAOSENNA","text":"\"No road is closed to those true of heart.“ I suppose I shouldn't be surprised that you'd begin with an earnest and heartfelt appeal."},{"name":"RAYAOSENNA","text":"For my part, I shall reach out to A–Ruhn. Perhaps together we can find a way to offer similar comfort to the elementals. I have no doubt we will require their assistance in the days ahead."},{"name":"KANESENNA","text":"Thank you, Sister. May the Twelve watch over and keep you both."},{"name":"KANESENNA","text":"May I trouble you to accompany me? The presence of a storied hero would surely lend credence to my claims that the people's difficulties will soon be at an end."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"While you attend to that, I shall gather what information I can from the Wood Wailers stationed here. Pray look for me at the camp proper when you have finished."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"The Seedseers are beholden to the pleas of elementals and man alike. I do not envy their responsibilities, difficult as they are for anyone to fulfill."},{"name":"RAYAOSENNA","text":"There was a time when my sister was loath to show weakness. Though she accepts the aid of others more easily now─goes so far as to seek of her own accord, even─her desire to project strength in the face of adversity sometimes brings old tendencies to the fore."},{"name":"TRANQUILMAN04103A","text":"I saw it for but a moment, but the image is seared into my memories. Ah...I'm afraid to close my eyes even now!"},{"name":"TRANQUILWOMAN04103","text":"What'll we do if the beast comes? What <span class=\"emphasis\">can</span> we do?"},{"name":"TRANQUILMAN04103B","text":"It's like I've been saying─the Seedseers are useless! If it ain't about their precious elementals, they don't care. We'd be better off heading south to Ul'dah..."},{"name":"KANESENNA","text":"If we are to convince the people that they need not live in fear of Gleipnir, then my words alone may be insufficient. I do not comport myself as an imposing figure blessed with martial prowess, to say the least."},{"name":"KANESENNA","text":"You, on the other hand, are renowned as a peerless warrior who has triumphed in countless trials. Simply looking on your features fills me with confidence that this crisis too shall pass."},{"name":"KANESENNA","text":"I pray you stay by my side, that those we speak with might be joyed by your presence."},{"name":"SYSTEM","text":"Kan–E–Senna is now accompanying you. Keep her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Kan–E–Senna behind by entering a different area, or by speaking with her and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Kan–E–Senna accompany you again, return and speak with her at the original location."},{"name":"SYSTEM","text":"You must be accompanied by Kan–E–Senna and have her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"Kan–E–Senna has yet to arrive. Be sure she is at your side before attempting to continue."},{"name":"Q2","text":"What will you do?"},{"name":"A2","text":"Speak with Kan–E–Senna."},{"name":"A2","text":"Part ways with Kan–E–Senna."},{"name":"A2","text":"Nothing."},{"name":"KANESENNA","text":"Try as they might to go about their lives as normal, there is an unmistakable tension in their every movement. We must do what we can to put their minds at ease."},{"name":"KANESENNA","text":"Too often do I only learn of the people's troubles through reports and the like. To hear their stories firsthand, the desperation in their voices...it strengthens my resolve to bring this nightmare to an end."},{"name":"KANESENNA","text":"I am reminded also that we Seedseers must do more to convey the thoughts of the elementals to our fellow Gridanians. Though they live among us, there is a tendency to treat them as something otherworldly and unknowable. If only all could share in our experience..."},{"name":"SYSTEM","text":"Are you sure you wish to part ways with Kan–E–Senna?"},{"name":"KANESENNA","text":"I understand you must have many pressing obligations. Still, I would not proceed without your company, and shall wait for you to return before speaking with the people."},{"name":"KANESENNA","text":"I am glad to see you returned from your adventures none the worse for wear. Now, shall we continue?"},{"name":"TRANQUILMAN04103A","text":"I saw it! A gargantuan beast stalking the woods, with horns the size of my leg! What's to stop it from coming here to fill its belly?"},{"name":"KANESENNA","text":"Gleipnir will do no such thing, I swear. I shall see to it personally that the blasphemy does not come within a malm of this village. Keep heart, for brighter days lie ahead of us."},{"name":"TRANQUILMAN04103A","text":"Truly, Elder Seedseer? Ah...perhaps I've let my imagination get the better of me. You are a beacon in these dark times. I pray you restore the peace soon!"},{"name":"KANESENNA","text":"I shall, you can be certain!"},{"name":"TRANQUILWOMAN04103","text":"A single scratch is enough to spell one's doom, they say! Nothing but to wait for death to come. How can we face a beast like that!?"},{"name":"KANESENNA","text":"Do not give in to despair, my friend. Know that I shall do all in my power to see us through this crisis. Hold fast to hope, and encourage others to do so as well."},{"name":"TRANQUILWOMAN04103","text":"I'll try, Elder Seedseer, I'll try. I know you've placed yourself at risk, leaving the safety of the city and coming here, and that means a lot to me and mine. I'll stay close to the Wailers and pray news of your triumph reaches us soon."},{"name":"KANESENNA","text":"Thank you. I promise you that it will not be long."},{"name":"TRANQUILMAN04103B","text":"Seedseers are sittin' pretty with their guards and finery. What do they care if a beastie is runnin' amok? They'll be fine. That's why they're doin' nothin' while it hunts us."},{"name":"TRANQUILMAN04103B","text":"We'd be fools to trust our lives to those what don't care a whit. Aye, past time we went south. Least in Ul'dah they don't pretend to look out for the common man."},{"name":"TRANQUILMAN04103B","text":"E-Elder Seedseer! I was just, uh... Er..."},{"name":"KANESENNA","text":"I promise you that we are sparing no effort in our hunt for Gleipnir. However, it will take time─and more may suffer before the beast is laid low."},{"name":"KANESENNA","text":"Nevertheless, I ask that you place your faith in me, if only for a while longer. I love the Twelveswood and her people with all my heart, and I will not let our enemy torment us forever."},{"name":"TRANQUILMAN04103B","text":"I...I understand. Man's gotta give voice to his worries from time to time, aye? Nothin' I want less than to abandon my home. I'll stick around...for now."},{"name":"TRANQUILMAN04103A","text":"We can cower in fear, or we can strive to lift one another's flagging spirits. Better to choose the latter. May the Matron bring you victory, for all of our sakes."},{"name":"TRANQUILWOMAN04103","text":"Everyone's scared, but so long as we stick together and stay strong, I think we'll survive."},{"name":"TRANQUILMAN04103B","text":"Sorry about earlier. I've been strung tighter than a longbow lately. I really do appreciate the Seedseers and all they've done for us, and I pray they can deliver us from this evil."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Oh? I thought the Elder Seedseer was in your care. Where is she?"},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Will that be all for now, Elder Seedseer?"},{"name":"KANESENNA","text":"It will. I have done what I can to quell the unrest. But so long as Gleipnir lives, they will never be at peace."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Sometimes simply lending an ear does wonders─as must be the case for the elementals, yes?"},{"name":"A3","text":"Do you doubt your chosen course?"},{"name":"KANESENNA","text":"Indeed, you are correct. Today was a welcome reminder of that truth, and an important step in our journey."},{"name":"KANESENNA","text":"Nay, not in the slightest. The shortest path to a destination is often not the best, and today was a welcome reminder of that truth."},{"name":"KANESENNA","text":"Mayhap I should visit these settlements more often. Doubtless some here think me as distant as the elementals, so rarely do they see me in the outer reaches..."},{"name":"KANESENNA","text":"You have served me admirably as protectors thus far, for which I am grateful. Yet until we have found and laid Gleipnir low, I must continue to impose upon your goodwill."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"'Tis no imposition, Elder Seedseer. You saved me on the killing fields of Carteneau. My life is yours, now and always."},{"name":"KANESENNA","text":"Your life is your own to command, but I thank you for your words. And your conviction, which fills me with confidence that the path we walk is true."},{"name":"KANESENNA","text":"Even if that path takes us far afield... Hmm. Did I ever tell you that, when I was a young student, I would often steal into the woods with a dear friend of mine─much to the chagrin of our teacher?"},{"name":"KANESENNA","text":"Deep down, I suspect there is still a part of me that yearns to wander where I should not..."},{"name":"LANDENEL","text":"Elder Seedseer. Word from the border─we've got ourselves a right bloody mess, by the sound of it."},{"name":"KANESENNA","text":"What has happened?"},{"name":"LANDENEL","text":"Per your earlier instructions, the Wailers closed the roads to all travel while we scoured the wood for signs of Gleipnir. But now a group of locals are demanding to be let through into Thanalan."},{"name":"LANDENEL","text":"They're terrified, by the sound of it. Screaming about the Creeping Death and gods know what else."},{"name":"KANESENNA","text":"Despair grips their hearts... If it consumes them wholly, then we may have yet more blasphemies to contend with."},{"name":"KANESENNA","text":"I will speak with them. Wild rumors fuel their panic, and with truth and compassion will I convince them to see reason and return to their homes."},{"name":"LANDENEL","text":"If anyone can it's you, Elder Seedseer. We're doing our best to keep them calm for now, but my man's words painted a grim picture. I pray you make your way to the border as quickly as you can."},{"name":"LANDENEL","text":"Follow the road south─you'll find them soon enough. My men are doing what they can, but we're soldiers, not mediators..."},{"name":"KANESENNA","text":"The people here are indeed terrified. I must take care with my words."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"It's good we arrived when we did. Any later and we might've been met with a bloodier sight."},{"name":"REFUGEEMAN1","text":"Let us through, damn you! We're standing here while the Creeping Death nips at our heels! You're telling us to die!"},{"name":"WOODWAILER1","text":"Those rumors are false! The Elder Seedseer herself sent word that the Creeping Death is not responsible for the recent incidents!"},{"name":"WOODWAILER1","text":"You mustn't surrender to panic. Return to your homes while we deal with the threat, and pay no heed to baseless stories."},{"name":"REFUGEEMAN1","text":"Stories? <span class=\"emphasis\">Stories</span>!? I've seen the dead with my own eyes─don't tell me what is and isn't true!"},{"name":"KANESENNA","text":"Hearken to me, my friends. I come before you now to assure you that the Creeping Death has not returned. Only those who have been wounded by Gleipnir are in danger, and so I beseech you to take shelter in your homes until the threat has passed."},{"name":"REFUGEEMAN1","text":"Gleipnir!? The beast I saw in the wood!? We have to run! It could've followed us!"},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"You saw him!? Where?"},{"name":"REFUGEEMAN1","text":"Not far from here. Those glistening horns...those terrible chains...reaching out to drag you down to the seventh hell... We ran and ran and never looked back!"},{"name":"REFUGEEMAN1","text":"But don't worry─it didn't catch any of us! No one's marked, see? That means...that means we're safe, right?"},{"name":"REFUGEEMAN2","text":"But... But say we weren't quite fast enough... What then?"},{"name":"KANESENNA","text":"Its horns and claws are where the poison resides, and even a scratch would be cause for concern..."},{"name":"REFUGEEMAN2","text":"Even a little scratch..."},{"name":"REFUGEEMAN2","text":"Then...then it's too late for me!? Is that...why my body feels...like it's on fire..."},{"name":"REFUGEEMAN1","text":"You told me the branches tripped you up! You said that's how it happened! You said!"},{"name":"KANESENNA","text":"O heavenly winds, guide us to the font of strength. May we drink from it and be made whole! "},{"name":"REFUGEEMAN2","text":"I don't...I don't feel any better... Do it again. Do it again!"},{"name":"REFUGEEMAN2","text":"It hurts... Help me..."},{"name":"KANESENNA","text":"Conjury has no effect. There can be no mistake─this is Gleipnir's doing."},{"name":"KANESENNA","text":"Even so, I ask that you do not lose heart! Stay strong, for if we surrender to fear, the beast has already won!"},{"name":"REFUGEEMAN2","text":"No... I don't want to die. Please...help me..."},{"name":"REFUGEEMAN2","text":"GAAAHHH!"},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Get back!"},{"name":"REFUGEEMAN1","text":"You said... You said it wasn't...<br>Ugh... Why... Why..."},{"name":"REFUGEEMAN1","text":"Liar... Liars! All of you! None of us are safe! None of us will...GAAAHHH!"},{"name":"KANESENNA","text":"Despair made manifest... Twelve forefend. Is there naught that can be done for these poor souls?"},{"name":"KANESENNA","text":"Naught but one thing, I know. I know. We must lay them to rest. Contain the threat."},{"name":"KANESENNA","text":"These ones are beyond saving. We can but end their suffering."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"So this is the face of the Final Days..."},{"name":"WOODWAILER1","text":"We'll keep these people safe!"},{"name":"REFUGEEMAN3","text":"What...what are those monstrosities!?"},{"name":"REFUGEEWOMAN","text":"This can't be... This isn't real!"},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"'Twas not the poison which triggered their transformation, but despair. Overwhelming despair..."},{"name":"REFUGEEMAN3","text":"Matron have mercy, what were those fiends!? The Creeping Death seems a mercy compared to an end like that..."},{"name":"REFUGEEWOMAN","text":"I can't take it! What kind of life is this, waiting to be hunted or be turned into one of them!?"},{"name":"WOODWAILER1","text":"We did what we had to. If we had let the fiends live, the blood of many would have been on our hands."},{"name":"KANESENNA","text":"They are...at peace. Would that it had not come to this. I was powerless to prevent it..."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"You did all you could, Elder Seedseer."},{"name":"REFUGEEMAN3","text":"Is that what's going to happen to us? Is there no hope?"},{"name":"KANESENNA","text":"What you witnessed was the fate of those who fall to deepest despair. It feeds upon grief and anguish, and is more deadly than Gleipnir itself."},{"name":"KANESENNA","text":"But as I swore to you that we shall defeat the blasphemy that haunts our homeland, so too do I swear that despair will not be the end of us. Keep the faith and look to the horizon, for brighter days will come."},{"name":"REFUGEEMAN3","text":"As you say, Elder Seedseer...as you say..."},{"name":"KANESENNA","text":"Gleipnir is not here, and so you are free to return to your homes. I but urge you to take care on the path back."},{"name":"REFUGEEMAN3","text":"We will, Elder Seedseer..."},{"name":"KANESENNA","text":"This storm has passed, but a darker tempest roils in the distance."},{"name":"KANESENNA","text":"So long as the specter of despair looms, the people will struggle to take any words of comfort to heart. We will see more tragedies like this."},{"name":"KANESENNA","text":"The elementals too cry out for a solution. The longer we struggle to resolve this crisis, the more innocent lives we put at risk."},{"name":"KANESENNA","text":"Raya–O said we would need to turn to the elementals for assistance, and I know now that she was right. And so I will seek audience with the great one."},{"name":"KANESENNA","text":"However, there are preparations I must attend to first. I shall make the proper ablutions at the Lotus Stand. Pray return to the Adders' Nest and await my summons."},{"name":"RAYAOSENNA","text":"I heard about what happened at the border, and about Kan–E's decision to commune with the great one. I pray that the elementals will answer our calls for assistance."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Despite our best efforts, we have been unable to prevent further loss of life. I foresee even greater hardship ahead."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"As we press on, we mustn't forget the words of the Elder Seedseer. We must strive to remain undaunted in the face of despair."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"She is preparing for her communion with the great one. When the time is right, she will call upon us both. Until then, my friend, stay strong."}],"reward":{"gil":1000},"reqs":{"jobs":[{"lvl":86,"id":186}],"quests":[69638]},"next":[69640]},"partials":[{"type":"npc","id":"1038411","obj":{"i":1038411,"n":"Keeper Of The Entwined Serpents","l":52,"q":6}},{"type":"quest","id":"69638","obj":{"i":69638,"n":"Shrouded in Peril","g":184,"l":"Radz-at-Han","s":101,"f":1}},{"type":"quest","id":"69640","obj":{"i":69640,"n":"A Gift Undone","g":184,"l":"Gridania","s":121,"f":1}}]}