{"quest":{"name":"An Honor to Serve","location":"Zadnor","id":69630,"patch":5.55,"sort":311,"unlocksFunction":1,"eventIcon":71341,"issuer":1036756,"target":1036756,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"RESISTANCECOUNCILOR","text":"Blade <span class=\"highlight\">Surname</span>. Might I have a word?"},{"name":"RESISTANCECOUNCILOR","text":"Your valiant efforts on the battlefield continue to prove an ideal to which all of our soldiers aspire. After conferring with my superiors, they asked that you be made privy to the Resistance's highest accolades."},{"name":"RESISTANCECOUNCILOR","text":"They are decorations awarded only to our most valiant soldiers, blessed to grant their wearers protection from those who would bring ruin to Bozja."},{"name":"RESISTANCECOUNCILOR","text":"Few are those who possess the mettle to qualify for evaluation, but we believe you, Blade <span class=\"highlight\">Surname</span>, may be worthy of this most prestigious of honors."},{"name":"RESISTANCECOUNCILOR","text":"Players who are awarded Resistance honors will be granted increased attributes when undertaking duties in Save the Queen content."},{"name":"RESISTANCECOUNCILOR","text":"A large amount of mettle must be amassed to be rewarded Resistance honors. Furthermore, it should be noted that no rewards other than an increase to attributes will be granted."},{"name":"Q1","text":"Submit to evaluation for Resistance honors?"},{"name":"RESISTANCECOUNCILOR","text":"Very good. We shall be observing your exploits in the field with great interest, Blade <span class=\"highlight\">Surname</span>."},{"name":"RESISTANCECOUNCILOR","text":"When you believe yourself ready to receive of our honors, come and speak with me, and I will evaluate your performance accordingly."},{"name":"RESISTANCECOUNCILOR","text":"You have unlocked Resistance honors. There are three types of honors, each of which increases various character attributes."},{"name":"RESISTANCECOUNCILOR","text":"To receive Resistance honors, you must first amass sufficient mettle and speak with the Resistance councilor to receive proofs of mettle. These may then be exchanged for honors of your choosing. You can speak with the Resistance councilor at any time to learn more about Resistance honors."}],"reqs":{"quests":[69624]}},"partials":[{"type":"npc","id":"1036756","obj":{"i":1036756,"n":"Resistance Councilor","l":3662,"q":1}},{"type":"quest","id":"69624","obj":{"i":69624,"n":"March of the Bloody Queen","g":76,"l":"Zadnor","s":307,"f":1}}]}