{"quest":{"name":"Tell Me a Story","location":"Gangos","id":69634,"patch":5.55,"sort":352,"icon":101073,"unlocksFunction":1,"eventIcon":71341,"issuer":1032905,"target":1032905,"genre":76,"usedItems":[33759,33760],"journal":["The House of Splendors is prepared to deliver a shipment of metal alloy, provided that you fulfill your side of the bargain.","In exchange for the metal alloy, the House of Splendors has asked for two sets of freshly penned memoirs. They went on to say these tales of heated battle should be based on encounters in Bozja or, failing that, those of an otherworldly nature. There is a pained look in Zlatan's eyes as he tells you they have asked for thirty volumes of each. And so he bids you safe travels as you set off to the battlefield in search of inspiration for your writings.<br><br>※Memoirs can be obtained by participating in skirmishes and critical engagements in Zadnor, as well as any of the normal Omega 8-man raids. The Unrestricted Party option cannot be enabled when clearing the aforementioned duties.","You return with the requested memoirs, an arduous labor of blood, sweat, and ink. Regana's associates are thrilled to have completed the transaction, but apparently more so to meet Gerolt. They shower him with compliments, followed by a proposal for a wholesale contract for additional shipments of metal alloy. You quickly interject before he has the chance to accept, prompting the attendants to take their leave. Though no new contracts were signed, you are one step closer to a more powerful Resistance weapon."],"objectives":["Deliver the copies of <span class=\"emphasis\">A Day in the Life: Battles for the Realm</span> and <span class=\"emphasis\">A Day in the Life: Beyond the Rift</span> to Zlatan at Gangos."],"dialogue":[{"name":"ZLATAN","text":"If you are up to the task, Blade <span class=\"highlight\">Surname</span>, I thought we might tend to the metal alloy required for the Resistance weapons' refinement."},{"name":"ZLATAN","text":"I say “we,” but I fear there is little I can do to help with this particular request from the House of Splendors."},{"name":"ZLATAN","text":"For some reason, they have requested memoirs of battle in return for their services. They were quite adamant that said memoirs are of fierce battles far more harrowing than anything I myself have experienced."},{"name":"ZLATAN","text":"What's more, they went on to say these writings should be based on battles here in Bozja, or battles of an “otherworldly nature.” My apologies, Blade <span class=\"highlight\">Surname</span>, but they have asked for thirty freshly penned volumes of each."},{"name":"SYSTEM","text":"The requested memoirs can be obtained by participating in skirmishes and critical engagements in Zadnor."},{"name":"SYSTEM","text":"They may also be obtained by completing any of the normal Omega 8-man raids."},{"name":"ZLATAN","text":"I can scarcely imagine what manner of harrowing tales you intend to pen, but I have every confidence the House of Splendors will be pleased."},{"name":"SYSTEM","text":"The requested memoirs can be obtained by participating in skirmishes and critical engagements in Zadnor."},{"name":"SYSTEM","text":"They may also be obtained by completing any of the normal Omega 8-man raids."},{"name":"ZLATAN","text":"Ah, you are returned. Regana's attendants arrived with a shipment of alloy not long ago. May I presume you found ample inspiration for your memoirs?"},{"name":"ESCHINA","text":"...Twenty-nine. Thirty. Everything is accounted for. Here is your alloy, as promised."},{"name":"ZLATAN","text":"A pleasure to do business with you. Though...may I ask why the House of Splendors sent <span class=\"emphasis\">two</span> representatives for this transaction?"},{"name":"ESCHINA","text":"Considering the difficulties likely involved in penning these memoirs, we thought it best to leave nothing to chance with this particular shipment. In any case, sixty volumes of anything is rather a lot, so we decided to share the load."},{"name":"ENNA","text":"Though there was one other reason we both elected to come..."},{"name":"ENNA","text":"Those chiseled muscles. That rugged jawline... You must be Gerolt, the world-renowned blacksmith. I've heard many a tale of the wonders borne from your forge."},{"name":"ESCHINA","text":"Aye, a master smith whose striking good looks are matched only by his incomparable business acumen. In fact, we wish to make you a proposition─an exclusive contract for wholesale shipments of our alloy. If anyone can realize the potential of this king amongst metals, it would be the illustrious Gerolt Blackthorne."},{"name":"GEROLT","text":"Well, it's nice to see someone finally recognizes me talent for what it is. And yer absolutely right─I'm sure I could find a use for more o' this here alloy. Mayhap a new line o' kettles, or..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Take this deal, and you can write your own bloody memoirs."},{"name":"A2","text":"Are you sure you want <span class=\"emphasis\">more</span> dealings with Rowena's lot?"},{"name":"GEROLT","text":"B-But...ye know damn well waxin' poetic ain't me strong suit, and what if Rowena found out I'm the one what wrote 'em?<br>...Fine. If that's the way you want to be about it, I guess we'll have to decline the offer."},{"name":"GEROLT","text":"Oi, let's not bring Rowena into this! &lt;sigh&gt; You're right... It's only a matter o' time before she weasels more clauses an' loopholes into the contract... She'd have me over a barrel before I know it."},{"name":"ESCHINA","text":"So Rowena has you wrapped about her finger, does she? What a pity."},{"name":"ENNA","text":"We'd hoped you might be interested in a little “something on the side,” but it seems she's got you all to herself."},{"name":"ENNA","text":"Well, you can't say we didn't try. Perhaps you should keep to the strait and narrow?"},{"name":"REGANA","text":"And perhaps you should be running along?"},{"name":"ESCHINA","text":"As you wish. We'll be back again when the Resistance has need of our services. Until then, Regana..."},{"name":"SYSTEM","text":"Through your various dealings with the House of Splendors, you have acquired all the materials needed to refine your Resistance weapon. Speak with Gerolt to proceed to the next phase in his plan."}],"reward":{"gil":615},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69632]},"next":[69636]},"partials":[{"type":"npc","id":"1032905","obj":{"i":1032905,"n":"Zlatan","l":3478,"q":12}},{"type":"item","id":"33759","obj":{"i":33759,"n":"A Day in the Life: Battles for the Realm","l":1,"c":26155,"t":63}},{"type":"item","id":"33760","obj":{"i":33760,"n":"A Day in the Life: Beyond the Rift","l":1,"c":26156,"t":63}},{"type":"quest","id":"69632","obj":{"i":69632,"n":"What Dreams Are Made Of","g":76,"l":"Gangos","s":350,"f":1}},{"type":"quest","id":"69636","obj":{"i":69636,"n":"A Done Deal","g":76,"l":"Gangos","s":354,"f":1}}]}