{"quest":{"name":"A Fond Memory","location":"Gangos","id":69635,"patch":5.55,"sort":353,"icon":101074,"unlocksFunction":1,"eventIcon":71341,"issuer":1032905,"target":1032905,"genre":76,"usedItems":[33763,33764],"journal":["The House of Splendors has devised a way to bind the power of emotion to weapons, which it is willing to share for a price.","Based on the techniques used to create materia, the House of Splendors has devised an incantation that can commit the energies of emotion to the Resistance weapon. For ease of use─or perhaps ease of profit─the spell has been penned to magicked scrolls, and the House has asked you supply them with memories of the dying in exchange. Zlatan forgoes explanations of the crystallized memories and tells you only that two varieties of memory are required, thirty of each.<br><br>※Memories of the dying can be obtained by participating in skirmishes and critical engagements in Zadnor, as well as any of the normal Eden 8-man raids. The Unrestricted Party option cannot be enabled when clearing the aforementioned duties.","You return to Gangos, memories of the dying in hand. The transaction is carried out as arranged, but before Regana's associate leaves, she takes a moment to offer Gerolt an additional contract for larger shipments of magicked scrolls. Much to Zlatan's surprise, the attendant is strangely composed when the offer is rejected. As she turns to leave, you find yourself another step closer to refining your Resistance weapon."],"objectives":["Deliver the bleak memories of the dying and lurid memories of the dying to Zlatan at Gangos."],"dialogue":[{"name":"ZLATAN","text":"According to Master Gerolt, the means by which emotional energies are committed to the Resistance weapons is perhaps the most crucial part of the refinement process."},{"name":"ZLATAN","text":"Somehow, the House of Splendors has contrived an incantation they believe will do precisely that, inspired by the techniques used to create materia. They are penned to magicked scrolls, no doubt designed to expire after a handful of uses. But I digress..."},{"name":"ZLATAN","text":"In exchange for these scrolls, they have asked we procure crystallized memories of the dying. Our work on the Resistance weapons has garnered their attention, it seems, and now they wish to study the crystals to perhaps refine their own wares."},{"name":"ZLATAN","text":"I would rather we didn't have to share the techniques of our forebears, but if this is the price we must pay to benefit Bozja's future, so be it."},{"name":"ZLATAN","text":"I will forgo explanations on how to acquire them, as you are already quite familiar. You need only know they have requested two varieties of memories, thirty of each."},{"name":"SYSTEM","text":"The requested memories of the dying can be obtained by participating in skirmishes and critical engagements in Zadnor."},{"name":"SYSTEM","text":"They may also be obtained by completing any of the normal Eden 8-man raids."},{"name":"ZLATAN","text":"By now I would imagine you know far better than I how best to procure memories of the dying. Remember─they have asked for two varieties of memories, thirty of each."},{"name":"SYSTEM","text":"The requested memories of the dying can be obtained by participating in skirmishes and critical engagements in Zadnor."},{"name":"SYSTEM","text":"They may also be obtained by completing any of the normal Eden 8-man raids."},{"name":"ZLATAN","text":"Welcome back, Blade <span class=\"highlight\">Surname</span>. Regana's colleague arrived not long ago with the magicked scrolls. I trust you were able to find a suitable assortment of memories?"},{"name":"GJUSANA","text":"Yes, these will do nicely. Here are your scrolls."},{"name":"ZLATAN","text":"And with this, we are yet another step closer to achieving what even our forebears could only dream of. You have my sincerest gratitude."},{"name":"GJUSANA","text":"Think nothing of it. Thanks to you, I'm more likely to make my quota for this month's sales. I've been going through a bit of a rough spot lately, and that was even before Regana's proposition..."},{"name":"ZLATAN","text":"Proposition?"},{"name":"GJUSANA","text":"Ah! Sorry, forget I said anything! Now, if I'm not mistaken, the burly gentleman over there is Eorzea's finest blacksmith, Gerolt Blackthorne, correct?"},{"name":"GJUSANA","text":"Excuse me. Would you be interested in negotiating larger shipments of magicked scrolls? Wholesale, perhaps?"},{"name":"GJUSANA","text":"A man of your talents could use the surplus to make a hefty profit selling them to the Resistance, maybe even pay off outstanding debts. What do you say?"},{"name":"GEROLT","text":"As temptin' as that sounds, I'm not too keen on doin' any more work than I have to at present, even if I end up regrettin' it later. And I'm not about to ask <span class=\"highlight\">Forename</span> here or the Resistance to empty their coffers to solve me troubles."},{"name":"ZLATAN","text":"If I may interject, we have no intention of arming <span class=\"emphasis\">all</span> of our soldiers with these Resistance weapons, and we simply do not have the resources required to exchange for a large number of scrolls. My apologies, but we cannot in good conscience commit to supplementary agreements."},{"name":"GJUSANA","text":"I see... Well, if you should have a change of heart, you may call on me at any time."},{"name":"ZLATAN","text":"Y-Yes, of course, thank you. To be honest, I was expecting your proposition to be a touch more..."},{"name":"GJUSANA","text":"Aggressive? A great many of the House's attendants are rather forward, if not overbearing, in their negotiations, I'll not deny it. I can be as well if I deem it necessary, but now is not such an occasion."},{"name":"GJUSANA","text":"I hope the rest of your business proceeds as planned."},{"name":"REGANA","text":"It's a pity they didn't take you up on your offer, but your help is greatly appreciated all the same. I was right to call on you."},{"name":"SYSTEM","text":"Through your various dealings with the House of Splendors, you have acquired all the materials needed to refine your Resistance weapon. Speak with Gerolt to proceed to the next phase in his plan."}],"reward":{"gil":615},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69632]}},"partials":[{"type":"npc","id":"1032905","obj":{"i":1032905,"n":"Zlatan","l":3478,"q":12}},{"type":"item","id":"33763","obj":{"i":33763,"n":"Bleak Memory of the Dying","l":1,"c":20019,"t":63}},{"type":"item","id":"33764","obj":{"i":33764,"n":"Lurid Memory of the Dying","l":1,"c":20025,"t":63}},{"type":"quest","id":"69632","obj":{"i":69632,"n":"What Dreams Are Made Of","g":76,"l":"Gangos","s":350,"f":1}}]}