{"quest":{"name":"What Dreams Are Made Of","location":"Gangos","id":69632,"patch":5.55,"sort":350,"icon":101071,"unlocksFunction":1,"eventIcon":71341,"issuer":1032879,"target":1032905,"genre":76,"journal":["Gerolt would test his forge in ways the ancient Bozjans only dreamed of.","According to Zlatan, one of the surviving members of Gunnhildr's Blades recently discovered on the battlefield a new variety of crystal that contains not memories, but raw emotions. Gerolt suspects that, with a little effort, these fascinating specimens can be used to reforge the Resistance weapons into the pinnacle of martial perfection.","Regana has agreed to call upon her colleagues in the House of Splendors, and will be instructing them to deliver the necessary materials to Gangos. As one would expect of dealings with the much-maligned organization, this service will come at a cost, however, and it falls to you to procure the goods they request as payment─whatever they may be."],"objectives":["Speak with Zlatan."],"dialogue":[{"name":"GEROLT","text":"Well, well, didn't think I'd see you traipsin' about here. They told me ye've been keepin' busy givin' the IVth Legion what for on the front lines. I'm sure yer itchin' to get back, but afore ye go, we've some interestin' news to share. "},{"name":"GEROLT","text":"Well, well, if it ain't the hero o' the hour. Hope you had yer fill durin' the celebration─gods know I did. What a night that was!"},{"name":"ZLATAN","text":"Yes, well... The night has passed, and now a new day dawns for Bozja, thanks in no small part to Blade <span class=\"highlight\">Surname</span>'s selflessness. Though the battle for Bozja is over, we received a rather interesting report from the field."},{"name":"ZLATAN","text":"One of the surviving members of Gunnhildr's Blades has found more crystals on the battlefield, but far different from those we have seen before."},{"name":"GEROLT","text":"Aye, they ain't formed from the memories o' the dyin'. More like a concentration o' raw emotion."},{"name":"GEROLT","text":"And I'd wager me last mug of ale─well, maybe not me <span class=\"emphasis\">last</span> mug─that Gunnhildr's Blades would've used crystals just like these to give their weapons more bite. If they knew how, that is."},{"name":"GEROLT","text":"Seems like when the last queen unleashed the power of the sword, the prayers o' her people added to her strength. These crystals ain't exactly full o' faith, but if we're lookin' to make the Resistance weapons stronger, the power o' them emotions might just do the trick."},{"name":"GEROLT","text":"From what books I could find, Gunnhildr's Blades had the same idea─enhancin' their weapons usin' the power of prayer, but understandin' how to unlock the potential o' Save the Queen proved too much for 'em."},{"name":"REGANA","text":"Fascinating. Should we succeed where even the ancient Bozjans failed, we will have forged the true blades of Gunnhildr, as they were meant to be..."},{"name":"GEROLT","text":"Aye, you could say that. 'Course I'd rather we keep callin' 'em Resistance weapons."},{"name":"REGANA","text":"Whatever we choose to name them, it certainly is an exciting prospect! You shall have the support of the House of Splendors, and any resources that might prove useful to your work."},{"name":"ZLATAN","text":"The cooperation of the House is greatly appreciated, but I assume this is not an act of charity."},{"name":"REGANA","text":"Well, we are a business, after all. But surely any price we ask is a pittance if it means a glorious new standard for your countrymen to rally behind?"},{"name":"ZLATAN","text":"...Yes, such splendorous weapons would more than serve as a beacon of hope for our peoples' future once the imperials are driven out of Bozja."},{"name":"ZLATAN","text":"...Yes, such splendorous weapons would more than serve as a beacon of hope for our peoples now that the imperials have been driven out of Bozja."},{"name":"GEROLT","text":"More importantly, me contract with the House o' Splendors'll be fulfilled. Assumin', that is, we can get a hold o' everything we need."},{"name":"GEROLT","text":"That bein' an alloy what can handle higher concentrations of aether, a potent reagent to bind aetherial energies to the weapon, and a means o' committin' the power of emotions to it."},{"name":"REGANA","text":"Rather a tall order, but I am certain that the House of Splendors can provide. I will have my associates look through our inventories and bring the necessary resources to Gangos. Naturally, the House will expect something in return, most likely goods of equivalent value."},{"name":"ZLATAN","text":"And what part will you play in the proceedings, if I may ask?"},{"name":"REGANA","text":"Oh, I plan to have the Ironworks make adjustments to the Allagan node, in order to more precisely tailor the completed weapons to their future wielders. After all, such attention to detail will increase their value exponentially."},{"name":"REGANA","text":"And one last thing. I will be instructing my colleagues to deliver the requested materials in bulk. That they should have to travel so far, I intend to make it worth their time."},{"name":"ZLATAN","text":"I suppose that is fair. And we will certainly have need to forge more weapons when new members of Gunnhildr's Blades are appointed."},{"name":"REGANA","text":"Thank you for understanding. Now, without any further ado, I shall begin my preparations."},{"name":"ZLATAN","text":"For the time being, that leaves us to ponder upon the not-so-simple matter of the goods the House will demand as payment."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Leave it to me!"},{"name":"A2","text":"Oh dear..."},{"name":"ZLATAN","text":"Wonderful. Once we know more, I shall act as an intermediary to ensure a smooth transaction."},{"name":"ZLATAN","text":"Well, you don't <span class=\"emphasis\">have</span> to help us if you don't want to. Although, from what I gather, most adventurers find the lure of a shiny, new weapon hard to resist. Does that sound accurate?"},{"name":"REGANA","text":"Heh heh heh. Now all I need to do is wait for my moment..."},{"name":"GEROLT","text":"It'll be nice not havin' to deal directly with Regana for a while, eh? With any luck, her cronies won't drive too hard a bargain."},{"name":"ZLATAN","text":"I but moments ago received a list of desired goods from Mistress Regana. The House of Splendors works with frightening efficiency..."},{"name":"ZLATAN","text":"What they are asking for does not seem entirely unreasonable. As Regana has arranged three separate transactions, I shall let you decide which to attend to first."},{"name":"SYSTEM","text":"Three new Resistance weapon quests are now available from Zlatan."},{"name":"SYSTEM","text":"Upon completing these three quests, an additional Resistance weapon quest will become available."}],"reward":{"gil":615},"reqs":{"jobs":[{"lvl":80,"id":142}],"questsType":"all","quests":[69620,69576]},"next":[69633,69634,69635]},"partials":[{"type":"npc","id":"1032879","obj":{"i":1032879,"n":"Gerolt","l":3478,"q":5}},{"type":"npc","id":"1032905","obj":{"i":1032905,"n":"Zlatan","l":3478,"q":12}},{"type":"quest","id":"69620","obj":{"i":69620,"n":"A New Playing Field","g":76,"l":"Gangos","s":301,"f":1}},{"type":"quest","id":"69576","obj":{"i":69576,"n":"A New Path of Resistance","g":76,"l":"Gangos","s":253,"r":1,"f":1}},{"type":"quest","id":"69633","obj":{"i":69633,"n":"Spare Parts","g":76,"l":"Gangos","s":351,"f":1}},{"type":"quest","id":"69634","obj":{"i":69634,"n":"Tell Me a Story","g":76,"l":"Gangos","s":352,"f":1}},{"type":"quest","id":"69635","obj":{"i":69635,"n":"A Fond Memory","g":76,"l":"Gangos","s":353,"f":1}}]}