{"quest":{"name":"Irresistible","location":"Gangos","id":69637,"patch":5.55,"sort":355,"repeatable":1,"icon":101076,"unlocksFunction":1,"eventIcon":71342,"issuer":1032905,"target":1032905,"genre":76,"usedItems":[33767],"journal":["Before the finishing touches can be added to the Resistance weapon, Zlatan has one last task for you.<br>※Changing classes or jobs will prevent progress during this quest.","As Zlatan explains it, the raw emotions you seek were first discovered at the site of intense battles where emotions ran high. He asks that you seek out equally fierce confrontations to find fifteen crystals of raw emotion.<br><br>※You may not proceed with a class or job that is different from when you accepted this quest.<br>※Raw emotions can be obtained by completing the raids Delubrum Reginae or the Dalriada in Zadnor, any level 70 dungeon, or the deep dungeon Heaven-on-High.","You return to Gangos with the required raw emotions, and it is not long before the familiar clangor of Gerolt's hammer and the whirring of the Allagan node fills the air. Before long, the work is completed, and you find yourself the proud owner of a weapon the ancient Bozjans could only dream of, possessed of a strength that may very well rival that of Save the Queen. Zlatan wastes no time relaying the good news to Bajsaljen.<br><br>Interrupting the jubilant mood, Regana brings up the matter of their contract, claiming Rowena has doubled the asking price for the materials used in the forging of such weapons. To everyone's surprise, Rowena herself appears unexpectedly to refute those selfsame claims and thereby uncover Regana's extortion scheme. Her plans exposed, Regana fully expects her employment to be terminated, but Zlatan insists she stays on to fulfill the contract between the Resistance and the House of Splendors. Rowena consents to his request, and all present, save perhaps Gerolt, are pleased to see that their work will be allowed to continue.<br><br>Your work to perfect the Resistance weapon has enheartened Bajsaljen, for now the people of Bozja will at last have a shining beacon of hope under which they might rally."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Obtain raw emotions</span><span class=\"alternative\">Augmented Law's Order Bastard Sword and Augmented Law's Order Kite Shield</span><span class=\"alternative\">Augmented Law's Order Knuckles</span><span class=\"alternative\">Augmented Law's Order Labrys</span><span class=\"alternative\">Augmented Law's Order Spear</span><span class=\"alternative\">Augmented Law's Order Composite Bow</span><span class=\"alternative\">Augmented Law's Order Cane</span><span class=\"alternative\">Augmented Law's Order Rod</span><span class=\"alternative\">Augmented Law's Order Index</span><span class=\"alternative\">Augmented Law's Order Codex</span><span class=\"alternative\">Augmented Law's Order Knives</span><span class=\"alternative\">Augmented Law's Order Revolver</span><span class=\"alternative\">Augmented Law's Order Zweihander</span><span class=\"alternative\">Augmented Law's Order Astrometer</span><span class=\"alternative\">Augmented Law's Order Samurai Blade</span><span class=\"alternative\">Augmented Law's Order Rapier</span><span class=\"alternative\">Augmented Law's Order Manatrigger</span><span class=\"alternative\">Augmented Law's Order Chakrams</span><span class=\"alternative\">With  in your inventory or Armoury Chest, deliver the raw emotions to Zlatan at Gangos</span></span>."],"dialogue":[{"name":"SYSTEM","text":"Please note that upon completing the quest “Irresistible,” you will receive a Resistance weapon for <span class=\"alternative-container\"><span class=\"alternative\">an [Job]</span><span class=\"alternative\">a [Job]</span></span>."},{"name":"SYSTEM","text":"Please ensure you have changed to your desired job before speaking with Zlatan."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Undertake this quest as another job."},{"name":"A2","text":"Undertake this quest as <span class=\"alternative-container\"><span class=\"alternative\">an [Job]</span><span class=\"alternative\">a [Job]</span></span>."},{"name":"SYSTEM","text":"Please speak with Zlatan again when you are ready to undertake this quest."},{"name":"SYSTEM","text":"You have already received [Error] and [Error]. Please change to a different job and speak with Zlatan again."},{"name":"SYSTEM","text":"You have already received [Error]. Please change to a different job and speak with Zlatan again."},{"name":"SYSTEM","text":"In order to accept the quest “Irresistible,” please ensure that [Error] and [Error] are either equipped, in your Armoury Chest, or in your inventory."},{"name":"SYSTEM","text":"In order to accept the quest “Irresistible,” please ensure that [Error] is either equipped, in your Armoury Chest, or in your inventory."},{"name":"ZLATAN","text":"This new variety of crystals was first discovered on the plateaus of Zadnor."},{"name":"ZLATAN","text":"Much like the memories of the dying, we believe these crystals manifested from pitched battle with the enemy where emotions ran high."},{"name":"ZLATAN","text":"For a warrior of your prowess, I can only assume this means you must seek out perilous battles with the most deadly of foes to stir such emotions. We believe that fifteen of these crystallized emotions should suffice."},{"name":"ZLATAN","text":"Seeking to refine another Resistance weapon, I see. Thankfully, there are still resources left over from the last weapon, though we will require another assortment of raw emotions."},{"name":"ZLATAN","text":"As before, we will need fifteen to see our work done."},{"name":"SYSTEM","text":"Raw emotions can be obtained by undertaking the duties Delubrum Reginae or the Dalriada."},{"name":"SYSTEM","text":"They may also be obtained by completing any level 70 dungeon, or the deep dungeon Heaven-on-High."},{"name":"ZLATAN","text":"I dare not ask where exactly you plan to procure the emotions we require, but I pray that you will return to us safely, Blade <span class=\"highlight\">Surname</span>."},{"name":"SYSTEM","text":"Raw emotions can be obtained by completing the raids Delubrum Reginae or the Dalriada."},{"name":"SYSTEM","text":"They may also be obtained by completing any level 70 dungeon, or the deep dungeon Heaven-on-High."},{"name":"ZLATAN","text":"Welcome back, Blade <span class=\"highlight\">Surname</span>. If you have obtained a suitable store of raw emotions, let us commence the refining process. Before we begin, might I ask you to unequip your weapon?"},{"name":"ZLATAN","text":"Master Gerolt has made ready the forge, and all the other requisite materials are accounted for. May I see the crystals you have collected?"},{"name":"ZLATAN","text":"Excellent. And the weapon, if you please."},{"name":"ZLATAN","text":"Now, let us take these to Master Gerolt. I can scarcely wait to see what wonders he will work with his forge."},{"name":"GEROLT","text":"Aye, this seems to be everythin'."},{"name":"GEROLT","text":"Time to get to work. Why don't you go and tell the node what tickles yer fancy while I start in on the weapon?"},{"name":"ZLATAN","text":"Speaking of the Allagan node, Regana, a sealant was required when we last made use of it. Will we not have need of more?"},{"name":"REGANA","text":"Yes, a sealant made with aetherial siltstone is still required to complete the refining process."},{"name":"REGANA","text":"However, when making adjustments to the node and testing the enhanced coating process, there was a surprising amount of sealant left unused. There should be enough for now, but if <span class=\"highlight\">Forename</span> should be inclined to refine other weapons, we will need to acquire more."},{"name":"GEROLT","text":"That's awful kind o' ye. Maybe you ain't such a skinflint after all."},{"name":"REGANA","text":"Well, it is in everyone's best interests to see these weapons perfected. And if the House of Splendors is to establish good relations with the Resistance, a constant cutthroat approach to business will get us nowhere."},{"name":"GEROLT","text":"That don't sound like the House o' Splendors I know, but if you've a mind to throw the Resistance a bone, who am I to argue?"},{"name":"GEROLT","text":"Lookin' to fire up the forge again, eh? Well, let's get to it."},{"name":"REGANA","text":"And you needn't worry about the aetherial sealant─I have already seen to its preparation. It is the least I can do after my previous transgressions. "},{"name":"ZLATAN","text":"That is incredibly generous of you, Regana. Thank you."},{"name":"REGANA","text":"Y-Yes, well... Generosity aside, there are material concerns that must be addressed if our work is to continue. Should you wish to make further alterations to the weapon, I'm afraid you will have to supply your own sealant."},{"name":"MEMORIZESYSTEM","text":"Weapon receptacle ready for aetheroinsulation coating application. Please select desired attribute adjustment."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Adjust Resistance weapon attributes."},{"name":"A2","text":"Inquire about the refinement process."},{"name":"A3","text":"Nothing."},{"name":"SYSTEM","text":"You may raise four attributes associated with your Resistance weapon as you see fit. When you are satisfied with the allotment of attributes, select <span class=\"highlight\">Allocate</span> to complete the process."},{"name":"SYSTEM","text":"Choose carefully, as redistribution of attributes will require the procurement of additional materials."},{"name":"GEROLT","text":"Aye, that'll do. And that Allagan node did a mighty fine job on the finishin' touches."},{"name":"GEROLT","text":"The hopes an' dreams of ancient Bozja made manifest. A weapon truly worthy o' Gunnhildr's Blades─[???]!"},{"name":"GEROLT","text":"The hopes an' dreams of ancient Bozja made manifest. A blade truly worthy o' Gunnhildr's Blades─[???]!"},{"name":"GEROLT","text":"'Course we can't forget 'er twin, [???]!"},{"name":"GEROLT","text":"The queen's inscription ain't never shined so bright as when I hammered them crystals into the Resistance weapon. Can scarcely imagine what went into the makin' o' Save the Queen."},{"name":"GEROLT","text":"Havin' come face-to-face with Her Majesty yerself, I suppose you'd know better than any of us how potent the power o' memory an' emotions can be, eh?"},{"name":"GEROLT","text":"An' now that selfsame power is coursin' through yer Resistance weapon. I reckon even Queen Gunnhildr herself'd be hard-pressed to draw any more power out o' them inscriptions."},{"name":"ZLATAN","text":"The way you describe it, one might think this Resistance weapon rivals the strength of Save the Queen!"},{"name":"GEROLT","text":"Aye, Zlatan! That she might!"},{"name":"ZLATAN","text":"Wha... What did you just call me?"},{"name":"ZLATAN","text":"Surely I'm not the only one who heard that. My <span class=\"emphasis\">actual</span> name... Oh, I pray this is not merely a fleeting moment of sobriety."},{"name":"GEROLT","text":"So <span class=\"emphasis\">that's</span> his name!? I s'pose it was only a matter a time afore I got it right..."},{"name":"GEROLT","text":"But anyway, let's not get carried away with celebratin' just yet. We still have to share the fruits of our labor with Bajsaljen and the others."},{"name":"ZLATAN","text":"Yes, of course! I will go and inform him at once."},{"name":"REGANA","text":"And I will see our contract to its conclusion..."},{"name":"GEROLT","text":"I swear, if me kettles shined half as bright as these Resistance weapons, me debts'd be paid in no time at all."},{"name":"ZLATAN","text":"Master Gerolt, I would rather you refrained from drawing comparisons between the legacy of my forebears and...kettles, no matter how shiny they may be."},{"name":"GEROLT","text":"Just a bit o' humor to keep the mood light, nothin' to get worked up about Laz─er, lad."},{"name":"ZLATAN","text":"No harm done, Master Gerolt. If no offense was meant, then none shall be taken."},{"name":"REGANA","text":"I fear he hasn't realized Gerolt has already forgotten his name."},{"name":"MEMORIZESYSTEM","text":"Thank you for using the House of Splendor's weapon refinement services. &lt;blip&gt; &lt;blip&gt;<br>We look forward to serving you again. And remember─if quality is what you seek, be sure to visit Mor Dhona and let Mistress Rowena add a touch of splendor to your life!"},{"name":"BAISHAEN","text":"A weapon beyond even the reach of Gunnhildr's Blades. Truly a marvel of craftsmanship."},{"name":"BAISHAEN","text":"Though you were tasked only with recreating the weapons of Queen Gunnhildr's illustrious guard, it is clear you have gone far above and beyond what anyone could have hoped for. There is no doubt in my mind that you have made this seemingly impossible dream reality."},{"name":"BAISHAEN","text":"And I can think of no finer soldier than you to wield it, Blade <span class=\"highlight\">Surname</span>. In your hands, it will serve as a beacon of hope in our fight for freedom."},{"name":"BAISHAEN","text":"And I can think of no finer soldier than you to wield it, Blade <span class=\"highlight\">Surname</span>. In your hands, it shall serve as a reminder of our hard-earned freedom."},{"name":"REGANA","text":"Now that the weapon is forged, I wish to discuss the matter of payment for supplies and services rendered to the Resistance."},{"name":"REGANA","text":"In light of the considerable drain on the House's resources, I am afraid the cost for manufacturing subsequent Resistance weapons will henceforth be doubled."},{"name":"REGANA","text":"I wish it were not so, but Mistress Rowena insisted─"},{"name":"ROWENA","text":"(-???-)Did I now?"},{"name":"REGANA","text":"M-Mistress Rowena! To what do we owe the pleasure?"},{"name":"ROWENA","text":"Zlatan here called me, hopin' to talk over the terms o' the wholesale contracts I supposedly offered the Resistance."},{"name":"ROWENA","text":"And after speakin' with G'jusana and the others, they said it was <span class=\"emphasis\">you</span> who set up these deals. Clearly, you were hopin' to skim a not-so-small amount o' profits off the top, ain't that right?"},{"name":"REGANA","text":"N-No! Never! All that I do has ever been for the House of Splendors!"},{"name":"ROWENA","text":"And how, exactly, is tryin' to steal profits from your colleagues in the company's best interest? Usin' me good name to try and extort decent folk? If this is supposed to impress me, you're <span class=\"emphasis\">very</span> much mistaken!"},{"name":"GEROLT","text":"Impress...?"},{"name":"ROWENA","text":"Aye. For reasons I'll likely never understand, this one here took a real shine to me. Matter o' fact, unlike most of the other girls, she joined the House o' Splendors because she wanted to learn the trade. And from her very first day, she's run herself ragged tryin' to prove her worth."},{"name":"REGANA","text":"I...we stood to make so much from this deal, I hoped you might overlook me using your name to see it done. But I've betrayed the trust you've placed in me, and for that, I'm truly sorry. I'll not darken your door again, Mistress Rowena."},{"name":"ZLATAN","text":"If I might interject, Regana's work with the Resistance has been nothing short of exceptional. From her commissioning of the Allagan node, to her assistance with our research, she has contributed much and more to our cause. Why, she's even helped keep Gerolt focused─and more importantly, sober─long enough to see the job through to its conclusion."},{"name":"ZLATAN","text":"It is no exaggeration to say that without her, we would not be presenting Bajsaljen with the fruits of our labor."},{"name":"ZLATAN","text":"If you could find it within your heart to forgive Regana her transgressions, it would be my honor and privilege to continue business with the House of Splendors with her as your representative."},{"name":"BAISHAEN","text":"Provided our original agreement stands, and the cost of your services has not, in fact, doubled, I see no reason to object to a continued partnership."},{"name":"ROWENA","text":"Seein' as we <span class=\"emphasis\">narrowly</span> avoided any wrongdoin', I'm willin' to agree to our clients' wishes. Regana will remain here and oversee House business until the obligations of our contract have been fulfilled."},{"name":"GEROLT","text":"That sounds all well an' good, but I thought our work─and more importantly, me contract─was finished after I hammered out that weapon."},{"name":"BAISHAEN","text":"Your jokes never were funny, Gerolt. The original agreement was to forge weapons for <span class=\"emphasis\">all</span> of Gunnhildr's Blades. Your work has only just begun."},{"name":"ZLATAN","text":"Blade <span class=\"highlight\">Surname</span>'s weapon was always meant to be only a prototype... Though experience tells me remembrance of fine details is not one of your strong suits."},{"name":"ROWENA","text":"And <span class=\"emphasis\">my</span> experience tells <span class=\"emphasis\">me</span> you lot should keep an eye on how much that daft sod's been drinkin'. I can tell you now, I ain't payin' for any of it, so be sure to charge him for every drop."},{"name":"REGANA","text":"Thank you, Bajsaljen. I swear you will not regret this."},{"name":"BAISHAEN","text":"There is yet a long road ahead of us, Blade <span class=\"highlight\">Surname</span>, but I have faith in them. And you. For far too long the people of Bozja have been without a symbol of hope. But now, thanks to you and the others, they will soon find one."}],"reward":{"items":[{"id":33462},{"id":33479},{"id":33463},{"id":33464},{"id":33465},{"id":33466},{"id":33470},{"id":33471},{"id":33472},{"id":33473},{"id":33467},{"id":33468},{"id":33469},{"id":33474},{"id":33475},{"id":33476},{"id":33477},{"id":33478}]},"reqs":{"jobs":[{"lvl":80,"id":162}],"quests":[69636]}},"partials":[{"type":"npc","id":"1032905","obj":{"i":1032905,"n":"Zlatan","l":3478,"q":12}},{"type":"item","id":"33462","obj":{"i":33462,"n":"Blade's Honor","l":535,"c":30633,"t":2}},{"type":"item","id":"33479","obj":{"i":33479,"n":"Blade's Fortitude","l":535,"c":30223,"t":11}},{"type":"item","id":"33463","obj":{"i":33463,"n":"Blade's Serenity","l":535,"c":31198,"t":1}},{"type":"item","id":"33464","obj":{"i":33464,"n":"Blade's Valor","l":535,"c":31208,"t":3}},{"type":"item","id":"33465","obj":{"i":33465,"n":"Blade's Glory","l":535,"c":31610,"t":5}},{"type":"item","id":"33466","obj":{"i":33466,"n":"Blade's Muse","l":535,"c":32397,"t":4}},{"type":"item","id":"33470","obj":{"i":33470,"n":"Blade's Mercy","l":535,"c":32781,"t":9}},{"type":"item","id":"33471","obj":{"i":33471,"n":"Blade's Fury","l":535,"c":33152,"t":7}},{"type":"item","id":"33472","obj":{"i":33472,"n":"Blade's Acumen","l":535,"c":33222,"t":10}},{"type":"item","id":"33473","obj":{"i":33473,"n":"Blade's Wisdom","l":535,"c":33221,"t":98}},{"type":"item","id":"33467","obj":{"i":33467,"n":"Blade's Subtlety","l":535,"c":33984,"t":84}},{"type":"item","id":"33468","obj":{"i":33468,"n":"Blade's Justice","l":535,"c":34362,"t":87}},{"type":"item","id":"33469","obj":{"i":33469,"n":"Blade's Ingenuity","l":535,"c":34408,"t":88}},{"type":"item","id":"33474","obj":{"i":33474,"n":"Blade's Providence","l":535,"c":34956,"t":89}},{"type":"item","id":"33475","obj":{"i":33475,"n":"Blade's Fealty","l":535,"c":36513,"t":96}},{"type":"item","id":"33476","obj":{"i":33476,"n":"Blade's Temperance","l":535,"c":36812,"t":97}},{"type":"item","id":"33477","obj":{"i":33477,"n":"Blade's Resolve","l":535,"c":36054,"t":106}},{"type":"item","id":"33478","obj":{"i":33478,"n":"Blade's Euphoria","l":535,"c":36253,"t":107}},{"type":"item","id":"33767","obj":{"i":33767,"n":"Raw Emotion","l":1,"c":20027,"t":63}},{"type":"quest","id":"69636","obj":{"i":69636,"n":"A Done Deal","g":76,"l":"Gangos","s":354,"f":1}}]}