{"quest":{"name":"The Gift of Mercy","location":"The Lochs","id":69649,"patch":6.0,"sort":251,"icon":101091,"unlocksFunction":1,"eventIcon":71341,"issuer":1039402,"target":1039411,"genre":185,"journal":["The blasphemy hunter is even more flustered than usual, and with good reason.","You find Raubahn engaged in an urgent linkpearl conversation with M'naago, whose search party has finally made contact with the errant Fordola. As previously surmised, she has been on the trail of her friend Charlet, with the intention of slaying him following his irreversible transformation into a blasphemy. Although she successfully predicted where the beast would appear, Fordola was soon spotted by Charlet, who turned and fled in the direction of Specula Imperatoris. Raubahn orders the troops to prevent the blasphemy from escaping until the two of you arrive.","In the time taken for you and Raubahn to reach Specula Imperatoris, M'naago and her team have been pushed to their limits by the rampaging Charlet, with only Fordola still fit to fight. She, however, faces an entirely different struggle, as her guilt for her part in the deaths of Charlet's brother and the Crania Lupi threatens to overwhelm her, and it is only the unexpected pleas of M'naago and the surprising arrival of Arenvald that pull her back from the brink. Her resolve renewed, she leads the charge against Charlet, and with support from you and the Bull of Ala Mhigo, she finally lays her childhood friend to rest.","You and your comrades are given a warm reception upon returning to the city. Even Fordola, the reviled war criminal, receives a hero's welcome from Lylie, the child whose life she had saved. In light of her continued service to Ala Mhigo, Raubahn intends to have the restrictions to her freedom eased to a degree. The suggestion that she may no longer be required to wear the enchanted choker─capable of claiming her life should she attempt to flee─elicits little in the way of an outward response, though you suspect this comes as welcome news all the same.","Raubahn offers his thanks for your cooperation in hunting down the blasphemy and the various services performed for the sake of Ala Mhigo. Before departing, he asks that you share your account with the ambassador to Radz-at-Han, who will be eager to hear of your exploits.","The ambassador and his Ul'dahn counterpart are─as one might expect─delighted to hear firsthand accounts of your triumphs. Having played an instrumental role in helping his countrymen overcome this recent crisis and begin to come to terms with their bloody past, you take a moment's repose before embarking on your next adventure."],"objectives":["Speak with Raubahn.","Speak with Raubahn again.","Speak with the Ala Mhigan ambassador in Sundrop."],"dialogue":[{"name":"LIVERATIONARMY","text":"Thank goodness you're here─Commander Aldynn needs to see you right away! Follow me!"},{"name":"RAUBAHN","text":"Keep it contained until I arrive─but do not engage if you can help it. Understood?"},{"name":"ARENVALD","text":"That was M'naago."},{"name":"ARENVALD","text":"Her unit has found Fordola. Or rather, <span class=\"emphasis\">she</span> has found <span class=\"emphasis\">them</span>."},{"name":"RAUBAHN","text":"In fact, I have Fordola on the search party's linkpearl. She wants a word with you."},{"name":"FORDOLA","text":"(-Fordola-)This is urgent, so be quiet and listen."},{"name":"FORDOLA","text":"(-Fordola-)The blasphemy─my friend─is right in front of us."},{"name":"FORDOLA","text":"(-Fordola-)I tracked him down, and when he spotted me, he started heading towards Specula Imperatoris."},{"name":"FORDOLA","text":"(-Fordola-)Look, <span class=\"highlight\">Forename</span>─I need your help."},{"name":"FORDOLA","text":"(-Fordola-)Charlet's not─ He never wanted to hurt anyone. But this thing he's become is... I can't leave him like this."},{"name":"FORDOLA","text":"(-Fordola-)I've got to stop him, whatever it takes."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'm on my way."},{"name":"A1","text":"Wait till we get there─do not engage. Is that clear?"},{"name":"FORDOLA","text":"(-Fordola-)I owe you."},{"name":"MNAAGO","text":"(-M'naago-)This is M'naago─can you hear me? We've got the blasphemy surro─"},{"name":"MNAAGO","text":"(-M'naago-)Ugh... It's on the move!"},{"name":"MNAAGO","text":"(-M'naago-)Get ahead of it, but maintain distance! We need to─ Fordola! What are you doing!? Fordola! <span class=\"emphasis\">Fordola</span>!"},{"name":"RAUBAHN","text":"There's no time to waste. They need our help!"},{"name":"ARENVALD","text":"Rhalgr's beard...once she's got her mind set, there's no stopping her. She's convinced herself she's responsible for this mess─that she created the blasphemy single-handedly..."},{"name":"ARENVALD","text":"All I ask is that you see she makes it out of this alive. She's come so far...and I don't want to lose her."},{"name":"RAUBAHN","text":"Radiata and Ala Ghiri are not that far from Specula Imperatoris. If we let the blasphemy slip through our fingers...it doesn't bear thinking about."},{"name":"RAUBAHN","text":"And while Fordola is determined to slay it by her own hand, we can't allow her recklessness to put the lives of others in jeopardy."},{"name":"RAUBAHN","text":"The time has come for action. Are you ready?"},{"name":"MNAAGO","text":"Hold the line...for as long as you can!"},{"name":"MNAAGO","text":"Commander Aldynn and the Warrior of Light will be here any moment─stay strong!"},{"name":"RAUBAHN","text":"You've done well. Leave the rest to us."},{"name":"MNAAGO","text":"Yes, sir!"},{"name":"MNAAGO","text":"Get the injured to safety!"},{"name":"CHARLET","text":"Coward... Coward..."},{"name":"CHARLET","text":"Traitor...to them... To everyone..."},{"name":"CHARLET","text":"I wish there was another way."},{"name":"ANSFRID","text":"So do I, but fighting's the only thing I'm any good at. Makes me wonder how I ended up with such a clever brother."},{"name":"CHARLET","text":"Too clever for my own good, maybe. Just the thought of going into battle...about getting hurt. About having to hurt other people..."},{"name":"HRUDOLF","text":"He's a bleeding heart, our Charlet. Sooner befriend a fly than shoo it away─much less kill it!"},{"name":"CHARLET","text":"I c-could kill if I wanted! I could..."},{"name":"FORDOLA","text":"But you don't─and there's no shame in that. Leave the soldiering to us, Charlet. We'll show the Garleans what we're capable of. Get the power and respect we deserve. And then...things'll change. They will. You'll see."},{"name":"EMELIN","text":"We've found a place for ourselves, and you'll find yours soon enough."},{"name":"FORDOLA","text":"All right, that'll do. Everyone who's enlisting, meet back here tomorrow."},{"name":"CHARLET","text":"...In the end, what good did I do?"},{"name":"CHARLET","text":"They gave everything they had to give...while I hid, like a rat waiting for the storm to pass."},{"name":"CHARLET","text":"Coward... Coward... <span class=\"emphasis\">Coward</span>!"},{"name":"CHARLET","text":"Uwaaaaaah!"},{"name":"CHARLET","text":"Coward... Coward..."},{"name":"CHARLET","text":"Better dead... Better forgotten..."},{"name":"FORDOLA","text":"It's not your fault, Charlet. It's not... You didn't do anything wrong... And I..."},{"name":"FORDOLA","text":"I'm the coward! The traitor! The Butcher! I'll always be...the Butcher..."},{"name":"MNAAGO","text":"Don't you dare, Fordola!"},{"name":"MNAAGO","text":"You don't get to end it. You don't get to give up. I won't let you!"},{"name":"MNAAGO","text":"You have a lifetime to make amends and atone. To become something more than you were. But if you die here, you are <span class=\"emphasis\">everything</span> they say. Everything you believe."},{"name":"MNAAGO","text":"Is that what you want!?"},{"name":"ARENVALD","text":"(-???-)She's not going anywhere."},{"name":"FORDOLA","text":"Arenvald... Why are you here...?"},{"name":"ARENVALD","text":"There's nowhere else I'd rather be."},{"name":"ARENVALD","text":"I can't fight by your side, but I can still cheer you on."},{"name":"ARENVALD","text":"I've seen your past, Charlet. How you were left behind while your friends rushed into battle."},{"name":"ARENVALD","text":"It's bloody hard, isn't it? Wanting to do something so desperately, with every fiber of your being, knowing that you should─should be able to, you <span class=\"emphasis\">should</span>...but you can't."},{"name":"ARENVALD","text":"So you find another way to support them. Your way. You did that too, didn't you? You were there for them, even if it didn't feel like it, but you were, Charlet. You were."},{"name":"ARENVALD","text":"As a friend of mine once said..."},{"name":"ARENVALD","text":"...Not all heroes are forged in the fires of battle."},{"name":"RAUBAHN","text":"The history of Ala Mhigo is writ in blood."},{"name":"RAUBAHN","text":"While we cannot change the past, we can change the future."},{"name":"RAUBAHN","text":"And for that, we must all play our part. All of us."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Let us grant Charlet the peace he deserves."},{"name":"A1","text":"You too, Fordola."},{"name":"FORDOLA","text":"Ansfrid, Emelin...one day, we'll be together again. But not yet."},{"name":"FORDOLA","text":"You'd never hurt anyone, Charlet. That's not who you are."},{"name":"FORDOLA","text":"You'll be remembered as the kind soul you always were."},{"name":"FORDOLA","text":"I'm counting on you."},{"name":"FORDOLA","text":"Thank you. I mean it."},{"name":"LYLIE","text":"I've been looking everywhere for you!"},{"name":"FORDOLA","text":"Have you now?"},{"name":"RAUBAHN","text":"We've put down the last remaining beasts spawned by the blasphemy. 'Tis a pity we could do naught for those who'd turned, but that we were able to prevent further casualties is nothing short of a miracle."},{"name":"RAUBAHN","text":"It's astonishing, too, looking back at Charlet's case. Although his existence spurred others to transform, he never attacked any settlements or travelers. Even when he underwent the change in the middle of a crowded street, those who were present escaped with minor injuries at worst."},{"name":"RAUBAHN","text":"I think that deep down, his compassion is what kept the raging blasphemy at bay."},{"name":"ARENVALD","text":"The only time he emerged from hiding was to journey to the place where his brother died..."},{"name":"RAUBAHN","text":"Aye, it's clear he still retained some semblance of his former self. &lt;sigh&gt; Another victim of the Empire's terrible legacy, along with his friends and so many others."},{"name":"RAUBAHN","text":"But the Crania Lupi wasn't the creation of the imperials alone. Many of those youths sought a place with them because they were denied one with us."},{"name":"ARENVALD","text":"That's why the memorial ceremony is so important. It's our chance to face our past together─to give them in death what we couldn't in life. To not deny anyone a place in memory, even if it hurts or makes us feel ashamed."},{"name":"RAGANFRID","text":"You'll be attending, won't you?"},{"name":"FORDOLA","text":"I haven't been ordered to, so I suppose not."},{"name":"RAUBAHN","text":"In light of your leal service to Ala Mhigo...I intend to have the conditions by which you are bound eased. Providing I'm able to obtain approval, you will be granted a degree of freedom..."},{"name":"RAUBAHN","text":"At the very least, we should soon have no need for that choker."},{"name":"RAGANFRID","text":"There'll be no objections from me. You've done well."},{"name":"FORDOLA","text":"...Hmph."},{"name":"ARENVALD","text":"If I didn't know better, I'd think you were smiling!"},{"name":"ARENVALD","text":"Well, I for one couldn't be happier her efforts are being recognized. It gives me that much more motivation to continue my work with the Silver Griffins and bring the people of Ala Mhigo closer together."},{"name":"ARENVALD","text":"Got to do my best to keep up with a certain little lordling, aye?"},{"name":"RAUBAHN","text":"I think we've done enough for one day. Time we got some rest."},{"name":"RAUBAHN","text":"Allow me─as both the guardian of Ala Mhigo and as your sworn comrade─to express my thanks for coming to our aid in these desperate times."},{"name":"RAUBAHN","text":"No matter what manner of disaster may befall us, your presence alone is enough to keep the flame of hope burning bright."},{"name":"RAUBAHN","text":"Aye, even someone on the very precipice of despair such as Fordola can find salvation in your guiding light."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Laying it on a bit thick, aren't you?"},{"name":"A2","text":"Heavens forbid people would stop throwing themselves in harm's way at every opportunity..."},{"name":"A2","text":"You're something of an immortal flame yourself!"},{"name":"RAUBAHN","text":"Am I? Hmm... Both M'naago and Arenvald said much the same thing. I must be getting soft in my old age."},{"name":"RAUBAHN","text":"And put you healers out of a job? Not a chance! Heh... Though in all seriousness, we could all stand to take fewer risks."},{"name":"RAUBAHN","text":"Hah! Been waiting for a chance to use that one, haven't you? I like to think I can still pull my weight on and off the battlefield, but that might be a bit generous."},{"name":"RAUBAHN","text":"In any case, it's safe to say we've all benefited enormously from your sterling work here. We couldn't ask for a better healer─or a better friend."},{"name":"RAUBAHN","text":"Our ambassador in Radz-at-Han will be relieved to learn of our successes here. If you happen to cross paths, give him my regards, would you?"},{"name":"ULDAHMILITARYATTACHE","text":"We've heard you've been doing a lot of good work in Ala Mhigo <span class=\"emphasis\">and</span> in Ul'dah. Still, who better to tell the tale than the hero of the hour!"},{"name":"ALAMHIGOMILITARYATTACHE","text":"Greetings. How goes it in Ala Mhigo?"},{"name":"ALAMHIGOMILITARYATTACHE","text":"Eliminating blasphemies, helping organize a memorial ceremony... They've certainly kept you busy."},{"name":"ULDAHMILITARYATTACHE","text":"A fine example of going above and beyond the call of duty! I'll be sure to send word of your exploits to Ul'dah. Wait till the sultana hears about this!"},{"name":"ALAMHIGOMILITARYATTACHE","text":"Her Grace will not be the only one to welcome this news. On behalf of the Grand Company of Eorzea and our allies, allow me to express my most heartfelt gratitude."},{"name":"SYSTEM","text":"You can now dye the job-specific gear for level 90 healers."},{"name":"SYSTEM","text":"Job-specific gear will become available once you have fulfilled certain conditions within the main scenario quests for Endwalker."}],"reward":{"gil":2000,"items":[{"num":2,"id":33917},{"num":2,"id":33919},{"num":2,"id":33920}]},"reqs":{"jobs":[{"lvl":90,"id":187}],"quests":[69648]},"next":[70115]},"partials":[{"type":"npc","id":"1039402","obj":{"i":1039402,"n":"Blasphemy Hunter","l":2408,"q":5}},{"type":"npc","id":"1039411","obj":{"i":1039411,"n":"Ala Mhigan Delegate","l":3707,"q":2}},{"type":"item","id":"33917","obj":{"i":33917,"n":"Piety Materia IX","l":560,"c":20281,"t":58,"materia":{"tier":8,"value":12,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"item","id":"33919","obj":{"i":33919,"n":"Savage Aim Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Critical Hit","category":0}}},{"type":"item","id":"33920","obj":{"i":33920,"n":"Savage Might Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Determination","category":0}}},{"type":"quest","id":"69648","obj":{"i":69648,"n":"Trail of Skulls","g":185,"l":"The Lochs","s":241,"f":1}},{"type":"quest","id":"70115","obj":{"i":70115,"n":"Bitter Snow","g":189,"l":"Radz-at-Han","s":1}}]}