{"quest":{"name":"A Gift Undone","location":"Gridania","id":69640,"patch":6.0,"sort":121,"icon":101090,"unlocksFunction":1,"eventIcon":71341,"issuer":1038411,"target":1038411,"genre":184,"journal":["The tired eyes and slumped shoulders of the Keeper of the Entwined Serpents bespeaks weariness...","Gleipnir's assaults continue unabated, and it has only become more clear that Gridania's sole hope for salvation lies with Kan–E–Senna's efforts to enlist the aid of the great one. You have only a moment to ponder this situation before the Keeper of the Entwined Serpents receives word via linkshell that Gleipnir has emerged once again─this time near the Guardian Tree. Wood Wailers have engaged the beast, but they are surely overmatched. The Elder Seedseer has instructed you to join her at Sorrel Haven with the utmost haste.","You arrive at Sorrel Haven to find pieces of discarded armor and weaponry strewn about the ground. As you inspect the site, a vicious growl is the only warning you receive before being ambushed by feral beasts. You make quick work of the threat, but its presence bodes ill for the survival of the missing Wood Wailers. Kan–E–Senna is surely close, and so you must keep watch for more abominations until she arrives.","The Elder Seedseer concludes that the Wailers, facing Gleipnir and certain death, must have succumbed to despair and turned into beasts like others before them. With grim determination she declares that they must be put to rest. She suggests splitting into two groups to track the monsters. When the hunt is finished, you are to reunite with your companions at Everschade.","After a brief search you encounter the former Wood Wailers and bring an end to their suffering. With Gleipnir nowhere to be seen, no immediate threats to the Guardian Tree remain, and so you may wait at Everschade for Kan–E–Senna to return.","Kan–E–Senna attempts to commune with the great one, but is repelled by a wave of pure terror. The heart of the forest is seized by fear and cannot aid you until it is calmed. To your collective horror, Gleipnir then leaps into the clearing, snarling in defiance. As the beast lunges forward, the Elder Seedseer places herself in his way and receives the full brunt of the charge. She is knocked to the ground, and as you brace for battle, the Echo grants you a vision of a young Padjali boy and girl, the latter of which bears a striking resemblance to Kan–E. As the vision fades, you see Gleipnir standing over the unconscious Elder Seedseer...but rather than attack, it slinks back into the woods. While it seems Kan–E was not wounded, her attendant resolves to deliver her to Gridania as quickly as possible. He will carry her, and asks you to meet him at the Adders' Nest upon your return.","Kan–E–Senna has already regained consciousness, it seems, but is not yet ready to receive guests. The faithful attendant regrets that he could not protect her from Gleipnir, but an encouraging word from you serves to lift his spirits. He vows that together you will find a way to defeat the blasphemy once and for all, and asks that you return to the Adders' Nest when Kan–E–Senna has made a full recovery.<br><br>※The next role quest will be available from the Keeper of the Entwined Serpents upon reaching level 88 in any tank class."],"objectives":["Keep lookout at the designated location in Sorrel Haven.","Inspect the battered equipment.","Keep lookout at the designated locations and slay any beasts that appear.","Wait at the designated location.","Speak with the Keeper of the Entwined Serpents at the Adders' Nest."],"dialogue":[{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"The situation has worsened since last we spoke. Gleipnir grows bolder in his attacks, and the conjurers are spread thin in their efforts to attend the victims. Moreover, we are no closer to finding a means to counteract the blasphemy's poison."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"With no choice but to wait until death claims them, some are overwhelmed by hopelessness, becoming mad beasts that lash out at their former countrymen."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Such tragedies all too easily beget further tragedy, as bereaved loved ones are in turn overcome and share in the same horrid fate."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"The people speak of these incidents in hushed whispers, afraid that at any moment a monster might appear within their midst..."},{"name":"Q0","text":"What will you say?"},{"name":"A0","text":"We must slay Gleipnir without further delay."},{"name":"A0","text":"If we could find a cure for the blasphemy's poison..."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Indeed. Let us hope that the Elder Seedseer's efforts to enlist the aid of the elementals are successful, and that united we may at last cleanse the Twelveswood of this evil once and for all."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Urgent news, <span class=\"highlight\">Forename</span>! Gleipnir has ambushed a party of Wood Wailers!"},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"They are engaged with the blasphemy near the Guardian Tree, where the great one slumbers. This bodes ill..."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Has it divined the Elder Seedseer's intent? Is it attempting to prevent her from communing with the elementals? Bah! In any event, we cannot let Gleipnir harm the tree!"},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"The Elder Seedseer bade us rendezvous with her at Sorrel Haven. We leave at once!"},{"name":"SYSTEM","text":"Battered arms and armor are strewn across the ground, but there is no other trace of man or blasphemy..."},{"name":"KANESENNA","text":"I see... I think I know what happened here─though I pray that I am wrong..."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"There is no sign of the Wood Wailers save their arms and armor."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Seasoned warriors would never cast aside their equipment. But here it lies...and I see not a single body..."},{"name":"KANESENNA","text":"In the face of certain death, even the bravest among us can succumb to despair. Before the blasphemy's poison took them, they transformed..."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Gleipnir could not have gone far. He may be watching us even now."},{"name":"KANESENNA","text":"Be on your guard. The air is thick with corruption. If the Wood Wailers succumbed to a man, then we can expect a hard fight."},{"name":"KANESENNA","text":"Though I dread the thought of hurting our brave soldiers, we cannot allow the creatures they have become to roam free."},{"name":"KANESENNA","text":"Let us form two groups to more quickly track down and cull the beasts. Once we have finished, we shall regroup under the boughs of the Guardian Tree."},{"name":"KANESENNA","text":"We cannot suffer the presence of beasts so near to the great one, else any entreaties I make will surely be ignored. We must find the poor Wood Wailers and bring an end to their suffering."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Even Gridania's sworn spears are no match for Gleipnir. And so it falls to us to stem this dark tide before it washes over the Twelveswood."},{"name":"SYSTEM","text":"You find no trace of the Wailers-turned-beasts..."},{"name":"SYSTEM","text":"You have laid to rest the last of the turned Wailers. Reunite with your companions at Everschade."},{"name":"KANESENNA","text":"Our work is done, then."},{"name":"KANESENNA","text":"The loss of so many brave souls is tragic. But now they are at peace, and the Guardian Tree is safe. Let us take comfort in that."},{"name":"KANESENNA","text":"I but pray that the great one will hear my plea..."},{"name":"KANESENNA","text":"Ahh!"},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Elder Seedseer! Are you hurt?"},{"name":"KANESENNA","text":"The great one is filled with fear. An all-consuming fear unlike any I have ever felt."},{"name":"KANESENNA","text":"It spoke unto me, and its words were clarion. “Drive the evil away. Drive the evil away.”"},{"name":"KANESENNA","text":"It can think of naught else, and so we will not receive the aid we seek. Not until we can dispel the dread that claws at the forest's very heart."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"No... This was our last hope..."},{"name":"KANESENNA","text":"...We are not alone."},{"name":"KANESENNA","text":"There can be no mistake. This is the profane beast─the blasphemy that has mired the Twelveswood in despair. Gleipnir!"},{"name":"KANESENNA","text":"Stay back!"},{"name":"KANESENNA","text":"It makes for the Guardian Tree! We must stop it!"},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"The poison! You mustn't let it touch you!"},{"name":"KANESENNA","text":"Such...fearsome strength..."},{"name":"ESUMIYAN","text":"In accordance with our covenant, we Padjal have been blessed by the elementals. From the moment we are chosen, we are bound to act as mediators between man and nature."},{"name":"ESUMIYAN","text":"The most skilled among us are honored as Seedseers, and it is their duty to guide Gridania through times both poor and prosperous."},{"name":"ESUMIYAN","text":"I cannot say which of you will be found more worthy. In my estimation, you both have the potential to become Seedseers. Of that I become more certain by the day."},{"name":"KANESENNA","text":"(-Padjali Girl-)But I don't want to be a Seedseer. I never wanted to be a Padjal either. I never asked for any of this."},{"name":"KANESENNA","text":"(-Padjali Girl-)Why can't I live a normal life like everyone else? How come I don't get to grow old? Why was I cursed with these ugly horns?"},{"name":"PADJALBEAST","text":"(-Padjali Boy-)I like them. And maybe we didn't choose to be born this way, but I don't think it makes us that different from everyone else."},{"name":"PADJALBEAST","text":"(-Padjali Boy-)It's a rare gift─a blessing, even!─and if we can use it to help others, then we should. Don't give up on becoming a Seedseer, Kan–E. We'd all be worse for it!"},{"name":"KANESENNA","text":"A blessing...? I...I never thought of it that way. I suppose I just hated not having a choice. But maybe you're right..."},{"name":"PADJALBEAST","text":"Kan–E..."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"The Matron is merciful─the Elder Seedseer has fallen unconscious, but is otherwise unharmed. The blasphemy must not have touched her, for I do not see the telltale mark of poison..."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Still, I am no healer, and she should be looked after by those who are. I shall carry her back to Gridania."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"We must leave before Gleipnir returns. Await me at the Adders' Nest."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Allow me to thank you again for your assistance. The Elder Seedseer has been delivered into the care of E–Sumi–Yan, and by the grace of the elementals will she make a full recovery."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"In fact, she has already regained consciousness, but is not yet allowed to receive visitors. We can but wait for now."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"...Godsdammit, I was useless! I could do nothing while the Elder Seedseer faced Gleipnir alone."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"I was to be her shield! That I stand before you while she lies abed is proof of my failure..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"She wouldn't have wanted you to throw your life away."},{"name":"A1","text":"Kan–E–Senna lives still. And still she requires your protection."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"...You truly are the hero of whom the bards sing, aren't you? You've suffered terrible trials, yet still you stand tall and resolute."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Thank you for your counsel. How close I came to forgetting the lessons of my past..."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"I've spoken of it to few. Truth be told, it brings me shame to recall it."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"I fought at Carteneau. Not as a soldier of the Eorzean Alliance, but as a conscript in the Garlean Imperial Army."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Clad in armor and magitek, another drop in a sea of pitiless metal. You grow numb to the violence and the killing out of necessity. It becomes routine─work to earn your next meal."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"But then the moon shattered and the dragon emerged, and when the dust had settled, I was another body clinging to life amongst the fallen. I remember staring at the burning sun above, growing weaker, wondering if the heat or an Eorzean's blade would finish the job."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"But it wasn't death that came, but salvation. I was delivered from my well-earned fate by the Elder Seedseer. She deigned to save a man who once bared steel against her people."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Her kindness didn't end there. Once my wounds had healed, she welcomed me with open arms. Never did she regard me with distrust, nor did she ever make me feel obliged to repay my debt."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"She fought not to take life, but to safeguard it. Through our friendship I came to see the wisdom in that distinction, and pledged my remaining years to her service."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"'Twould have accomplished nothing to throw myself against Gleipnir in vain─and even if there was profit to be found in the sacrifice, she would not abide it. Your words served to remind me of this. We will defeat the blasphemy, aye, but we will do so without forsaking that which we hold dear. This I swear!"}],"reward":{"gil":1000},"reqs":{"jobs":[{"lvl":87,"id":186}],"quests":[69639]},"next":[69641]},"partials":[{"type":"npc","id":"1038411","obj":{"i":1038411,"n":"Keeper Of The Entwined Serpents","l":52,"q":6}},{"type":"quest","id":"69639","obj":{"i":69639,"n":"To Give Voice","g":184,"l":"Gridania","s":111,"f":1}},{"type":"quest","id":"69641","obj":{"i":69641,"n":"A Pact Proven","g":184,"l":"Gridania","s":131,"f":1}}]}