{"quest":{"name":"Hearts True","location":"Gridania","id":69642,"patch":6.0,"sort":141,"icon":101090,"unlocksFunction":1,"eventIcon":71341,"issuer":1038411,"target":1038411,"genre":184,"journal":["The Keeper of the Entwined Serpents is on the lookout for poms in the distance.","Mere moments after your arrival, the moogles come bearing only the finest saplings for use in the purification of the Twelveswood. Before you depart, however, Kan–E–Senna joins you at the Adders' Nest, looking as vibrant as ever, and offers to consecrate each sapling with a prayer as Jorin did long, long ago. She senses that the flow of aether has become warped near Greentear, and so it is decided that it will be your first destination.","Having cleansed the corruption, the soil is ready to receive the sapling. Kan–E–Senna awaits your signal to finish the ceremony.","The Elder Seedseer plants the sapling in the purified soil and offers a prayer to the elementals. The ceremony seems to have been successful, but your work is far from finished. Kan–E–Senna senses another taint near Silent Arbor, and bids you follow.","You cleanse the corruption and fell the corrupted sprite with ease. Kan–E–Senna may now proceed with the ceremony.","With a sapling and a prayer, the Elder Seedseer once again restores a weakened portion of the forest to good health. Although the next source of corruption is distant, Kan–E senses that it is somewhere in the vicinity of Hyrstmill.","The corruption in Hyrstmill is faint, and the ceremony is carried out quickly and without incident. Before you leave, however, you are approached by a man who is surprised to see the Elder Seedseer in his village, and distressed to learn her purpose in coming there. He protests her efforts to placate the elementals at the expense of her people, as he perceives it. As Kan–E–Senna attempts to calm him, she learns that they suffered tragedy in the days preceding Gleipnir's appearance, when the Creeping Death claimed the life of a poor woman─the wife of a man she soon realizes is Ea–Sura–Supin, her childhood friend who was stripped of his Padjal horns and cast out many years ago. The nature of Gleipnir's apparent hostility towards the elementals becomes clear: the blasphemy is driven by the lingering resentment of one who grew to believe he had been twice robbed of purpose by the guardians of the Twelveswood. More resolved than ever to see this crisis resolved, the Elder Seedseer makes for Everschade, where the great one slumbers, to beseech its aid.","Kan–E–Senna delivers an earnest plea to the great one, which takes hold of her body to communicate its reply. While it is grateful for your efforts to cleanse the Twelveswood of corruption, the elementals still fear the blasphemy's poison, and are reticent to lend their strength. The Keeper of the Entwined Serpents protests, and is joined a moment later by a chorus of other voices─people come from all across Gridania to lend their support to their leader. Moved by this display, the great one relents and offers up branches of the Guardian Tree, instructing those present to attach them to the oldest trees in the forest. By doing so will the great one be able to channel its power to every corner of the woods, purging once and for all the corruption from their home. The end of Gridania's great ordeal draws near, and the Elder Seedseer returns to the city to prepare.","Kan–E–Senna's attendant informs you that the people are hard at work bearing the Guardian Tree's many branches to the far reaches of the Twelveswood, in preparation for the final ceremony the Elder Seedseer must perform. The Keeper bids you make ready for an encounter with Gleipnir as well, for the beast will surely attempt to interfere with your plans, and when it does, you must be there to meet it.<br><br>※The next role quest will be available from the Keeper of the Entwined Serpents upon reaching level 90 in any tank class."],"objectives":["Investigate the corruption at Greentear and slay any monsters that appear.","Speak with Kan–E–Senna.","Investigate the corruption in Silent Arbor and slay any monsters that appear.","Speak with Kan–E–Senna.","Speak with Kan–E–Senna at Hyrstmill.","Speak with Kan–E–Senna in Everschade.","Speak with the Keeper of the Entwined Serpents."],"dialogue":[{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Gleipnir has not been seen since our last encounter. This brief respite may be our best chance to quell the great one's terror."},{"name":"PUKWAPIKA","text":"Make way for the saplings, kupo!"},{"name":"PUKWAPIKA","text":"We've had plenty of practice cultivating our gardens, so selecting the most robust ones was a simple matter!"},{"name":"PUKWAPIKA","text":"That was the hardest work, so you can help us with the easy part. If you see a spot of corruption, cleanse the taint and plant the sapling in its place, kupo."},{"name":"PUKWAPIKA","text":"Do it enough times and the great one is sure to understand that we're doing all we can to heal the forest, which ought to brighten its mood."},{"name":"PUKWAPIKA","text":"We'll see to the East Shroud. You should have no trouble taking care of the rest, kupo."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Your efforts are much appreciated! We will begin without further delay."},{"name":"KANESENNA","text":"I trust you will not object to my company? I daresay healing the forest is one task for which I am more qualified than most."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Elder Seedseer! Are you well enough to leave the city?"},{"name":"KANESENNA","text":"I should like to think I have been for some time. In any event, E–Sumi has finally grown tired of my objections and ceased his attempts to detain me further."},{"name":"KANESENNA","text":"Allow me to be the one to consecrate these saplings. 'Twould be an honor to offer words of thanks to the forest for its bounty."},{"name":"PUKWAPIKA","text":"Please do, kupo! A prayer from the Elder Seedseer herself will surely hasten their growth from tiny sapling to towering tree!"},{"name":"KANESENNA","text":"Such is my hope. As Jorin did before me, I shall approach the great one in friendship, that it might see through the veil of fear that blinds it and remember our covenant."},{"name":"KANESENNA","text":"Let us begin by cleansing all traces of corruption in the Central Shroud."},{"name":"KANESENNA","text":"To Greentear─I sense that the flow of aether has become warped there."},{"name":"PUKWAPIKA","text":"Impressive, kupo! Not even my keen eyes could spot corruption from such a distance."},{"name":"KANESENNA","text":"It is but one of many talents I owe to the elementals. Well then, shall we be on our way?"},{"name":"KANESENNA","text":"This blight upon the forest must be cleansed. When you have finished, I shall consecrate the sapling and soil with prayer."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"I shall keep watch for errant beasts."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"The taint has been cleansed, but it will only be a matter of time until it manifests once more."},{"name":"KANESENNA","text":"In gratitude for your boundless blessings do I offer this gift. May it nourish you as you nourish us..."},{"name":"KANESENNA","text":"At last, the earth is cleansed. There is a settlement not far from here. We should tell them of this sapling─bid them watch over and keep it safe from harm."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Of course, Elder Seedseer. I shall relay your words forthwith. It will give the people hope to know that they can aid in the restoration of the Twelveswood."},{"name":"KANESENNA","text":"Thank you. And now we must go..."},{"name":"KANESENNA","text":"...To Silent Arbor. There something foul impedes the flow of aether. Let us hurry."},{"name":"KANESENNA","text":"Pray see to the corruption that I may plant and bless the sapling."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Look─the flowers here have withered and died. I shudder to think what the forest would look like if this were allowed to spread."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"I trust the moogles are planting their saplings with suitable solemnity and reverence...but if they are not, let us hope their festivities do not draw Gleipnir's eye."},{"name":"KANESENNA","text":"The injury has begun to heal, and our next destination lies...to the north."},{"name":"KANESENNA","text":"Near...Hyrstmill, I believe. 'Tis faint, for we are far from the source. Nevertheless, I am certain it is there. Come."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"So close to the hamlet... Is nowhere safe? Where must the people seek shelter from this corruption?"},{"name":"KANESENNA","text":"'Tis fortunate that the corruption here is faint. A simple prayer should suffice to cleanse this soil, after which we may plant the sapling."},{"name":"KANESENNA","text":"I sense no other disruptions in the aetheric flow, which leads me to believe that the moogles have already seen to the remainder. Indeed, the Twelveswood sighs with a contentment I have not felt in a long while."},{"name":"KANESENNA","text":"But will it serve to placate the great one I cannot say. Not until we visit the Guardian Tree..."},{"name":"HYRSTMILLBOTANIST","text":"Excuse me, but...you're the Elder Seedseer, aren't you? What brings you all the way to our village?"},{"name":"KANESENNA","text":"Corruption that had upset the balance of aether, but that we have since cleansed with prayer and saplings. Thus has the Twelveswood reclaimed a measure of peace."},{"name":"HYRSTMILLBOTANIST","text":"You've...you've been planting trees?"},{"name":"KANESENNA","text":"We have. The elementals have suffered much of late, and with these offerings we endeavor to raise their spirits."},{"name":"HYRSTMILLBOTANIST","text":"E...Elder Seedseer, I've got to protest! What of your people's spirits─we who dread every step we must take out of doors!?"},{"name":"HYRSTMILLBOTANIST","text":"That terrible monster is still out there, preying upon innocent folk without rhyme or reason! And if it doesn't strike us dead where we stand, its poison will finish the job..."},{"name":"KANESENNA","text":"I know that you are afraid. That you and yours suffer still. However, 'tis under the auspices of the elementals that we may call the Twelveswood home, and they too cry out for deliverance. Even the great one quakes with fear for the blasphemy's continued existence."},{"name":"KANESENNA","text":"To ignore their plight is to invite greater tragedy for us all. Rest assured, however, that I have not forgotten the needs of the people."},{"name":"KANESENNA","text":"We bring comfort to the elementals and renew our sacred ties that we might enlist the aid of the great one in combating Gleipnir and the suffocating despair it spreads. And so I pray you continue to put your faith in our guardians─and in me."},{"name":"HYRSTMILLWAREHOUSEKEEPER","text":"Would that we could, Elder Seedseer, but we've been dealing with death and sickness since before Gleipnir's coming."},{"name":"HYRSTMILLWAREHOUSEKEEPER","text":"They say the Creeping Death's nothing to fear these days, but we know better. One of ours caught it not long ago. We gave her the cure─had plenty on hand─and for a while we thought it would be all right...but by the time we realized it hadn't done a damn thing, it was too late to call for a conjurer..."},{"name":"HYRSTMILLWAREHOUSEKEEPER","text":"It was a sad day for all of us when she passed, but for none more so than her poor husband, Supin..."},{"name":"HYRSTMILLBOTANIST","text":"He was beside himself with grief─and who could blame him? And then came Gleipnir to compound our woes..."},{"name":"KANESENNA","text":"Supin...? It cannot be... Do you speak of Ea–Sura–Supin?"},{"name":"HYRSTMILLBOTANIST","text":"Ea–Sura? No, no. Supin was an odd one, but no one'd mistake him for a Padjal. Supin wasn't even his real name─that'd be Elenjya. But his wife was fond of calling him Supin for some reason, and it caught on with the rest of us."},{"name":"KANESENNA","text":"I see... And what did Elenjya look like?"},{"name":"HYRSTMILLBOTANIST","text":"Well...I'd say he'd seen no more than thirty summers. Kept to himself, came and went with nary a word at times─though after he met his beloved, he became more of a fixture. Friendly, even."},{"name":"HYRSTMILLBOTANIST","text":"His wife was a sickly lass, but she had spirit. But spirit's not enough to beat the Creeping Death. Pity we couldn't do anything for her."},{"name":"KANESENNA","text":"He had finally made a new life for himself here... Thank you for recounting Elenjya's story. Sad though it was, it has helped me to better understand how much you all have suffered."},{"name":"KANESENNA","text":"I promise that you will have cause to celebrate soon. Until then, I implore you again to place your faith in the elementals, and in me. Together we shall overcome this crisis."},{"name":"KANESENNA","text":"Despite what he said, I am certain this Elenjya was Ea–Sura–Supin. To think that he was living so close by for all those years. Searching for new purpose...and finding true love..."},{"name":"KANESENNA","text":"Only to be robbed of that fulfillment too..."},{"name":"KANESENNA","text":"Were he still a Padjal, empowered by the elementals, could he have saved her? He would've dwelt on the question, night after sleepless night. I know I would have."},{"name":"KANESENNA","text":"Mayhap in the end he came to blame the elementals for his helplessness. For her death... And in despair was consumed."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Aye... The animosity would linger. Endure. And in vengeance would Gleipnir find its final purpose."},{"name":"KANESENNA","text":"...We have done all we can to show the great one the purity of our intent. Let us hope that we will be accepted as friends."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Suffering was Ea–Sura's constant companion. Nay, it is still. For his sake─and ours─we must deliver him peace."},{"name":"KANESENNA","text":"Our supplications cannot have escaped the great one's notice. May it be enough to receive an audience..."},{"name":"KANESENNA","text":"O great one, may I abide ever beneath your boughs, embraced by your compassion, grace, and wisdom. Bestill the fear within your heart, and know that I am your faithful servant..."},{"name":"ELEMENTALS","text":"(-The Great One-)All feeling..."},{"name":"ELEMENTALS","text":"(-The Great One-)Passing corruption... Refreshed... Renewed green... Flesh restored..."},{"name":"ELEMENTALS","text":"(-The Great One-)Child of child... Covenant honored... Friend... Friendship... Peace..."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"It worked─the great one speaks through the Elder Seedseer!"},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"We were right to follow Jorin's example..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"The corruption is but one aspect of a greater threat."},{"name":"A1","text":"We beseech your help to slay Gleipnir."},{"name":"ELEMENTALS","text":"(-The Great One-)Profanity's spawn... Despair's orphan... Sadness and anger... Sadness... Death's prayer... One and all..."},{"name":"ELEMENTALS","text":"(-The Great One-)Poison potent... Wounds unmending... Withering bark... No strength...to share..."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"After all we have done, you deny us? After all the Elder Seedseer has endured!? She has pledged herself to you─devoted her life to the Twelveswood!"},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"The people cried out for salvation, and she answered! The elementals cried out for deliverance, and she answered!"},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Only you can help us now. If you do not, then we are lost. <span class=\"emphasis\">She</span> is lost. Please, I beg you!"},{"name":"HYRSTMILLBOTANIST","text":"(-???-)We beg you!"},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"What...what are you doing here?"},{"name":"REFUGEEMAN3","text":"We've been dependin' on the Seedseers all our lives, blamin' them whenever somethin' goes wrong, without ever considerin' what we might do ourselves."},{"name":"HYRSTMILLBOTANIST","text":"Aye, but no longer. The Elder Seedseer has gone to incredible lengths for her people, and so her people have come to return the favor. If her plea alone is not convincing enough, then we will raise our voices in support!"},{"name":"WOODWAILER1","text":"We couldn't let them make the journey without protection. That, and we couldn't let them put us to shame. We too have come to stand with the Elder Seedseer and beseech the great one for aid!"},{"name":"REFUGEEWOMAN","text":"We all want the same thing, don't we? Peace restored to the forest...so please─share what you can, however little! Do not forsake us! Do not forsake her!"},{"name":"ELEMENTALS","text":"(-The Great One-)Kan–E... Covenant's child... Walks with man...with elemental... Keeper of ancient faith... Unbroken..."},{"name":"ELEMENTALS","text":"(-The Great One-)Cannot... Will not...break faith... To man...render up...flesh..."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Then you...agree to help us?"},{"name":"ELEMENTALS","text":"(-The Great One-)Flesh...branches... Take and join...to oldest elders... Renew bond... As one stir..."},{"name":"ELEMENTALS","text":"(-The Great One-)Raise up...to heavens...covenant's symbol... Our staff... All join... All bloom... All peace..."},{"name":"KANESENNA","text":"My...my duty weighed heavy on my heart. So heavy that at times I scarce remembered to breathe. For days and nights I worried that I would be found wanting."},{"name":"KANESENNA","text":"But by your faith and trust has the path forward been revealed to us. You came hither, united in purpose, and bared your hearts before the great one. I─nay, Gridania─is forever in your debt."},{"name":"KANESENNA","text":"May I rely on you all once more? I bid you take these branches to every corner of the Twelveswood and join them to the eldest trees, that we might finally win free of this despair."},{"name":"HYRSTMILLBOTANIST","text":"It shall be done, Elder Seedseer. We swear it!"},{"name":"KANESENNA","text":"Once the trees have been bound together in spirit, I shall carry out the great one's final instruction and cast its cleansing power all across the Twelveswood. Yet I must remind you, my friends, that Gleipnir still stalks the forest. It will not remain idle─it will attempt to stop us. Go with hope in your hearts, but do not lose sight of the danger."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"I admit, for a moment I thought it wouldn't work. But the Elder Seedseer moved not only the hearts of the people, but that of the forest itself."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Her final task appears to be a bit more complicated than the great one made it sound, and so she must scour the ancient texts before the time comes, and consult with the Seedseer Council to make sure all goes according to plan."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"It's just as well. We still need to wait until the others have joined the great one's branches to the many ancient trees scattered throughout the Twelveswood."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Then, of course, there is the matter of Gleipnir. He will not go peacefully as we work to hasten his demise."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"When he comes, we must be ready..."}],"reward":{"gil":1000,"items":[{"id":36057}]},"reqs":{"jobs":[{"lvl":89,"id":186}],"quests":[69641]},"next":[69643]},"partials":[{"type":"npc","id":"1038411","obj":{"i":1038411,"n":"Keeper Of The Entwined Serpents","l":52,"q":6}},{"type":"item","id":"36057","obj":{"i":36057,"n":"Coconut Cod Chowder","l":545,"c":24105,"t":46}},{"type":"quest","id":"69641","obj":{"i":69641,"n":"A Pact Proven","g":184,"l":"Gridania","s":131,"f":1}},{"type":"quest","id":"69643","obj":{"i":69643,"n":"A Path Unveiled","g":184,"l":"Gridania","s":151,"f":1}}]}