{"quest":{"name":"Trail of Skulls","location":"The Lochs","id":69648,"patch":6.0,"sort":241,"icon":101091,"unlocksFunction":1,"eventIcon":71341,"issuer":1039402,"target":1039410,"genre":185,"journal":["The blasphemy hunter may seem calm and collected from a distance, but you suspect something is amiss.","The blasphemy hunter reports that Fordola has given her keepers the slip and disappeared during a training exercise. Apparently, she has been acting out of sorts ever since meeting the mother and daughter you had previously encountered in Ala Gannha, so Raubahn has gone there in search of clues as to her whereabouts.","From speaking with the mother and child, you learn that Fordola was overwhelmed by a vision granted to her by the Echo during their meeting. It appears she witnessed the young girl's memories of a man she met moments before he transformed into the blasphemy you seek. Fordola was heard to utter the name “Charlet,” and though it is unfamiliar to your present company, Raganfrid may have useful information to share.","Raganfrid explains that Charlet is an Ala Mhigan with ties to the Empire, and his older brother Ansfrid served under Fordola in the Crania Lupi. Fortunately, Raganfrid happens to know their uncle, who he recently helped find work at the Sleeping Stones, and he should be able to assist you in your inquiries.","Charlet's uncle relates to you the tale of his two nephews, both of whom were raised as imperial citizens. They were also childhood friends of Fordola's, and while Ansfrid joined the army, Charlet's compassionate demeanor made him unsuited to a life in the military. After learning of the deaths of his brother and the other Skulls, he blamed himself for abandoning his friends and eventually disappeared. As the pieces of the puzzle come together, you ponder the bigger picture as you make your way back to Ala Gannha.","You share your findings with Arenvald, in particular the link between Charlet and Fordola. It occurs to Arenvald that she is likely attempting to put down the blasphemy that her friend has become out of the belief that she is responsible for its creation.","Back in the Ala Mhigan Quarter, Raubahn details his two-pronged approach to tracking down Charlet and Fordola. It stands to reason that if one is found, the other will not be far behind, and you decide it best to bide your time until fresh information comes to light.<br><br>※The next role quest will be available from the blasphemy hunter upon reaching level 90 in any healer class."],"objectives":["Speak with Raubahn in Ala Gannha.","Speak with Raganfrid.","Speak with Raubahn.","Speak with Raubahn again.","Speak with Raubahn in the Ala Mhigan Quarter."],"dialogue":[{"name":"LIVERATIONARMY","text":"Something terrible has happened!"},{"name":"LIVERATIONARMY","text":"It's Fordola─she's escaped!"},{"name":"LIVERATIONARMY","text":"She was accompanying a squadron out on a training exercise. One moment she was there, and the next, she was gone!"},{"name":"LIVERATIONARMY","text":"I didn't think much of it at the time, but she's been acting strangely ever since she went to meet that mother and child. You know, the ones who wanted to thank her for saving the girl's life."},{"name":"LIVERATIONARMY","text":"When I told Commander Aldynn about it, he went charging off to Ala Gannha to ask them if they have any idea where Fordola might be."},{"name":"LIVERATIONARMY","text":"I thought about going after him, but when I heard you were headed this way, I reckoned it'd be better to send you in my stead. Godsspeed, <span class=\"highlight\">Forename</span>!"},{"name":"LIVERATIONARMY","text":"Fordola's an enigma at the best of times. I'm sure she's got her reasons, but I haven't the slightest clue what they could be..."},{"name":"ARENVALD","text":"Gods be good─ What is she thinking?"},{"name":"CLARELL","text":"Have we done something wrong?"},{"name":"LYLIE","text":"I know you! You're friends with the brave lady, aren't you?"},{"name":"RAUBAHN","text":"<span class=\"highlight\">Forename</span>? I wasn't expecting to see you here. You've heard what's happened, then?"},{"name":"RAUBAHN","text":"Just as Fordola was beginning to earn our trust, she's given us the slip. As you may know, she wears a choker enchanted to prevent <span class=\"emphasis\">exactly</span> that."},{"name":"RAUBAHN","text":"If I were to give the order, she would be dead within moments─and she knows that. She took the risk anyway, so I have to believe she has a good reason."},{"name":"ARENVALD","text":"That's what we're looking into now."},{"name":"RAUBAHN","text":"We were hoping Clarell and young Lylie here could shed some light on the matter."},{"name":"ARENVALD","text":"We'd like to ask you about your conversation with Fordola, if we may."},{"name":"CLARELL","text":"(-Clarell-)Yes...of course."},{"name":"CLARELL","text":"(-Clarell-)I know she's the Butcher─or was, at least─but it didn't seem right to go without thanking her. That's why I requested the meeting. To express my gratitude...and my apologies."},{"name":"CLARELL","text":"(-Clarell-)She was quiet at first. Just stood there as we spoke, as if she weren't even listening. And then I mentioned the blasphemy, and she looked at Lylie...and all of a sudden clutched her own head and cried out in agony!"},{"name":"ARENVALD","text":"The Echo..."},{"name":"ARENVALD","text":"Can you remember what you were thinking about at the time?"},{"name":"LYLIE","text":"(-Lylie-)Umm... A man. The one I saw in the city."},{"name":"CLARELL","text":"(-Clarell-)What? Who? Did he have something to do with all those people panicking?"},{"name":"LYLIE","text":"(-Lylie-)I think he did... When I was waiting for you, I saw him. He was by himself..."},{"name":"LYLIE","text":"(-Lylie-)He looked poorly, so I asked if he was all right, and he said yes. He had a nice smile."},{"name":"LYLIE","text":"(-Lylie-)He got up and started walking. B-But then..."},{"name":"LYLIE","text":"(-Lylie-)He was shouting and screaming! I was so frightened, I didn't want to talk about it. Not even to Mum."},{"name":"CLARELL","text":"(-Clarell-)I wish you'd said something sooner! &lt;sigh&gt; I'm sorry, poppet. This is my fault for leaving you on your own..."},{"name":"RAUBAHN","text":"The man who turned into a blasphemy, I'd wager. The girl saw him─which means Fordola has now seen him, too."},{"name":"CLARELL","text":"(-Clarell-)There was one other thing. When Fordola was having her, ah...funny turn, she said something. Charlie? No... Charlet, I think. Yes, that was it."},{"name":"RAUBAHN","text":"Ring any bells?"},{"name":"ARENVALD","text":"Can't say it does. But if he has anything to do with the Skulls, the Silver Griffins should have some information on him."},{"name":"RAUBAHN","text":"We'd best have a word with Raganfrid, then."},{"name":"RAUBAHN","text":"You've both been very helpful. I'd also like to thank you for being so kind to Fordola. She may not have said it, but I'm sure it meant a lot to her."},{"name":"ARENVALD","text":"I've a couple more things I'd like to ask, so I'll catch up with you later."},{"name":"ARENVALD","text":"Whatever she's dealing with, she needn't face it alone. I wish I could've told her that...even though I know she probably wouldn't have listened."},{"name":"CLARELL","text":"Fordola may well be everything people say she is─or worse─but she did us a good turn that day. I'll never forget it."},{"name":"LYLIE","text":"Where did the brave lady go?"},{"name":"RAUBAHN","text":"I've a feeling this Charlet and Fordola are connected in some way."},{"name":"RAGANFRID","text":"Charlet, you say? Yes, that name came up during our recent investigations..."},{"name":"RAGANFRID","text":"As I recall, he served under the viceroy during the occupation, and his whereabouts is currently unknown. Had an older brother, named Ansfrid, one of the Crania Lupi."},{"name":"RAUBAHN","text":"Which would give him a connection to Fordola... Is there anyone who can tell us more about him?"},{"name":"RAGANFRID","text":"Yes, an uncle, who we recently helped find employment here in Ala Gannha. He's actually the one who asked us to look for Charlet."},{"name":"RAGANFRID","text":"You'll most likely find him working at the Sleeping Stones. As it happens, I was planning to bring him something to eat. I'll join you there shortly."},{"name":"RAGANFRID","text":"You might think a quarry is no place for a man of advanced years, and perhaps you'd be right. But hard times are the only times we've known, even before the occupation, and I doubt that'll change much within my lifetime."},{"name":"RAUBAHN","text":"Perhaps we should've asked what he looks like..."},{"name":"RAGANFRID","text":"Still looking, eh? That's him, over there."},{"name":"RAGANFRID","text":"I hope we're not interrupting."},{"name":"RELATIVESMAN04112","text":"No, no, of course not! It's good to see you, Raganfrid."},{"name":"RELATIVESMAN04112","text":"My word, the Bull of Ala Mhigo and the champion of the Alliance. What brings such esteemed guests to our humble, err...quarry?"},{"name":"RAUBAHN","text":"At ease, my good fellow. We merely wish to ask you about your nephew."},{"name":"RELATIVESMAN04112","text":"Charlet!? You've found him!?"},{"name":"RELATIVESMAN04112","text":"No luck yet, then."},{"name":"RAGANFRID","text":"Is there anything else you can tell us? More about his childhood, perhaps."},{"name":"RELATIVESMAN04112","text":"Wasn't much of one, I'm afraid... Poor boy's life was ruined long before he had any say in the matter. His parents and I swore allegiance to Garlemald to secure ourselves and our kin citizenship. For all the good it did us here, living amongst our countrymen who treated us as pariahs."},{"name":"RELATIVESMAN04112","text":"Took its toll on him and his brother, to be spat on as traitors by association. One thing led to another, and Ansfrid─together with most of his friends─joined the imperial army. That's how it started, you know. The Crania Lupi. Gaius's loyal little pups..."},{"name":"RAUBAHN","text":"Do you remember the names of these friends?"},{"name":"RELATIVESMAN04112","text":"Yes, they had quite the reputation growing up. There was Emelin, Hrudolf..."},{"name":"RELATIVESMAN04112","text":"...And the angry little girl who'd grow up to become the Butcher herself, Fordola."},{"name":"RAUBAHN","text":"Charlet was part of their group, too, yes? But from what we've heard, he chose not to become a soldier."},{"name":"RELATIVESMAN04112","text":"Wouldn't have lasted a day in training. He knew that better than anyone, of course. Not that it helped him to feel any less guilty for “turning his back” on the others."},{"name":"RELATIVESMAN04112","text":"He blamed himself for their deaths. For not stopping them when he had the chance. For not being strong enough to fight by their side. Maybe save them, maybe not─but he wasn't there, and he wished he had been. Then one day, he was gone."},{"name":"RELATIVESMAN04112","text":"Wherever he is, I hope he's safe and well."},{"name":"RAGANFRID","text":"So do we. Thank you─the information you've shared should prove useful. And for you, I've brought some food. Why don't you call it a day and go and enjoy it with your family?"},{"name":"RAGANFRID","text":"Let him have the peace for now. Back to Ala Gannha."},{"name":"RAGANFRID","text":"Once we know for certain what has become of Charlet, we'll have to tell his uncle."},{"name":"ARENVALD","text":"That little girl's worried about Fordola. As for the mother...well, it's complicated. Understandable, really."},{"name":"RAUBAHN","text":"...So not only was his brother a member of the Skulls, but Charlet himself was a childhood friend of Fordola's."},{"name":"RAGANFRID","text":"I'm told he refused the support of the Silver Griffins as well. He's been trying to make his own way for some time now."},{"name":"RAUBAHN","text":"His brother and his friends died at Specula Imperatoris─save for Fordola, and the gods only know how he felt about her after that."},{"name":"ARENVALD","text":"Or how Fordola felt about Charlet after seeing Lylie's memory of him transforming into a blasphemy. Brother of a man she killed and a childhood friend besides─she thinks she's responsible for this. That's why she ran. To kill the beast."},{"name":"RAGANFRID","text":"I never thought I'd say this, but...I'm worried about her."},{"name":"ARENVALD","text":"Fordola is a survivor and an outcast herself─exactly the sort of person the Silver Griffins are trying to support."},{"name":"ARENVALD","text":"You've seen for yourself the sacrifices she's willing to make. And if you can learn to feel sympathy for her, maybe others can, too."},{"name":"RAUBAHN","text":"I think we have enough information for the time being. Let's return to the city and plan our next move."},{"name":"ARENVALD","text":"As the saying goes, “history is written by the victor.” And I'll wager those who swore loyalty to Garlemald never thought they'd find themselves on the losing side. But they did, and they paid a price. Maybe not enough for some, but we've got to draw a line somewhere."},{"name":"RAGANFRID","text":"To some, Fordola is a monster worse than any blasphemy. But I've seen enough working with the Silver Griffins to realize it's never that simple. I want to believe there's hope for her─that there's hope for us all."},{"name":"RAUBAHN","text":"I've assigned a few of my soldiers to assist the Silver Griffins in investigating Charlet's background."},{"name":"RAUBAHN","text":"With luck, we will find him quickly. And then we can prepare for what must come after."},{"name":"RAUBAHN","text":"We're all but certain Charlet's the one who transformed into a blasphemy, and so there's naught to be done but put him out of his misery."},{"name":"RAUBAHN","text":"As for Fordola, I've put M'naago and her troops in charge of tracking her. Once they've found her, they have my permission to lend whatever support they deem necessary."},{"name":"RAUBAHN","text":"If it comes to it, I may ask you to join the search. Until such time, I ask that you take this opportunity to rest."},{"name":"LIVERATIONARMY","text":"It would be quite a blow for us to lose a warrior of Fordola's caliber. I hope we can find her before she does anything stupid."}],"reward":{"gil":1000,"items":[{"id":36056}]},"reqs":{"jobs":[{"lvl":89,"id":187}],"quests":[69647]},"next":[69649]},"partials":[{"type":"npc","id":"1039402","obj":{"i":1039402,"n":"Blasphemy Hunter","l":2408,"q":5}},{"type":"npc","id":"1039410","obj":{"i":1039410,"n":"Raubahn","l":2408,"q":5}},{"type":"item","id":"36056","obj":{"i":36056,"n":"Salted Thavnairian Cod","l":545,"c":24315,"t":46}},{"type":"quest","id":"69647","obj":{"i":69647,"n":"Laying the Past to Rest","g":185,"l":"The Lochs","s":231,"f":1}},{"type":"quest","id":"69649","obj":{"i":69649,"n":"The Gift of Mercy","g":185,"l":"The Lochs","s":251,"f":1}}]}