{"quest":{"name":"Old Heroes Never Die","location":"Limsa Lominsa","id":69652,"patch":6.0,"sort":321,"icon":101092,"unlocksFunction":1,"eventIcon":71341,"issuer":1040166,"target":1040166,"genre":186,"journal":["The secretariat appears to have been waiting for you.","The secretariat brings grave tidings: a Lominsan merchantman carrying a haul of O'Ghomoro crystals was taken by a Sahagin raiding party. In light of this, Merlwyb suspects that the Crushing Tide have a mind to summon the Lord of the Whorl once more. In hopes of forestalling such a calamitous turn of events, she means to meet with her Sahagin ally Noll and his compatriots at South Tidegate, and bids you join her there.","To your dismay, Noll confirms that Doww and the Crushing Tide do indeed seek to summon Leviathan in hopes of bolstering their ranks. With Limsa's forces already stretched thin defending the coast from the beasts born of the Final Days, you suggest that the Company of Heroes might be summoned back to help combat the threat. Unfortunately, Merlwyb explains that they disbanded before the Calamity, and their leader has not been seen since. All hope is not lost, however, as Merlwyb has a plan, and asks that you meet her at the Drowning Wench for a discussion with the Company's erstwhile first mate, Wheiskaet.","Joined by the other former members of the Company of Heroes, Wheiskaet listens patiently as Merlwyb makes her pitch. At first, he is reluctant to agree to the Admiral's proposal, but acquiesces when she states that you could lead them in their absent commander's stead. An arrangement is reached, and thus do you resolve to learn more of the storied veterans, that you might more effectively utilize their talents.","A brief conversation with Wheiskaet and the individual members of the Company allows you to take stock of their abilities and assign each to the task which you deem them best suited. Your general plan of attack decided upon, the Company takes their leave, and you and Merlwyb decide to return to Maelstrom Command to make preparations for the coming mission.","Back at Maelstrom Command, the secretariat furnishes you with a linkpearl, formally establishing a new linkshell with you and the Company of Heroes. Duly equipped, you resolve to stay at the ready until the time is right for you and those you command to enter the fray.<br><br>※The next role quest will be available from the Maelstrom secretariat upon reaching level 88 in any melee DPS class."],"objectives":["Speak with Merlwyb at South Tidegate.","Wait outside the Drowning Wench.","Speak with Wheiskaet.","Speak with the Maelstrom secretariat."],"dialogue":[{"name":"LIMSASECRETARY","text":"The Admiral left a message for you─and the news is not good."},{"name":"LIMSASECRETARY","text":"It appears that a Lominsan merchant ship was assailed by a Sahagin raiding party affiliated with the Crushing Tide."},{"name":"LIMSASECRETARY","text":"To further complicate matters, the vessel in question was carrying a shipment of crystals supplied to us by the kobolds of O'Ghomoro."},{"name":"LIMSASECRETARY","text":"The Admiral suspects that Doww means to use the plundered crystals to summon Leviathan. She has gone to meet with Noll, that we and our Sahagin allies might take swift action."},{"name":"LIMSASECRETARY","text":"She bids you join her immediately. Should the worst come to the worst, your experience in combating primals may prove essential."},{"name":"LIMSASECRETARY","text":"Pray make for South Tidegate and rendezvous with Admiral Bloefhiswyn at once."},{"name":"MERLWYB","text":"Thank you for coming, <span class=\"highlight\">Forename</span>."},{"name":"MERLWYB","text":"The situation is grim. The Crushing Tide plundered one of our trading ships and seized a goodly stash of O'Ghomoro crystals."},{"name":"NOLL","text":"Pshhh... Though their aim is clear, it appears they yet lack the quantity needed to perform the sssummoning."},{"name":"NOLL","text":"Doww longs for the days when every Sahagin cried out for Lord Leviathan's deliverance, and will ssstop at nothing to see them return."},{"name":"NOLL","text":"I cannot fathom what the Crushing Tide are thinking. What sssatisfaction, what happiness can be found in giving over their hearts and minds to a false god?"},{"name":"MERLWYB","text":"And so we must thwart their designs, lest the bonds we have forged be forever broken."},{"name":"MERLWYB","text":"By the same token, we cannot ignore the blasphemy, nor the transformations its presence may bring about."},{"name":"MERLWYB","text":"A battle on two fronts─neither of which we can commit to at the expense of the other..."},{"name":"MERLWYB","text":"As we sail into the eye of the storm, I would hear your counsel. What course of action would you propose?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Might we turn to the three great pirate powers for aid?"},{"name":"A1","text":"Let us recruit the Yellowjackets to the cause."},{"name":"A1","text":"Sounds like a job for the Company of Heroes..."},{"name":"MERLWYB","text":"As it happens, I've already enlisted the Executioners, the Krakens, and the Sirens to the cause. They've done much to bolster the Maelstrom's efforts to scour the seas for the blasphemy."},{"name":"MERLWYB","text":"So if we're to seek reinforcements, we will have to turn elsewhere. But to whom?"},{"name":"MERLWYB","text":"The Yellowjackets are spread thin keeping the coast safe from the Crushing Tide and their raids. We cannot afford to dilute their ranks any further."},{"name":"MERLWYB","text":"No, we must look to another party for assistance, I'm afraid. Any other ideas?"},{"name":"MERLWYB","text":"The Company of Heroes? Now that's a name I've not heard in some time."},{"name":"MERLWYB","text":"'Tis true that they answered the call many a time. Indeed, other than you and yours, there are arguably none better suited to the task of primal slaying."},{"name":"MERLWYB","text":"But they disbanded over five years ago...and neither hide nor hair has been seen of their commander since."},{"name":"MERLWYB","text":"Aye, absent their leader, I suspect they will be reluctant to join our cause..."},{"name":"MERLWYB","text":"...And yet, I can think of no better option. I'll contact Wheiskaet─their erstwhile commander's right-hand man─and see if he will not hear us out."},{"name":"MERLWYB","text":"I will ask him to meet us at the Drowning Wench. Let us hope he is receptive to our offer."},{"name":"MERLWYB","text":"Noll. Might I trust you and your brothers to continue the search for the blasphemy in the meantime?"},{"name":"NOLL","text":"Pshhh... But of course, Admiral. Should we dissscover anything, you will be the first to know."},{"name":"NOLL","text":"Pshhh... It is good to see you sssafe, friend."},{"name":"LIMSASECRETARY","text":"Admiral Bloefhiswyn awaits you at South Tidegate. Pray join her as soon as you are able."},{"name":"MERLWYB","text":"My apologies for the delay."},{"name":"Q7","text":"What will you say?"},{"name":"A7","text":"You are alone?"},{"name":"A7","text":"So your plea fell on deaf ears..."},{"name":"WHEISKAET","text":"(-???-)...And here I swore five years ago that I was done playing hero."},{"name":"LANDENEL","text":"Could someone explain what this is all about? Believe it or not, I am a respectable man with respectable obligations these days."},{"name":"UODHNUNH","text":"Take that polearrrm out of your arrrse, old friend. And stop pretending you're not still a murderous bastard at heart."},{"name":"LANDENEL","text":"Watch that wicked tongue of yours, U'odh, lest I skewer it and prove you right!"},{"name":"SHAMANILOHMANI","text":"Ahhh... Nothing like a reunion with dear companions over a bottle of the Wench's finest vintage! That <span class=\"emphasis\">is</span> why we're here, right?"},{"name":"BRAYFLOX","text":"Pshhh...! Shkohhh...! Long time no eyecatch, uplanders! Brayflox is tummy-tickled to see gobbiefriends again!"},{"name":"MERLWYB","text":"Thank you for assembling on such short notice."},{"name":"UODHNUNH","text":"Sparrre us the pleasantries, Admiral. Why are we here?"},{"name":"MERLWYB","text":"I make a simple request: reform the Company of Heroes, and lend Limsa Lominsa your strength."},{"name":"WHEISKAET","text":"Hmm. You've a reason, I'm sure. I would hear it."},{"name":"MERLWYB","text":"...So there you have it. A terrible fiend known as a blasphemy prowls our seas, transforming the Sahagin into ravening beasts."},{"name":"MERLWYB","text":"At the same time, the Sahagin themselves─specifically, a hostile faction calling themselves the Crushing Tide─had declared their intention to summon Leviathan anew. Should they succeed, we would be hard-pressed to deal with the primal while still dealing with the other threats."},{"name":"WHEISKAET","text":"A right pickle, indeed..."},{"name":"WHEISKAET","text":"...But the answer is no. The commander disbanded the Company, and as his first mate, it's not my place to gainsay his final order."},{"name":"LANDENEL","text":"Sod that, I say. Have you forgotten our company's creed!? “The duty of the strong is to protect the weak!”"},{"name":"LANDENEL","text":"Are the people now in danger not the same men and women we fought to defend years ago? The commander would not have turned his back on them, and neither should we!"},{"name":"WHEISKAET","text":"Bold words, Landenel. But do you truly believe that we can honor them as we are?"},{"name":"WHEISKAET","text":"Old mercenaries past their prime, lacking the commander whose wisdom and prowess saw them to glory once upon a time..."},{"name":"MERLWYB","text":"Ah, yes. Your commander..."},{"name":"MERLWYB","text":"What if <span class=\"highlight\">Forename</span> here were to lead you in his stead? Surely you would not question <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> abilities."},{"name":"SHAMANILOHMANI","text":"...An intriguing proposition. I, for one, would not be averse to serving under such a decorated hero."},{"name":"BRAYFLOX","text":"Pshhh...! Shkohhh...! Gobbiefriend has goodly head for fighty-think and goodly arms for thinky-fight!"},{"name":"WHEISKAET","text":"As ringing an endorsement as any. But I would hear it from the <span class=\"alternative-container\"><span class=\"alternative\">woman herself</span><span class=\"alternative\">man himself</span></span>. Do you believe you are capable of leading the Company of Heroes into battle?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"If you've the stones to follow me."},{"name":"A2","text":"Better battle than a banquet."},{"name":"WHEISKAET","text":"Now <span class=\"emphasis\">that's</span> the confidence I'd expect from my commander. Very well, then─consider us yours to lead."},{"name":"WHEISKAET","text":"Still nursing that grudge, are we? Aye, I suppose we still owe you a dozen favors. If you're willing to lead, we'll follow."},{"name":"WHEISKAET","text":"&lt;sigh&gt; Five years to the day. Truth be told, I was enjoying the more leisurely life. But when duty calls..."},{"name":"UODHNUNH","text":"Wait. Before we proceed, I must ask. Have we no way of reaching out to the commander?"},{"name":"LANDENEL","text":"Forgotten how he took his leave, have we? Up and vanishing so we could each find our own way, apart from him and the Company. I doubt we'll see him again─much as I wish we could."},{"name":"MERLWYB","text":"To the matter at hand─the missions you will undertake."},{"name":"MERLWYB","text":"First, you are to aid us tracking down the blasphemy that roams the sea. Second, you must prevent the Crushing Tide from summoning Leviathan at all costs."},{"name":"SHAMANILOHMANI","text":"Oh, is that all? And there I thought we might get our feet wet with a real challenge, heh. But in all seriousness, we should take care to decide who attends to what."},{"name":"WHEISKAET","text":"Sounds like a job for our acting commander. I'm sure <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>'ll give it all due consideration."},{"name":"MERLWYB","text":"I will reach out to Wheiskaet, the former first mate of the Company, and see if he is willing to meet us at the Drowning Wench."},{"name":"NOLL","text":"Pshhh... Worry not... My ssspawnbrothers and I will keep our eyes on the Crushing Tide in the meantime."},{"name":"WHEISKAET","text":"So if I understand this correctly, we're to bring down this so-called blasphemy. Of course, to do that, we'll need to find the damn thing first."},{"name":"WHEISKAET","text":"We've also got to prevent the Crushing Tide from summoning their god, Leviathan. A tall order in and of itself."},{"name":"WHEISKAET","text":"As acting commander, it's your job to decide who'll be doing what, based on the skills we each have to offer."},{"name":"WHEISKAET","text":"I'd recommend that you start by having a chat with each of us, that you might develop a sense of the strengths and weaknesses─mostly strengths, of course─of the storied veterans under your command."},{"name":"LANDENEL","text":"My specialty, you ask? Why, impaling fiends with this lance of mine, of course! The stronger the foe, the better─none are a match for me!"},{"name":"LANDENEL","text":"It would be folly to waste my talents on dealing with those slippery fishmen. Set me against that so-called blasphemy and I'll have the thing on a skewer before you can say “Merlwyb Bloefhiswyn”!"},{"name":"Q3","text":"Which task will you entrust to Landenel?"},{"name":"A3","text":"Pursuing and slaying the blasphemy."},{"name":"A3","text":"Preventing the primal summoning."},{"name":"WHEISKAET","text":"A wise choice. Send Landenel after the Sahagin, and he's like to <span class=\"emphasis\">help</span> them summon Leviathan to sate his bloodlust."},{"name":"WHEISKAET","text":"Have you lost your wits!? Send Landenel after the Sahagin, and he's like to <span class=\"emphasis\">help</span> them summon Leviathan to sate his bloodlust. Oh, gods help us all..."},{"name":"UODHNUNH","text":"I will speak plain: I am not some battle-crazed barrrbarian like Landenel. As nunh of the U, a tribe of peerless hunters, I conduct my affairs with discipline and prrrudence."},{"name":"UODHNUNH","text":"As such, I know better than any that to rrrush headlong into battle is rarely the best course of action. Far wiser it is to observe from afar and proceed with caution."},{"name":"Q4","text":"Which task will you entrust to U'odh Nunh?"},{"name":"A4","text":"Pursuing and slaying the blasphemy."},{"name":"A4","text":"Preventing the primal summoning."},{"name":"WHEISKAET","text":"It's true that the nunh can hold his own in a fight, but I cannot help but wonder if that's the best use of his─ Ah, but it is your choice to make."},{"name":"WHEISKAET","text":"Very astute, if I do say so myself. There are few better suited to the task of averting needless bloodshed than the famously circumspect U'odh Nunh."},{"name":"SHAMANILOHMANI","text":"As you well know, my vision is somewhat lacking these days. I can still defend myself when necessary, but I'd rather it not come to that."},{"name":"SHAMANILOHMANI","text":"My condition also leaves me rather unsuited to scouting and searching. It wasn't always the case, but such is life. On the other hand, I'd like to think I've gotten quite good at sounding out the intentions of others during negotiations and the like..."},{"name":"Q5","text":"What task will you entrust to Shamani Lohmani?"},{"name":"A5","text":"Pursuing and slaying the blasphemy."},{"name":"A5","text":"Preventing the primal summoning."},{"name":"WHEISKAET","text":"That is an...<span class=\"emphasis\">interesting</span> choice, Commander. Shamani will dutifully perform any task, to be sure, but I can't help but wonder if that's a suitable venue for his particular talents..."},{"name":"WHEISKAET","text":"You've a keen sense for these things, I see. More so than reconnaissance or battle, Shamani has a knack for working behind the scenes to see the Company's goals achieved."},{"name":"BRAYFLOX","text":"Pshhh...! Shkohhh...! Brayflox master remaker of Illuminati treasures! Offers much hand-lending with ingenuity!"},{"name":"BRAYFLOX","text":"Farseeing spyglass sees far into oceandeep! Crackfires go boom and blast beasts into bittypieces!"},{"name":"Q6","text":"What task will you entrust to Brayflox?"},{"name":"A6","text":"Pursuing and slaying the blasphemy."},{"name":"A6","text":"Preventing the primal summoning."},{"name":"WHEISKAET","text":"A logical choice, if I do say so myself. Brayflox's mastery of tools and armaments are sure to avail you in tracking and felling that beast."},{"name":"WHEISKAET","text":"The choice is yours to make, of course. But I cannot help but wonder if Brayflox's talents might be better applied to a less...<span class=\"emphasis\">delicate</span> task."},{"name":"WHEISKAET","text":"It would seem everyone has their assignments."},{"name":"WHEISKAET","text":"And I daresay the choices you've made are nigh impeccable. If I didn't know better, I'd think you'd been leading us for years."},{"name":"WHEISKAET","text":"I can't say I agree with all of your choices, but given that you've only just assumed command, I reckon you've done well enough."},{"name":"WHEISKAET","text":"That said...I must confess that your choices do not exactly inspire me with confidence. I hope that you can improve your grasp of the strengths and weaknesses of those under your command, lest these missions end in disaster."},{"name":"MERLWYB","text":"And with that, it is time we got to work. I have procured linkpearls for one and all, that we can keep each other apprised of our progress. You may pick them up from Maelstrom Command."},{"name":"WHEISKAET","text":"We'd best be off, then. Should we have need to regroup or reconsider our strategy, call for us."},{"name":"MERLWYB","text":"I will return to Command, and share these developments here with the secretariat and our Sahagin friends. Do join me if you can...<span class=\"emphasis\">Commander</span> <span class=\"highlight\">Forename</span>."},{"name":"MERLWYB","text":"Wheiskaet may be skeptical, but I for one have little doubt you will prove a worthy commander for the Company of Heroes."},{"name":"LANDENEL","text":"Have we finished with all the logistical nonsense? I'm eager for a taste of the old violence. You know the flavor."},{"name":"LANDENEL","text":"Just point me in the right direction, and my lance will do the rest!"},{"name":"UODHNUNH","text":"Please think twice before assigning me to the same grrroup as Landenel. I don't know what's worse─his tendency to wave his lance in people's faces, or all the shouting and blusterrring he engages in while doing so."},{"name":"UODHNUNH","text":"The Company of Heroes may have forrrmed anew, but that does not absolve me of my duties as nunh."},{"name":"SHAMANILOHMANI","text":"The others may gripe and groan, but not me. I'll be the first to admit that I missed the action!"},{"name":"SHAMANILOHMANI","text":"The Company may have reformed, but I can't very well let my precious vintage sour."},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh... Brayflox happily gives hand-lending to uplander!"},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh... Uplander can count on Brayflox. Expect much bangyboom and firedoom!"},{"name":"WHEISKAET","text":"Oh, it's you. I'd have thought your duties as acting commander would leave you little time for leisure."},{"name":"LIMSASECRETARY","text":"Ah, <span class=\"highlight\">Forename</span>. The Admiral has apprised me of the situation in full."},{"name":"MERLWYB","text":"Furnish <span class=\"highlight\">Forename</span> with a linkpearl, yes?"},{"name":"LIMSASECRETARY","text":"Of course, Admiral."},{"name":"LIMSASIGNALLER","text":"It would seem the Company is trying to reach us."},{"name":"LANDENEL","text":"(-Landenel-)Ho there, Commander! Just give the word, and I'll come running!"},{"name":"UODHNUNH","text":"(-U'odh Nunh-)Lowerrr your godsdamned voice, will you?"},{"name":"LANDENEL","text":"(-Landenel-)Watch your tongue, or I'll track you down and rip yours out!"},{"name":"LIMSASECRETARY","text":"They sound more like mortal enemies than old companions..."},{"name":"MERLWYB","text":"That's where <span class=\"highlight\">Forename</span> comes in. I'm trusting you to whip them back into shape. Make them a force to be reckoned with."},{"name":"MERLWYB","text":"I will have the secretariat contact you if there are any developments. I would convey them to the entire Company by linkpearl, but we cannot afford anyone taking reckless action..."},{"name":"MERLWYB","text":"In the meantime, I will reach out to Noll and see what he has gleaned about the Crushing Tide and their hideout."},{"name":"MERLWYB","text":"Let us hope for good tidings, Commander."},{"name":"MERLWYB","text":"I have just finished briefing the secretariat. She has something you should find useful."},{"name":"LIMSASIGNALLER","text":"Admiral Bloefhiswyn has tasked me with overseeing communications between you and the Company of Heroes. First, you'll be needing a linkpearl. Pray speak with the secretariat."}],"reward":{"gil":1000},"reqs":{"jobs":[{"lvl":87,"id":188}],"quests":[69651]},"next":[69653]},"partials":[{"type":"npc","id":"1040166","obj":{"i":1040166,"n":"Maelstrom Secretariat","l":28,"q":5}},{"type":"quest","id":"69651","obj":{"i":69651,"n":"The Crushing Tide","g":186,"l":"Limsa Lominsa","s":311,"f":1}},{"type":"quest","id":"69653","obj":{"i":69653,"n":"A Mother's Suffering","g":186,"l":"Limsa Lominsa","s":331,"f":1}}]}