{"quest":{"name":"Home No Longer","location":"The Doman Enclave","id":69658,"patch":6.0,"sort":421,"icon":101093,"unlocksFunction":1,"eventIcon":71341,"issuer":1038458,"target":1038457,"genre":187,"journal":["There is work to be done, yet Yugiri appears reluctant to take action.","Yugiri suspects Kisei hails from her home of Sui-no-Sato, and after asking the Kojin to inquire in her stead, she is all but certain. To learn more would require speaking with the people of Sui-no-Sato in person, a seemingly impossible task due to her exile imposed by the Ruby Princess. To that end, she asks you to lead the investigation while she accompanies you in disguise. She will meet you at Onokoro after donning a suitable guise.","You arrive to find Yugiri dressed in the selfsame garbs she wore when you first met in Eorzea. Before departing, she explains to you the reason for her banishment─that her people feared she might drag them into Doma's war with the Empire. Putting the past aside for now, you press onward and downward, into the deep beneath the waves of the Ruby Sea.","Kisei's banishment was likely decades ago, meaning only the elders among the village would remember what became of her. With that in mind, Yugiri asks you to walk about Sui-no-Sato, speak with her people, and see what you can learn.<br><br>※You must be accompanied by Yugiri to complete this task. Speak with her again should you become separated.","You approach an elderly man who, unfortunately, remembers little more than Kisei's name. Perhaps there is someone else in the village who remembers her.","You speak with an elderly woman, and although she only recalls that Kisei was a priestess of the village, she tells you there yet remains someone who may have the knowledge you seek─Yunagi, Kisei's old childhood friend, and Yugiri's mother.","Yunagi tells you of Kisei's past, and her gifts that drew the scrutiny of the Ruby Princess. Whether she does possess preternatural powers remains to be seen, but what is certain is her claims led to her exile. Before you part ways, Yunagi takes note of your disguised companion, and bids her deliver a message to one Yugiri Mistwalker: that her mother and father love her, and could not be more proud.","Satisfied with this newfound piece to the puzzle of Kisei's past─and still unsure how to feel about her conversation with her mother─Yugiri bids you join her at the enclave to speak with Hien.","While you were away, Hien has seen the former conscripts returned in the prisoner exchange to the Kienkan. With their safety assured, he has returned his attentions to the hunt for the blasphemy. It will not be long before he has need of your marksman's arm.<br><br>※The next role quest will be available from Yugiri upon reaching level 88 in any physical ranged DPS class."],"objectives":["Speak with Yugiri at Onokoro.","Speak with Yugiri and have her accompany you.","Speak with the elders of Sui-no-Sato while accompanied by Yugiri.","Speak with Yunagi while accompanied by Yugiri.","Speak with Yugiri at Onokoro.","Speak with Hien at the Doman Enclave."],"dialogue":[{"name":"YUGIRI","text":"Ah, <span class=\"highlight\">Forename</span>. If you are come to ask after the blasphemy, I have naught to share. As of yet, our shinobi have seen no sign of the beast."},{"name":"YUGIRI","text":"The returnees, however, are all accounted for, and Lord Hien has seen them safely to the Kienkan. As such, he is presently assisting with the hunt."},{"name":"YUGIRI","text":"For a blessing, there have been no reports of other villagers turning. And yet..."},{"name":"YUGIRI","text":"Before the situation takes a turn for the worse, there is a matter I feel warrants further investigation: Kisei."},{"name":"YUGIRI","text":"Though a villager of Isari, I suspect she may, in fact, hail from my home, Sui-no-Sato."},{"name":"YUGIRI","text":"Knowing they would be loath to answer my inquiries, I entreated the Kojin to contact Sui-no-Sato in my stead."},{"name":"YUGIRI","text":"To hear tell of it, Princess Kurenai has made great strides in establishing stronger ties with the outside world. At mention of Kisei, however, their cordial warmth turned strangely cold..."},{"name":"YUGIRI","text":"While contact with the outside world is kept to a minimum, they have ever maintained relations with the Blue of Tamamizu. At mention of Kisei, however, their cordial warmth turned strangely cold..."},{"name":"YUGIRI","text":"If we are to learn more, I fear we have little choice but to go and speak with the people of Sui-no-Sato ourselves. A simple visit for you, I imagine, but my banishment complicates matters."},{"name":"YUGIRI","text":"That said, it has been many years since I left home. Were I to disguise myself, I might well go unnoticed in your company. If you are willing to take the risk...?"},{"name":"YUGIRI","text":"Thank you. Let us make for Onokoro, then."},{"name":"YUGIRI","text":"The garments I wore when we first met. Sufficient, I think, to conceal my identity."},{"name":"YUGIRI","text":"&lt;sigh&gt; How many years has it been since last I saw home?"},{"name":"YUGIRI","text":"I am a shinobi of Doma, aye, but even as a child, I sought to ensure the safety and survival of Sui-no-Sato."},{"name":"YUGIRI","text":"I was quite bold in those days, if not a touch reckless, and together with the other children I often ventured beyond the borders of home."},{"name":"YUGIRI","text":"We yearned for adventure, and so one day we sought to behold the wonders of Doma... Imagine our horror to discover a city of ruin and ash, imperial soldiers marching through the streets. We fled at the sight, but in my haste, I lost my way in the bamboo groves."},{"name":"YUGIRI","text":"It was there I first met a young boy named Shun, a sweaty mess as he swung his wooden sword with reckless abandon. Training to fulfill his duty as a samurai, he said."},{"name":"YUGIRI","text":"Having seen the destruction of which the Empire was capable, I too felt the need to protect my home. I joined him in his exercises, and every day my resolve to protect those I love grew."},{"name":"YUGIRI","text":"Sadly, my elders refused to listen. They were content to remain hidden beneath the waves, and hopefully, the Empire's notice. With a heavy heart, I left in search of the strength I believed we sorely needed. And I found it as a shinobi."},{"name":"YUGIRI","text":"But the people feared war and conflict would follow on my heels should I return... I do not begrudge them their decision, nor do I regret mine own."},{"name":"YUGIRI","text":"Part of me is overjoyed at the thought of seeing home again. Openly defying the wishes of the Ruby Princess, however, would bode ill for my family. They have suffered enough for my transgressions."},{"name":"YUGIRI","text":"That is why, for their sake, I would remain naught but a faceless shinobi at your employ."},{"name":"YUGIRI","text":"Thank you. With that in mind, let us make for Sui-no-Sato."},{"name":"SUIELDERA","text":"Hmmm... It's not often that we have visitors from the surface."},{"name":"SUIELDERB","text":"Be at ease, friend. You will find no trouble here."},{"name":"YUGIRI","text":"All these years, yet naught appears to have changed since the day I left..."},{"name":"YUGIRI","text":"But now is not the time to reminisce. We have work to do."},{"name":"YUGIRI","text":"Kisei's departure from Sui-no-Sato was likely decades ago. Perhaps the village elders will know why she chose to leave."},{"name":"SYSTEM","text":"Yugiri is now accompanying you. Keep her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Yugiri behind by entering a different area, or by speaking with her and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Yugiri accompany you again, return and speak with her at the original location."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Speak with Yugiri."},{"name":"A1","text":"Part ways with Yugiri."},{"name":"A1","text":"Nothing."},{"name":"YUGIRI","text":"&lt;sigh&gt; So many fond memories..."},{"name":"YUGIRI","text":"Ahem. Pay no mind to my idle musings. Lead on."},{"name":"SYSTEM","text":"Are you sure you wish to part ways with Yugiri?"},{"name":"YUGIRI","text":"Other matters demand your attention? So be it. But remember─time is of the essence. I will await your return."},{"name":"YUGIRI","text":"You are ready to proceed? Good. Let us resume our search for the village elders, then."},{"name":"SYSTEM","text":"You must be accompanied by Yugiri and have her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"Yugiri has yet to arrive. Be sure she is at your side before attempting to continue."},{"name":"SUIELDERA","text":"Kisei? Hm. The name sounds familiar, and yet..."},{"name":"SUIELDERA","text":"Apologies, friend. My memory is not what it once was."},{"name":"YUGIRI","text":"Let us seek out another."},{"name":"SUIELDERA","text":"I pray you find what you seek."},{"name":"SUIELDERB","text":"My, it has been quite some time since last I heard that name. She was a priestess of the village, banished after drawing the ire of the former Ruby Princess."},{"name":"SUIELDERB","text":"What has become of her after all these years, I wonder?"},{"name":"YUGIRI","text":"Please, is there anything else you can tell us?"},{"name":"SUIELDERB","text":"Hmm... Yunagi was quite close with her, if memory serves. Perhaps you should seek her out. "},{"name":"YUGIRI","text":"Mother. I had hoped to avoid my parents, but if there is no other way... <span class=\"highlight\">Forename</span>, might I ask you to take the lead?"},{"name":"SUIELDERB","text":"Yunagi and Kisei were good friends, once upon a time. If anyone can tell you more of Kisei, it would be her."},{"name":"IHANAMI","text":"I say, are you not the adventurer who aided Yugiri in Doma's liberation?"},{"name":"YUNAGI","text":"I know you. Yes, the young <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who saved our daughter's life when she fought the crown prince..."},{"name":"YUNAGI","text":"'Tis good to see you again. To what do we owe the honor of your visit?"},{"name":"YUNAGI","text":"Kisei... Yes, we were close. But that was a long, long time ago."},{"name":"YUNAGI","text":"Still, if I can be of assistance to the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> to whom we owe so much, I will share all I know."},{"name":"YUNAGI","text":"Kisei was born to a family of priests, and even at an early age, she was possessed of extraordinary abilities. Much was expected of her...but everything changed the day she said she could speak with the dead."},{"name":"YUNAGI","text":"No one believed her, at first. But she continued to insist she could, and strove to prove it by demonstrating knowledge well beyond her years. Knowledge of events to which she could not have been privy."},{"name":"YUNAGI","text":"Word of her talent eventually reached the Ruby Princess, and she was summoned to Shisui of the Violet Tides for a private audience."},{"name":"YUNAGI","text":"No one knows what Kisei said to her in the palace. Only that the princess was incandescent with rage, and ordered her exile forthwith."},{"name":"YUNAGI","text":"Some believe Kisei revealed a terrible secret of the royal house, or perhaps spoke a blatant falsehood that proved her a liar."},{"name":"YUNAGI","text":"Indeed, the knowledge she claimed to divine from the dead was not always truthful. But who is to say the dead would know the truth, or not seek to deceive? Thus could we never be certain if it was simply a fantasy or a power divine."},{"name":"YUNAGI","text":"The one thing that is certain is that no small number of people found comfort in her words."},{"name":"YUNAGI","text":"Would that I could tell you more, but sadly I have not seen or spoken with Kisei since her banishment."},{"name":"YUNAGI","text":"Forgive me, but...have we met your companion before? She looks familiar."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I believe this is the first time our humble shinobi has visited Sui-no-Sato."},{"name":"A2","text":"I imagine she does, considering she's Y─"},{"name":"YUNAGI","text":"Ah, is that so? For the briefest of moments, you reminded me of someone quite dear to my heart."},{"name":"YUGIRI","text":"Y-You could not possibly know me. I am but a lowly shinobi of Doma. Nothing more."},{"name":"YUNAGI","text":"Being a shinobi, I presume you have heard tales of Yugiri Mistwalker. Should you chance to meet her, may I ask you to deliver her a message?"},{"name":"YUNAGI","text":"Tell her that her mother and father love her. That we could not be more proud of her."},{"name":"YUGIRI","text":"I... I will."},{"name":"YUGIRI","text":"I have no doubt she feels the same, and not a day goes by without you in her thoughts."},{"name":"YUGIRI","text":"Ahem. I believe we have heard enough. Shall we return to Onokoro?"},{"name":"YUGIRI","text":"My apologies for placing you in so peculiar a situation."},{"name":"YUGIRI","text":"Though I must confess, it did my heart good to see Mother and Father well."},{"name":"YUGIRI","text":"All the more reason I must do all I can to keep the peace. As a shinobi of Doma─no, as a member of the Eastern alliance."},{"name":"YUGIRI","text":"Mayhap there will come a day when Sui-no-Sato opens to the world. A day when Yugiri Mistwalker can be reunited with her mother and father."},{"name":"YUGIRI","text":"Would that Lord Hien could be afforded the same opportunity."},{"name":"YUGIRI","text":"But Lord Kaien and Lady Mina have long since passed. Two of too many lives lost in the imperial occupation."},{"name":"YUGIRI","text":"I cannot imagine he would ever succumb to despair, but make no mistake─Lord Hien knows the pain of his people all too well. I can see it in his eyes, and if I may be honest, it troubles me at times."},{"name":"YUGIRI","text":"...But perhaps I have said too much."},{"name":"YUGIRI","text":"Come. We mustn't keep him waiting."},{"name":"YUGIRI","text":"For a blessing, Onokoro appears to be untouched by the recent chaos. For now, at least."},{"name":"HIEN","text":"Welcome back. I trust your journey proved an enlightening one?"},{"name":"HIEN","text":"So she does, in fact, hail from Sui-no-Sato. And you say she has possessed these divine gifts since childhood?"},{"name":"HIEN","text":"Genuine or no, the people believe her, and more flock to her side with every passing day."},{"name":"HIEN","text":"But the returnees are safe at the Kienkan, its defenses bolstered."},{"name":"HIEN","text":"As for the blasphemy, I have spoken with our Confederate allies, among others, and together we will establish a network of contacts across the length and breadth of Doma to take up the search in earnest. Mark my words─we <span class=\"emphasis\">will</span> find it."}],"reward":{"gil":1000},"reqs":{"jobs":[{"lvl":87,"id":189}],"quests":[69657]},"next":[69659]},"partials":[{"type":"npc","id":"1038458","obj":{"i":1038458,"n":"Yugiri","l":2813,"q":5}},{"type":"npc","id":"1038457","obj":{"i":1038457,"n":"Hien","l":2813,"q":5}},{"type":"quest","id":"69657","obj":{"i":69657,"n":"When the Kami Answer","g":187,"l":"The Doman Enclave","s":411,"f":1}},{"type":"quest","id":"69659","obj":{"i":69659,"n":"The Devoted Daughter","g":187,"l":"The Doman Enclave","s":431,"f":1}}]}