{"quest":{"name":"The Crushing Tide","location":"Limsa Lominsa","id":69651,"patch":6.0,"sort":311,"icon":101092,"unlocksFunction":1,"eventIcon":71341,"issuer":1040166,"target":1040174,"genre":186,"journal":["The secretariat has recent developments to share.","While Limsa Lominsa's Sahagin allies assist in the hunt for the blasphemy, Merlwyb wishes to attempt negotiations with the Crushing Tide, in hopes of easing tensions and forestalling any additional transformations. To that end, a parley has been arranged with Doww─leader of the hostile faction─at the Sapsa Spawning Grounds, whereto you will accompany the Admiral.","You join Merlwyb near the spawning grounds, but Doww is nowhere to be found. With some trepidation, the two of you decide to seek answers from the other members of Crushing Tide in the vicinity.<br><br>※You must be accompanied by Merlwyb to complete this task. Speak with her again should you become separated.","Together with the Admiral, you speak to a few of the hostile Sahagin, one of whom grudgingly reveals Speaker Doww's current whereabouts to you. Resolving to take caution not to fan the flames, you go to seek him out.","You succeed in tracking down Doww, who receives the Admiral's words with as much disdain as was to be expected. Nevertheless, he acquiesces to a parley in South Tidegate, if only as a show of strength for his followers. You can only hope that the Crushing Tide's leader will be more receptive when next you speak.","Back at South Tidegate, your parley with Speaker Doww proves an unmitigated disaster when he dismisses the Admiral's offer out of hand, and his followers─overcome by their anger and despair─transform into beasts before your eyes. Lofty aspirations of peace will have to wait until you have dealt with the immediate threat.","You swiftly dispatch the beast before it can sow untold chaos. Your concern turns to Noll, who you hope has survived the battle unscathed.","Noll is visibly shaken by the horrors he has just witnessed, but otherwise no worse for the wear. He encourages you to check on the Admiral, who was fighting off a beast of her own.","The immediate threat having been dealt with, you reconvene with your companions. Noll is deeply disturbed─not merely by the sight of his brothers transforming before his eyes, but by Speaker Doww's fanatical delusion that it is a blessing bestowed upon them by Leviathan himself. Fearing disaster should greater numbers of the Crushing Tide turn, Merlwyb resolves to redouble her efforts in dispatching the blasphemy with all speed, and bids you join her back at Maelstrom Command.","Back in Limsa, Merlwyb expresses concern that reinforcements may be needed in dealing with the twofold threat of the blasphemy and the Crushing Tide. She bids you remain close by until such time as further action can be taken.<br><br>※The next role quest will be available from the Maelstrom secretariat upon reaching level 87 in any melee DPS class."],"objectives":["Speak with Merlwyb at South Tidegate and have her accompany you.","Speak with the Crushing Tide Sahagin while Merlwyb is accompanying you.","Speak with Doww while Merlwyb is accompanying you.","Speak with Merlwyb.","Defeat the beast.","Speak with Noll.","Speak with Merlwyb.","Speak with Merlwyb at Maelstrom Command."],"dialogue":[{"name":"LIMSASECRETARY","text":"Your timing could not be better. The Admiral has just this moment returned from meeting with the Sahagin. I shall inform her of your arrival."},{"name":"MERLWYB","text":"Ah, <span class=\"highlight\">Forename</span>. I'm glad you're here. We have decided on our next course of action."},{"name":"MERLWYB","text":"As you know, we face two distinct, but interconnected, challenges. The transformations occurring among the Sahagin may be one, but the blasphemy itself is the root of the problem."},{"name":"MERLWYB","text":"Thus far, those who succumbed to the change have all been affiliated with the Crushing Tide, who continue to resist our diplomatic efforts. Were we to put a stop to the phenomenon, as well as address their grievances, we may yet have a chance at peace."},{"name":"MERLWYB","text":"To that end, I would propose a double-pronged approach."},{"name":"MERLWYB","text":"On one front, we shall work in tandem with our Sahagin allies to redouble our patrols. Should the blasphemy surface, we will share this knowledge and move immediately to dispatch the threat."},{"name":"MERLWYB","text":"At the same time, we will pursue a dialogue with the Crushing Tide. We need to bring them back to the negotiating table, and then see what can be done to convince them to stand down."},{"name":"MERLWYB","text":"A key point will no doubt be the lingering issue of securing land for their spawning grounds. 'Tis a discussion I intend to approach with an open mind."},{"name":"MERLWYB","text":"'Twill be no easy task, but we succeeded with the kobolds, and I have faith that we will succeed with the Sahagin as well, so long as we parley in good faith."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I can only hope the Crushing Tide share that sentiment..."},{"name":"A1","text":"I doubt they will listen."},{"name":"MERLWYB","text":"You're wise to temper your expectations, but I would not abandon hope ere we try. At any rate, Noll has sent word that one Doww─a priest who styles himself the leader of the Crushing Tide─has grudgingly agreed to hear us out."},{"name":"MERLWYB","text":"I will parley with him face-to-face at the Sapsa Spawning Grounds, and would have you at my side. If you do not object, that is."},{"name":"MERLWYB","text":"Excellent. In that case, pray join me at South Tidegate when you are ready. From there, we will go together."},{"name":"MERLWYB","text":"All prepared, are you?"},{"name":"MERLWYB","text":"Doww is not known for his patience. We must take care not to incur his ire."},{"name":"MERLWYB","text":"I was told he would be at the spawning grounds upon our arrival, but it appears he has been delayed."},{"name":"MERLWYB","text":"Let us speak with the Sahagin here. Mayhap one of them will be able to shed light on what may be keeping him."},{"name":"MERLWYB","text":"One more thing─I come here as a representative of Limsa Lominsa on a diplomatic mission. Should the talks deteriorate and things come to blows, I cannot be seen to bloody my hands. I trust that you understand."},{"name":"MERLWYB","text":"And with that, let us be off."},{"name":"SYSTEM","text":"Merlwyb is now accompanying you. Keep her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Merlwyb behind by entering a different area, or by speaking with her and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Merlwyb accompany you again, return and speak with her at the original location."},{"name":"Q9","text":"What will you do?"},{"name":"A9","text":"Speak with Merlwyb."},{"name":"A9","text":"Part ways with Merlwyb."},{"name":"A9","text":"Nothing."},{"name":"MERLWYB","text":"First, let us see if any of the Sahagin here possess any knowledge of Doww's whereabouts."},{"name":"MERLWYB","text":"Are you sure you wish to part ways with Merlwyb?"},{"name":"MERLWYB","text":"Far be it from me to keep you from more pressing duties. When you are ready to proceed, let us reconvene at South Tidegate."},{"name":"MERLWYB","text":"Ready to resume our mission? Very well. Let us see if any of the Sahagin here can tell us aught of Doww's whereabouts."},{"name":"ENEMYSAHAGINA04115","text":"Pshhh...! What business have you here, shhhorewalker!?"},{"name":"ENEMYSAHAGINB04115","text":"Pshhh...! Since when do shhhorewalkers so brazenly traipse about our ssspawning grounds!?"},{"name":"DOWW","text":"Pshhh...! You have some gall to show your face here, shhhorewalker. This is our domain. Tread carefully or pay the price."},{"name":"SYSTEM","text":"You must be accompanied by Merlwyb and have her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"Merlwyb has yet to arrive. Be sure she is at your side before attempting to continue."},{"name":"LIMSASECRETARY","text":"We welcome your aid in our negotiations with the Crushing Tide. Admiral Bloefhiswyn awaits you at South Tidegate."},{"name":"ENEMYSAHAGINA04115","text":"Pssshhh... Why do you tressspasss in our domain, vile shhhorewalkers!?"},{"name":"MERLWYB","text":"We mean you no harm. We come only for a peaceful parley with your leader, Master Doww. Where might we find him?"},{"name":"ENEMYSAHAGINA04115","text":"Pssshhh! We desssire no <span class=\"emphasis\">parley</span> with the shhhorewalkers who would sssteal our home!"},{"name":"ENEMYSAHAGINA04115","text":"Were it not for your insssatiable selfishness, we Sssahagin would grow and flourishhh!"},{"name":"MERLWYB","text":"Your grievances are justified. That is why I would speak with Master Doww, and work toward a peaceful solution."},{"name":"ENEMYSAHAGINA04115","text":"Pssshhh! Empty words from the thieving shhhorewalker! But so be it─soon you shhhall learn the futility of your efforts."},{"name":"ENEMYSAHAGINA04115","text":"Speaker Doww is currently overseeing security at the ssspawning grounds. You will find him by the entrance─though mark my wordsss, you will wishhh you hadn't."},{"name":"MERLWYB","text":"We shall see. I thank you for your aid."},{"name":"ENEMYSAHAGINB04115","text":"Pssshhh... What is this!? Sssince when are filthy shhhorewalkers free to intrude upon our sacred ssspawning grounds!?"},{"name":"MERLWYB","text":"Pray forgive our intrusion."},{"name":"MERLWYB","text":"We seek an audience with Speaker Doww. Where might we find him?"},{"name":"ENEMYSAHAGINB04115","text":"You will do no sssuch thing, shhhorewalker! We have not forgotten what you did to Lord Leviathan. Begone!"},{"name":"MERLWYB","text":"We won't get much out of this one. Let's try elsewhere."},{"name":"STHALRHET","text":"We've managed to bring a fair share of the drowned back to their senses. Sadly, the Sahagins' distrust of us remains deep-seated. If you mean to go onward, be wary─you will find more foes than friends."},{"name":"DOWW","text":"Pssshhh... Shhhorewalkers in our ssspawning grounds? To what do I owe the dissspleasure?"},{"name":"MERLWYB","text":"Speaker Doww, I presume. Our apologies for entering into your home unannounced."},{"name":"MERLWYB","text":"I am Merlwyb Bloefhiswyn, Chief Admiral of Limsa Lominsa, and this is <span class=\"highlight\">Forename Surname</span>."},{"name":"MERLWYB","text":"We come seeking a parley, that we might strive for peace between our peoples."},{"name":"DOWW","text":"Parley, you sssay...?"},{"name":"MERLWYB","text":"Prolonging this conflict any further will lead only to needless suffering."},{"name":"MERLWYB","text":"The menace both our peoples face is great indeed. If ever there was a time to set aside our differences and come together for the greater good, it is now. I invite you to join us at South Tidegate for formal negotiations."},{"name":"DOWW","text":"Shhhorewalkers and Sahagin, coming together? What assurance do I have that you will not ssslit our gills the moment we ssset foot within your territory?"},{"name":"MERLWYB","text":"I can offer naught but my word. We open our gates to you, and invite you into our home as a show of respect."},{"name":"DOWW","text":"...Hmph. I do not trussst you, shhhorewalker, but let it never be said that Doww of the Crushing Tide was a coward. I accept your offer, but attempt any treachery or sssubterfuge, and your people will drown in their own blood."},{"name":"MERLWYB","text":"Very well, Master Doww. I look forward to a productive discussion."},{"name":"MERLWYB","text":"Let us return, then. I shall send word to Noll as well─I would have our Sahagin allies join us at the parley."},{"name":"MERLWYB","text":"Ready to resume our mission? Excellent. Let us proceed to Speaker Doww's chambers."},{"name":"MERLWYB","text":"Let us search the spawning grounds and see if we cannot find this Doww."},{"name":"ENEMYSAHAGINA04115","text":"You will find Speaker Doww at the ssspawning grounds. Seek him out if you like─but do not expect that he will lisssten to your empty promises."},{"name":"ENEMYSAHAGINB04115","text":"Pssshhh! Every moment you linger here sssullies our sssacred home, shhhorewalker. Begone from this place before I ssspear you through the throat!"},{"name":"MERLWYB","text":"Thank you for joining us here, Master Doww."},{"name":"DOWW","text":"Pssshhh... The air here sssickens me. Be brief."},{"name":"MERLWYB","text":"Aye, let us get straight to the heart of the matter."},{"name":"MERLWYB","text":"A common threat looms before us─one more powerful than any primal, with the potential to bring death without end to both Sahagin and Lominsan alike. These circumstances call for swift and united action."},{"name":"MERLWYB","text":"You doubt our intentions, but I remind you that we have liberated many of your kin from Leviathan's enthrallment. They and countless other Sahagin have joined us, of their own free will, that we may ensure the survival of both our peoples."},{"name":"NOLL","text":"Pshhh... Aye, by their deeds have the Lominsans proven themselves worthy of our trust."},{"name":"MERLWYB","text":"Master Doww. You and your Crushing Tide want only to secure a future for your people. I say to you this can only be done by confronting this threat together."},{"name":"DOWW","text":"Pshhh... Threats, <span class=\"emphasis\">threatsss</span>─what is this <span class=\"emphasis\">threat</span> you ssspeak of!?"},{"name":"DOWW","text":"If it is unity you crave, then sssubmit yourself to our command. Be as the Serpent Reavers. They are the only shhhorewalkers I deign to call friend."},{"name":"MERLWYB","text":"You would ask us to willingly surrender ourselves to your Lord of the Whorl?"},{"name":"DOWW","text":"I do. For that─and that alone─will ensure peace between us."},{"name":"NOLL","text":"Preposterousss! You propose not alliance, but servitude. This way lies nothing but death for all Sahagin!"},{"name":"DOWW","text":"Do you hear this, my ssspawnbrothers? The shhhorewalkers have stolen this one's mind! He decries Lord Leviathan, and espouses the lunacy of our sssworn foes!"},{"name":"DOWW","text":"These treacherous wretches have abandoned our god, and conspire to drive we faithful from our ancestral home! We cannot─we <span class=\"emphasis\">mussst</span> not─let this stand!"},{"name":"RADICALSAHAGINA04115","text":"Pshhh...! For shhhame! Forsssaken by our spawnbrothers! They ssside with the finless ones and blaspheme our Lord Leviathan!"},{"name":"RADICALSAHAGINB04115","text":"They who sssteal our spawning grounds and ssslaughter our children! Our future! <span class=\"emphasis\">Our future</span>!"},{"name":"DOWW","text":"Pshhh! Behold...behold this blessing! Lord Leviathan grants us greater and greater ssstrength!"},{"name":"MERLWYB","text":"You would call this a <span class=\"emphasis\">blessing</span>!?"},{"name":"RECONCILEDSAHAGINB04115","text":"Pshhh...! Sssuch horrors! Flee! Flee for your lives!"},{"name":"MERLWYB","text":"The beast makes for Aleport. I leave this place to you!"},{"name":"DOWW","text":"Pshhhhhh! Sssplendid...sssplendid! Let all our ssspawnbrothers be blessed with such power!"},{"name":"DOWW","text":"Know thisss, shorewalker─I come not because your words sssway me, but to show my ssspawnbrothers that Doww of the Crushhhing Tide is no coward."},{"name":"ENEMYSAHAGINA04115","text":"Pshhh... Why do you linger here, shhhorewalker? Leave us be, lessst one of my spawnbrothers grow unable to sssuffer your presence."},{"name":"ENEMYSAHAGINB04115","text":"Pshhh! Shhhorewalker! Every moment longer you remain compounds the insult of your trespass. Begone, begone I say!"},{"name":"NOLL","text":"Pshhh... I beg of you, friend shorewalker. Deliver my ssspawnbrother from that horrific fate..."},{"name":"STHALRHET","text":"Did that fishback just turn into some monstrous fiend? What in the seven hells is going on here!?"},{"name":"NOLL","text":"Pshhh... This is the second time you've saved my life, shorewalker. My gratitude is as boundlesss as the sea."},{"name":"NOLL","text":"But what of the Admiral? We must go to her aid!"},{"name":"MERLWYB","text":"...I was too late. I am sorry."},{"name":"NOLL","text":"Pshhh... There is no need for apologies. You are not resssponsible for my people's plight."},{"name":"NOLL","text":"But what I cannot fathom is Doww's response. How <span class=\"emphasis\">pleased</span> he was to see his brothers become slavering beasts!"},{"name":"MERLWYB","text":"The fool believes it a blessing from Leviathan himself..."},{"name":"MERLWYB","text":"Any hope for a peaceable solution will be lost should Doww and his Crushing Tide manage to wield these transformations as a weapon against us."},{"name":"NOLL","text":"I shhhudder at the very thought. And yet the true threat, the blasphemy, is still out there, yes?"},{"name":"MERLWYB","text":"Just so. The first ones to transform are those who have fallen into the deepest depths of despair. The more painful their anguish, the more fearsome and formidable they become in their bestial forms─and the greater their influence over others."},{"name":"NOLL","text":"Pshhh... We can ssscarcely hope to stand against a legion of such foes. Would that there was more my people could do to help..."},{"name":"MERLWYB","text":"I will have the Maelstrom patrol the seas for the blasphemy, that we might slay it with all due haste."},{"name":"MERLWYB","text":"But this may well amount to naught. If the blasphemy, too, was born from a Sahagin, it could be sheltering in the depths, beyond the reach of our ships."},{"name":"NOLL","text":"In that case, pray allow my spawnbrothers and I to serve as your eyes beneath the sssea."},{"name":"MERLWYB","text":"Thank you, Noll. Through our efforts combined, we might yet weather this threat."},{"name":"MERLWYB","text":"As for your brothers who gave their lives today for our cause, I shall see that they are returned home to be laid to rest as they deserve."},{"name":"NOLL","text":"Pshhh... You have my gratitude, Admiral."},{"name":"MERLWYB","text":"And with that, we should return as well. There is much work to be done, and would see it done quickly."},{"name":"NOLL","text":"Pshhh... What a horrific sssight..."},{"name":"STHALRHET","text":"All that I can do is defend this gate as best I can. Go in safety, friend."},{"name":"MERLWYB","text":"Ah, <span class=\"highlight\">Forename</span>. I was just sharing our findings."},{"name":"MERLWYB","text":"So you see, the danger is exactly as the Sahagin described."},{"name":"MERLWYB","text":"While Doww and his ilk have no means of forcibly triggering the phenomenon at present, 'tis plain they intend to seek one out."},{"name":"MERLWYB","text":"Redouble our patrols offshore, and inform me at the first sign of anything out of the ordinary."},{"name":"LIMSASECRETARY","text":"It shall be done, Admiral."},{"name":"MERLWYB","text":"I worry that we may be stretching ourselves too thin. Should the situation take a turn for the worse, I will recall our forces from Garlemald─yet I would reserve that as a last resort."},{"name":"MERLWYB","text":"For now, I must get to work securing reinforcements. I ask that you remain close by─we may have need of your strength all too soon."},{"name":"LIMSASECRETARY","text":"Oh, you've returned. The Admiral was just briefing me on the events at the spawning grounds."},{"name":"NOLL","text":"Pshhh... I mussst take my fallen brother home..."}],"reward":{"gil":1000},"reqs":{"jobs":[{"lvl":86,"id":188}],"quests":[69650]},"next":[69652]},"partials":[{"type":"npc","id":"1040166","obj":{"i":1040166,"n":"Maelstrom Secretariat","l":28,"q":5}},{"type":"npc","id":"1040174","obj":{"i":1040174,"n":"Merlwyb","l":28,"q":3}},{"type":"quest","id":"69650","obj":{"i":69650,"n":"Storm Clouds Brewing","g":186,"l":"Radz-at-Han","s":301,"f":1}},{"type":"quest","id":"69652","obj":{"i":69652,"n":"Old Heroes Never Die","g":186,"l":"Limsa Lominsa","s":321,"f":1}}]}