{"quest":{"name":"The Devoted Daughter","location":"The Doman Enclave","id":69659,"patch":6.0,"sort":431,"icon":101093,"unlocksFunction":1,"eventIcon":71341,"issuer":1038458,"target":1038457,"genre":187,"journal":["Yugiri appears armed and ready to leave the enclave, which can only mean one thing.","The time to take up arms has come, for the blasphemy has been sighted in the Ruby Sea. As Hien and Yugiri prepare to meet with Rasho at Onokoro, he invites you to join them as they plan their next course of action.","Rasho informs you that the blasphemy was sighted near Shoal Rock, and for reasons yet unknown, the beast remains idle. He believes it best to strike quickly so as to seize on its faineancy, and so Tansui proposes you entrap the beast by dividing your forces. While you search the islands together with Hien and Yugiri on foot, he and Rasho will circle about islands aboard a ship. And so the hunt begins along the shores of Shoal Rock.","While you succeed in locating the blasphemy, but one glance at you and your comrades─weapons at the ready─is all it takes for the beast to take flight to parts unknown. Tansui arrives shortly after, and is taken aback upon learning the blasphemy was born from Minato. He reveals that he knew the woman, having rescued her at sea when her ship was sunk by imperial pursuers. Though her parents perished in the attack, she survived, albeit so traumatized by the experience that the mere sight of weapons drawn would drive her to scream in terror. She was eventually given into the care of Isari, where she found a husband, and together they frequented the beach where you found the blasphemy she became─all of which strongly suggests that these memories of her former life still influence her behavior as a beast.","Though your prey has eluded you, Tansui's portrait of Minato gives you reason to believe that the blasphemy will return to the beach. Until then, however, there is nothing for you to do but join Hien at the Doman Enclave.","Not long after you arrive at the Doman Enclave, Kisei appears with a number of villagers in tow. To appease the spirits of the deceased, she insists Hien render up the former conscripts as an offering to the kami Izanami. Hien summarily refuses, decrying the notion of sacrificing innocent lives. Though her followers' resolve begins to waver, Kisei will not be denied, but before she can press the issue, the long-absent Gosetsu reveals himself. Lord Hien's faithful retainer comes bearing a letter for Akitsu from his father─a man once taken by Garlemald and still very much alive, despite Kisei's earlier display of channeling his spirit. This revelation calls the truth of the priestess's powers into question, prompting her to leave in shame, but not before vowing revenge at the hands of her stepdaughter.<br><br>The stunned and embarrassed villagers disperse, and soon after Tonbo steps forward to apologize to Hien. The youth goes on to voice his fear that he may one day succumb to despair and become a monster as his brother did, and with the villagers now disillusioned with Kisei, others may follow. Indeed, the people of Doma are yet burdened by loss and grief with which they have yet to come to terms. Hien recognizes this, and, with Gosetsu's counsel, hopes to find a means to provide them with a measure of comfort, that they may begin to heal.<br><br>※The next role quest will be available from Yugiri upon reaching level 89 in any physical ranged DPS class."],"objectives":["Speak with Rasho at Onokoro.","Speak with Hien.","Speak with Hien at the Doman Enclave."],"dialogue":[{"name":"YUGIRI","text":"You've arrived not a moment too soon. The blasphemy has been sighted on the coast. For a mercy, there are no reported casualties as of yet."},{"name":"HIEN","text":"Just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I was hoping to see. No sooner had we cast wide our net than a Confederate messenger was at our door."},{"name":"HIEN","text":"If you would join us, Rasho awaits our arrival at Onokoro."},{"name":"TANSUI","text":"Here about the blasphemy, yes? Lord Hien and Yugiri should be arriving soon enough."},{"name":"RASHO","text":"Well, now. That the noble lord of Doma should come in person once again. Mayhap these blasphemies truly are a threat."},{"name":"HIEN","text":"Indeed they are. And I was told you and yours sighted our quarry quite recently."},{"name":"RASHO","text":"Aye, that we did. Near the islands of Shoal Rock. The beast appeared to be docile by all accounts, but appearances can be deceiving."},{"name":"RASHO","text":"If it is as you say, and this blasphemy has eyes only for former conscripts, then we have naught to fear. I trust those we accepted into our care are still in yours at the Kienkan, enjoying the finest Doman hospitality?"},{"name":"RASHO","text":"Anyway, I know not why it came to the Ruby Sea, nor why it remains idle, but if we act quickly, there is a chance we can take it unawares."},{"name":"TANSUI","text":"I propose we divide our forces. If you're willing to go ashore, we'll take a ship and circle about the islands. The first to find it will have the honor of the kill."},{"name":"HIEN","text":"Hah, a simple enough plan. Shall we be off to Shoal Rock, then?"},{"name":"RASHO","text":"I had thought we earned a reprieve from battle with the imperial withdrawal, but it seems I was mistaken. So be it. I'll not suffer this monster to threaten us any longer."},{"name":"TANSUI","text":"I can't imagine it will take long to deal with this creature, once we corner it."},{"name":"YUGIRI","text":"Make ready, <span class=\"highlight\">Forename</span>. Should we find the beast first, we must be prepared to strike at once."},{"name":"HIEN","text":"This is where the blasphemy was last sighted. If the fates are kind, this will all be over soon."},{"name":"HIEN","text":"Damn."},{"name":"YUGIRI","text":"Such speed. I doubt even my falcons could keep pace with it."},{"name":"TANSUI","text":"Bah, don't tell me that's the blasphemy flying off into the distance..."},{"name":"HIEN","text":"I hoped the ill will it bore me in life might compel the beast to stay and fight. Perhaps less of Minato remains than I thought─"},{"name":"TANSUI","text":"Minato? That monstrosity was <span class=\"emphasis\">Minato</span>!?"},{"name":"HIEN","text":"You knew her?"},{"name":"TANSUI","text":"Her family tried to flee to Hingashi during the occupation, but their ship was raided and sunk."},{"name":"TANSUI","text":"When we happened upon the wreckage, she was huddled between her parents on a piece of flotsam, desperate to keep warm...but they had long since grown cold."},{"name":"TANSUI","text":"We took her to Onokoro where we nursed her back to health. Couldn't imagine what horrors she must've witnessed. The mere sight of our weapons was enough to make her start screaming..."},{"name":"TANSUI","text":"She was clearly unfit for our trade, so we sought a village that might take her in. Isari was that village."},{"name":"TANSUI","text":"Several months later, I chanced to meet her on this very beach. She was in the company of a young Auri fisherman, and I knew at once she had found more than a home there."},{"name":"TANSUI","text":"I saw them here many times after that. She found something comforting about this place, I think..."},{"name":"YUGIRI","text":"According to reports from Radz-at-Han, the memories and desires of those who turn can influence their behavior as blasphemies..."},{"name":"HIEN","text":"Then perhaps Minato's memories are what compelled the beast to come here."},{"name":"TANSUI","text":"That would also explain its timid nature."},{"name":"TANSUI","text":"Minato was never one for violence, and the sight of you, blade drawn, no doubt stirred what little of the woman remains in the monster."},{"name":"HIEN","text":"If that is the case, an assault on the Kienkan is unlikely, guarded as it is by our samurai. But how are we to fight an enemy so quick to flee at the first sign of danger?"},{"name":"TANSUI","text":"&lt;sigh&gt; Robbed of her parents, her husband...and now her life. I would rather we didn't have to at all."},{"name":"TANSUI","text":"But I understand full well the risk we take by doing nothing. If we catch sight of the blasphemy again, you will be the first to know. Perhaps next time we can put her soul to rest."},{"name":"RASHO","text":"Worry not, friend. We will keep watch for the blasphemy. You have my word."},{"name":"TANSUI","text":"Minato suffered enough in life. That her spirit should be made to suffer still even now is obscene. The blasphemy must be stopped."},{"name":"YUGIRI","text":"We scarcely had time to draw our weapons ere it fled. Perhaps we must reconsider our approach."},{"name":"HIEN","text":"There is naught to do now but bide our time. Come, let us return to the enclave."},{"name":"YUGIRI","text":"If the blasphemy fears to show itself, there is no telling how long it may take to track it down a second time."},{"name":"HIEN","text":"Given what we have learned, it seems likely that the blasphemy will return to Shoal Rock. But that knowledge will avail us naught if we cannot prevent it from escaping again..."},{"name":"KISEI","text":"Lord Hien. On behalf of the people of Isari, we are come with a request."},{"name":"HIEN","text":"We welcome you with open arms and open hearts. What is it you would ask of me?"},{"name":"KISEI","text":"Those returned to us in the prisoner exchange have been granted shelter at the Kienkan."},{"name":"KISEI","text":"That they yet live is an affront to the kami's grand design, and the spirits of our loved ones suffer for it. Balance must needs be restored, and so I beseech you to render them unto the goddess Izanami."},{"name":"HIEN","text":"Absolutely not."},{"name":"HIEN","text":"'Tis not our place to pray for the death of others, nor draw steel to sate mere bloodlust."},{"name":"HIEN","text":"When I take a life, be it by command or my own hand, I do so not in service to vengeance, but to uphold my duty to Doma and her people."},{"name":"KISEI","text":"How did your mercy for Yotsuyu serve your duty? How were your people made better by the sight of her walking free?"},{"name":"HIEN","text":"For her crimes and her cruelty, I cut her down the day we took Doma Castle. I sought to kill her, and by rights she should have died then and there."},{"name":"HIEN","text":"But the kami willed otherwise, and returned her to us alive and bereft of her memories."},{"name":"HIEN","text":"With no recollection of her deeds, it would have been Tsuyu who faced punishment, not Yotsuyu. This was my judgment, and for it you were denied the justice you deserved. You have every right to resent me."},{"name":"HIEN","text":"But you come before me and ask that I sacrifice men and women whose only “crime” was to suffer─to be condemned to a life of servitude! If you truly believe your cause to be sacrosanct─believe yourselves fit to bear the burden and swing the sword─then step forward!"},{"name":"KISEI","text":"Sophistry and lies! They were meant to die. The spirits demand it!"},{"name":"GOSETSU","text":"(-???-)Are these the words of the dead, or the living who yet mourn?"},{"name":"GOSETSU","text":"Word of the Isari priestess and her gifts has spread far and wide, and I thought to see the truth of it myself. By coincidence, I crossed paths with a traveler hailing from the selfsame village, who had a mind to return as well but, alas, could not. And so he bid me deliver a missive in his stead."},{"name":"GOSETSU","text":"Judging by the striking resemblance, I take it you are the young fisher Akitsu."},{"name":"AKITSU","text":"This...this is a letter from my father! He was severely wounded in battle, but expects to make a full recovery."},{"name":"AKITSU","text":"He's alive. But...that would mean..."},{"name":"GOSETSU","text":"Surely a woman of your talents can <span class=\"emphasis\">divine</span> a plausible explanation for this turn of events."},{"name":"KISEI","text":"...You shall pay for this contumely. My daughter will make certain of that."},{"name":"GOSETSU","text":"Apologies for the abrupt and otherwise unannounced arrival. As you can see, my lord Hien, I am returned."},{"name":"HIEN","text":"Full glad am I for it. Thanks to your timely arrival, we have given the lie to Kisei's claims of preternatural powers."},{"name":"YUGIRI","text":"I gather you are apprised of recent events?"},{"name":"GOSETSU","text":"Aye. It did not take long to learn the state of affairs here in Doma, and that my assistance may be required."},{"name":"GOSETSU","text":"I had heard tales of Kisei channeling the dead, including the father of one young fisherman. Imagine my surprise when I saw this spirit in the flesh. He was also on pilgrimage, paying respects to the departed, and we chanced to meet in a Liberation Front infirmary."},{"name":"GOSETSU","text":"Would that we were not brought back together under such circumstances, but I am glad to see you all hale and hearty."},{"name":"HIEN","text":"Tonbo? Is something the matter?"},{"name":"TONBO","text":"I...I wish to apologize, Lord Hien. It was wrong of me to say the things I said."},{"name":"TONBO","text":"I understand nothing can bring back my father. But I was so angry, I..."},{"name":"HIEN","text":"Please, Tonbo, you needn't apologize."},{"name":"TONBO","text":"It's just... My brother was always so brave. But Father's death was more than he could bear, and it turned him into that monster. If he wasn't brave enough, what chance do I have...?"},{"name":"TONBO","text":"We wanted to perform the rites for Father. But the body was never returned to us, so..."},{"name":"TONBO","text":"N-Not that I blame you for that, Lord Hien. I understand nothing could be done..."},{"name":"GOSETSU","text":"That Akitsu's father survived is nothing short of a miracle, but I fear he is indeed the rare exception. I have offered prayers at more graves than I can count. It would be cruel to give others the false hope that their loved ones might return."},{"name":"GOSETSU","text":"And yet Kisei continues to do just that, offering comfort with her lies."},{"name":"GOSETSU","text":"A tempting but ephemeral balm for wounds that have yet to heal. Much like the anger some harbor for you, or resentment for the families restored while theirs remain broken..."},{"name":"GOSETSU","text":"But for those like that poor boy whose hearts lack for hatred, who know only sadness and despair... "},{"name":"HIEN","text":"Aye, they too may turn. Exposing the truth of Kisei's deception hasn't helped matters. If we are to prevent more suffering, we must pursue a lasting solution."},{"name":"HIEN","text":"I would be most grateful for your counsel, Gosetsu. There is much I could learn from your pilgrimage."},{"name":"GOSETSU","text":"If there is aught you require, but say the word and it shall be done."},{"name":"GOSETSU","text":"It is the least I can do for the part I played in Yotsuyu's tragedy. I failed her in the end, but I will not fail you, my lord."},{"name":"HIEN","text":"Thank you again for your aid, <span class=\"highlight\">Forename</span>. The day's events have given me much to consider. When our next step is decided, you will be first to know."}],"reward":{"gil":1000},"reqs":{"jobs":[{"lvl":88,"id":189}],"quests":[69658]},"next":[69660]},"partials":[{"type":"npc","id":"1038458","obj":{"i":1038458,"n":"Yugiri","l":2813,"q":5}},{"type":"npc","id":"1038457","obj":{"i":1038457,"n":"Hien","l":2813,"q":5}},{"type":"quest","id":"69658","obj":{"i":69658,"n":"Home No Longer","g":187,"l":"The Doman Enclave","s":421,"f":1}},{"type":"quest","id":"69660","obj":{"i":69660,"n":"A Singular Gift","g":187,"l":"The Doman Enclave","s":441,"f":1}}]}