{"quest":{"name":"A Mother's Suffering","location":"Limsa Lominsa","id":69653,"patch":6.0,"sort":331,"icon":101092,"unlocksFunction":1,"eventIcon":71341,"issuer":1040166,"target":1040174,"genre":186,"journal":["The secretariat has urgent news for you.","The Crushing Tide have struck again, and Candlekeep Quay is under attack. You prepare to contact the Company of Heroes and order them into battle, that the threat may be quashed before the residents suffer any casualties.","You reach out to Wheiskaet and the Company via linkpearl and order them to defend Candlekeep Quay. With Landenel and U'odh Nunh already in the vicinity, you assign each their tasks and send them on their way, while resolving to join them as soon as possible.","You arrive at Candlekeep Quay to find that the Company of Heroes succeeded in fending off the raiders and seeing the residents to safety. Interrogating two of the captured Crushing Tide after the battle, you learn that Doww is hiding out on a deserted isle that Merlwyb surmises is located in the Cieldalaes. All present resolve to set sail to promptly deal with the threat.","On the isle you come face-to-face with Doww and the blasphemy, whose presence stirs the power of the Echo. You are granted a vision which reveals that the blasphemy was born of none other than the Indigo Matriarch, queen of the Sahagin, who was overcome with despair for the plight of her people. Regaining your senses, you and your companions confront the beast, only to be incapacitated by a devastating attack that saps your strength. Fortunately, you manage to escape unharmed thanks to a well-timed bullet fired by an unknown sharpshooter. Making for the docks, you regroup with your companions and consider your next course of action.","The members of the Company vent their frustration at their failure to defeat the blasphemy. Noll, for his part, is deeply distressed by the revelation that the abomination was once his people's mother and queen. Together with Wheiskaet, you ponder the implications of what you have learned from your brief encounter, while Merlwyb declares her intent to dispatch scouts to track the escaped beast, and ascertain where it is taking shelter.","Back at Maelstrom Command, Merlwyb considers how the beast might be dealt with. Reaffirming her confidence in you and the Company of Heroes, she muses about attempting to recruit the Company's missing commander to aid in your cause. She encourages you to rest up while you can, as your greatest challenge still lies ahead.<br><br>※The next role quest will be available from the Maelstrom secretariat upon reaching level 89 in any melee DPS class."],"objectives":["Speak with the storm runner.","Speak with Wheiskaet at Candlekeep Quay.","Speak with Merlwyb at the Lominsan ferry docks.","Speak with Merlwyb again.","Speak with Merlwyb at Maelstrom Command."],"dialogue":[{"name":"LIMSASECRETARY","text":"Grave news, <span class=\"highlight\">Forename</span>. We've just received word that Candlekeep Quay is under attack."},{"name":"LIMSASECRETARY","text":"It would seem the Crushing Tide has struck again. The Admiral asks that you deploy the Company of Heroes at once. Our man here will act as your signaler."},{"name":"LIMSASIGNALLER","text":"The Company of Heroes is awaiting your orders!"},{"name":"WHEISKAET","text":"(-Wheiskaet-)Candlekeep Quay!?"},{"name":"WHEISKAET","text":"(-Wheiskaet-)Both Landenel and U'odh Nunh should be close by. What are your instructions?"},{"name":"SYSTEM","text":"Landenel is a hot-headed warrior who lives for the thrill of battle, while U'odh Nunh is a calm and calculating hunter. Both can serve you well, but better if assigned to a task suited to their skills..."},{"name":"Q1","text":"What order will you give Landenel?"},{"name":"A1","text":"Drive the Crushing Tide away!"},{"name":"A1","text":"See the residents of Candlekeep Quay to safety!"},{"name":"LANDENEL","text":"(-Landenel-)Consider it done, Commander!"},{"name":"Q2","text":"What order will you give to U'odh Nunh?"},{"name":"A2","text":"Drive the Crushing Tide away!"},{"name":"A2","text":"See the residents of Candlekeep Quay to safety!"},{"name":"UODHNUNH","text":"(-U'odh Nunh-)Understood."},{"name":"WHEISKAET","text":"(-Wheiskaet-)The rest of us will head there at once!"},{"name":"LIMSASECRETARY","text":"I'll tell the Admiral you and the Company of Heroes are on your way. Godsspeed! "},{"name":"LIMSASECRETARY","text":"Our communications officer will assist in relaying your orders."},{"name":"WHEISKAET","text":"Worry not. The tide has already ebbed, if you follow my meaning."},{"name":"WHEISKAET","text":"Perhaps you're curious how your men carried out your orders?"},{"name":"WHEISKAET","text":"You'll be pleased to hear that Landenel led the attack with his characteristic aplomb. Dancing amongst his foes with such speed and ferocity that were dizzying to watch."},{"name":"WHEISKAET","text":"Landenel managed to see every last man, woman, and child to safety─albeit grumbling all the while about how he'd rather be skewering fishbacks."},{"name":"WHEISKAET","text":"U'odh Nunh made full use of his talents in neutralizing our foe's attack. Mere moments after he arrived, he devised and enacted the perfect defense plan, using the terrain to his advantage."},{"name":"WHEISKAET","text":"U'odh Nunh made full use of his talents in leading the rescue effort. Not a single man, woman, or child suffered so much as a scratch."},{"name":"WHEISKAET","text":"I had my doubts at first, but you've passed your first trial as acting captain with flying colors."},{"name":"WHEISKAET","text":"By sending both men to the front lines, you left the residents open to an attack. Fortunately, I came along in time to escort them to safety─but a few stragglers were wounded in the chaos."},{"name":"WHEISKAET","text":"By assigning both men to the rescue effort, you left the quay itself vulnerable to attack...and the damage was as severe as you might expect. I advise you to consider your orders more carefully in the future."},{"name":"WHEISKAET","text":"Pardon my bluntness, but you have much to learn about being an effective leader. You'd best be a quick study, or the consequences will be dire."},{"name":"MERLWYB","text":"The battle is over, I see. 'Tis good to see the Company of Heroes can still live up to its name."},{"name":"MERLWYB","text":"I demand answers. Why did you target Candlekeep Quay?"},{"name":"ENEMYSAHAGINA04117","text":"(-Belligerent Sahagin-)Pshhh! I ssspit on your questions, filthy shhhorewalker!"},{"name":"WHEISKAET","text":"I was hoping we might do this the easy way, but if you insist..."},{"name":"ENEMYSAHAGINA04117","text":"(-Belligerent Sahagin-)Pshhh! So you would torture us? You shorewalkers are all the same─sssavage brutes, the lot of you!"},{"name":"SHAMANILOHMANI","text":"<span class=\"emphasis\">Torture</span>? Please─we are not so uncivilized as that, my slippery friend."},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh... Brayflox's shiny treasure will have fishman trading tongueflaps in no time!"},{"name":"WHEISKAET","text":"Allow me to explain: Shamani Lohmani and Brayflox are well practiced in the art of interrogation."},{"name":"WHEISKAET","text":"Shamani has a sharp mind, as I'm sure you've noticed, and a knack for getting information out of uncooperative types with a minimum of fuss."},{"name":"WHEISKAET","text":"Brayflox, on the other hand... Her methods can be...<span class=\"emphasis\">unconventional</span>, to say the least. But it's hard to argue with the results."},{"name":"WHEISKAET","text":"Well, Commander? The choice is yours to make."},{"name":"Q3","text":"To whom will you entrust the interrogation?"},{"name":"A3","text":"Shamani Lohmani's my man."},{"name":"A3","text":"Brayflox, I choose you!"},{"name":"SHAMANILOHMANI","text":"But of course, Commander. Watch as I get him talking without so much as lifting a finger."},{"name":"SHAMANILOHMANI","text":"They tell me your kind are particularly fond of La Noscean oranges. Might I interest you in a glass of delightful orange wine brewed from our latest harvest?"},{"name":"ENEMYSAHAGINA04117","text":"(-Belligerent Sahagin-)Pshhh! Thisss... This is─!"},{"name":"ENEMYSAHAGINA04117","text":"(-Belligerent Sahagin-)Pshhh! Another glass, shhhorewalker! I demand it, in return for the crimes you have committed against my spawnbrothers!"},{"name":"SHAMANILOHMANI","text":"A mere glass, my friend? Why, I'd be more than happy to offer you a full bottle─nay, an entire cask! <span class=\"emphasis\">If</span> you provide us with the answers we seek..."},{"name":"ENEMYSAHAGINA04117","text":"(-Belligerent Sahagin-)Pshhh... We have a deal, shorewalker. For a cask of that blisssful beverage, I will tell you all my secrets!"},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh... If fishman will not spit out truthywords, Brayflox's treat will have fishman spit out something else..."},{"name":"ENEMYSAHAGINA04117","text":"(-Belligerent Sahagin-)Pshhh! Wh-What...what is this!?"},{"name":"ENEMYSAHAGINA04117","text":"(-Belligerent Sahagin-)Ngaaaaaah! So vile, so putrid this stench!"},{"name":"ENEMYSAHAGINA04117","text":"(-Belligerent Sahagin-)Unnnghhh... Bleeeccchhhhhhhhh!"},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh... Stinkysweet of aged gobbiecheese is strong, yes? Makes many nosetickles and stomachturns."},{"name":"UODHNUNH","text":"Our finned friend's spit <span class=\"emphasis\">something</span> up, all rrright. Though I'd rather he hadn't..."},{"name":"ENEMYSAHAGINA04117","text":"(-Belligerent Sahagin-)Pshhh! F-Fine! I will speak, dirty shorewalkers! J-Just...just get that foul poison away from me!"},{"name":"MERLWYB","text":"Again, I ask: why did you target Candlekeep Quay?"},{"name":"ENEMYSAHAGINA04117","text":"(-Belligerent Sahagin-)...Doww himself gave the order. Said we must essstablish a foothold in preparation for our assault on the city."},{"name":"MERLWYB","text":"He means to attack Limsa Lominsa itself? But with your numbers, that would be folly."},{"name":"ENEMYSAHAGINA04117","text":"(-Belligerent Sahagin-)Pshhh! Speaker Doww commands power beyond the comprehension of you shorewalkers!"},{"name":"MERLWYB","text":"We have dealt with Leviathan before."},{"name":"ENEMYSAHAGINA04117","text":"(-Belligerent Sahagin-)You misunderstand. Speaker Doww says it is a greater power ssstill. The very first being blessed by our Lord..."},{"name":"MERLWYB","text":"The blasphemy..."},{"name":"MERLWYB","text":"Tell me where Doww is."},{"name":"ENEMYSAHAGINA04117","text":"(-Belligerent Sahagin-)Pshhh... An island far to the sssouth and eassst... There, he performs the rite that will sssummon forth the divine one and deliver my brothers and I to glory!"},{"name":"MERLWYB","text":"...Thank you for your cooperation."},{"name":"MERLWYB","text":"I suspect that Doww is hiding out somewhere in the Cieldalaes─a deserted isle, most likely."},{"name":"LANDENEL","text":"I don't know much about these so-called “blasphemies,” but can they truly be tamed so easily?"},{"name":"MERLWYB","text":"We have no evidence they can─but we must operate under the assumption that Doww has found a way."},{"name":"MERLWYB","text":"I will ready a ship─we set sail for the Cieldalaes at once. Prepare yourselves, and meet me at the docks as soon as you are ready."},{"name":"WHEISKAET","text":"I'll have Shamani and Brayflox continue the interrogation in the meantime. Our friends here might still be hiding something from us."},{"name":"LANDENEL","text":"You kept us waiting long enough, Commander. Not that I'm complaining─more fishmen for me to skewer."},{"name":"UODHNUNH","text":"Is that all? And I was just getting warrrmed up..."},{"name":"SHAMANILOHMANI","text":"Good to know my colleagues haven't grown rusty in the years since we disbanded."},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh... Brayflox's treasures go boom! Blast fishymen to bittybits!"},{"name":"LIMSASECRETARY","text":"You have orders from the Admiral to make for Candlekeep Quay and provide support for the Company as needed."},{"name":"LIMSASIGNALLER","text":"To think I'd live to see the famed Company of Heroes not only reform, but fight at our side."},{"name":"MERLWYB","text":"Everyone is here? Good. We make for the Cieldalaes in search of Doww's hideout."},{"name":"MERLWYB","text":"Our friend Noll will be waiting for us there."},{"name":"MERLWYB","text":"The blasphemy, too, may be present. Be vigilant and keep your weapons at the ready."},{"name":"MERLWYB","text":"Well, Commander? Do you have any words for your men on the eve of battle?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"The duty of the strong..."},{"name":"A4","text":"All for one..."},{"name":"LANDENEL","text":"(-Company of Heroes-)...Is to protect the weak!"},{"name":"UODHNUNH","text":"Hmm? Can't say I've hearrrd that motto before..."},{"name":"WHEISKAET","text":"Nor I. At any rate, let's be about it!"},{"name":"MERLWYB","text":"We meet again, Doww."},{"name":"MERLWYB","text":"Where is the blasphemy? Tell us now so we may end this madness."},{"name":"DOWW","text":"Pshhhhhhhhh... Heh heh heh..."},{"name":"WHEISKAET","text":"Speak of the bloody devil!"},{"name":"NOLL","text":"Pshhh... There it is... The dread beassst I saw beneath the waves..."},{"name":"MERLWYB","text":"The source of our woes..."},{"name":"MERLWYB","text":"The Echo...!? Of all the times!"},{"name":"WHEISKAET","text":"Defend the commander!"},{"name":"DOWW","text":"Pshhh... I bring grave tidingsss, my queen. The wretched shhhorewalkers poison the minds of my ssspawnbrothers with false words and foul magicks!"},{"name":"DOWW","text":"Our poor, beguiled brethren renounce Lord Leviathan and name Him a false god! They treat with Limsa Lominsa, and some even call for an alliance!"},{"name":"DOWW","text":"We must sssummon Him, that the lost might receive of His blesssing anew! This I would gladly do had our ssstock of crystals not run dry..."},{"name":"SAHAGINMOTHER","text":"Ssspawning time is nearly upon us...yet you fight and bicker amongssst yourselves... How am I to birth a new brood when my children grown ssstand divided?"},{"name":"DOWW","text":"Who dares enter the sssacred chamber!?"},{"name":"RECONCILEDSAHAGIN04117","text":"(-Forward-thinking Sahagin-)Pshhh... Forgive my intrusion, Queen Mother. I speak for the Sahagin who seek an accord with the shhhorewalkers."},{"name":"RECONCILEDSAHAGIN04117","text":"(-Forward-thinking Sahagin-)A new age is upon usss... We needn't turn to false gods, nor foment bitterness and bloodshed in our precious ssspawning grounds..."},{"name":"RECONCILEDSAHAGIN04117","text":"(-Forward-thinking Sahagin-)The shhhorewalkers have changed. They endeavor to understand us. To shhhare these lands with us, that they may have peace, and we our ssspawning grounds."},{"name":"SAHAGINMOTHER","text":"Could thisss be true...?"},{"name":"DOWW","text":"Lies, lies! Do not be deceived by that one's delusions, my queen! He is a heathen who has ssstrayed from Lord Leviathan's light!"},{"name":"DOWW","text":"The shhhorewalkers are oathbreakers, now and forevermore! As they extend one hand in friendship, they clutch a dagger in the other. We are beasts in their eyes, deserving of naught but ssslaughter!"},{"name":"SAHAGINMOTHER","text":"Oh... Oh, for a blessed moment, I felt the faintest touch of hope... But you are right, Doww. They are demons...and we are damned..."},{"name":"SAHAGINMOTHER","text":"O, for woe! My poor children have lossst their faith! Their minds poisoned by lies, they turn away from the Lord of the Whorl, and cassst their lot with the enemy..."},{"name":"DOWW","text":"'Tis so, my queen, 'tis so. We will have no choice but to abandon our sssacred spawning grounds, and sssink to the ocean's floor to rot and decay."},{"name":"SAHAGINMOTHER","text":"Doww, dearessst of my children... You tell then that we have no future...?"},{"name":"SAHAGINMOTHER","text":"How can I bring new life into this world, knowing that my brood will have their hearts ssstolen and abandon me? How can I bear this unbearable sssadness?"},{"name":"SAHAGINMOTHER","text":"I cannot!"},{"name":"RECONCILEDSAHAGIN04117","text":"(-Forward-thinking Sahagin-)Pshhh─!? Wh-What's happening!?"},{"name":"RECONCILEDSAHAGIN04117","text":"(-Forward-thinking Sahagin-)Please, my queen! You mussst calm yourself!"},{"name":"RECONCILEDSAHAGIN04117","text":"(-Forward-thinking Sahagin-)Pshhhaaaaaaaaagh!"},{"name":"DOWW","text":"Such...such power! Sssuch <span class=\"emphasis\">beauty</span>! A blessing from Lord Leviathan Himself!"},{"name":"WHEISKAET","text":"&lt;pant&gt; So this is a blasphemy, eh? I can see what all the fuss was about..."},{"name":"MERLWYB","text":"Have your wits about you? Good. If you can fight, now is the time."},{"name":"DOWW","text":"Pshhh... Strike now, my queen! Send the shhhorewalkers and their honorless leader to her death!"},{"name":"LANDENEL","text":"Wh-What's happening!? I can't feel my legs!"},{"name":"RADICALSAHAGINA04117","text":"(-Friendly Sahagin-)Pshhh... Wh-Why, Mother...? Are we not your children...too...?"},{"name":"MERLWYB","text":"Dammit! We cannot weather another blow like the last!"},{"name":"LANDENEL","text":"I still don't know what in the seven hells just happened, but I'll be damned if I'm going to go down without a fight!"},{"name":"WHEISKAET","text":"Steady! The beast is feeding on our aether. We'll not survive a head-on fight!"},{"name":"WHEISKAET","text":"Landenel! U'odh! Remember the Company stratagem when faced with overwhelming odds!"},{"name":"WHEISKAET","text":"Retreat! Retreat! Let's get ourselves the bloody hells out of here!"},{"name":"WHEISKAET","text":"Let's see how this blasphemy likes my axe between its eyes."},{"name":"LANDENEL","text":"I don't know a blasphemy from a hole in the ground. All I know is that I'm ready to kill the bleedin' thing!"},{"name":"UODHNUNH","text":"This is the enemy's stronghold. Never forget that they have the advantage."},{"name":"SHAMANILOHMANI","text":"Don't you worry─Brayflox and I have the situation under control."},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh... Brayflox keep watcheyes on this place."},{"name":"MERLWYB","text":"Damn it all! We'd have better luck holding back the tide!"},{"name":"SHAMANILOHMANI","text":"How goes it, friends...is what I would normally ask, but judging from the muttered cursing, I gather it did not go all that well."},{"name":"WHEISKAET","text":"We barely escaped with our lives. To think the damned beast had the power to stop us in our tracks─literally."},{"name":"UODHNUNH","text":"What do we know of the creature's origins? Was it once a Sahagin as you suspected?"},{"name":"MERLWYB","text":"Mayhap the Echo afforded <span class=\"highlight\">Forename</span> some insight."},{"name":"NOLL","text":"Pshhh! Doww's villainy knows no bounds! Sssowing seeds of dessspair in our queen mother's heart, that she might transssform into that monstrosity!"},{"name":"SHAMANILOHMANI","text":"If she was the first to turn, then there was nothing deliberate about it. Still, it's clear that his words served as a catalyst."},{"name":"LANDENEL","text":"If we kill the blasphemy, it'll be tantamount to killing the Sahagin's queen. That's not going to endear us to them one bit."},{"name":"NOLL","text":"Pshhh... I cannot turn my ssspear against the mother who birthed me, let alone take her life..."},{"name":"LANDENEL","text":"Out of curiosity, did anyone see who fired that shot? Were it not for them, we'd all be dead."},{"name":"MERLWYB","text":"I know not, but we must formulate a plan─and quickly. My scouts tell me that the blasphemy has left the island, and now roams the open sea."},{"name":"MERLWYB","text":"I will order them to continue the search. In the meantime, we must find a means to overcome the beast's formidable offense."},{"name":"WHEISKAET","text":"Leave that to us. Time and again, we've used our wits and experience to triumph over the longest odds."},{"name":"WHEISKAET","text":"To defeat your enemy, first you must know your enemy. Tell me, Commander...what do <span class=\"emphasis\">you</span> reckon was the most valuable knowledge we gleaned from our initial encounter?"},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"That the blasphemy is the Sahagin queen transformed."},{"name":"A5","text":"That the blasphemy has the power to absorb aether."},{"name":"WHEISKAET","text":"Indeed. If the beast still has some memory of what it once was, we may very well be able to predict its future actions."},{"name":"WHEISKAET","text":"I concur. Now that we know how the beast disables its foes, we can use this knowledge to devise a proper defense against it."},{"name":"WHEISKAET","text":"...But that is not all we have learned. While the blasphemy can maneuver through the water, it also frequents caves and the like. Our best chance of defeating it would be in such a place."},{"name":"MERLWYB","text":"Our only chance, I daresay."},{"name":"MERLWYB","text":"I will send scouts to identify any and all large caverns and coastal areas that could serve as shelter for a massive creature."},{"name":"MERLWYB","text":"To ensure the safety of our people─and to have any hope for peace with the Sahagin─this is a battle that we must win. All your strength and wisdom will be needed in the days to come. Dismissed."},{"name":"NOLL","text":"......"},{"name":"MERLWYB","text":"Come, let us share our findings with the Maelstrom."},{"name":"WHEISKAET","text":"When no path to victory can be found, flee and fight another day. It might not be the kind of approach that make a bard sing your praises, but it's kept us alive, and that's enough."},{"name":"LANDENEL","text":"Face-to-face with the damned beast, and I could barely lift my spear! Next time, mark my words, that bastard fish is going to pay..."},{"name":"UODHNUNH","text":"So that was the blasphemy. Intrrriguing creature. For the first time in many summers, we find ourselves with a worthy foe."},{"name":"NOLL","text":"Pshhh... Were the other beasssts we faced also once my ssspawnbrothers? I...I cannot bear the thought..."},{"name":"MERLWYB","text":"Now that we have seen what the blasphemy is capable of ourselves, 'tis more plain to me than ever that it must be slain."},{"name":"MERLWYB","text":"Reach out to all trade ships entering and departing Limsa. Inform them that any sightings of the blasphemy are to be reported to Maelstrom Command at once."},{"name":"LIMSASECRETARY","text":"Understood. But given the beast's abilities, how do you intend to overcome it?"},{"name":"MERLWYB","text":"I trust that the Company of Heroes and <span class=\"highlight\">Forename</span>─experienced primal-slayers all─will find a way."},{"name":"MERLWYB","text":"...And yet I would leave no resource untapped. There is one more whose expertise I would call upon─if he would agree."},{"name":"MERLWYB","text":"Even Wheiskaet is at a loss as to his former commander's whereabouts. But mayhap Eynzahr could offer some guidance...?"},{"name":"MERLWYB","text":"No doubt you are still fatigued from the battle with the blasphemy. Pray rest while you are able."},{"name":"MERLWYB","text":"When we are ready to take further action, you will hear from me. Till then, take care."},{"name":"LIMSASECRETARY","text":"The Admiral told me of your encounter with the blasphemy. The result may not have been ideal, but I am heartened to see you return safely."}],"reward":{"gil":1000},"reqs":{"jobs":[{"lvl":88,"id":188}],"quests":[69652]},"next":[69654]},"partials":[{"type":"npc","id":"1040166","obj":{"i":1040166,"n":"Maelstrom Secretariat","l":28,"q":5}},{"type":"npc","id":"1040174","obj":{"i":1040174,"n":"Merlwyb","l":28,"q":3}},{"type":"quest","id":"69652","obj":{"i":69652,"n":"Old Heroes Never Die","g":186,"l":"Limsa Lominsa","s":321,"f":1}},{"type":"quest","id":"69654","obj":{"i":69654,"n":"Out of the Shadows","g":186,"l":"Limsa Lominsa","s":341,"f":1}}]}