{"quest":{"name":"Seeds of Disquiet","location":"Radz-at-Han","id":69656,"patch":6.0,"sort":401,"icon":101093,"unlocksFunction":1,"eventIcon":71341,"issuer":1039102,"target":1038457,"genre":187,"journal":["The Doman delegate is seeking able-bodied adventurers on behalf of Lord Hien.","At the mere sight of you, the Doman delegate is equal parts excited and relieved. As he tells it, dread beasts heralding the Final Days have begun to manifest in Doma, following the appearance of a blasphemy. Though they have made great strides in slaying the lesser creatures, the greater threat continues to elude them, keeping to the heavens and beyond the reach of their samurai and shinobi. To that end, Lord Hien seeks a marksman able to pluck the beast from the sky. You agree to answer their call for aid, and so he begs you make for the Doman Enclave, where Yugiri will receive you.","Your discussion with Hien and Yugiri is cut short when a vexed villager interrupts with grave news. A young man of Namai recently transformed into a terrible beast, inciting panic in the people as it fled. Hien would take swift action in slaying the creature, and so he and Yugiri leave with the villager for the Glittering Basin, and you are to follow.","There is nothing to be seen when you arrive at the Glittering Basin, and so Hien suggests you split up to cover more ground. He bids you search to the west, reminding you not to hesitate in slaying the beast should you find it first.","You find the beast preparing to sink its fangs into a frightened young boy. Thanks to your timely arrival, and unmatched martial prowess, its meal is denied. All that remains is to ensure the boy is unharmed.","Much to the surprise of all, the young boy is not thankful, but furious as he accuses you of killing his brother. He runs off in a huff, and shortly after Isse arrives. It would seem that the young boy, Tonbo, pursued the beast born of his sibling when it fled their village, and Isse gave chase to ensure he did not come to harm. He goes on to explain the circumstances that have left the people of his village, and perhaps all of Doma, in the grips of despair. The youth's account gives Hien much to consider as you all return to the Doman Enclave.","Hien has a mind to visit the villages of Doma personally and inquire after those whom their neighbors believe are more distressed of late─individuals that he fears may be at risk of sharing in the fate of Tonbo's brother. Meanwhile, Yugiri and the other shinobi will continue to hunt the blasphemy that yet eludes them. Until more is known, Hien bids you rest, that you may be ready and able to aid them once more.<br><br>※The next role quest will be available from Yugiri upon reaching level 86 in any physical ranged DPS class."],"objectives":["Speak with Yugiri at the Doman Enclave.","Speak with the vexed villager at the Glittering Basin.","Seek out and defeat the beast.","Aid the frightened youth.","Speak with Hien at the Doman Enclave."],"dialogue":[{"name":"DOMANRESIDENTOFFICER","text":"Do mine eyes deceive me? <span class=\"alternative-container\"><span class=\"alternative\">Lady</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>! Oh, thank the kami."},{"name":"DOMANRESIDENTOFFICER","text":"Lord Hien has requested assistance in the resolution of a most urgent matter─the hunt for a fell beast believed to be a blasphemy."},{"name":"DOMANRESIDENTOFFICER","text":"Though we have made great strides in ensuring the safety of our people, we fear even our finest shinobi will be no match for this enemy, for it commands the skies of Doma."},{"name":"DOMANRESIDENTOFFICER","text":"But as your talent for striking down foes at a distance is beyond compare, I can think of no one better to aid us in overcoming this adversary."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"'Twould be my pleasure."},{"name":"A1","text":"Well, if no other marksman is up to the task..."},{"name":"DOMANRESIDENTOFFICER","text":"Oh, kami be praised! I shall inform Lady Yugiri, that she may receive you at the Doman Enclave. Safe travels, <span class=\"alternative-container\"><span class=\"alternative\">Lady</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>."},{"name":"DOMANRESIDENTOFFICER","text":"Lady Yugiri will await your arrival at the Doman Enclave. Safe travels, and may the kami speed your way."},{"name":"YUGIRI","text":"It is good to see you, <span class=\"highlight\">Forename</span>. When we received word that you of all people had answered our call, I could scarcely believe it. Yet here you are."},{"name":"YUGIRI","text":"Lord Hien will be pleased for this reunion. If you would wait here a moment..."},{"name":"HIEN","text":"Well, well, that the kami should guide your steps to our door once more, and with such fortuitous timing."},{"name":"HIEN","text":"Pray forgive me for not affording you a hero's welcome, but time is not on our side."},{"name":"HIEN","text":"Not long after receiving word of men transforming into hideous beasts in Thavnair, a similar creature was born of a woman in Isari. After attacking another villager, it took to the skies and fled, though to where we know not."},{"name":"HIEN","text":"An all too cruel twist of fate, for the one slain was among the prisoners returned to us in that deplorable exchange with Asahi and the Empire. Just when they had at last begun to piece their life back together..."},{"name":"HIEN","text":"This blasphemy must be stopped. Alas, our foe is wont to keep to the skies, well beyond the reach of our samurai and shinobi."},{"name":"HIEN","text":"Thus did we seek the aid of those proficient in ranged combat, able to pluck the beast from the heavens."},{"name":"HIEN","text":"Of course, martial prowess alone will not solve our problems─others have turned into weaker but no less gruesome abominations, as was the case in Thavnair, and their numbers increase by the day."},{"name":"HIEN","text":"From what I understand, this phenomenon is not unlike a sickness which spreads by feeding on fear and anxiety. Emotions which, of late, can be found in abundance. Slaying the beasts means nothing if the peoples' hearts cannot be put at ease."},{"name":"UNSETTLEDVILLAGER","text":"(-???-)Lord Hien!"},{"name":"UNSETTLEDVILLAGER","text":"You have to help! The villagers─they...they..."},{"name":"YUGIRI","text":"Sir, please─calm yourself, and tell us what happened."},{"name":"UNSETTLEDVILLAGER","text":"Another has been turned in Namai, my lord! For a blessing, no one was harmed when the beast flew into a rage, but...the people are in a panic! I fear what may happen next."},{"name":"HIEN","text":"It would seem we have even less time than I thought."},{"name":"HIEN","text":"Worry not. We will see to the beast."},{"name":"HIEN","text":"As of yet, there is no cure for this affliction...but we will save what lives we can. I promise you."},{"name":"HIEN","text":"I trust you are ready to join the fray?"},{"name":"UNSETTLEDVILLAGER","text":"It was last seen near the Glittering Basin. Come, I will show you."},{"name":"HIEN","text":"Without a cure, we've no choice but to cut them down before they can cause more harm."},{"name":"YUGIRI","text":"Still no sign of the beast. Or any other, for that matter..."},{"name":"UNSETTLEDVILLAGER","text":"The beast was right here, I swear it."},{"name":"HIEN","text":"I thank you for leading us here, but it is not safe. Please, return to your village."},{"name":"HIEN","text":"We should split up if we're to have any chance of finding it. <span class=\"highlight\">Forename</span>, would you see to the west? I will search in the north. Yugiri, I leave the east to you."},{"name":"HIEN","text":"If you find it, remember─these blasphemies are no longer people. They will not hesitate to strike you down, so you mustn't either."},{"name":"HIEN","text":"Now, let us not waste any more time."},{"name":"HIEN","text":"Are you all right? We heard shouting and came as fast as we could."},{"name":"YUGIRI","text":"It would appear <span class=\"highlight\">Forename</span> arrived not a moment too soon."},{"name":"TONBO","text":"(-Frightened Youth-)Why..."},{"name":"TONBO","text":"(-Frightened Youth-)Why did you kill my brother!?"},{"name":"HIEN","text":"Your brother...?"},{"name":"HIEN","text":"Young man, that creature was not your kin. Not anymore. Had <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> not laid it to rest, it would have killed you, and countless others."},{"name":"HIEN","text":"But if your heart cries out for one to blame, let it be me. The beast was slain at my behest, for it was the only way..."},{"name":"TONBO","text":"(-Frightened Youth-)No! No, you're wrong! You killed him! Murdered him! I hate you!"},{"name":"YUGIRI","text":"Isse? What are you doing here?"},{"name":"ISSE","text":"Searching for Tonbo, though clearly you found him first. The monster was his older brother, as you may have guessed, and Tonbo gave chase the moment it ran off."},{"name":"ISSE","text":"I beg you forgive him for his outburst."},{"name":"ISSE","text":"His brother was all he had left. Their father was conscripted by the Empire and was, regrettably, not among those returned to us in the recent exchange of prisoners."},{"name":"ISSE","text":"The hope they might one day be reunited was their only comfort when that...when the viceroy still ruled. I can only imagine how they felt when she walked into Isari, a shadow of her former self."},{"name":"ISSE","text":"\"Tsuyu“ may have had no memories of the monster she was, but her victims still see her in their dreams. Nevertheless, like many, the brothers prayed your mercy would see their family restored..."},{"name":"ISSE","text":"But then they learned of her death, and of their father's absence. Deprived of hope and of hate all at once, they had...nothing."},{"name":"ISSE","text":"Ah! M-My apologies for rambling."},{"name":"HIEN","text":"No. No, it was a rather enlightening tale."},{"name":"HIEN","text":"I spared the woman who brought him pain, and took the brother who brought him comfort."},{"name":"HIEN","text":"Aye...I would hate me too."},{"name":"HIEN","text":"I swear I will set things right for Tonbo. For all the people of Doma. Please, return home, Isse, and be safe."},{"name":"HIEN","text":"Let us return to the Doman Enclave. This ordeal has given me much to consider."},{"name":"YUGIRI","text":"I do not envy Lord Hien the burden now thrust upon him. But he shall not have to bear it alone."},{"name":"HIEN","text":"I owe you a great debt for your timely assistance."},{"name":"HIEN","text":"And an apology, for I've made you an executioner in young Tonbo's eyes. Would that I had been the one he witnessed cut down the beast his brother had become."},{"name":"HIEN","text":"But we haven't time to dwell on regrets and what should have been. No, we need to take action, and after hearing of Tonbo and his brother, I believe I know what must be done."},{"name":"HIEN","text":"A great many of our brothers and sisters were returned to us in the prisoner exchange. But even so, there are those who yet remain lost to us."},{"name":"HIEN","text":"Meanwhile, Yotsuyu, who was directly responsible for much of our people's suffering, was never held to account for her crimes. In death, she claimed vengeance for her suffering at the hands of her brother, but it came at the expense of justice for her countless victims."},{"name":"HIEN","text":"The people of Doma have every right to resent me for failing them and their grief. But what of those who cannot bring themselves to do even that─who are left alone with their anger and their pain?"},{"name":"YUGIRI","text":"It may well give way to despair, and then..."},{"name":"HIEN","text":"They would share the same fate as Tonbo's brother, yes."},{"name":"HIEN","text":"Which is why we must needs consider who else might share in his anguish, ere we find ourselves beset by more beasts."},{"name":"HIEN","text":"I will begin making rounds of the villages to inquire after those whom their neighbors believe are more distressed of late."},{"name":"YUGIRI","text":"Very good. I and the other shinobi shall continue our search for the blasphemy which set these events in motion."},{"name":"HIEN","text":"And you, my friend─we will have need of your talents again ere long. Rest assured we will keep you apprised of our findings."}],"reward":{"gil":1000},"reqs":{"jobs":[{"lvl":85,"id":189}],"quests":[69954]},"next":[69657]},"partials":[{"type":"npc","id":"1039102","obj":{"i":1039102,"n":"Doman Delegate","l":3707,"q":2}},{"type":"npc","id":"1038457","obj":{"i":1038457,"n":"Hien","l":2813,"q":5}},{"type":"quest","id":"69954","obj":{"i":69954,"n":"At World's End","g":11,"l":"Radz-at-Han","s":572}},{"type":"quest","id":"69657","obj":{"i":69657,"n":"When the Kami Answer","g":187,"l":"The Doman Enclave","s":411,"f":1}}]}