{"quest":{"name":"When the Kami Answer","location":"The Doman Enclave","id":69657,"patch":6.0,"sort":411,"icon":101093,"unlocksFunction":1,"eventIcon":71341,"issuer":1038458,"target":1038457,"genre":187,"journal":["Lord Hien's extended absence from the enclave does not sit well with Yugiri.","The whereabouts of the blasphemy remain unknown. Lord Hien, meanwhile, was last said to be visiting the village of Isari, though Yugiri fears he has been away overlong. She invites you to accompany her there and see if aught is amiss.","You find Lord Hien none the worse for wear, but as he explains it, the people of Isari have been less than hospitable. For reasons unknown, the villagers refuse to speak with him. The reason for their silence remains to be seen, but Lord Hien hopes they will be more forthcoming with information if you or Yugiri speak with them.","You learn of a woman named Kisei and her stepdaughter, who she claims was transformed not into a blasphemy, but a great kami known as Izanami. The villagers also confess a resentment towards Lord Hien for his failure to bring Yotsuyu to justice in their eyes. Satisfied with what you have learned, you reconvene with Yugiri and Lord Hien to share your findings.","Hien and Yugiri are incredulous at the suggestion that a woman of the village was transformed into anything but a blasphemy. Nevertheless, many people of Isari are firmly convinced. It has also been claimed that Kisei has the power to commune with the dead. Knowing she plans to demonstrate her powers at a nearby tavern, you and Yugiri go to bear witness firsthand.<br><br>To Yugiri's surprise, Kisei's display is quite compelling. After a young man finishes conversing with what all believe is his departed father, others raise their voices in desperation, begging to speak with their loved ones. Having seen enough, you return to Lord Hien to share what you observed.","You speak with Lord Hien of the assembly in the tavern, but before you can decide on your next move, a cry is heard in the distance. You run to render aid but arrive too late─the blasphemy has come and gone, leaving another victim in its wake. Kisei joins you soon after, an entourage of her followers in tow. She reaffirms her belief that her daughter has become a kami, and that she will redress the balance between the living and the dead.","Recent events in Isari weigh heavy on Lord Hien's mind. He invites you back to the Doman Enclave to discuss his next course of action.","Lord Hien is convinced the blasphemy is targeting those who were returned to Doma in the prisoner exchange. He intends to call together and move them to a secure location, that his hunt for the blasphemy may be carried out without fear of further tragedy.<br><br>※The next role quest will be available from Yugiri upon reaching level 87 in any physical ranged DPS class."],"objectives":["Search for Hien in Isari.","Gather information from the villagers.","Speak with Hien.","Speak with Hien at the Doman Enclave."],"dialogue":[{"name":"YUGIRI","text":"Ah, <span class=\"highlight\">Forename</span>. We have yet to ascertain the whereabouts of the blasphemy from Isari, but, for a blessing, we have received no reports of others that have turned."},{"name":"YUGIRI","text":"Lord Hien, for his part, has made a concerted effort to go about the villages and converse with his subjects directly. I suspect his constant presence has served to allay the peoples' fears."},{"name":"YUGIRI","text":"As one might expect, he has ever been dedicated and diligent, but I fear he has been away overlong."},{"name":"YUGIRI","text":"I thought to go and visit what should have been his last destination, Isari. Might I ask you to accompany me?  "},{"name":"YUGIRI","text":"Thank you. I am sure there is no cause for concern, but nevertheless, I should be glad to find him quickly."},{"name":"YUGIRI","text":"Thank goodness we found him. But why has he remained here so long, I wonder."},{"name":"HIEN","text":"<span class=\"highlight\">Forename</span>. Yugiri. My apologies if I gave you cause for concern. Assessing the state of affairs here in Isari has proven...difficult."},{"name":"HIEN","text":"To put it simply, the people─one and all─refuse to speak with me. They simply bow their heads and turn away at my approach."},{"name":"HIEN","text":"Knowing the blasphemy originated here, I cannot help but wonder if that has aught to do with their silence."},{"name":"HIEN","text":"Perhaps you could attempt to engage with the people in my stead? Surely they have no cause to deny the two of you."},{"name":"YUGIRI","text":"I should hope not. Nevertheless, I will don a disguise, lest I draw undue attention. Come, <span class=\"highlight\">Forename</span>. Let us see what we can discover."},{"name":"HIEN","text":"Thank you. Both of you."},{"name":"HIEN","text":"Do the people here not wish for the monstrosity to be laid low and for peace to reign once more? Why have they elected to behave in this manner?"},{"name":"UNCOUTHVILLAGER","text":"A blasphemy? You are mistaken, my friend. Our village was visited not by a monster, but a kami─Izanami!"},{"name":"UNCOUTHVILLAGER","text":"Where Lord Hien is cold and callous, She offers us boundless compassion and love."},{"name":"BURLYVILLAGER","text":"I owe a great debt to Lord Hien. If not for him, I would still be fighting under the imperial standard..."},{"name":"BURLYVILLAGER","text":"But the village suffered dearly under the occupation. What's more, our lord failed to punish the viceroy for her crimes, and failed to reunite many with their loved ones. I understand why some would think poorly of him, even if I do not."},{"name":"KINDLYVILLAGER","text":"Aye, that's right. The blasphemy was born of a young woman here in Isari. Tragic, really. Every day she prayed for the safe return of her husband, but it was not to be..."},{"name":"KINDLYVILLAGER","text":"If I am to be honest, I fear the loss drove her poor stepmother mad. Kisei has ever been a devout believer in the kami and their blessings, but she's somehow convinced herself that Minato has become one."},{"name":"KINDLYVILLAGER","text":"The delusions of a grieving parent, obviously, but an alarming number of people have come to share in her belief. Heresy is what it is."},{"name":"UNCOUTHVILLAGER","text":"Praise be to Izanami, goddess of creation and bringer of death!"},{"name":"BURLYVILLAGER","text":"Many villagers were heartbroken when they learned that their loved ones were not included in the prisoner exchange. Even so, I wish they would not lay all blame for that at the feet of Lord Hien."},{"name":"KINDLYVILLAGER","text":"The peoples' misplaced faith in this false Izanami worries me. Something must be done about this, and soon..."},{"name":"YUGIRI","text":"The situation here in Isari is...complicated, to say the least."},{"name":"HIEN","text":"I see... Little wonder they would refuse to confide in me. The belief held by some that this blasphemy is a kami, however, is quite concerning."},{"name":"HIEN","text":"Izanami presides over life and death. She gave birth to the nation of Doma, and ushers souls of the departed unto the land of the dead."},{"name":"HIEN","text":"I trust you understand what it would mean to deny them a source of hope in such dark times, even one such as this..."},{"name":"YUGIRI","text":"The villagers also claim this Kisei can speak with the dead. In fact, she will be holding a gathering to demonstrate her powers ere long."},{"name":"HIEN","text":"The perfect opportunity to gauge the extent of their fanaticism. Not for me, of course─my presence would draw undue attention. Might I ask you both to attend in my stead?"},{"name":"YUGIRI","text":"Her followers will be gathering in the tavern. Come."},{"name":"KISEI","text":"O spirits of Isari, I beseech you. Lend me your voice and let your presence be known. Cross the veil and be among us once more!"},{"name":"KISEI","text":"(-???-)...Akitsu."},{"name":"AKITSU","text":"Father...?"},{"name":"KISEI","text":"(-???-)Still tending the nets...like I taught you...?"},{"name":"AKITSU","text":"Y-Yes, Father! Every day. Thanks to you, we never want for fish. Our bellies are never empty."},{"name":"AKITSU","text":"I was...I am proud to be your son. I was always too embarrassed to tell you before, but..."},{"name":"KISEI","text":"(-???-)And I...am proud to have been your father... May you be ever blessed...by the sea's bounty."},{"name":"KISEI","text":"(-???-)Ugh...argh... It hurts..."},{"name":"AKITSU","text":"Father, what's wrong!?"},{"name":"KISEI","text":"He is in terrible pain, my child."},{"name":"KISEI","text":"Those who have cheated death's design yet live. It has disrupted the natural order, and the spirits suffer for it."},{"name":"AKITSU","text":"What must we do to ease their pain?"},{"name":"KISEI","text":"Fear not. Izanami shall put all to rights."},{"name":"KISEI","text":"She will claim the souls not long for this world and deliver them unto the hereafter. When Her work is finished, your father's spirit, and all the others, will find peace."},{"name":"TONBO","text":"Can you find my father? Can you help me speak with him?"},{"name":"VILLAGERA04121","text":"Kisei, Kisei! Can you commune with my husband?"},{"name":"VILLAGERB04121","text":"What about my family? Help me, Kisei, please!"},{"name":"YUGIRI","text":"She seemed convincing enough, but... Was that truly Akitsu's father that spoke through her?"},{"name":"HIEN","text":"So, is Kisei's ability all that she claims?"},{"name":"HIEN","text":"A young man spoke with his dearly departed father through her? I find that rather hard to believe..."},{"name":"YUGIRI","text":"Even so, those in attendance appeared quite convinced, my lord."},{"name":"HIEN","text":"And I suspect a great many of the villagers I've spoken with recently are as well."},{"name":"HIEN","text":"Everywhere I went, the people were in so much pain, and there was nothing I could do or say to give them solace."},{"name":"HIEN","text":"Yet for all their anguish, there has not been a single report of villagers turning since the incident with Tonbo's brother."},{"name":"HIEN","text":"Which can only mean word of Kisei and her ability to speak with the deceased has spread. The belief we can commune with our loved ones in death is a comfort far beyond my power to provide."},{"name":"HIEN","text":"Though I fail to see how the people would abide the kami claiming innocent lives to restore order..."},{"name":"VILLAGERC04121","text":"(-Terrified Villager-)She comes! Izanami!"},{"name":"HIEN","text":"The blasphemy!? Here?"},{"name":"VILLAGERC04121","text":"Lord Hien! The kami, sh-she appeared as if from nowhere, and in the next instant this poor man was...was..."},{"name":"HIEN","text":"So we were too late..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I spoke with him before in Isari!"},{"name":"A1","text":"Wasn't he one of the villagers returned in the prisoner exchange?"},{"name":"HIEN","text":"You recognize him, then?"},{"name":"HIEN","text":"Curious that he and the blasphemy's first victim were former conscripts. What could the fiend be after, I wonder?"},{"name":"KISEI","text":"(-???-)It does not become my lord to speak ill of the kami."},{"name":"KISEI","text":"I understand you are come to investigate the rumors of a monster born in our village. A blasphemy, you called it. But you are sorely mistaken."},{"name":"KISEI","text":"My stepdaughter, Minato, was chosen to serve as a vessel for Izanami. I witnessed her ascension with my own eyes."},{"name":"KISEI","text":"Minato, please!"},{"name":"MINATO","text":"I can't...I won't! There's no logic in it...no justice..."},{"name":"MINATO","text":"The witch of Doma spared, given a second chance...and my husband, condemned to die as a conscript..."},{"name":"MINATO","text":"I'll never know what became of him. Lord Hien can't give me even that. And when I look at the families he made whole, at their happiness...I feel the hole in my heart, the gaping wound that will never heal, begin to bleed..."},{"name":"MINATO","text":"Only at my beloved's side will I find peace."},{"name":"KISEI","text":"You mustn't lose faith, Minato. All will be well. Trust in the kami─in Izanami!"},{"name":"MINATO","text":"I...I want to believe...but..."},{"name":"KISEI","text":"Izanami is come to bring peace to the souls of the departed. To restore balance between their world and ours. Surely you would not dare defy the will of the kami?"},{"name":"HIEN","text":"This <span class=\"emphasis\">balance</span> you speak of has claimed the lives of two innocents but recently returned to us. I cannot─I will not─accept that the kami would condone such cruelty."},{"name":"KISEI","text":"No crueler than the sight of Yotsuyu free and forgiven, while my husband and son fought Garlemald's wars. Now dead and forgotten in a foreign land."},{"name":"KISEI","text":"With all due respect, Lord Hien, is it not your duty to protect Doma and her people? How are we to place our faith in the man who places the enemy's safety and well-being above that of his own subjects?"},{"name":"KISEI","text":"Only the kami are deserving of our adoration. As they have always been."},{"name":"YUGIRI","text":"Are you all right? For a moment you seemed unwell."},{"name":"HIEN","text":"The villagers are no doubt loath to ask it of me, but preparations must be made for burials and funeral rites. I can offer that much, at least..."},{"name":"HIEN","text":"You seemed distracted during our conversation with Kisei. Is something the matter?"},{"name":"HIEN","text":"...The Echo. And the blasphemy was indeed born of her stepdaughter..."},{"name":"HIEN","text":"To bear witness to such horror... How her mind must have struggled to comprehend what she saw."},{"name":"HIEN","text":"And as a woman of faith, perhaps her only surviving family becoming one with the divine was the only reality with which she could come to terms."},{"name":"HIEN","text":"I believe I know now what must be done. I but pray her fervor does not drive her to oppose us. Come, let us return to the enclave."},{"name":"YUGIRI","text":"What do you suppose Lord Hien intends to do?"},{"name":"HIEN","text":"From what you told me of your vision, the nature of Minato's despair, as well as the focus of her ire, is clear."},{"name":"HIEN","text":"'Tis plain she was a good-natured and kind-hearted woman, grieving for the loss of her husband."},{"name":"HIEN","text":"This loss alone may not have been enough to turn her, but my failure to hold Yotsuyu to account, together with the sight of other families reunited, compounded the turmoil in her broken heart."},{"name":"HIEN","text":"A path to despair paved by my good intentions. A truth that will weigh heavy on my conscience unto my dying day."},{"name":"HIEN","text":"Minato was prepared to die in sadness rather than live in hatred. If she could see the beast she has become, she would implore us to stop her."},{"name":"HIEN","text":"Which is why we must find the others who were returned to us in the prisoner exchange before they come to harm."},{"name":"HIEN","text":"Once their safety is assured, we may hunt down the blasphemy and bring a close to this tragedy."}],"reward":{"gil":1000},"reqs":{"jobs":[{"lvl":86,"id":189}],"quests":[69656]},"next":[69658]},"partials":[{"type":"npc","id":"1038458","obj":{"i":1038458,"n":"Yugiri","l":2813,"q":5}},{"type":"npc","id":"1038457","obj":{"i":1038457,"n":"Hien","l":2813,"q":5}},{"type":"quest","id":"69656","obj":{"i":69656,"n":"Seeds of Disquiet","g":187,"l":"Radz-at-Han","s":401,"f":1}},{"type":"quest","id":"69658","obj":{"i":69658,"n":"Home No Longer","g":187,"l":"The Doman Enclave","s":421,"f":1}}]}