{"quest":{"name":"To Calmer Seas","location":"Limsa Lominsa","id":69655,"patch":6.0,"sort":351,"icon":101092,"unlocksFunction":1,"eventIcon":71341,"issuer":1040166,"target":1040165,"genre":186,"journal":["The secretariat appears visibly dismayed.","While speaking with the secretariat at Maelstrom Command, you are interrupted by an incoming communication from Wheiskaet, who announces that his men have successfully tracked down the blasphemy and driven it into Sastasha Seagrot. With no time to waste, Merlwyb asks all parties to meet at the Drowning Wench to make ready for your final confrontation.","As you prepare to set sail, Merlwyb comforts the despondent Noll, assuring him that he will not have to bear the burden of ending his mother's life, as she once had to do with her father. The Admiral briefs all present on the plan of attack, and with nothing left to discuss, you set sail for Sastasha.","You arrive at the Seagrot in time to find Speaker Doww, or what remains of him after he was brutally mauled by his former mother and queen. The battle is joined, and this time you and your companions─aided by Lorens, who enters the fray somewhat late─succeed in defeating the blasphemy. With the beast at her mercy, Merlwyb fires the final bullet and puts it out of its misery once and for all. Two members of the Crushing Tide are present to witness the struggle, and are moved by your deeds and Merlwyb's words to put aside their hatred of the Lominsans and work towards peace. Your mission accomplished, you and your companions breathe a sigh of relief and prepare to sail home.","Back at the Wench, Lorens─now revealed to be none other than the Company's former commander─is accosted by his men, who are none too pleased with his penchant for vanishing when needed most. Eventually, tempers cool, and it comes time to relinquish your role of acting commander and bid farewell to your men.","With a few parting words, you formally dismiss each member of the Company of Heroes, thanking them for their service and sending them back whence they came. Lorens alone remains, ready to take his leave...","Lorens attempts to make a discreet retreat, but is accosted by Merlwyb, who chides him for leaving so suddenly five years ago. Nevertheless, she understands he had his reasons, and is forever grateful to the man she considers a brother in all but blood. Lorens brushes aside her kind words, stressing that she has shouldered a heavy burden for a long time─too long, perhaps...but she is her father's daughter, and Limsa Lominsa yet has need of her leadership. His part in the tale finished for now, Lorens wishes Merlwyb and you well and goes off on his own once more.","Though the events of the day weigh heavy on his heart, Noll is nevertheless able to take comfort in the knowledge that there is hope for peace between the Sahagin and the Lominsans. He resolves to return home with his newfound compatriots and do his part to persuade the remaining members of the Crushing Tide to renounce violence and work towards this common goal. The Sahagin take their leave, and only you and Merlwyb remain.","While the future is all but certain, Merlwyb is confident that with time and effort, the people of Limsa Lominsa can coexist with their neighbors, and vows to continue pursuing her dream of uniting all of Vylbrand as one great ship. Thanking you for all you have done, she expresses the wish that you might share an ale together one day when the storms have passed.","Back across the sea in Radz–at–Han, the Lominsan delegate is overjoyed to hear that the crisis in his homeland has passed. He expresses his gratitude for your efforts, and promises to share the news with the other nations, that they might take inspiration from your triumph."],"objectives":["Speak with Merlwyb.","Speak with Lorens.","Speak with Wheiskaet.","Speak with Landenel.","Speak with U'odh Nunh.","Speak with Shamani Lohmani.","Speak with Brayflox Alltalks.","Speak with Lorens.","Speak with Noll.","Speak with Merlwyb.","Speak with the Lominsan delegate in Sundrop."],"dialogue":[{"name":"LIMSASECRETARY","text":"Despite our best efforts, the blasphemy continues to elude us. For the time being, we─"},{"name":"LIMSASIGNALLER","text":"Sorry to interrupt, but I have an incoming communication from Wheiskaet!"},{"name":"WHEISKAET","text":"(-Wheiskaet-)Commander─we've snared ourselves a blasphemy!"},{"name":"WHEISKAET","text":"(-Wheiskaet-)We've our erstwhile companion Riol to thank. Knowing that the creature was once the Sahagin queen, he kept a close eye on the spawning grounds."},{"name":"WHEISKAET","text":"(-Wheiskaet-)Sure enough, he spied a massive black shadow moving beneath the water not long ago. After receiving word, Shamani Lohmani directed the Maelstrom warships in the vicinity to herd the beast with cannon fire into the Sastasha Seagrot."},{"name":"WHEISKAET","text":"(-Wheiskaet-)Isolated as the Seagrot is, we can engage our foe without putting smallfolk at risk. Any words for your men, Commander?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Company of Heroes...assemble!"},{"name":"A1","text":"The duty of the strong is to protect the weak!"},{"name":"LANDENEL","text":"(-Landenel-)You don't have to tell me twice! I've been aching for a rematch!"},{"name":"UODHNUNH","text":"(-U'odh Nunh-)Rush in blindly, and it will go as poorly for you as it did the first time."},{"name":"LANDENEL","text":"(-Landenel-)Hah! Knowing you, I'm sure you'll show up just in time to see me deal the killing blow!"},{"name":"SHAMANILOHMANI","text":"(-Shamani Lohmani-)Now, now...can we not save our vitriol for the quarry which I've lured to the perfect spot that is now waiting patiently for <span class=\"emphasis\">all of you</span> to put it out of its misery?"},{"name":"BRAYFLOX","text":"(-Brayflox-)Pshkohhh! Pshkohhh! Brayflox's gobbiebooms blast overbig blasphemy into bittypieces!"},{"name":"WHEISKAET","text":"(-Wheiskaet-)A motlier crew you'll never find, but we'll serve you well when the battle is joined, believe you me."},{"name":"MERLWYB","text":"(-Merlwyb-)This is Merlwyb. I will ready a warship at once. Assemble outside the Wench once you've all seen to your preparations."},{"name":"LIMSASECRETARY","text":"So, the time has come. I shall pray for your victory."},{"name":"MERLWYB","text":"Ah, <span class=\"highlight\">Forename</span>. The others should be along soon."},{"name":"MERLWYB","text":"The blasphemy is still contained within the Sastasha Seagrot. There it will meet its end, Navigator willing."},{"name":"NOLL","text":"Pshhh... Would that my brothers and I could join you in the fight. And yet, blasssphemous though it may be, that beast was once our mother."},{"name":"MERLWYB","text":"I understand, Noll. Forgive us for what we must do."},{"name":"MERLWYB","text":"Were there a means to reverse the transformation, we would do all in our power to bring your mother back. Sadly, there is nothing left of her to save."},{"name":"MERLWYB","text":"For the future of the Sahagin and Limsa Lominsa alike, the blasphemy must be laid to rest. And when the deed is done, I would bring your brothers─even the Crushing Tide─aboard the great ship we call Vylbrand."},{"name":"MERLWYB","text":"I do not want to slay your mother. But this thing she has become─a mindless beast who would enslave and kill her own─is an affront to the memory of who she was. It is not her─it is <span class=\"emphasis\">not</span>. Remember this always. You <span class=\"emphasis\">must</span>."},{"name":"MERLWYB","text":"I will not ask you to shoulder the burden of matricide."},{"name":"MERLWYB","text":"When the time comes to strike the final blow, I will do the deed."},{"name":"NOLL","text":"Pshhh... Admiral... All you say is true, and yet..."},{"name":"RIOL","text":"(-Riol-)Commander! I've sighted a group o' fishbacks─Crushin' Tide, most like─headin' straight for the Seagrot! Ye'd best make yer way here...and fast!"},{"name":"WHEISKAET","text":"Time to move out, then. Any words for your men before we set sail?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Don't go dying on me out there!"},{"name":"A2","text":"Today the blasphemy falls!"},{"name":"WHEISKAET","text":"Heh. Our new commander's sounding more and more like the old one."},{"name":"WHEISKAET","text":"You've grown into this role quite well, haven't you?"},{"name":"WHEISKAET","text":"But enough talk. It's time to show the realm that the Company of Heroes hasn't lost a step!"},{"name":"LANDENEL","text":"(-Company of Heroes-)Aye!"},{"name":"MERLWYB","text":"We'll stand a better chance of slipping past the Crushing Tide if we split up. <span class=\"highlight\">Forename</span> and I will go together, while the rest of you take a different route."},{"name":"MERLWYB","text":"Let us brook no further delay. To Sastasha!"},{"name":"LIMSASECRETARY","text":"That's it! I've finally remembered where I heard the name Lorens before. As I recall, he had quite the reputation in Limsa a few years ago, for all the wrong reasons..."},{"name":"LIMSASIGNALLER","text":"Admiral Bloefhiswyn awaits you at the Drowning Wench. Godsspeed!"},{"name":"DOWW","text":"Pshhh...! My queen! I beg of you, pray shhhow your loyal son mercy!"},{"name":"MERLWYB","text":"It's Doww...or what's left of him."},{"name":"RECONCILEDSAHAGINA04119","text":"(-Wizened Sahagin-)Pshhh...!? Ssspeaker Doww! Why would our queen do such a thing!?"},{"name":"RECONCILEDSAHAGINB04119","text":"(-Stalwart Sahagin-)It...it is as the shhhorewalkers say! What we thought a blessing is in truth a terrible curse!"},{"name":"RECONCILEDSAHAGINA04119","text":"(-Wizened Sahagin-)Pshhh! The horror! We mussst away at once!"},{"name":"RECONCILEDSAHAGINB04119","text":"(-Stalwart Sahagin-)And leave the shhhorewalkers to face our queen mother alone!? No...I will ssstand with them!"},{"name":"MERLWYB","text":"You mustn't sully your hands with the blood of your mother! Go and be with your kin! <span class=\"emphasis\">Go</span>!"},{"name":"RECONCILEDSAHAGINB04119","text":"(-Stalwart Sahagin-)Pshhh! F-Forgive me..."},{"name":"MERLWYB","text":"...I was beginning to think you wandered off a cliff, Lorens."},{"name":"LORENS","text":"Must ye say it like that? I prefer to think of myself as...fashionably late."},{"name":"LORENS","text":"But enough talk. It comes!"},{"name":"MERLWYB","text":"I will not ask for your forgiveness. But this I promise: you will be remembered for the mother you were."},{"name":"NOLL","text":"Pshhh... Admiral... I...I have no wordsss..."},{"name":"RECONCILEDSAHAGINA04119","text":"(-Wizened Sahagin-)Pshhh... Our queen mother returns to the depths in eternal ssslumber..."},{"name":"RECONCILEDSAHAGINA04119","text":"(-Wizened Old Sahagin-)With your strength, you could have crushhhed us easily. Why did you ssspare our lives?"},{"name":"MERLWYB","text":"The beasts and blasphemies are born from the despair in our hearts. But no more─I would break the cycle."},{"name":"MERLWYB","text":"Though Doww may have been blind to it, I believe in a future where Sahagin and Lominsan live in harmony."},{"name":"MERLWYB","text":"Even after losing who she was, your queen made for your spawning grounds. And it is there she drew her last breath..."},{"name":"MERLWYB","text":"When your next queen is crowned, know that she will have a safe place to raise her young. Once you have selected a suitable location, Limsa Lominsa will recognize and honor your claim."},{"name":"NOLL","text":"A promise for which we are grateful, Admiral, but what of the other peoples of Vylbrand?"},{"name":"MERLWYB","text":"The kobolds are open to the idea. The details will need to be negotiated, but I am confident we can reach an agreement."},{"name":"MERLWYB","text":"Sahagin, kobold, and Lominsan alike yearn to abide in peace. We can make it so."},{"name":"RECONCILEDSAHAGINB04119","text":"(-Stalwart Sahagin-)Pshhh... I have never fought alongside shorewalkers before, but I mussst say...it felt good."},{"name":"NOLL","text":"We have fought our neighbors for generations. It has won us only suffering and tragedy. I beg of you─lay down your ssspears."},{"name":"RECONCILEDSAHAGINB04119","text":"(-Stalwart Sahagin-)Pshhh..."},{"name":"MERLWYB","text":"'Twill take time and effort to bridge the gulf between our peoples. But bridge it we shall."},{"name":"LANDENEL","text":"I daresay <span class=\"emphasis\">we</span> have a lot of talking to do as well. Don't we, <span class=\"emphasis\">Commander</span> Lorens?"},{"name":"LORENS","text":"Ah, Landenel. If ye'd just allow me to explain..."},{"name":"MERLWYB","text":"Let's be off before they drag us into this mess..."},{"name":"LORENS","text":"Perfect timin', Actin' Commander! Ye must save me from this bloodthirsty bastard!"},{"name":"LANDENEL","text":"Well, Lorens? Let's hear your excuse─and it had better be a good one. Why in the seven hells were you skulking about in the shadows while we did all the dirty work!?"},{"name":"LORENS","text":"Hah! Like you lot'd be any happier if I'd showed myself sooner! I can hear yer whingin' now. “What, ye didn't think we could 'andle this on our own?”"},{"name":"LANDENEL","text":"Aye, I'd be bloody furious regardless! Don't think I've forgotten what happened─or rather <span class=\"emphasis\">didn't</span> happen─on the day of our duel!"},{"name":"LANDENEL","text":"Even though the future of the Company hung in the balance, I waited, and waited, and waited some godsdamned more, and still you never turned up! But I've got you now, and I will have satisfaction!"},{"name":"UODHNUNH","text":"Given Lorens's penchant for late arrivals, I couldn't help but worry too. To say he cut it fine would be an understatement."},{"name":"SHAMANILOHMANI","text":"And not by choice, as usual. My scouts observed him roaming near Costa del Sol not long ago. It would seem our commander's woeful sense of direction has not improved in the least."},{"name":"SHAMANILOHMANI","text":"I'm honestly surprised you never realized, Landenel, that that was to blame for his extreme tardiness. That the commander did indeed arrive at the agreed upon location for your duel...after the sun had risen and set a half dozen times."},{"name":"LORENS","text":"Navigator take me! Shamani, ye promised that would stay between the two of us... Ah, Brayflox! You have a kind word or two for yer ol' commander, don't ye?"},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh... Commander Lorens, commander no more. New commander, friend to gobbies everywhere! Does many sweatworks for gobbiekind!"},{"name":"LANDENEL","text":"Heh...and there I thought you were too much of a coward to face me in battle."},{"name":"LORENS","text":"Come now, Landenel. Ye know me better than─"},{"name":"LANDENEL","text":"Then it's settled─we fight here and now! On your guard!"},{"name":"LORENS","text":"P-Put that thing down, I say! Ye could hurt someone with that!"},{"name":"WHEISKAET","text":"Hard to believe he was once the glue that held this merry band together. That's right─if you hadn't yet realized the obvious, Lorens is our former commander. Forgive me for not stating it plainly sooner─I didn't want you to think we doubted your leadership."},{"name":"WHEISKAET","text":"He's got his quirks, but as you saw, he's a force of nature on the battlefield."},{"name":"WHEISKAET","text":"Anyhow, I think we can all say your stint as acting commander has been a rousing success. Now, I reckon it's about time you gave your final order."},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh... Company of Heroes bandbreak once more? Brayflox never liked parting with gobbiefriends..."},{"name":"LANDENEL","text":"Hear, hear. I may have my complaints, but when we're together, a good fight's never far away!"},{"name":"LORENS","text":"Ye hardly need a company or commander to get you that. And should Limsa again be imperiled, there's nothin' stoppin' us from risin' to the occasion."},{"name":"LORENS","text":"Till then, yer all strong enough in your own right. Why not serve the weak in yer own ways?"},{"name":"MERLWYB","text":"At last...it's over. We can take pride in the respite we've won, but we must never forget those who could not be here with us to enjoy it."},{"name":"WHEISKAET","text":"Ho there! Good to see our acting commander hale and hearty."},{"name":"LANDENEL","text":"Who invited this bloody bastard, anyway!?"},{"name":"UODHNUNH","text":"I daresay that blasphemy was the most forrrmidable foe our company has ever faced. I must further hone my skills, lest the next enemy prove too tough for us to handle."},{"name":"SHAMANILOHMANI","text":"Wondering where I was during the battle? Well, I wasn't slacking off, if that's what you're implying! My duty was to protect the ship to ensure our safe return. Truly!"},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh... Fighting with gobbiefriends gives Brayflox goodfeels!"},{"name":"NOLL","text":"Pshhh... Forgive usss for what we have done, Queen Mother..."},{"name":"RECONCILEDSAHAGINB04119","text":"(-Stalwart Sahagin-)Pshhh... Why did we ever believe that monstrosssity was a blessing? What fools we were..."},{"name":"WHEISKAET","text":"You've had quite the turn of duty, but all good things must come to an end. Any parting words before we go our separate ways?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Let the Company of Heroes be disbanded!"},{"name":"A3","text":"Give Gegeruju my best regards!"},{"name":"WHEISKAET","text":"Heh, finally, I can enjoy some semblance of peace again. At least, as much peace as a man can enjoy waiting hand and foot on the lord of Costa del Sol..."},{"name":"WHEISKAET","text":"It may have been rough sailing at times, but I rather enjoyed serving under you...Acting Commander <span class=\"highlight\">Forename</span>."},{"name":"LANDENEL","text":"Well? If you've something to say, let's hear it!"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"Let the Company of Heroes be disbanded!"},{"name":"A4","text":"Return to the Wailers and keep the murdering to a minimum!"},{"name":"LANDENEL","text":"Hah! As if I needed you to tell me. While I enjoyed the diversion, I know as well as any that my true place is in Gridania leading a respectable life."},{"name":"LANDENEL","text":"You may not have been the perfect commander, but Twelve as my witness, I hope to fight by your side again. Farewell."},{"name":"UODHNUNH","text":"I await your orrrders, Commander."},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"Let the Company of Heroes be disbanded!"},{"name":"A5","text":"Look after the U, brrrave nunh."},{"name":"UODHNUNH","text":"Aye, I have rrresponsibilities. A tribe that wants for my guidance and prrrotection. I can ill afford to tarry here much longer."},{"name":"UODHNUNH","text":"Nevertheless, it is with some rrregret that I take my leave. For all their faults─of which they have many─they arrre my companions. And I will miss them."},{"name":"SHAMANILOHMANI","text":"Well? Let's hear it, Commander!"},{"name":"Q6","text":"What will you say?"},{"name":"A6","text":"Let the Company of Heroes be disbanded!"},{"name":"A6","text":"You owe me a bottle of your finest Bacchus."},{"name":"SHAMANILOHMANI","text":"Indeed, indeed. I mean to return to Wineport as soon as I've tied up a few final loose ends here."},{"name":"SHAMANILOHMANI","text":"Speaking of wine, I've always preferred the older vintages. Left to sleep in their barrels for many a summer, they come out tasting better than ever. One might say the same about our own company."},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh... Brayflox wants busywork! Brayflox awaits uplander's lipflaps!"},{"name":"Q7","text":"What will you say?"},{"name":"A7","text":"Let the Company of Heroes be disbanded!"},{"name":"A7","text":"No more cheese wars. <span class=\"emphasis\">Please</span>."},{"name":"BRAYFLOX","text":"Pshhh... Shkohhh... Brayflox feels heavyheart, but accepts uplander's bossywords."},{"name":"BRAYFLOX","text":"Brayflox had goodtimes and happyfeels with gobbiefriends. But goodtimes will come again─and when they do, new boomsticks will bring blastydoom with much fastness!"},{"name":"LORENS","text":"It's time for ye to do what I once did: give yer men their final orders, and send them on their way."},{"name":"LORENS","text":"And on that note, I ought to be on my way..."},{"name":"MERLWYB","text":"Slipping away again, are we? You are a creature of habit."},{"name":"MERLWYB","text":"I resented you for it at the time, you know. But I think I understand now. Better to shun fame and not serve as an example for glory-seekers too eager to fight and too quick to die."},{"name":"LORENS","text":"Yer overthinkin' it. I'm a creature of <span class=\"emphasis\">whimsy</span>─a man who lets the tailwind carry him where it will. But more importantly, this new age belongs to the new blood. I've had my day in the sun."},{"name":"LORENS","text":"If ye succeed in brokerin' peace with the beastmen, there'll be no need to worry about primals─and the Company can go into permanent retirement. And then I can say I did right by the old man."},{"name":"MERLWYB","text":"If you hadn't been there for us both, I don't know if I could've pulled the trigger..."},{"name":"MERLWYB","text":"Thank you, Lorens. Brother."},{"name":"LORENS","text":"Bah...I did nothin'. It was <span class=\"emphasis\">you</span> who shouldered Captain Bloefhis's burden─and that of the entire League."},{"name":"LORENS","text":"...I'm sorry, Merlwyb. I know it hasn't been easy for you."},{"name":"LORENS","text":"But I daresay ye've worked hard enough. Maybe us Company folk aren't the only ones in need of a retirement... Ah, but I've said too much."},{"name":"MERLWYB","text":"Lorens holding his tongue? Gods, you <span class=\"emphasis\">have</span> changed. But yes. My greatest test as Admiral still lies ahead, as we steer the great ship Vylbrand towards a new future."},{"name":"LORENS","text":"Heh...you truly are yer father's daughter."},{"name":"LORENS","text":"I owe you my thanks, too. Daresay ye did almost as good a job keepin' my men to task as I could have done."},{"name":"LORENS","text":"Call it a hunch, but somethin' tells me our paths may cross again. But forgive me if I carry on like I've never seen ye before. Not unlike my ol' friend Mistbeard, I prefer to keep my past...in the past."},{"name":"LORENS","text":"And with that, I'm off. Take care of yerselves."},{"name":"NOLL","text":"Pshhh... The blasssphemy is no more, but we will never know lasting peace until the Crushhhing Tide agrees to lay down their arms."},{"name":"NOLL","text":"It will be a daunting tasssk, but as we saw in Sastasha, they are not beyond reason."},{"name":"NOLL","text":"I will do all in my power to see that your efforts─and the sacrifices of my brothers─were not in vain."},{"name":"RECONCILEDSAHAGINB04119","text":"Pshhh... Forgive usss. Even after being freed from falssse god's thrall, still we clung to our hateful beliefsss."},{"name":"RECONCILEDSAHAGINB04119","text":"It was easier to hearken to Ssspeaker Doww's every word and turn a blind eye to the harshhh truth. Easier and cowardly."},{"name":"RECONCILEDSAHAGINB04119","text":"I will return and ssspeak with my brothers of the Crushing Tide. I will tell them of our queen mother's sssacrifice, and the vision of hope you have shhhared with us. I ask only that you give us time, and trussst us to make our own decision."},{"name":"NOLL","text":"You have my word. If you would not be averssse, let us return to the spawning grounds together."},{"name":"NOLL","text":"...Adventurer. I have no words to expresss my gratitude to you. I will repay you the only way I know how─by doing my part to ushhher in an age where shorewalker and Sahagin ssstand as one."},{"name":"MERLWYB","text":"Just us now, it would seem."},{"name":"MERLWYB","text":"Ever since we achieved a measure of peace with the kobolds, I prayed that this day would come."},{"name":"MERLWYB","text":"Though it is, of course, only a beginning. Negotiations must be held─and words exchanged in earnest will invariably lead to flared tempers and bruised egos. But such things always accompany meaningful progress."},{"name":"MERLWYB","text":"The history of Vylbrand is one of bloodshed, but we have the power to change our ways."},{"name":"MERLWYB","text":"After all, it is clear we are united more by our similarities than we are divided by our differences."},{"name":"MERLWYB","text":"I will share what I have seen of the Sahagin with my fellow Lominsans, and listen closely to their doubts and concerns."},{"name":"MERLWYB","text":"For it must be a harmony not foisted upon them from above, but one which they aspire to of their own free will. No doubt, Noll and his brothers feel the same."},{"name":"MERLWYB","text":"Again, you have come to Limsa's aid─<span class=\"emphasis\">my</span> aid─at a time we needed it most."},{"name":"MERLWYB","text":"When we next meet, I hope 'twill not be as Admiral and adventurer, but as friends. Mayhap trading war stories over ales at the Wench."},{"name":"MERLWYB","text":"But for now, I must return to my duties. Drafting reports and decrees is hardly the most exciting part of my role, but it is a necessary one."},{"name":"MERLWYB","text":"If you happen to pass through Radz–at–Han, pray share your exploits with our delegate there. Doubtless he will be interested to hear your firsthand account."},{"name":"MERLWYB","text":"One day I will lay down these muskets of mine for good. But not yet, Father. Not yet..."},{"name":"LIMSARESIDENTOFFICIAL","text":"<span class=\"highlight\">Forename</span>! You return. Pray tell, what news from my homeland?"},{"name":"LIMSARESIDENTOFFICIAL","text":"Extraordinary... And a chance at peace with the Sahagin? These are heartening tidings, indeed."},{"name":"LIMSARESIDENTOFFICIAL","text":"Without a doubt, you have helped to dispel the pall of despair that once hung over all Vylbrand. Our people now bask in newfound hope."},{"name":"LIMSARESIDENTOFFICIAL","text":"I must share the news with the others. Full glad will they be to hear that the threat to Limsa Lominsa is no more. Thank you again, my friend!"},{"name":"SYSTEM","text":"You can now dye the job-specific gear for level 90 melee DPS."},{"name":"SYSTEM","text":"Job-specific gear will become available once you have fulfilled certain conditions within the main scenario quests for Endwalker."}],"reward":{"gil":2000,"items":[{"num":2,"id":33919},{"num":2,"id":33920},{"num":2,"id":33918}]},"reqs":{"jobs":[{"lvl":90,"id":188}],"quests":[69654]}},"partials":[{"type":"npc","id":"1040166","obj":{"i":1040166,"n":"Maelstrom Secretariat","l":28,"q":5}},{"type":"npc","id":"1040165","obj":{"i":1040165,"n":"Lominsan Delegate","l":3707,"q":2}},{"type":"item","id":"33919","obj":{"i":33919,"n":"Savage Aim Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Critical Hit","category":0}}},{"type":"item","id":"33920","obj":{"i":33920,"n":"Savage Might Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Determination","category":0}}},{"type":"item","id":"33918","obj":{"i":33918,"n":"Heavens' Eye Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Direct Hit Rate","category":0}}},{"type":"quest","id":"69654","obj":{"i":69654,"n":"Out of the Shadows","g":186,"l":"Limsa Lominsa","s":341,"f":1}}]}