{"quest":{"name":"O Mighty Fury, Guide Us to Victory","location":"Ishgard","id":69666,"patch":6.0,"sort":541,"icon":101094,"unlocksFunction":1,"eventIcon":71341,"issuer":1037016,"target":1037015,"genre":188,"journal":["The set of Artoirel's jaw betrays a hint of anxiety.","With an air of solemnity, Artoirel informs you that the ecumenical council will soon be held. This council, he explains, is the highest assembly in the Ishgardian Orthodox Church, where participants gather to deliberate and decide upon changes to church doctrine. Traditionally, only the archbishop and the members of the Synod sit in attendance, but on this occasion the doors will be thrown open to the general public. While Artoirel and Clem go on ahead to the Vault, you are tasked with fetching Aymeric, who has headed to the Last Vigil to gather his thoughts ahead of this momentous event.","You find Aymeric deep in thought, pondering the difficult choices he has made, and what he must do in order to build a united Ishgard for one and all. With the appointed hour nigh, he suggests that you begin making your way to the Vault together.","You begin walking with Aymeric to the Vault, and at his behest first head to Fortemps Manor.<br><br>※You must be accompanied by Aymeric to complete this task. Speak with him again at the Last Vigil should you become separated.","Standing before Fortemps Manor, Aymeric fondly recalls your time as wards of House Fortemps, and thanks you again for the many changes you set in motion by coming to Ishgard. You then set out once more, next making for the Architects.","Pausing at the Architects, Aymeric reflects upon the crimes of the founding fathers. If Ishgard is to forge a new future, he declares, it must decide how it will confront its complicated past. His musings thus concluded, the two of you continue on to join Clem at the Vault.","Thus does the ecumenical council commence─the first in generations and first ever with the general public in attendance. Friction is initially evident between opposing factions of the clergy, but thanks to your companions' sage mediation and guidance, they are able to find common ground. In renewing their commitment to their shared faith in Halone and acknowledging the mistakes of the past, the church shall take its first step towards reform, that it might again serve as a beacon of hope for the people.<br><br>※In the event that you leave the strategy room, you may re-enter by speaking with the Temple Knight guard at the Congregation of Our Knights Most Heavenly.","Back at the Congregation, you and your companions share your relief at the success of the council. Now that the church has seemingly weathered the worst of this crisis, you may turn your attention wholly upon the task of dealing with Profane Fafnir.<br><br>※The next role quest will be available from Artoirel upon reaching level 90 in any magical ranged DPS class."],"objectives":["Speak with Aymeric at the Last Vigil.","Speak with Aymeric and have him accompany you.","Accompany Aymeric to Fortemps Manor and then speak with him.","Accompany Aymeric to the Architects and then speak with him.","Speak with Clem while accompanied by Aymeric.","Speak with Aymeric in the strategy room."],"dialogue":[{"name":"ARTOIREL","text":"Ah, <span class=\"highlight\">Forename</span>. Owing to Lord Aymeric's swift action, I am pleased to say that the ecumenical council will soon be held."},{"name":"ARTOIREL","text":"In case you are unaware, the council is the highest assembly in the Ishgardian Orthodox Church, its purpose to deliberate and decide upon doctrine."},{"name":"ARTOIREL","text":"The previous one was held no less than eighty years ago, and four archbishops have since come and gone. As such, most Ishgardians know little of it save that which they have read in the historical records."},{"name":"ARTOIREL","text":"Traditionally, the archbishop and members of the Synod would meet behind closed doors. In light of Bishop Vartinoix's fate, however, this time the doors will be thrown open to the public."},{"name":"CLEM","text":"Indeed. For the first time in history, all men and women of the faith may have a hand in shaping the mission and the teachings of the church."},{"name":"CLEM","text":"'Tis my hope that you will also join us in this endeavor."},{"name":"ARTOIREL","text":"Deacon Clem, allow me to express our gratitude for your efforts in facilitating the council. We appreciate the difficulty of your position."},{"name":"CLEM","text":"I merely heed my conscience and my faith, my lord."},{"name":"CLEM","text":"Acting in Bishop Vartinoix's stead, I shall do all within my power to see that the church may serve the people once more."},{"name":"CLEM","text":"Where is the lord speaker, if I may ask?"},{"name":"ARTOIREL","text":"He stepped outside for a moment, saying that he wished to gather his thoughts ahead of the council. The hour draws nigh, however..."},{"name":"ARTOIREL","text":"<span class=\"highlight\">Forename</span>─I shall proceed to the Vault with the good deacon. In the meantime, may I ask you to find Lord Aymeric? He should be at the Last Vigil, I believe."},{"name":"AYMERIC","text":"Oh, 'tis you, my friend. Is it time already?"},{"name":"AYMERIC","text":"I see... My apologies for making you come and fetch me."},{"name":"AYMERIC","text":"I have been thinking, <span class=\"highlight\">Forename</span>. On the path I have chosen to walk, and on those who have been left behind as a consequence of my actions."},{"name":"AYMERIC","text":"Those who died fighting... Those burdened with boundless grief... Those deprived of position and purpose..."},{"name":"AYMERIC","text":"Like any nation, Ishgard is made up of disparate souls with disparate beliefs. Without an enemy to unite us, we recall the differences we once set aside out of necessity, and find amongst our old friends new ideological foes."},{"name":"AYMERIC","text":"The future I had envisioned... 'Tis far more difficult to secure than I ever imagined."},{"name":"AYMERIC","text":"What must I do for our people to live in harmony? For our nation to move forward as one?"},{"name":"AYMERIC","text":"Such questions I have been pondering..."},{"name":"AYMERIC","text":"We should begin making our way to the council. Shall we continue our conversation while we walk?"},{"name":"AYMERIC","text":"Ready? Then let us be off."},{"name":"AYMERIC","text":"If it is agreeable, I would like to look on Fortemps Manor."},{"name":"Q1","text":"To be deleted."},{"name":"SYSTEM","text":"Aymeric is now accompanying you. Keep him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Aymeric behind by entering a different area, or by speaking with him and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Aymeric accompany you again, return and speak with him at the original location."},{"name":"SYSTEM","text":"You must be accompanied by Aymeric and have him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"Aymeric has yet to arrive. Be sure he is at your side before attempting to continue."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Speak with Aymeric."},{"name":"A1","text":"Part ways with Aymeric."},{"name":"A1","text":"Nothing."},{"name":"AYMERIC","text":"Though we haven't much time, I am glad for the opportunity to stroll about the city with you."},{"name":"SYSTEM","text":"Are you sure you wish to part ways with Aymeric?"},{"name":"AYMERIC","text":"Have business to attend to before the council, do you? Very well. Perhaps I shall take a moment more to compose myself..."},{"name":"AYMERIC","text":"Ready for the council? Then let us make our way to the Vault."},{"name":"AYMERIC","text":"It feels like another age that you and yours were no more than foreign wards of House Fortemps. And in actual fact, it may be considered so."},{"name":"AYMERIC","text":"For your coming set in motion a chain of events that brought an end to the Dragonsong War, ushering in a new age of harmony."},{"name":"AYMERIC","text":"You paved the way for meaningful change in our nation, and for that you shall ever have my gratitude."},{"name":"AYMERIC","text":"Now then, shall we continue on to the Architects?"},{"name":"AYMERIC","text":"King Thordan and his knights twelve. The murderers of Ratatoskr... Since the truth of their ancient crime came to light, many have demanded that these images be torn down."},{"name":"AYMERIC","text":"Yet though what our founding fathers did was wrong, neither is it right to simply expunge them and their deeds from history. To do so would be to deny our people's part in what followed for a thousand years."},{"name":"AYMERIC","text":"We have the chance to forge a new future, but we, as a nation, must decide how we will confront our past..."},{"name":"AYMERIC","text":"...Forgive me, I was lost in thought yet again. Let us join Deacon Clem at the Vault."},{"name":"CLEM","text":"Oh, is Lord Aymeric not with you? I was under the impression that you would be coming together..."},{"name":"CLEM","text":"There is still some time before the council convenes. If you have other matters you must attend to first, you may yet see to them."},{"name":"CLEM","text":"There you are, my friends. The council is about to convene. Let us take our place in the audience hall."},{"name":"AYMERIC","text":"Esteemed members of the clergy and honored adherents of the faith. I thank you all for your attendance."},{"name":"AYMERIC","text":"In recent days, our nation has been racked by a series of tragedies: those among us who do Halone's work have been transformed into abominations."},{"name":"AYMERIC","text":"This dreadful phenomenon has been brought about by the Final Days, and it is upon our despair and anguish that it feeds. Thus, if we are to prevent further tragedy, we must strive to ensure that all Ishgardians, clergymen and citizens alike, abide with peace and love for one another in their hearts."},{"name":"AYMERIC","text":"To that end have I called this ecumenical council, the first in generations, that we might together determine a path forward for the church and our society as a whole."},{"name":"CLEM","text":"Since antiquity, the Ishgardian Orthodox Church served the people in two respects: as the Fury's spear to strike at the heart of dragonkind, and as the Fury's shield to safeguard the souls of men."},{"name":"CLEM","text":"But now that we are at peace with the Dravanians, the church need no longer serve as the spear. And so we must now reconsider how we might better serve as a shield for our brethren."},{"name":"CLERGYMANA04131","text":"The hierarchy must be reformed, and for that we need accountability. The upper echelon must be stripped of rank at a minimum, and investigations conducted─trials held, if the evidence is sufficiently damning. And then we may turn our attention to their doctrine of lies."},{"name":"CLERGYMANB04131","text":"As our predecessors did before us, we of the Synod have ever sought to interpret the scriptures to the best of our ability, and thence conveyed Halone's will to the people."},{"name":"CLERGYMANB04131","text":"Such fervent pursuit of retribution at the expense of doctrine would come also at the expense of our faith."},{"name":"ISHGARDIAN04131","text":"Have we won the war to lose our souls? O Halone, are we outside Your grace?"},{"name":"ARTOIREL","text":"This bodes ill... At this rate, someone might turn..."},{"name":"AYMERIC","text":"Since the war's end, the church and the faithful have stood at a crossroads, unable to take the next step forward."},{"name":"AYMERIC","text":"His Grace Bishop Vartinoix─may he walk in Halone's halls─was one such soul, and in his longing for simpler times, he resorted to using forbidden magicks. He succumbed to despair."},{"name":"AYMERIC","text":"In our minds we renounce the lies upon which our nation was built, but in our hearts we yearn for the righteousness─misguided though it was─that gave us comfort and purpose for so long."},{"name":"AYMERIC","text":"So let us not forget who we were."},{"name":"AYMERIC","text":"Let us confront the mistakes of the past and learn from them, that we do not repeat the mistakes of our forefathers."},{"name":"CLEM","text":"As fervently as we believed in our sacred duty, we struggle to accept the church's deception and embrace change."},{"name":"CLEM","text":"The legacy of Thordan weighs heavy, and there is the temptation to simply cast it aside like a mantle that suits us no longer."},{"name":"CLEM","text":"Yet that would dishonor the sacrifice of those who went before. Countless souls who served the people with purest intent. And so, heavy though it may be, let us together bear this burden as we set forth anew."},{"name":"ARTOIREL","text":"Our friend <span class=\"highlight\">Forename</span> risked life and limb to reveal the truth to us. The truth that our legends and our scripture were tainted by betrayal. But not wholly corrupted."},{"name":"ARTOIREL","text":"Though the great walls and towering spires of our city may have been built with murder and deception, they rest upon a foundation immutable and true: our devotion to Halone, whom we have worshipped since before our forefathers settled these lands."},{"name":"ARTOIREL","text":"The church is a font of practical wisdom, and its teachings guide us in our daily lives. Such things define our faith no less than the lies. We can acknowledge our sins without renouncing our religion."},{"name":"CLERGYMANA04131","text":"Aye...and without rejecting who we are..."},{"name":"CLERGYMANB04131","text":"A comprehensive review of scripture as well as historical literature will be necessary. Revisions, as appropriate, must be made to ensure that the truth of our past is preserved for future generations."},{"name":"GERRALDIEUX","text":"With your peerless knowledge of church doctrine, I daresay none is better suited to leading that effort than you."},{"name":"GERRALDIEUX","text":"I also expect that many eyes will be required to pore over all the tomes. And I know many idle men and women of faith who would jump at the chance to do Halone's work once more."},{"name":"AYMERIC","text":"That day so very long ago, I had no answer to my father's words. But it seems the people had it within them all along."},{"name":"ARTOIREL","text":"'Tis well Lord Aymeric interjected when he did."},{"name":"CLEM","text":"With this, the church and the people have taken their first step towards a brighter future."},{"name":"AYMERIC","text":"The council went better than I had dared hope."},{"name":"ARTOIREL","text":"Truly. While the details remain to be decided, 'twas a resounding success."},{"name":"CLEM","text":"Your words helped everyone to find common ground. I know not how to thank you."},{"name":"AYMERIC","text":"Much credit must go to <span class=\"highlight\">Forename</span>. In the face of great hardship, never did <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> hesitate to press on, and our people have not forgotten this."},{"name":"CLEM","text":"Indeed. Well do I remember the day you flew into Ishgard upon a dragon's back. In making possible the impossible, you inspired us all."},{"name":"CLEM","text":"In you we glimpse the Fury, a vision of courage in the face of uncertainty. Looking to your example, we shall endeavor to bring about change to the church─for the future of all Ishgardians."},{"name":"CLEM","text":"There will, of course, still be those souls who struggle to rise above the mire of despair. But my fellows and I shall be there to take their hand in faith and love."},{"name":"CLEM","text":"For what is faith if not salvation?"},{"name":"CLEM","text":"Well, I had best return to the cathedral. We have much and more to do!"},{"name":"CLEM","text":"Ah, but ere I forget─I have tracked down that which you requested. Some repairs will be necessary, but it will be seen to with all haste."},{"name":"ARTOIREL","text":"To be deleted."},{"name":"AYMERIC","text":"I had tasked the deacon with finding a certain item, you see─a secret weapon, one might say. Given what we know of Profane Fafnir, I suspect it will be of great use in our hunt."},{"name":"AYMERIC","text":"Once the repairs are complete, we shall be ready to strike."},{"name":"ARTOIREL","text":"With the church having reached an accord with the people, the risk of more clergymen turning is greatly diminished. We may now focus entirely on the blasphemy."},{"name":"AYMERIC","text":"'Tis time we freed Vaindreau from his torment. Rest while you can, <span class=\"highlight\">Forename</span>, for I daresay the coming battle will demand the best of us."},{"name":"CASTERGATEKEEPER","text":"Heading to the strategy room? I should be glad to show you in."},{"name":"SYSTEM","text":"Proceed to the strategy room?"}],"reward":{"gil":1000,"items":[{"id":36057}]},"reqs":{"jobs":[{"lvl":89,"id":190}],"quests":[69665]},"next":[69667]},"partials":[{"type":"npc","id":"1037016","obj":{"i":1037016,"n":"Artoirel","l":4023,"q":6}},{"type":"npc","id":"1037015","obj":{"i":1037015,"n":"Aymeric","l":4023,"q":2}},{"type":"item","id":"36057","obj":{"i":36057,"n":"Coconut Cod Chowder","l":545,"c":24105,"t":46}},{"type":"quest","id":"69665","obj":{"i":69665,"n":"Wills Unending, Faith Unbending","g":188,"l":"Ishgard","s":531,"f":1}},{"type":"quest","id":"69667","obj":{"i":69667,"n":"Ever March Heavensward","g":188,"l":"Ishgard","s":551,"f":1}}]}