{"quest":{"name":"The Dormant Dhyata","location":"Old Sharlayan","id":69669,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1039203,"target":1039203,"genre":173,"journal":["Rurusha is raring to get started.","Rurusha has tasked you with crafting gold plating for the relic.<br><br>※Minimum collectability rating for this delivery is 110. Delivering items with a rating of 220 or more will earn greater rewards.","You deliver the sets of gold plating to Rurusha. With the relic's exterior sorted out, she asks that you let her know when you are up to the task of working on its insides."],"objectives":["Deliver the sets of gold plating to Rurusha."],"dialogue":[{"name":"RURUSHA","text":"Ah, hello again, <span class=\"highlight\">Forename</span>. Are you ready to begin?"},{"name":"RURUSHA","text":"Wonderful to hear! I'd like you to start by crafting gold plating. You needn't worry about fitting it to the relic, though. I will handle that."},{"name":"SYSTEM","text":"You may now undertake deliveries for the Faculty of Archaeology at the Studium. By delivering the requested items to Rurusha and raising yourself in her esteem, you can advance the story of her efforts to restore the relic."},{"name":"BORIC","text":"You know, there's lots of unsavory characters out there who make a living stealing relics made of silver and gold from archaeological sites, selling them on to art dealers and collectors... How much do you suppose the Golden Dhyata is worth?"},{"name":"RURUSHA","text":"Pray, let me know when you've made the plating."},{"name":"RURUSHA","text":"Great work! I can't wait to spruce up the old girl."},{"name":"RURUSHA","text":"Great work! I can see you're a fine <span class=\"alternative-container\"><span class=\"alternative\">craftswoman</span><span class=\"alternative\">craftsman</span></span> indeed. Thank the gods for sending you our way."},{"name":"SYSTEM","text":"In making your first successful delivery, you have begun to earn Rurusha's trust."},{"name":"SYSTEM","text":"Deliver the items Rurusha needs, and deliver them often to improve your standing with the Faculty of Archaeology!"},{"name":"RURUSHA","text":"Truly, splendid work. Our little friend is looking much better already."},{"name":"RURUSHA","text":"&lt;sniff&gt; Oh, it feels like watching my own child growing up. That you are here to help means more than you know."},{"name":"BORIC","text":"I am glad to see you in such high spirits, Professor. Truly, I am. But is it really wise for us to use the entirety of our remaining budget on this project?"},{"name":"RURUSHA","text":"Oh, Boric. Lighten up! Have I ever steered you wrong in the past?"},{"name":"BORIC","text":"Well, I suppose not... Even so, you must forgive me if I feel uneasy seeing our coffers so thoroughly emptied."},{"name":"RURUSHA","text":"Better that the money is used than left to gather dust, I say."},{"name":"BORIC","text":"While I do agree that being miserly serves little purpose, the opposite extreme may not be the best approach."},{"name":"RURUSHA","text":"Well, there's no need for <span class=\"emphasis\">you</span> to fret, <span class=\"highlight\">Forename</span>. I have set aside more than enough scrips to see you duly compensated for your efforts."},{"name":"RURUSHA","text":"But enough talk of boring old financial matters. I believe it is time for us to start work on our little friend's insides!"},{"name":"RURUSHA","text":"However, know that this will be an altogether more difficult process than reinforcing its exterior. Let me know when you feel up to the task."},{"name":"SYSTEM","text":"Rurusha is pleased with your efforts. She now considers you a <span class=\"highlight\">Rookie Relic Restorer</span>!"},{"name":"SYSTEM","text":"The next request will be available from Rurusha upon reaching level 83 as a blacksmith, armorer, or goldsmith."}],"reward":{"items":[{"num":250,"id":8},{"num":250,"id":9}]},"reqs":{"jobs":[{"lvl":80,"id":151}],"quests":[69668]},"next":[69670]},"partials":[{"type":"npc","id":"1039203","obj":{"i":1039203,"n":"Rurusha","l":3706,"q":7}},{"type":"quest","id":"69668","obj":{"i":69668,"n":"Professor Rurusha's New Friend","g":173,"l":"Old Sharlayan","s":0,"f":1}},{"type":"quest","id":"69670","obj":{"i":69670,"n":"Gears of Gold","g":173,"l":"Old Sharlayan","s":0}}]}