{"quest":{"name":"Professor Rurusha's New Friend","location":"Old Sharlayan","id":69668,"patch":6.0,"sort":0,"icon":101136,"unlocksFunction":1,"eventIcon":71341,"issuer":1039211,"target":1039203,"genre":173,"journal":["Boric is in a spot of bother.","After speaking to Boric, you learn that he serves as an assistant to Rurusha, a professor of archaeology at the Studium. She is currently attempting to restore a relic of sorts and is seeking someone capable of helping her. You agree to hear more about her work and make your way with Boric to go and speak with the professor.","Upon your arrival, you soon realize that not everyone is as keen on Professor Rurusha's latest project as she is. However, you decide to lend an ear to her words once she is done getting an earful from Professor Namono.","The professor shows you the relic in question and shares her theory that it is a type of mammet, possibly possessed of unique powers. Christened the Golden Dhyata after a deity of the same name, you agree to help her get to the bottom of the mysteries surrounding the seemingly inconspicuous relic."],"objectives":["Search for Rurusha.","Speak with Rurusha."],"dialogue":[{"name":"BORIC","text":"Deary me. Whatever am I to do? I dread to think how the professor would react if I returned without a─"},{"name":"BORIC","text":"Oh! Sorry, you startled me. I don't suppose you would happen to be a <span class=\"alternative-container\"><span class=\"alternative\">craftswoman</span><span class=\"alternative\">craftsman</span></span>, would you?"},{"name":"BORIC","text":"Brilliant! Please, allow me to introduce myself: I am Boric and I am under the employ of a professor at the Studium."},{"name":"BORIC","text":"Professor Rurusha, to be precise. She works in the field of archaeology and is deeply invested in the restoration of relics. I have been tasked with finding someone capable of helping with her most recent project."},{"name":"BORIC","text":"Needless to say, I first asked our colleagues at the Studium itself for their aid, but I was told in no uncertain terms that our so-called relic was mere refuse..."},{"name":"BORIC","text":"Frankly, between the two of us, to my untrained eye it appears to be little more than a shabby ornament or child's toy. The professor, meanwhile, is convinced that it is “unique and of great value.”"},{"name":"BORIC","text":"And far be it for me to question her─few archaeologists have had as much success as she! But I digress. Would you be willing to at least meet with the professor and hear more about our work?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Let me have a look at that relic."},{"name":"A1","text":"As long as I'm compensated for my time..."},{"name":"BORIC","text":"So you are willing to meet her, then? Excellent! Thank you so much."},{"name":"BORIC","text":"She ought to be somewhere here in the Studium. I don't imagine it will take too long to find her!"},{"name":"BORIC","text":"Oh, dear. Here's Professor Namono come to tell off the professor once more..."},{"name":"NAMONOTAYAMONO","text":"Honestly, I've never seen such foolishness!"},{"name":"RURUSHA","text":"Why, hello there. Terribly sorry, but I'm rather busy at the moment. Can it wait until later?"},{"name":"NAMONOTAYAMONO","text":"Perhaps you wouldn't be quite so busy if you weren't wasting time on what is clearly little more than rubbish!"},{"name":"NAMONOTAYAMONO","text":"You do realize there are limits to our fundings and facilities, don't you? The faculty cannot afford to waste time on projects that show little to no merit!"},{"name":"RURUSHA","text":"Honestly, I think you're overreacting, Professor. I have a very good feeling about this relic, you know."},{"name":"NAMONOTAYAMONO","text":"Feeling? Feeling!? I was not aware we had decided to rely on <span class=\"emphasis\">feelings</span> over common sense now."},{"name":"NAMONOTAYAMONO","text":"If I were you two I'd spend my time on anything other than helping this crazed crone with her “work.”"},{"name":"RURUSHA","text":"Sorry about that! You must be wondering what you've walked into. It seems Professor Namono is having a rather bad day."},{"name":"RURUSHA","text":"Wait a minute. You wouldn't happen to be an artisan, would you?"},{"name":"BORIC","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> is indeed, Professor! What's more, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>'s kindly agreed to hear more about our work. Which is why I brought, er..."},{"name":"BORIC","text":"Come to think of it, I don't think I ever asked for your name."},{"name":"RURUSHA","text":"Well, <span class=\"highlight\">Forename</span>, thank you for coming all this way to talk to an excitable old lady."},{"name":"RURUSHA","text":"I am Rurusha, a humble professor of archaeology. You've doubtless heard from Boric that we are attempting to restore a relic of sorts."},{"name":"RURUSHA","text":"I suppose it then falls upon me to explain our situation in a little more detail."},{"name":"RURUSHA","text":"But let us first make our way to the workshop. It will be much easier to explain things to you there."},{"name":"BORIC","text":"I'm not sure I know anyone scarier than Professor Namono... Of course, he is highly capable—the fact that he's become a professor despite being younger than myself is proof of that. Although, the fact remains that he's so...passionate about work that he is somewhat hard to approach."},{"name":"RURUSHA","text":"The work that presently occupies my time is the restoration of this peculiar piscine-faced relic. Its design called to mind the stories of Saint Dhyata, which is why I have taken to calling it the “Golden Dhyata” in her honor."},{"name":"RURUSHA","text":"It was brought to us by one of our gleaners."},{"name":"RURUSHA","text":"From what I understand, the excavation whence they found it was an independent venture, and considering its otherwise lackluster appearance, those of a similar mind to Professor Namono have been quick to write it off as “rubbish.” However, I believe it to be a type of mammet."},{"name":"BORIC","text":"I do not wish to sound impudent, Professor, but do you truly think that...thing could be a mammet? To my eyes it looks like an ornament designed to resemble a bird or a fish..."},{"name":"BORIC","text":"Next you'll be saying it can take to the skies like an airship."},{"name":"RURUSHA","text":"For all we know it might well do that! And yes, I'm quite certain the Golden Dhyata is a mammet."},{"name":"RURUSHA","text":"It doesn't look much like your standard Ul'dahn mammet, I'll grant you that, but its innards are no less complex."},{"name":"RURUSHA","text":"We just need to get it fixed and it's bound to start moving, I know it! What's more, I've got a special feeling about this one. Something tells me it possesses special abilities."},{"name":"BORIC","text":"Ah, another one of your special feelings. Wonderful..."},{"name":"RURUSHA","text":"In any case, this is where I need your help, <span class=\"highlight\">Forename</span>. The relic might not seem in a bad state from its outer appearance, but its insides are a mess."},{"name":"RURUSHA","text":"There appears to be little that can be salvaged, so it will be your duty to create replica parts that match all the broken ones housed within."},{"name":"RURUSHA","text":"I would be forever grateful to you should you decide to help us. I'm just champing at the bit to find out what secrets lurk within this little, old thing."},{"name":"RURUSHA","text":"Wonderful! I knew I could count on you the moment you arrived!"},{"name":"RURUSHA","text":"You've made an old woman very happy, <span class=\"highlight\">Forename</span>."},{"name":"RURUSHA","text":"Now, let's get down to business."},{"name":"RURUSHA","text":"I'd like you to begin by working on its exterior. Though I see no signs of erosion, something─possibly one of the dislodged parts─has done considerable damage to its insides."},{"name":"RURUSHA","text":"But it won't do to work on the interior and its complex parts without first ensuring the shell housing them is sound."},{"name":"RURUSHA","text":"That said, I've no doubt you'll need to prepare a few things before you get to work. Let me know when you feel ready to get started."},{"name":"SYSTEM","text":"You may now undertake deliveries for the Faculty of Archaeology at the Studium. Speak to Rurusha to learn more."}],"reward":{"items":[{"num":2,"id":30482}]},"reqs":{"jobs":[{"lvl":80,"id":151}],"quests":[70009]},"next":[69669]},"partials":[{"type":"npc","id":"1039211","obj":{"i":1039211,"n":"Boric","l":3706,"q":1}},{"type":"npc","id":"1039203","obj":{"i":1039203,"n":"Rurusha","l":3706,"q":7}},{"type":"item","id":"30482","obj":{"i":30482,"n":"Chili Crab","l":490,"c":24328,"t":46}},{"type":"quest","id":"70009","obj":{"i":70009,"n":"The Faculty","g":178,"l":"Old Sharlayan","s":10,"f":1}},{"type":"quest","id":"69669","obj":{"i":69669,"n":"The Dormant Dhyata","g":173,"l":"Old Sharlayan","s":0}}]}