{"quest":{"name":"No Forgiveness, No Deliverance","location":"Ishgard","id":69663,"patch":6.0,"sort":511,"icon":101094,"unlocksFunction":1,"eventIcon":71341,"issuer":1037016,"target":1037016,"genre":188,"journal":["Artoirel is eagerly awaiting Deacon Clem's report.","Having finished speaking with the rescued clergymen, Clem arrives at the strategy room to report his findings. He reaffirms that, since the church's deception was made public, he and his brethren have been the subject of harassment by certain quarters of the populace. In spite of this, he still believes that the church may again serve as a beacon of hope for the people. His unwavering faith, Aymeric believes, is the reason why he did not turn when others did. Having thus established the cause for the transformations, you turn your attention to the mystery of Profane Fafnir's identity. It is decided that you will seek out eyewitnesses among ordinary citizens, and to that end you head to the Hoplon to make inquiries.","You converse with a number of citizens and gain some insights into the identity of the man-turned-blasphemy. Satisfied, you go to seek out Aymeric at the Arc of the Venerable.","After sharing your findings with one another, you and your companions determine that the man may have been a patient at Saint Vaindreau's Grace, and by curious coincidence has the same name as the figure for whom the infirmary was named. Artoirel volunteers to head to the Firmament to make inquiries, and bids you and Aymeric await him in the Brume.","Artoirel emerges from the Firmament with Loverick, the infirmary aide who had care of Vaindreau. From him you learn that the young man was found by a patrol in the central highlands. After being treated for his injuries, he was brought to the infirmary for recovery, during which time he was heard muttering the names of Archbishop Thordan and Bishop Vartinoix while unconscious. By this, Loverick assumed that Vaindreau was a pious man who regarded them with respect and reverence, but you cannot help but wonder whether there is more to it.<br><br>※In the event that you leave the strategy room, you may re-enter by speaking with the Temple Knight guard at the Congregation of Our Knights Most Heavenly.","Back at the Congregation, you consider why Vaindreau would speak Bishop Vartinoix's name specifically. In light of the possibility that they were personally acquainted, Artoirel proposes speaking with His Grace directly, and Aymeric leaves to arrange a meeting.<br><br>※The next role quest will be available from Artoirel upon reaching level 87 in any magical ranged DPS class."],"objectives":["Gather eyewitness accounts of the man-turned-blasphemy near the Hoplon.","Speak with Aymeric.","Wait with Aymeric in the Brume.","Speak with Artoirel in the strategy room."],"dialogue":[{"name":"ARTOIREL","text":"Ah, <span class=\"highlight\">Forename</span>. Your timing could not be better."},{"name":"ARTOIREL","text":"Deacon Clem has finished speaking with the rescued clergymen, and will be here shortly to share his findings."},{"name":"ARTOIREL","text":"Lord Aymeric too is on his way. Let us wait for them."},{"name":"ARTOIREL","text":"Deacon Clem, we thank you for making the inquiries on our behalf."},{"name":"CLEM","text":"'Twas no imposition in the least. As I said, I am glad to do all I can."},{"name":"AYMERIC","text":"So, 'tis our understanding that those we escorted back were all close acquaintances of the inquisitor who turned."},{"name":"AYMERIC","text":"Like him, they too had been the subject of harassment by certain quarters of the populace. Is this correct?"},{"name":"CLEM","text":"It is, I am afraid. And they are far from alone. Men of the cloth were once afforded respect and deference as servants of Halone, but now they are openly reviled by many."},{"name":"CLEM","text":"We were complicit in perpetuating terrible lies─this is true─but we too were misled. We too are victims. Yet we are regarded by some as criminals..."},{"name":"AYMERIC","text":"Well do I understand the people's anger, but it saddens me to think that they would thus lash out at their fellow man. Especially when we need solidarity most of all..."},{"name":"AYMERIC","text":"Though I can imagine your plight, I would not presume to fully grasp your pain. Will you tell us of the challenges you and yours have had to face since the war's end?"},{"name":"CLEM","text":"Like all sons and daughters of Ishgard, we dreamed of peace in our lifetime. But now that it has come, we find we have little cause to rejoice."},{"name":"CLEM","text":"Our faith has long been the foundation of our lives, and overnight that foundation has been crippled by fractures. Beyond repair, for some."},{"name":"CLEM","text":"To learn that we had been deceived, and that we had unwittingly deceived others in turn was...devastating. We who had once been shepherds to men found ourselves lost lambs, bereft of surety and wanting for guidance."},{"name":"CLEM","text":"We have languished in darkness, all of us."},{"name":"CLEM","text":"Yet I have faith. That the church will redeem itself. That it will find a new path, and again become a beacon of hope for the people."},{"name":"AYMERIC","text":"I see... Thank you for sharing this with us. Your testimony has confirmed our suspicions."},{"name":"AYMERIC","text":"According to our allies, that which causes people to turn is none other than their despair and anguish."},{"name":"AYMERIC","text":"If it wasn't before, 'tis now abundantly clear why members of the clergy are among the transformed."},{"name":"AYMERIC","text":"That you did not, I believe, is due to your unwavering faith in the church. In light of this, we would ask for your continued cooperation."},{"name":"CLEM","text":"Of course. Anything to help my brethren."},{"name":"ARTOIREL","text":"Now that we have established the cause, that leaves us with the mystery of Profane Fafnir's identity."},{"name":"ARTOIREL","text":"The progenitor of these troubles... Could he too have been a man of the cloth?"},{"name":"CLEM","text":"From what I recall of his garb, I doubt it. He was dressed in the common fashion, and inadequately against the cold besides."},{"name":"AYMERIC","text":"'Tis said that something of the individual may remain in the blasphemy, influencing its behavior."},{"name":"AYMERIC","text":"If we can determine what instincts drive Profane Fafnir, we may learn who it once was. And this knowledge, I believe, will prove vital in our efforts to stop it."},{"name":"AYMERIC","text":"Deacon Clem─we ask that you reach out to your fellow clergymen. Please do what you can to ease their anxieties."},{"name":"CLEM","text":"Understood. As I have ever done, I shall provide what comfort I can to those in need."},{"name":"AYMERIC","text":"Meanwhile, we must make it a priority to identify the blasphemy. To that end, I would seek out more eyewitnesses."},{"name":"AYMERIC","text":"The Hoplon is a busy place at any given time; some ordinary citizens are bound to have been present as that tragic event unfolded."},{"name":"AYMERIC","text":"I propose we make inquiries in the Pillars. If you could attend to the Hoplon, Lord Artoirel and I will look in the surrounding areas."},{"name":"AYMERIC","text":"There are bound to be others who witnessed the transformation. We have but to find them."},{"name":"ARTOIREL","text":"I have this area well in hand. I pray you make inquiries on the Hoplon."},{"name":"ISHGARDIANA04127","text":"No, I didn't see that dragon. Nor would I have wished to, frightful as it sounds."},{"name":"ISHGARDIANA04127","text":"They say it wasn't a Dravanian attack. But if not, then what was it?"},{"name":"ISHGARDIANB04127","text":"The dragon that appeared at the Hoplon? Aye, I saw with my own eyes. One moment an Elezen, the next a terrible beast. He was a heretic, I take it?"},{"name":"ISHGARDIANC04127","text":"I wasn't present for the incident at the Hoplon, but a young man poorly dressed for the cold, that I did see."},{"name":"ISHGARDIANC04127","text":"I recall him well because an aide from Saint Vaindreau's was searching for him. He was a patient at the infirmary, and by coincidence had the same name."},{"name":"ISHGARDIANA04127","text":"Whatever that beast was, I pray I never have to lay eyes upon it. I'd sooner forget it was ever here."},{"name":"ISHGARDIANB04127","text":"That dragon was massive, let me tell you. I didn't know heretics could transform into something so big."},{"name":"ISHGARDIANC04127","text":"I know not what became of that young man, but I hope the aide found him. He plainly wasn't in a state to be wandering about alone."},{"name":"ARTOIREL","text":"Were you able to learn anything?"},{"name":"AYMERIC","text":"There you are, <span class=\"highlight\">Forename</span>. Did your search yield any fruit?"},{"name":"AYMERIC","text":"A patient of the Firmament's infirmary, you say..."},{"name":"AYMERIC","text":"A patient of the Firmament's infirmary, you say..."},{"name":"ARTOIREL","text":"Among those with whom I spoke, one claims to have witnessed an individual fitting that description. A man walking in a stupor, who did not seem to feel the cold."},{"name":"ARTOIREL","text":"If he had wandered straight out of the infirmary, it would explain his state of attire."},{"name":"AYMERIC","text":"Yes, I daresay we have found our blasphemy. But to think that his name should be Vaindreau..."},{"name":"AYMERIC","text":"'Tis the same as that of former Heavens' Ward commander Ser Vaindreau de Rouchmande, for whom the infirmary is named."},{"name":"ARTOIREL","text":"Ser Vaindreau, however, retired from his station at a ripe old age some years ago. 'Tis not like to have been him."},{"name":"ARTOIREL","text":"In any case, we have a lead. I shall head to the infirmary at once. Pray wait for me in the Brume."},{"name":"AYMERIC","text":"Lord Artoirel should not be long. Let us wait here."},{"name":"ARTOIREL","text":"This is Loverick, the aide who was in charge of Vaindreau."},{"name":"LOVERICK","text":"Have you found him? Oh, please say you have!"},{"name":"AYMERIC","text":"We have not, I am afraid. But we seek to, and hope that you could tell us more about him. May we ask how he came to be at the infirmary?"},{"name":"LOVERICK","text":"He was found by a patrol in the central highlands. After being treated for his hurts, he was brought to us for convalescence. Being in the prime of his years, he had been doing well, but then..."},{"name":"AYMERIC","text":"Prime of his years... By all accounts, he is no old man. It seems safe to assume it isn't Ser Vaindreau."},{"name":"LOVERICK","text":"Oh no, he's definitely a different person, as I told Lord Artoirel."},{"name":"LOVERICK","text":"And though he gave his name as Vaindreau, he seemed rather confused, and we had no means to confirm his identity."},{"name":"LOVERICK","text":"In his state, he shouldn't be wandering about on his own. Please, you must find him."},{"name":"AYMERIC","text":"The man who recently turned into a beast at the Hoplon... We regret to say it may have been Vaindreau."},{"name":"LOVERICK","text":"Wh-What? No... How can this be?"},{"name":"ARTOIREL","text":"Is there aught else you can tell us? Things he may have said or done while in your care?"},{"name":"LOVERICK","text":"Hmmm..."},{"name":"LOVERICK","text":"While he was still unconscious, he would often ramble. Though most of it was incoherent, he mentioned the archbishop many times."},{"name":"LOVERICK","text":"Oh, and he spoke of a bishop too─Bishop Vartinoix. I assumed he was a pious man, given this."},{"name":"AYMERIC","text":"I see. Thank you for your cooperation. We will continue our investigation and, should we confirm what became of Vaindreau, inform you forthwith."},{"name":"ARTOIREL","text":"Let us return to the Congregation for now."},{"name":"AYMERIC","text":"Who could this Vaindreau be...?"},{"name":"ARTOIREL","text":"The mystery remains, but we are one step closer to identifying the man who became Profane Fafnir."},{"name":"AYMERIC","text":"Indeed. Though he did not at first appear to be a member of the clergy, his words betray a fervent faith."},{"name":"AYMERIC","text":"And how curious that he should speak not only of the archbishop, but Bishop Vartinoix specifically..."},{"name":"ARTOIREL","text":"Perhaps he was personally acquainted with His Grace."},{"name":"ARTOIREL","text":"In light of the possibility, I believe we should speak with him directly."},{"name":"AYMERIC","text":"Agreed. I will request an audience, but His Grace has many demands upon his time. It may be a while before we are seen."},{"name":"AYMERIC","text":"Should you have other business, pray feel free to attend to them in the meantime."},{"name":"CASTERGATEKEEPER","text":"Heading to the strategy room? I should be glad to show you in."},{"name":"SYSTEM","text":"Proceed to the strategy room?"}],"reward":{"gil":1000},"reqs":{"jobs":[{"lvl":86,"id":190}],"quests":[69662]},"next":[69664]},"partials":[{"type":"npc","id":"1037016","obj":{"i":1037016,"n":"Artoirel","l":4023,"q":6}},{"type":"quest","id":"69662","obj":{"i":69662,"n":"Our Aching Souls","g":188,"l":"Radz-at-Han","s":501,"f":1}},{"type":"quest","id":"69664","obj":{"i":69664,"n":"Only Justice, Only Vengeance","g":188,"l":"Ishgard","s":521,"f":1}}]}