{"quest":{"name":"Wills Unending, Faith Unbending","location":"Ishgard","id":69665,"patch":6.0,"sort":531,"icon":101094,"unlocksFunction":1,"eventIcon":71341,"issuer":1037016,"target":1037016,"genre":188,"journal":["Artoirel has the identity of the blasphemy on his mind.","As you begin conversing with Artoirel, Aymeric arrives with grim news: upon being confronted, those who had abetted Bishop Vartinoix in his attempt to summon King Thordan turned into beasts and were subsequently put down. Deprived of their accounts, you consider other ways to confirm the clone and Vaindreau are one and the same, and it is decided that you will attempt to retrace their movements. While Artoirel heads to Azys Lla, you and Aymeric will make inquiries at Camp Dragonhead, where Vaindreau was first taken upon being found in the wilds.","Speaking with the people at Camp Dragonhead, you learn something of the circumstances surrounding the appearance of Vaindreau. Bearing this information, you go to rejoin Aymeric.","Upon hearing your findings, Aymeric states that he learned much the same thing. Curious about the fate of the airship that was seen flying low, he has secured a pair of black chocobos to help you search Providence Point to the north.","At the conclusion of your search, you are surprised to find not only the wreckage of the <span class=\"emphasis\">Soleil</span>, the archbishop's personal vessel, but Profane Fafnir itself lying nearby. At the sight of the imposing creature, you experience visions of Vaindreau's past─from the time his ship crash-landed to when he fled the infirmary. Coming out of your reverie, you steel yourself for a confrontation with the dread blasphemy, but instead of attacking, the beast elects to flee. After that close encounter, Aymeric suggests returning to Ishgard.<br><br>※In the event that you leave the strategy room, you may re-enter by speaking with the Temple Knight guard at the Congregation of Our Knights Most Heavenly.","Back at the Congregation, you share your revelations with Aymeric and Artoirel, confirming beyond a doubt that the clone and Vaindreau are one and the same. Based on what is known of primals, the man's confusion can be attributed to the mixture of memories he inherited from the multiple individuals who had transformed into King Thordan and his knights twelve. Though the Heavens' Ward took up arms against him and his allies, Aymeric laments their terrible fate, and expresses his fear that other Ishgardians who have become disillusioned with the church may succumb to despair and turn as Vaindreau and the clergymen did. Given courage by your words, the lord speaker makes the decision to hold an ecumenical council, that the church might establish new doctrine, and sets off to make the necessary preparations.<br><br>※The next role quest will be available from Artoirel upon reaching level 89 in any magical ranged DPS class."],"objectives":["Ask about Vaindreau at Camp Dragonhead.","Report your findings to Aymeric.","Speak with Aymeric.","Speak with Artoirel in the strategy room."],"dialogue":[{"name":"ARTOIREL","text":"<span class=\"highlight\">Forename</span>, you are ever a sight for sore eyes."},{"name":"AYMERIC","text":"Ill tidings, my friends..."},{"name":"AYMERIC","text":"I dispatched the Temple Knights to find the clergymen who aided in Bishop Vartinoix's summoning attempt. Regrettably, when confronted, all turned and had to be put down."},{"name":"ARTOIREL","text":"Without their accounts, how then to ascertain that the clone and Vaindreau are the same individual..."},{"name":"AYMERIC","text":"Maintaining the assumption that they are, perhaps we should instead consider how Vaindreau may have found his way to Coerthas."},{"name":"AYMERIC","text":"According to <span class=\"highlight\">Forename</span>'s vision, he was abandoned in Azys Lla. But what did he do afterwards?"},{"name":"ARTOIREL","text":"Then there is but one way to ascertain the truth: we follow his trail."},{"name":"ARTOIREL","text":"I shall go and search for the clone in Azys Lla. If he is still there, then we are dealing with a different individual."},{"name":"AYMERIC","text":"A splendid idea. We leave the floating continent in your capable hands."},{"name":"AYMERIC","text":"Meanwhile, <span class=\"highlight\">Forename</span> and I shall retrace Vaindreau's steps whence he first appeared."},{"name":"AYMERIC","text":"Upon being found in the central highlands, he was taken to Camp Dragonhead. Let us begin by making inquiries there."},{"name":"AYMERIC","text":"Let me know if you learn aught of interest. I have a thought for our next move, to which end I am making some arrangements."},{"name":"YAELLE","text":"Ah, 'tis ever an honor to receive you. What brings you to our humble camp this <span class=\"alternative-container\"><span class=\"alternative\">day</span><span class=\"alternative\">morn</span></span>?"},{"name":"YAELLE","text":"An injured man who was found out in the wilds? Yes, I know the one. I was with the patrol that chanced into him north of here, at Providence Point."},{"name":"YAELLE","text":"He was unconscious and in a bad way, and we hurriedly bore him back to camp. After doing what we could for him, we sent him on to the city."},{"name":"SYSTEM","text":"Your exchange with Yaelle has taught you about “Where Vaindreau was found.”"},{"name":"THEOBALIN","text":"Hm? Investigating the stranger we found, are you? I wasn't involved myself, so I can't tell you much about the fellow."},{"name":"THEOBALIN","text":"But in case it is of interest, earlier the same day, I caught sight of an airship flying dangerously low. It soon disappeared into the brewing snowstorm, looking none too steady."},{"name":"SYSTEM","text":"Your exchange with Theobalin has taught you about “An airship flying low.”"},{"name":"NINNE","text":"Well now, if it isn't the late Lord Haurchefant's dear friend. Is there something you require?"},{"name":"NINNE","text":"Ah yes, the mystery man. I was among those who tended him. He was not attired for the snow, much less the snowstorm in which he had been caught, and was suffering from frostbite."},{"name":"NINNE","text":"When people are extremely cold, they may mistakenly feel that they are warm and disrobe. That might explain his state of undress."},{"name":"SYSTEM","text":"Your exchange with Ninne has taught you about “Vaindreau's state when he was found.”"},{"name":"YAELLE","text":"That fellow was fortunate we found him when we did. Any longer in that storm, and he would have been just another drift of snow."},{"name":"THEOBALIN","text":"I do wonder what that airship was about, and what became of it. I don't believe we were expecting any to pass through that day..."},{"name":"NINNE","text":"We took care of the man as best we could, but given his state, I expect he will need a long convalescence before he's back on his feet."},{"name":"AYMERIC","text":"There you are. Were you able to learn aught of interest?"},{"name":"AYMERIC","text":"A mysterious man found collapsed after an airship was seen flying low... Yes, the accounts I heard are consistent with yours."},{"name":"AYMERIC","text":"I for one am curious about the fate of this unknown airship. To that end, I have arranged a pair of black chocobos for us, the more efficiently to scour the area."},{"name":"AYMERIC","text":"We shall contain our search to Providence Point, where Vaindreau is said to have been found."},{"name":"AYMERIC","text":"If you are ready, let us be off."},{"name":"Q1","text":"Mount a black chocobo and begin searching?"},{"name":"AYMERIC","text":"Nothing so far... Let us continue northeast."},{"name":"AYMERIC","text":"By the Fury... It's the blasphemy!"},{"name":"VAINDREAU","text":"His Eminence... Must protect...His Eminence..."},{"name":"LOVERICK","text":"Ah, you're finally awake! Halone be praised!"},{"name":"LOVERICK","text":"How are you feeling? Strong enough to speak? Can you tell me your name?"},{"name":"VAINDREAU","text":"My name... My name is...is..."},{"name":"VAINDREAU","text":"...Zephirin. No─Charibert... Or was it Vellguine? Paulecrain?"},{"name":"VAINDREAU","text":"So many names...swirling in my mind...and voices that reject them. Is there none they will accept?"},{"name":"LOVERICK","text":"Are you all right?"},{"name":"VAINDREAU","text":"(-Vaindreau-)...Vaindreau. My name is Vaindreau."},{"name":"LOVERICK","text":"Well now, that's the same as our infirmary! I daresay fate has guided you to us!"},{"name":"LOVERICK","text":"So, Vaindreau. If you are feeling up to a little conversation, can you tell me about yourself? Anything else you remember─anything at all?"},{"name":"VAINDREAU","text":"(-Vaindreau-)A proud son of House Dzemael... Nay. A devout servant of Halone...who lives...for the rush of battle? The pleasure in inflicting pain... The attentions of maidens... To fight beside my brother-in-arms..."},{"name":"VAINDREAU","text":"(-Vaindreau-)A lowborn runt...whose every effort went unrewarded. Whose very name disqualified him from ever leading the Temple Knights. But His Eminence raised me up. Granted me a place at his side..."},{"name":"VAINDREAU","text":"(-Vaindreau-)From that day forth, I pledged my sword to his service. Pledged my very being. My life to be offered up in defense of his."},{"name":"VAINDREAU","text":"(-Vaindreau-)I am a knight...of the Heavens' Ward. Sworn to protect and serve...the archbishop."},{"name":"LOVERICK","text":"Oh, you're a knight? Forgive me if that sounded rude, but I had no idea. And...while I realize your memories may be a bit muddled, I'm afraid I must inform you that the Heavens' Ward have not been seen in quite some time and are presumed dead, and the archbishop... Well. He is most certainly no longer of this world."},{"name":"LOVERICK","text":"But the important thing is you're safe now, and we'll help you get back on your feet. Speaking of which, let me bring some food and water. You must be absolutely famished."},{"name":"VAINDREAU","text":"(-Vaindreau-)The archbishop...dead? No... No, this cannot be. How can I still be alive when he is not?"},{"name":"VAINDREAU","text":"(-Vaindreau-)I must find him..."},{"name":"AYMERIC","text":"<span class=\"highlight\">Forename</span>!"},{"name":"VAINDREAU","text":"For the glory...of King Thordan..."},{"name":"AYMERIC","text":"Another vision, I take it."},{"name":"AYMERIC","text":"Let us make for Ishgard. I expect that Lord Artoirel will return soon, if he has not already, and we should both be glad to hear your tale."},{"name":"ARTOIREL","text":"Ah, <span class=\"highlight\">Forename</span>. I pray your search was more productive than mine own."},{"name":"AYMERIC","text":"Everyone is here. Excellent. So, were you able to find our clone in Azys Lla?"},{"name":"ARTOIREL","text":"Nay, naught but the discarded Ascalon remained. How fared you with your own efforts in the central highlands?"},{"name":"AYMERIC","text":"In the course of retracing Vaindreau's steps, we came upon the wreck of the <span class=\"emphasis\">Soleil</span>."},{"name":"AYMERIC","text":"I suspect he found the vessel abandoned in Azys Lla and tried to use it to return to Ishgard."},{"name":"ARTOIREL","text":"But he crashed en route and was subsequently rescued by a patrol from Camp Dragonhead..."},{"name":"AYMERIC","text":"So it would seem. And the archbishop's airship was not the only thing we found. Profane Fafnir was there too."},{"name":"AYMERIC","text":"The creature chose to flee, but not before <span class=\"highlight\">Forename</span> had a vision of Vaindreau's past."},{"name":"AYMERIC","text":"Go on, my friend. Share with us what you witnessed."},{"name":"ARTOIREL","text":"...All the pieces fit, and it is as you surmised, my lord. Vaindreau and the clone are one and the same, and in his despair, he turned into the blasphemy."},{"name":"ARTOIREL","text":"Yet the confusion he exhibited when asked his name... 'Tis as if he wasn't sure of his own identity."},{"name":"AYMERIC","text":"According to the Scions, primals retain the memories of their previous incarnations."},{"name":"AYMERIC","text":"From this, it may be assumed that the clone harbors the memories of all those who became King Thordan and his knights twelve."},{"name":"AYMERIC","text":"Though he struggled to reconcile these conflicting memories, he managed to settle on the name Vaindreau."},{"name":"AYMERIC","text":"The voices within were clearly in agreement when facing <span class=\"highlight\">Forename</span>, the mere sight of whom drove the blasphemy to flee..."},{"name":"AYMERIC","text":"Above all, however, they share in the desire to protect the archbishop. This desire was seared into Vaindreau's very being, and when he learned that he no longer had a purpose..."},{"name":"AYMERIC","text":"The Heavens' Ward took up arms against us and Ishgard. By their hand were we robbed of one of our finest knights and a dear friend."},{"name":"AYMERIC","text":"Even so, I would not wish such a terrible fate upon them."},{"name":"AYMERIC","text":"The selfsame fate inflicted upon full many clergymen...and a fate I fear ordinary citizens will succumb to if we fail to act."},{"name":"AYMERIC","text":"The people will not soon forget the betrayal of our church's leadership─nor should they. But absent the comfort and stability once afforded to them by the institution, many have become lost...and are all too vulnerable to despair."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"The people don't have to forget, but they need to move forward."},{"name":"A1","text":"The church can still be a source of comfort, but things need to change."},{"name":"AYMERIC","text":"I thought as much myself, my friend, but to hear you say it as well... Indeed, when the ground upon which we stand crumbles, we must find the strength to move forward. Even should it cause us pain to do so."},{"name":"AYMERIC","text":"Lord Artoirel. At the next house session, I shall call for an ecumenical council to be held."},{"name":"ARTOIREL","text":"My lord, such a gathering is reserved for... Oh! You intend for the church to codify new doctrine!"},{"name":"AYMERIC","text":"Since the separation of religion and state, we have refrained from interfering in church affairs. But if the church is to remain a part of Ishgardian society and continue serving the people, it must reconsider its role and formally address recent revelations."},{"name":"AYMERIC","text":"I would call for this council not as the lord speaker, but as a humble adherent of the faith."},{"name":"AYMERIC","text":"Long had I considered whether such measures were necessary, but lacked the courage to set them in motion. I now have it thanks to you."},{"name":"AYMERIC","text":"I shall tend to the necessary preparations at once. Among other things, we must reach out to those of the clergy who are amenable to reform. I ask for your patience in the meantime."},{"name":"CASTERGATEKEEPER","text":"Heading to the strategy room? I should be glad to show you in."},{"name":"SYSTEM","text":"Proceed to the strategy room?"}],"reward":{"gil":1000},"reqs":{"jobs":[{"lvl":88,"id":190}],"quests":[69664]},"next":[69666]},"partials":[{"type":"npc","id":"1037016","obj":{"i":1037016,"n":"Artoirel","l":4023,"q":6}},{"type":"quest","id":"69664","obj":{"i":69664,"n":"Only Justice, Only Vengeance","g":188,"l":"Ishgard","s":521,"f":1}},{"type":"quest","id":"69666","obj":{"i":69666,"n":"O Mighty Fury, Guide Us to Victory","g":188,"l":"Ishgard","s":541,"f":1}}]}