{"quest":{"name":"A Singular Gift","location":"The Doman Enclave","id":69660,"patch":6.0,"sort":441,"icon":101093,"unlocksFunction":1,"eventIcon":71341,"issuer":1038458,"target":1038457,"genre":187,"journal":["Yugiri's stern expression suggests she has no good news to share.","Having reflected on Tonbo's words, and recognizing that his people still struggle to cope with the loss of their loved ones, Hien has decided to hold a national funeral to honor those who did not return from imperial conscription and are presumed dead. Because there are no bodies to be buried, they will enshrine keepsakes of the deceased at the Swallow's Compass. Hien asks you to accompany him to Namai where he will gather offerings from the townsfolk, while Yugiri visits the people of Isari.","Hien believes it his duty to keep safe the peoples' offerings, and insists you need only watch and listen as he speaks with the villagers.<br><br>※You must be accompanied by Hien to complete this task. Speak with him again at Namai should you become separated.","Hien has made every effort to remember the stories of those who will be honored at the coming funeral. Before making the journey back to the enclave with the offerings, however, he suggests a brief repose in the rice fields of the Gensui Chain.","Hien recognizes the difficulty inherent in trying to strive for a better future without making peace with tragedies of the past. When the subject of his own past is broached, you find yourselves interrupted by the fortuitous arrival of Gosetsu. He believes his lord must lead by example and come to terms with his own painful memories, if he truly hopes to deliver others from their despair. To that end, Hien bids you join him in retrieving a keepsake he has kept hidden at Plum Spring.","At Plum Spring, Hien unearths a doll modeled after the auspice Qitian Dasheng. The only gift he received from his father as a child, it stirs fond memories of his youth, and time spent together with his parents. Custom dictates a keepsake of the deceased is offered, but he believes his father would approve nonetheless. Together you return to the enclave, the lord of Doma in higher spirits than when you first set out.","Plans for the funeral are proceeding apace, and Hien appears hopeful. There is still the matter of the blasphemy to deal with, but for now, he intends to do what he can to help his people mourn, and hopes you will be present when all is ready.<br><br>※The next role quest will be available from Yugiri upon reaching level 90 in any physical ranged DPS class."],"objectives":["Speak with Hien at Namai and have him accompany you.","Speak with the villagers while accompanied by Hien.","Speak with Hien.","Speak with Hien at the Doman Enclave."],"dialogue":[{"name":"YUGIRI","text":"Regrettably, there have been no sightings of the blasphemy since our first encounter at Shoal Rock. As Tansui surmised, it seems to fear confrontation."},{"name":"YUGIRI","text":"We, for our part, have tried to make good use of this intervening calm. Even now, Lord Hien and Gosetsu discuss how we might prevent other villagers from turning. If you would wait here a moment, he would no doubt wish to hear your thoughts on the matter."},{"name":"HIEN","text":"<span class=\"highlight\">Forename</span>, so glad you could come. As Yugiri no doubt explained, the blasphemy continues to elude us, and so we have turned our attention to other matters we can and should address."},{"name":"HIEN","text":"After long discussions and much deliberation, we believe we have found a means to allay the growing malaise of our people. If you would, Gosetsu?"},{"name":"GOSETSU","text":"The idea came to us after considering young Tonbo's remarks about his father, whose body was never found and returned to Doma. Others no doubt share in his melancholy, unable to bury and mourn their loved ones as is their right."},{"name":"GOSETSU","text":"Put simply, they cannot make peace with their loss. Their anguish, if left to linger, may consume them as well."},{"name":"HIEN","text":"That we might provide the people of Doma with comfort and closure, we will hold a national funeral at the Swallow's Compass. Those who choose to attend will be asked to present personal effects of the deceased they wish to be enshrined there."},{"name":"HIEN","text":"Spirits reside in all things, be they living or inanimate, and though we may die, a part of us lives on in the items we cherished most in life. Therefore, in lieu of remains, these belongings will be afforded a place in the royal mausoleum, that the spirits of those lost to us may find their way home to Doma, and at last know peace."},{"name":"HIEN","text":"The announcement has already been made, and a great many people are now engaged in the difficult task of deciding which keepsake will serve as their offering."},{"name":"HIEN","text":"'Tis not a decision to be made lightly, but I suspect they will have made up their minds by the time we go to collect their chosen tokens. I also hope to learn more about the departed from those willing to speak with me, for my benefit and for theirs."},{"name":"HIEN","text":"To break free of their sorrow, they must seek joy in the memories and the love they shared with the departed. And I will help them find it."},{"name":"HIEN","text":"Might the liberator of Doma be willing to favor the people with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> presence as well? I doubt not that they will appreciate the gesture. "},{"name":"HIEN","text":"Good. Yugiri, I leave the people of Isari to you. Gosetsu, might I ask you to─"},{"name":"GOSETSU","text":"Apologies, my lord, but there is...a small, but most urgent, matter I must first tend to."},{"name":"HIEN","text":"Very well, I shall not pry. Now, <span class=\"highlight\">Forename</span>, let us go and pay a visit to the good people of Namai."},{"name":"BEREAVEDA","text":"Have you heard of the funeral to be held at the Swallow's Compass? I'd like to give over a memento of my dear husband's, and I believe I know just the thing."},{"name":"BEREAVEDB","text":"To think my son's belongings will be enshrined at the Swallow's Compass... I can think of no finer tribute to his memory."},{"name":"TONBO","text":"I hope my offering isn't too heavy for Lord Hien."},{"name":"HIEN","text":"Right, then. Before we begin, I would remind you that you need only listen to the tales of their loved ones. As overseer of the ceremony, I see it as my duty to deliver their effects personally."},{"name":"HIEN","text":"Because of this, it is of the utmost importance that we keep clear of any beasts that might damage our cargo."},{"name":"HIEN","text":"It goes without saying how important it is that their offerings are delivered in pristine condition, and I will be no good to you in a fight while heavily encumbered."},{"name":"HIEN","text":"If stealth or flight are not options, I must ask that you fight for us both. But we needn't worry unless the occasion arises. For now, let us be off."},{"name":"SYSTEM","text":"Hien is now accompanying you. Keep him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Hien behind by entering a different area, or by speaking with him and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Hien accompany you again, return and speak with him at the original location."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Speak with Hien."},{"name":"A1","text":"Part ways with Hien."},{"name":"A1","text":"Nothing."},{"name":"HIEN","text":"I pray this ceremony helps them to find the closure they so rightfully deserve."},{"name":"SYSTEM","text":"Are you sure you wish to part ways with Hien?"},{"name":"HIEN","text":"If you have business elsewhere I will not keep you, but I beg you to hurry back. I will wait for you here in Namai."},{"name":"HIEN","text":"There you are. All is well, I trust? If you are ready, then let us return to the matter at hand."},{"name":"SYSTEM","text":"You must be accompanied by Hien and have him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"Hien has yet to arrive. Be sure he is at your side before attempting to continue."},{"name":"BEREAVEDA","text":"My husband, my dear sweet Maroya, never returned from Garlemald, but...perhaps now his soul might know peace. Please, take this painting brush to the Swallow's Compass."},{"name":"HIEN","text":"I shall handle it with the utmost care. Might we trouble you to tell us more about your husband?"},{"name":"BEREAVEDA","text":"Maroya was a kind and gentle soul... There was nothing he loved more in the world than to create. That brush never left his side, not even when he tended the fields. Any spare moment was dedicated to his craft, and he produced the most wonderful vistas of Yanxia."},{"name":"BEREAVEDA","text":"It was his dream to take us to Kugane where he would become a famous artist...until he was conscripted."},{"name":"BEREAVEDA","text":"In the early days, he would send drawings of the places they took him, though I know not how. But more time began to pass between each arrival, and then...they stopped coming altogether."},{"name":"BEREAVEDA","text":"I know not in what far-flung land he died, but I pray it was as beautiful as his works."},{"name":"HIEN","text":"He sounds like quite a man, to hold fast to his art even when forced to endure such hardship. His soul will find peace, of that I have no doubt."},{"name":"HIEN","text":"This should be everything. Would you join me for a short reprieve before our journey back?"},{"name":"BEREAVEDA","text":"That was Maroya's favorite brush. Please do take good care of it."},{"name":"BEREAVEDB","text":"I must thank you again, Lord Hien, for this honor. My son would have been overjoyed to know that his katana would be enshrined at the Swallow's Compass."},{"name":"HIEN","text":"Nay, the honor is mine. I'm sure your son was a fine warrior."},{"name":"BEREAVEDB","text":"Aye, and so was I, once upon a time. A samurai, as it happens, in service to your father when the Empire first invaded our lands."},{"name":"BEREAVEDB","text":"Though we were defeated, our spirits broken, my son Motosue was never one to lose hope."},{"name":"BEREAVEDB","text":"He was determined to follow in my footsteps. Gave his everything to honing his skill with the blade. When I watched him train, I felt the pride I thought I'd forsaken swell in my breast, and I knew he would restore our family to its former glory. Alas..."},{"name":"BEREAVEDB","text":"He could have fled. Perhaps started life anew as a vagabond of some sort. But he bore the burden and fought for Garlemald, for fear of what the imperials might do if he did not."},{"name":"HIEN","text":"'Tis plain he was a loving son and a warrior true. I will care for his blade as if it were mine own, and see it given the honor and respect due a samurai of Doma. "},{"name":"BEREAVEDB","text":"A samurai of Doma... Motosue would be so happy."},{"name":"TONBO","text":"I realize it's quite large, but I wanted to offer this on behalf of my brother and our father, Suzushiro."},{"name":"HIEN","text":"If you are willing, I would very much like to hear more about them both."},{"name":"TONBO","text":"My father, he...he was a carpenter. He was a good man, if a bit stubborn. Always thinking about his work. The only time he ever seemed to enjoy himself was when he had a cup of sake in his hand."},{"name":"TONBO","text":"When my brother came of age, he took up the trade as well. It brought them closer. I'd see them laughing over drinks together, or listening in silence to the crickets singing under the moonlight."},{"name":"TONBO","text":"I wanted to join them one day..."},{"name":"TONBO","text":"This was their favorite sake. I thought they might miss it."},{"name":"HIEN","text":"I am sure it will taste all the sweeter having come from you."},{"name":"HIEN","text":"I realize no one can ever replace your brother or father, but if you will allow, I would be honored to share drinks with you in their stead. When you are of age, of course."},{"name":"TONBO","text":"Thinking about my brother and father finding peace at the Swallow's Compass is comforting. Like a weight has been lifted from my heart."},{"name":"HIEN","text":"They put on brave faces, but the people of Namai are still wracked with grief. It is the same at every village I have visited in recent days...but it is only now that I am struck by the contradictory nature of my goals."},{"name":"HIEN","text":"Having joined the Eastern alliance, and taken steps to revitalize the enclave, I believed Doma was at last on the path to peace and prosperity. I still do. Yet by focusing so keenly on the future, I have neglected the past that yet haunts my people."},{"name":"HIEN","text":"Even if they do not give in to despair, and become beasts that plague our lands like poor Tonbo's brother, how are we to truly move forward if we are constantly looking back?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"You speak of their haunted pasts, Lord Hien, but what of yours?"},{"name":"A2","text":"Is there not someone for whom you yourself still grieve?"},{"name":"HIEN","text":"Me...? &lt;sigh&gt; All things considered, I suppose it was only a matter of time before the subject was broached."},{"name":"GOSETSU","text":"(-???-)Hah! <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> cuts to the heart of the matter─and the young lord. For the best, I should think, for he cannot lead by example if he has not yet made peace with his own past."},{"name":"GOSETSU","text":"A thousand apologies, my lord. I was passing through, tending to the matters of which I spoke earlier, when I chanced to hear familiar voices in the distance."},{"name":"GOSETSU","text":"If I may be so bold, the people of Doma, one and all, understand the source of your pain. To lose your father in the turmoil of a failed rebellion, his staggering duty to the throne thrust upon you─aye, how could you even begin to mourn, when first you had to lead?"},{"name":"GOSETSU","text":"It would behoove you to take part in the funeral rites, my lord. Take this time to make peace with your past while it is still yours to spend."},{"name":"GOSETSU","text":"Though unlikely─if not impossible─were you to become a monster as well, Doma would surely be lost."},{"name":"HIEN","text":"I thank you for your counsel, Gosetsu. But if I may ask, why is it you keep your blade at the ready? I thought this personal matter of yours to be naught but a trifle, or am I mistaken?"},{"name":"GOSETSU","text":"W-Well, I..."},{"name":"GOSETSU","text":"I find the katana a superior tool for peeling persimmons. Speaking of which, I do believe my stomach begs for sustenance. If you will excuse me..."},{"name":"HIEN","text":"Training─to help slay the blasphemy, no doubt. &lt;sigh&gt; Fitting that he should offer me counsel, yet refuse to heed it in kind."},{"name":"HIEN","text":"He is not the warrior he once was...but he is wise, our obstinate friend."},{"name":"HIEN","text":"If I am to be perfectly honest, it frightens me to recall it. The moment it all came crashing down."},{"name":"HIEN","text":"We'd taken Doma Castle. Victory was ours. But then we looked out and saw the banners of the XIIth Legion, marching towards us. The crown prince at the fore."},{"name":"HIEN","text":"No sooner had Gosetsu and I escaped than we received word that Zenos had slain my father."},{"name":"HIEN","text":"I remember how the fight went out of Gosetsu in an instant. How he wept for his lord, while I felt the weight of the profound duty bear down upon my shoulders. Crushing, suffocating... The heat of my own breath, the chill of my clammy palms..."},{"name":"HIEN","text":"...But duty demanded I master my emotions. When all those around me─Gosetsu included─were consumed by anger and a thirst for vengeance, I had to be in control. Under my orders we dispersed and fled to fight another day."},{"name":"HIEN","text":"To this day I have not stopped to reflect on my father's death. How could I, devoted as I am to finding Doma's way forward?"},{"name":"HIEN","text":"But now I must. And so, having taken you into my confidence, would you see this through with me to journey's end?"},{"name":"HIEN","text":"The keepsake I would offer up for the funeral is hidden in a place not easily reached. We will have to fly there, I'm afraid, but worry not─my yol will ferry us. Just a moment."},{"name":"HIEN","text":"The place we seek is Plum Spring, in the mountains. Shall we?"},{"name":"SYSTEM","text":"Mount the yol and travel with Hien?"},{"name":"HIEN","text":"My parents would bring me here for hanami as a child. Its beauty and serenity was such that I could forget the realities of the occupation."},{"name":"HIEN","text":"Indeed, some of my fondest memories of family are here, which is precisely why I chose this place to conceal the singular gift my father bequeathed to me as a child."},{"name":"HIEN","text":"Charming, is it not? The great auspice Qitian Dasheng, said to reside somewhere along the Dairyu Chain."},{"name":"HIEN","text":"In those days, anyone and everyone knew the tales of his prowess. Reckless boy that I was, I once even tried to seek him out, hoping he might help us."},{"name":"HIEN","text":"I buried it here shortly after my coming of age ceremony. It seemed a fitting place to both part with my childhood, and offer a final good-bye to my mother."},{"name":"HIEN","text":"More a keepsake of mine than his, to be sure, but he was never a man of worldly possessions. Still, I suspect he would allow himself a rare smile if he were to see it again after all these years."},{"name":"HIEN","text":"And that is precisely how I wish to bid him farewell. With a smile..."},{"name":"HIEN","text":"Ah... It should go without saying I would prefer it not become known that I kept this doll here. Wouldn't want the children to grow jealous now, would we?"},{"name":"HIEN","text":"And with that, I believe it is time we returned to the enclave."},{"name":"YUGIRI","text":"The two of you were away for quite some time. Is everything all right?"},{"name":"HIEN","text":"There are yet more villages to visit and offerings to collect, but preparations are proceeding apace. Soon the people will have one less cause to be tempted down the path of despair."},{"name":"HIEN","text":"Of course, there still remains the problem of the blasphemy. The former conscripts will remain at the Kienkan until it has been dealt with."},{"name":"HIEN","text":"We will slay the beast in due time, but before that, I would be honored if you were present for the funeral rites. Pray speak with Yugiri when next you visit the enclave, and she will tell you more of the proceedings."}],"reward":{"gil":1000,"items":[{"id":36057}]},"reqs":{"jobs":[{"lvl":89,"id":189}],"quests":[69659]},"next":[69661]},"partials":[{"type":"npc","id":"1038458","obj":{"i":1038458,"n":"Yugiri","l":2813,"q":5}},{"type":"npc","id":"1038457","obj":{"i":1038457,"n":"Hien","l":2813,"q":5}},{"type":"item","id":"36057","obj":{"i":36057,"n":"Coconut Cod Chowder","l":545,"c":24105,"t":46}},{"type":"quest","id":"69659","obj":{"i":69659,"n":"The Devoted Daughter","g":187,"l":"The Doman Enclave","s":431,"f":1}},{"type":"quest","id":"69661","obj":{"i":69661,"n":"Laid to Rest","g":187,"l":"The Doman Enclave","s":451,"f":1}}]}