{"quest":{"name":"Ever March Heavensward","location":"Ishgard","id":69667,"patch":6.0,"sort":551,"icon":101094,"unlocksFunction":1,"eventIcon":71341,"issuer":1037016,"target":1039101,"genre":188,"journal":["Artoirel has his sights set on Profane Fafnir.","Aymeric arrives at the Congregation with word that his secret weapon is ready. It is revealed to be none other than the Fury's Grace, the holy crozier of the archbishop, which Bishop Vartinoix recovered from Azys Lla. Exploiting the blasphemy's instincts, you will use it to lure the creature to the Chancel when next it appears over Ishgard, and thence strike it down. The strategy thus determined, you see to your preparations before proceeding to the Vault.","You join your companions at the Vault, ready for the final encounter with Profane Fafnir. It is only a matter of time before the blasphemy darkens the skies once more...","At the Chancel, you lie in wait for the dread blasphemy. As expected, its draconic silhouette is soon spotted, and as expected, it is drawn to the crozier in Aymeric's hand. Upon realizing it has been deceived, it lashes out at you with all its rage, but you nevertheless succeed in striking it down, and lay to rest the souls of the knights of the Heavens' Ward.<br><br>※In the event that you leave the strategy room, you may re-enter by speaking with the Temple Knight guard at the Congregation of Our Knights Most Heavenly.","Back at the Congregation, Artoirel offers you his gratitude for helping Ishgard to overcome not only the blasphemy, but the despair which spawned it. Glad though he is for his nation's progress, the lord of House Fortemps acknowledges that there remain great rifts within their society, and he pledges to do all within his power to bridge them.","In turn, Clem expresses his joy and relief for your preservation, and his undying gratitude that you succeeded in laying the blasphemy to rest. As he and his brethren work to reform their institutions and rebuild their relationship with the people, they will remember and pray for all who have fallen in service to the faith.","Last but never least, Aymeric thanks you and Artoirel for the vital roles you played in vanquishing Profane Fafnir. With no other Ishgardians having turned since the council, he prays that Ishgard is finally free of the scourge of despair, and swears that he will work to build a nation united and filled with hope. With surely nothing left unsaid, Artoirel bids you bear word of your success to the Ishgardian delegate in Radz-at-Han, that other nations may benefit and take inspiration from your firsthand account of events.","Arriving at Sundrop, you deliver the glad tidings to the Ishgardian delegate. The man takes the opportunity to confess his admiration for you, and you make a mental note to share some of your adventures with him one day, should the opportunity arise."],"objectives":["Speak with Aymeric at the Vault.","Speak with Artoirel in the strategy room.","Speak with Clem.","Speak with Aymeric.","Speak with the Ishgardian delegate in Sundrop."],"dialogue":[{"name":"ARTOIREL","text":"Glad tidings, <span class=\"highlight\">Forename</span>. Since the ecumenical council, not a single soul has turned."},{"name":"ARTOIREL","text":"Safe in that knowledge, we need only think of how to hunt down the blasphemy."},{"name":"AYMERIC","text":"Ah, <span class=\"highlight\">Forename</span>, you are here too. Excellent."},{"name":"AYMERIC","text":"I am pleased to say that the secret weapon is ready. We may now look to dealing with Profane Fafnir."},{"name":"AYMERIC","text":"As you will recall, when last we encountered it, it was lying in wait by the <span class=\"emphasis\">Soleil</span>."},{"name":"AYMERIC","text":"An instinct driven by its inherited memories, I believe. It seeks to protect that which it most strongly associates with the archbishop."},{"name":"AYMERIC","text":"In all likelihood, 'twas this selfsame motive that compelled it to come to the Holy See. From the skies above, it keeps watch over the Holy Vault."},{"name":"AYMERIC","text":"When next it descends, we shall exploit this instinct by using the secret weapon to lure it to the Chancel."},{"name":"ARTOIREL","text":"What exactly is this secret weapon?"},{"name":"AYMERIC","text":"'Tis none other than the Fury's Grace, the holy crozier of the archbishop."},{"name":"AYMERIC","text":"Suspecting that Bishop Vartinoix had retrieved it from Azys Lla, I had Deacon Clem search his private quarters. My suspicions proved correct."},{"name":"AYMERIC","text":"With the crozier in hand, I shall make an irresistible bait for Profane Fafnir."},{"name":"ARTOIREL","text":"My lord, that is an unconscionable risk! There is no telling how the blasphemy will react!"},{"name":"AYMERIC","text":"Indeed─but we can be confident that I will command his undivided attention, thus ensuring that no more of our citizens are placed in harm's way."},{"name":"AYMERIC","text":"If the Heavens' Ward are the archbishop's shields, then the Temple Knights are the people's. As leader of the order, the risk is mine to bear."},{"name":"AYMERIC","text":"All the knights of the Heavens' Ward fell in Azys Lla. As a vessel for their memories, Vaindreau may be considered the last of their number."},{"name":"AYMERIC","text":"Let us go, then...and relieve him of his─nay..."},{"name":"AYMERIC","text":"<span class=\"emphasis\">Their</span> duty."},{"name":"AYMERIC","text":"Let us see to our preparations and proceed to the Vault. We finish this once and for all!"},{"name":"ARTOIREL","text":"When the battle begins, Lord Aymeric and I will draw the blasphemy's attacks. Seize the opportunity to bring your magicks to bear against it."},{"name":"AYMERIC","text":"If you are ready, then let us set forth. You need but say the word."},{"name":"ARTOIREL","text":"The beast is come! Now is our chance!"},{"name":"AYMERIC","text":"Make ready..."},{"name":"AYMERIC","text":"To me, my knights!"},{"name":"VAINDREAU","text":"For the glory...of King Thordan..."},{"name":"VAINDREAU","text":"No... You are not he... A trick! It is a trick!"},{"name":"AYMERIC","text":"Forgive me, Ser Vaindreau...but for the sake of all Ishgardians, we must strike you down!"},{"name":"AYMERIC","text":"Finally, it is over..."},{"name":"AYMERIC","text":"Thus ends the tale of the Heavens' Ward. Let it not be forgotten."},{"name":"AYMERIC","text":"'Twas wrong of them to conceal the truth of our nation's founding. To abet the archbishop in his machinations."},{"name":"AYMERIC","text":"Yet in peering into their hearts, one thing became clear: they too had succumbed to primal manipulation. They too were victims. Flawed men, aye, and not without sin...but Ishgardians brave and true. As we all aspire to be."},{"name":"AYMERIC","text":"Having triumphed in the battle of ideals, I have a responsibility to all our people. Their hopes and dreams, their sorrow and suffering are mine to bear. And bear them I shall."},{"name":"AYMERIC","text":"For had you not vanquished King Thordan, or had I erred in but one of my choices..."},{"name":"AYMERIC","text":"I may well have been the first to succumb to despair. To be reborn a blasphemy."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You wouldn't have turned. Not you."},{"name":"A1","text":"A ridiculous notion. I'm more like to become a beast than you."},{"name":"AYMERIC","text":"Thank you, my friend. For having such confidence in me."},{"name":"AYMERIC","text":"My apologies, 'twas not mine intent to wax sentimental."},{"name":"ARTOIREL","text":"Our work here is done. Let us return to the Congregation."},{"name":"AYMERIC","text":"There are some few words I would say, but it can wait until Lord Artoirel and Deacon Clem have spoken theirs."},{"name":"CLEM","text":"I hurried here as soon as I learned of your victory."},{"name":"ARTOIREL","text":"<span class=\"highlight\">Forename</span>, permit me to offer my gratitude for helping us to overcome not only the blasphemy, but the despair which spawned it."},{"name":"ARTOIREL","text":"But this is only the beginning. On the face of it, we may have made tremendous strides in breaking down ancient barriers within our society, but there yet remain great rifts to be bridged."},{"name":"ARTOIREL","text":"'Tis no easy thing to rise above a lifetime of preconceptions and prejudice. I myself have struggled to do so, as you must know."},{"name":"ARTOIREL","text":"But I shan't give up. On the honor of my house, I will do everything in my power to build a new Ishgard. One in which all people can see eye to eye regardless of birth and station."},{"name":"ARTOIREL","text":"Now then, I believe the deacon has some words for you too. Pray lend him an ear."},{"name":"ARTOIREL","text":"Much as I appreciate our conversations, I think the deacon is deserving of your attentions as well."},{"name":"CLEM","text":"My <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span> <span class=\"highlight\">Forename</span>, may I say how glad I am that you are safe and well."},{"name":"CLEM","text":"Just before you arrived, Lord Aymeric explained to me the true nature of the man who became the blasphemy."},{"name":"CLEM","text":"The poor, confused creature was born of the church's mistakes, and on behalf of the clergy, I give you my heartfelt thanks for laying it to rest."},{"name":"CLEM","text":"As we work to reform our institutions and rebuild our relationship with the people, we will remember and pray for all those who have fallen in service to the faith."},{"name":"CLEM","text":"And we shall pray for you as well. Wheresoever your path may lead, may the Fury ever watch over and keep you."},{"name":"CLEM","text":"I shall leave it at that, then. Lord Aymeric too wishes to speak, and 'twould not do to keep him waiting."},{"name":"CLEM","text":"Let us not keep Lord Aymeric waiting."},{"name":"ARTOIREL","text":"Lord Aymeric has kept silent all this time, but he also has thoughts to share."},{"name":"AYMERIC","text":"<span class=\"highlight\">Forename</span>. Lord Artoirel. I thank you for the vital roles you played in ridding us of Profane Fafnir."},{"name":"ARTOIREL","text":"As ever, the sight of you in combat was nothing short of inspiring."},{"name":"AYMERIC","text":"With no further reported instances of people turning and the blasphemy itself no more, I should like to believe we are free of the scourge of despair."},{"name":"CLEM","text":"My brethren and I shall labor to see that it ever remains so by fighting to dispel the darkness in men's hearts."},{"name":"AYMERIC","text":"And I shall fight with you. Not only as the speaker of the House of Lords or the lord commander of the Temple Knights, but as a man of faith─in our god and in our people."},{"name":"AYMERIC","text":"Together, let us strive to fill our nation with hope."},{"name":"AYMERIC","text":"<span class=\"highlight\">Forename</span>─by now you will be sick unto death of being thanked, but I must nonetheless express an additional word of gratitude."},{"name":"AYMERIC","text":"Full oft have you saved our nation. Our people."},{"name":"AYMERIC","text":"I speak not only of our lives, but our hearts and minds as well."},{"name":"AYMERIC","text":"You have given us a great gift─that of opportunity and choice. And if we are to repay you for it, we as a nation must take full advantage of our freedom to dictate a new course forward, into a brighter future."},{"name":"AYMERIC","text":"What forward means, we may not always agree upon."},{"name":"AYMERIC","text":"But as fellow Ishgardians, we shall find a way to rise above our differences and stand united."},{"name":"AYMERIC","text":"That is the nation that I will strive to build. This I swear to you."},{"name":"ARTOIREL","text":"<span class=\"highlight\">Forename</span>. Given all that you have done for us, I am loath to impose further, but may I trouble you to bear word of our success to our officer in Radz-at-Han?"},{"name":"ARTOIREL","text":"We will of course be sending a report, but there is no substitute for a firsthand account. Our allies would benefit from the additional details you can provide as well."},{"name":"ARTOIREL","text":"Our thanks again, my friend, and may the Fury speed your way!"},{"name":"CASTERGATEKEEPER","text":"Thank you for your aid in vanquishing the blasphemy. I wish you safe passage back to Radz-at-Han."},{"name":"ISHGARDRESIDENTOFFICER","text":"Ah, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span> <span class=\"highlight\">Forename</span>! By your return, dare I hope that the hunt for the blasphemy was a success?"},{"name":"ISHGARDRESIDENTOFFICER","text":"That you would vanquish the beast comes as little surprise, but that this occasion would serve as impetus for the church to embark upon a path of reform is...incredible! I will share these joyous tidings with our allies without delay!"},{"name":"ISHGARDRESIDENTOFFICER","text":"If I may speak candidly...I must confess to being a great admirer of yours. When you have a moment, I should like to hear about some of your adventures...if you would do me the honor."},{"name":"ISHGARDRESIDENTOFFICER","text":"For the present, however─in my official capacity as the Ishgardian delegate, I offer you my humblest thanks for your immeasurable service to our nation!"},{"name":"SYSTEM","text":"You can now dye the job-specific gear for level 90 magical ranged DPS."},{"name":"SYSTEM","text":"Job-specific gear will become available once you have fulfilled certain conditions within the main scenario quests for Endwalker."},{"name":"CASTERGATEKEEPER","text":"Heading to the strategy room? I should be glad to show you in."},{"name":"SYSTEM","text":"Proceed to the strategy room?"}],"reward":{"gil":2000,"items":[{"num":2,"id":33919},{"num":2,"id":33920},{"num":2,"id":33918}]},"reqs":{"jobs":[{"lvl":90,"id":190}],"quests":[69666]}},"partials":[{"type":"npc","id":"1037016","obj":{"i":1037016,"n":"Artoirel","l":4023,"q":6}},{"type":"npc","id":"1039101","obj":{"i":1039101,"n":"Ishgardian Delegate","l":3707,"q":2}},{"type":"item","id":"33919","obj":{"i":33919,"n":"Savage Aim Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Critical Hit","category":0}}},{"type":"item","id":"33920","obj":{"i":33920,"n":"Savage Might Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Determination","category":0}}},{"type":"item","id":"33918","obj":{"i":33918,"n":"Heavens' Eye Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Direct Hit Rate","category":0}}},{"type":"quest","id":"69666","obj":{"i":69666,"n":"O Mighty Fury, Guide Us to Victory","g":188,"l":"Ishgard","s":541,"f":1}}]}