{"quest":{"name":"Only Justice, Only Vengeance","location":"Ishgard","id":69664,"patch":6.0,"sort":521,"icon":101094,"unlocksFunction":1,"eventIcon":71341,"issuer":1037016,"target":1037015,"genre":188,"journal":["The look of relief upon Artoirel's face bespeaks your timely arrival.","In hurried tones, Artoirel informs you that Bishop Vartinoix has decided to grant you an audience this very moment. Not wanting to miss the opportunity to learn if His Grace and Vaindreau may be connected, you make haste for Saint Reymanaud's Cathedral.","You arrive at the cathedral to find an apologetic Clem, who explains that the bishop has left on urgent business. While wondering what business should be so urgent, you head outside with your companions in search of His Grace.","It does not take you long to find the bishop. Appearing flustered, he denies any acquaintance with Vaindreau, and makes to leave. Ere he can do so, however, you experience a vision of his past, which reveals that he had journeyed to Azys Lla and tried to resurrect King Thordan and his knights twelve through a ritual of summoning. His plot laid bare, the bishop lashes out in a righteous fury, only to turn into a beast and force Aymeric to cut him down. Artoirel offers to tend to the aftermath and look after the distraught Clem, and bids you and Aymeric await him at the Congregation.<br><br>※In the event that you leave the strategy room, you may re-enter by speaking with the Temple Knight guard at the Congregation of Our Knights Most Heavenly.","After you recount your vision in full, Aymeric posits that the summoning ritual may have succeeded despite the lack of aether. However, what resulted was not the fearsome primal and his guard you once faced and felled, but a single, otherwise ordinary man driven by the desire to protect the archbishop. While you have yet to find conclusive proof that this clone and Vaindreau are one and the same, the possibility cannot be ruled out, and it is on this premise that you press on with your investigation.<br><br>※The next role quest will be available from Artoirel upon reaching level 88 in any magical ranged DPS class."],"objectives":["Speak with Clem in Saint Reymanaud's Cathedral.","Search for Vartinoix.","Speak with Aymeric in the strategy room."],"dialogue":[{"name":"ARTOIREL","text":"<span class=\"highlight\">Forename</span>, excellent timing as ever. Deacon Clem has just sent word that Bishop Vartinoix will see us now. By which I mean <span class=\"emphasis\">right this instant</span>."},{"name":"ARTOIREL","text":"'Tis extremely short notice, I know, but it would not do to miss the opportunity to learn how he and Vaindreau may be connected."},{"name":"ARTOIREL","text":"Not wishing to keep His Grace waiting, Lord Aymeric is already on his way to Saint Reymanaud's Cathedral."},{"name":"ARTOIREL","text":"Come, let us hurry there ourselves."},{"name":"AYMERIC","text":"Ah, <span class=\"highlight\">Forename</span>. Full glad am I that you could join us."},{"name":"ARTOIREL","text":"It seems His Grace has yet to arrive..."},{"name":"CLEM","text":"My lords, I am so sorry..."},{"name":"CLEM","text":"I informed His Grace that you were making your way hither..."},{"name":"CLEM","text":"But shortly before you arrived, he recalled that he had urgent business and had to leave the cathedral at once."},{"name":"CLEM","text":"He cannot have yet gone far, though, so if you wish to search for him in the hopes you can still steal a moment of his time..."},{"name":"AYMERIC","text":"To grant us an audience only to depart with such haste... What business could be so pressing?"},{"name":"AYMERIC","text":"To be deleted."},{"name":"ARTOIREL","text":"I've found His Grace, <span class=\"highlight\">Forename</span>."},{"name":"CLEM","text":"His Grace has yet to return, I am afraid..."},{"name":"VARTINOIX","text":"W-Well now, that even the savior of Ishgard should be here..."},{"name":"ARTOIREL","text":"Your Grace. Perhaps 'tis simply our misunderstanding, but we were under the impression that you had granted us an audience."},{"name":"VARTINOIX","text":"To be deleted."},{"name":"VARTINOIX","text":"L-Lord Speaker! Rest assured I was just about to return to the cathedral..."},{"name":"AYMERIC","text":"There is no need, Your Grace─this will not take long. As you may have heard, we are investigating a young man named Vaindreau. Is he known to you?"},{"name":"VARTINOIX","text":"No, no, I cannot say he is. With the exception of the former archimandrite, I am sure I know no one by that name."},{"name":"VARTINOIX","text":"But mine and the archbishop's are known to many, yes? Perhaps...perhaps this youth took inspiration from public services over which we presided. Goodly soul that he is. Full glad am I that his faith was of comfort to him in sickness, and I pray to Halone that he will soon be found in good health."},{"name":"VARTINOIX","text":"Now then, if there was nothing else, I shall return to my duties..."},{"name":"VARTINOIX","text":"Fear not, Your Eminence. I shall carry on your legacy."},{"name":"CLERGYMAN04129","text":"We have completed the preparations as per your instructions. But are you certain this will work...?"},{"name":"VARTINOIX","text":"It will. It must. Lord Aymeric spoke the truth when he revealed the archbishop sought primal powers to strengthen the people's faith."},{"name":"VARTINOIX","text":"I could not bring myself to believe it. Not at first. But in the course of cataloging His Eminence's personal articles, I came upon his journal..."},{"name":"VARTINOIX","text":"Therein he had written that, through abundant aether and fervent prayer, it is possible to make gods of men!"},{"name":"VARTINOIX","text":"All the power we require lies in this place, this Azys Lla. By channeling the essential elements into the soulless flesh and sword we found..."},{"name":"VARTINOIX","text":"We shall summon forth King Thordan and his knights twelve, and by His blessing Ishgard shall be restored to its former glory!"},{"name":"VARTINOIX","text":"Wh-What is this? It's...just an ordinary man, scarcely changed from before..."},{"name":"VAINDREAU","text":"Unnngh... His Eminence... I must protect...unnngh..."},{"name":"VARTINOIX","text":"No... No, this isn't right!"},{"name":"VARTINOIX","text":"Confound it... Perhaps I overlooked something. I must return to the Holy See and review the journal."},{"name":"INQUISITOR04129","text":"Your Grace! What shall we do with this...thing?"},{"name":"VARTINOIX","text":"Leave it! 'Tis a failure without use or value. The denizens of this place will deal with it soon enough."},{"name":"AYMERIC","text":"<span class=\"highlight\">Forename</span>, are you well? Were you perchance granted a vision of the past?"},{"name":"AYMERIC","text":"An attempted summoning of King Thordan and his knights twelve!?"},{"name":"AYMERIC","text":"Your Grace, you should know full well that summoning is strictly forbidden. You will accompany us to the Congregation and explain yourself."},{"name":"VARTINOIX","text":"I have dedicated my life to the church! Conducted my affairs in accordance with the scriptures, and taught others to do likewise!"},{"name":"VARTINOIX","text":"But you took it all from us! Tore down everything that defined us!"},{"name":"VARTINOIX","text":"You cannot know how it feels to have your very existence rejected! To be forsaken by your community─to be <span class=\"emphasis\">denied</span> by your society!"},{"name":"VARTINOIX","text":"Well, I deny <span class=\"emphasis\">you</span> and this <span class=\"emphasis\">justice</span>! I deny an Ishgard where the church has no place!"},{"name":"VARTINOIX","text":"To be deleted."},{"name":"VARTINOIX","text":"I refuse to accept it, do you hear me!? <span class=\"emphasis\">I refuse to accept it</span>!"},{"name":"CLEM","text":"Your Grace! Noooooo!"},{"name":"ARTOIREL","text":"That it should come to violence yet again... Would that your hand had not been forced, my lord."},{"name":"ARTOIREL","text":"Deacon Clem should not be alone at this time. I shall remain with him while tending to the aftermath."},{"name":"ARTOIREL","text":"When things have settled, I will return to the Congregation. Pray go on ahead and get some rest."},{"name":"AYMERIC","text":"How fares the deacon?"},{"name":"ARTOIREL","text":"Well enough, given the circumstances."},{"name":"ARTOIREL","text":"Though understandably shaken, he is more determined than ever to help his fellows."},{"name":"AYMERIC","text":"Truly, he is possessed of a stout heart."},{"name":"AYMERIC","text":"But to think that even a member of the Synod could succumb to despair and turn..."},{"name":"AYMERIC","text":"The crisis gripping the church is far graver than I had imagined."},{"name":"AYMERIC","text":"In pushing for such an abrupt separation of religion and state, we may have exacerbated the growing divide between the clergy and the general populace."},{"name":"ARTOIREL","text":"<span class=\"highlight\">Forename</span>─will you recount in full that which you witnessed in your vision?"},{"name":"ARTOIREL","text":"That he should seek to use one of Allag's unholy abominations to create a primal..."},{"name":"ARTOIREL","text":"Yet that which manifested was not like the being you fought, but rather retained the form of a man. One driven by the desire to protect the archbishop..."},{"name":"AYMERIC","text":"We may safely assume the bishop did not have sufficient aether. Bereft of Nidhogg's eye, the sword Ascalon no longer has such power."},{"name":"AYMERIC","text":"Nor does that of the Warring Triad remain to be harnessed, thanks to your valorous intervention."},{"name":"AYMERIC","text":"To be deleted."},{"name":"ARTOIREL","text":"But if the summoning failed, how did the clone come to possess life? And what purpose drives it?"},{"name":"ARTOIREL","text":"To be deleted."},{"name":"AYMERIC","text":"Lack of aether notwithstanding, the necessary components were present for a summoning."},{"name":"AYMERIC","text":"Perhaps the ritual itself was a success, and the vessel, though imperfect, arose as a champion of the archbishop. Yet how did he come to be in the central highlands...?"},{"name":"AYMERIC","text":"To be deleted."},{"name":"ARTOIREL","text":"You believe that this clone and the man who became the blasphemy are one and the same?"},{"name":"AYMERIC","text":"Nay, I merely speculate. Yet considering what we know of the clone and Vaindreau, it would seem a likely possibility."},{"name":"AYMERIC","text":"Whatever the truth may be, it will not elude us forever. But first, I must lay some groundwork for the next phase of our investigation."},{"name":"AYMERIC","text":"Gods permitting, I will have news to share ere long, so pray look in on us when you can."},{"name":"CASTERGATEKEEPER","text":"Heading to the strategy room? I should be glad to show you in."},{"name":"SYSTEM","text":"Proceed to the strategy room?"}],"reward":{"gil":1000},"reqs":{"jobs":[{"lvl":87,"id":190}],"quests":[69663]},"next":[69665]},"partials":[{"type":"npc","id":"1037016","obj":{"i":1037016,"n":"Artoirel","l":4023,"q":6}},{"type":"npc","id":"1037015","obj":{"i":1037015,"n":"Aymeric","l":4023,"q":2}},{"type":"quest","id":"69663","obj":{"i":69663,"n":"No Forgiveness, No Deliverance","g":188,"l":"Ishgard","s":511,"f":1}},{"type":"quest","id":"69665","obj":{"i":69665,"n":"Wills Unending, Faith Unbending","g":188,"l":"Ishgard","s":531,"f":1}}]}