{"quest":{"name":"Laid to Rest","location":"The Doman Enclave","id":69661,"patch":6.0,"sort":451,"icon":101093,"unlocksFunction":1,"eventIcon":71341,"issuer":1038458,"target":1039102,"genre":187,"journal":["Yugiri's somber expression suggests you have arrived right on time.","Preparations for the funeral are complete. The blasphemy continues to remain out of sight, and so Hien wishes to seize this opportunity to carry out the ceremony. Gosetsu, unfortunately, will be unable to attend, but Hien hopes you will accompany him and Yugiri as they make their way to the Swallow's Compass.","While waiting for villagers to arrive, Hien is approached by Kisei, who comes not to argue but to apologize─or so it would seem. Hoping to catch him off guard, Kisei unsheathes a dagger and makes to strike, only to be cut down by Yugiri. But the seemingly foolish endeavor is in service to a greater plan, as Kisei's death draws the blasphemy from hiding, intent upon avenging its stepmother. A fierce battle ensues, and as the situation turns dire, Gosetsu joins the fray not with sword in hand but with a cane, wielding healing magicks of surprising potency. With his aid, the blasphemy is at last laid low, and the funeral can be held without fear of further disruption.","The villagers of Doma are at last gathered, and Hien conducts a heartfelt service in remembrance of those poor souls who were never returned to Doma. One by one he recites the names and stories of parents, siblings, and children, until he finally speaks of Minato and Kisei─not of their tragic end, but of the happiness and fulfillment they found in family. The ceremony ends with a moment of silence, all present bowing their heads in prayer for their loved ones.","With the blasphemy slain and the funeral complete, there is naught left to do but return home. And so, Hien, Yugiri, and Gosetsu are off to the Doman Enclave.","Though it may be years, if not decades, until the people of Doma truly make peace with their past, Hien believes they have turned a corner. Yugiri praises Gosetsu's skill with healing magicks, prompting him to stress that he is still but a novice. It is for that reason that, unfortunately, he must once more leave on pilgrimage to hone his skills─though he reassures a disappointed Hien that he will fly to his side should the need arise. And so the former samurai takes his leave, prompting you to make ready to return to your other affairs as well. Hien thanks you once more for your aid, and bids you relay word of the blasphemy's demise to their representative at Radz-at-Han.","The Doman delegate is overjoyed to learn that the blasphemy is no more, and that the state of affairs in Doma is much improved for your involvement. If Hien should have need of your marksmanship again, he is certain to seek you out before all others."],"objectives":["Speak with Hien at the Swallow's Compass.","Speak with Hien.","Speak with Hien at the Doman Enclave.","Speak with the Doman ambassador in Sundrop at Radz-at-Han."],"dialogue":[{"name":"YUGIRI","text":"As ever, your timing is impeccable. We but moments ago completed preparations for the funeral."},{"name":"YUGIRI","text":"I will inform Lord Hien of your arrival."},{"name":"HIEN","text":"You're here. Excellent. The blasphemy continues to shun our settlements, and I mean to make the most of the time its absence affords us."},{"name":"HIEN","text":"I assume you were planning to take part in the ceremony?"},{"name":"HIEN","text":"Glad to hear it. Unfortunately, Gosetsu will not be joining us today."},{"name":"HIEN","text":"He's injured himself, as I knew he would with his secret training, and now grumbles from the confines of his bed. But he will be fine in due course. We may worry over his convalescence <span class=\"emphasis\">after</span> the funeral."},{"name":"YUGIRI","text":"There was a peculiar-looking doll among the effects, but I can find no record of it in our stores. Would you happen to know who brought it?"},{"name":"HIEN","text":"The villagers should arrive ere long. Then we may begin."},{"name":"KISEI","text":"Lord Hien. I..."},{"name":"KISEI","text":"I apologize, my lord, for my past transgressions."},{"name":"KISEI","text":"I yearned to believe my daughter was a kami reborn, but you were right─she is a monster. Words can ill express my shame for advocating the conscripts be sacrificed to appease the dead."},{"name":"KISEI","text":"Nay, this ceremony shall serve far, far better... And so, as a humble citizen of Doma, I offer my deepest gratitude...and beg for your forgiveness."},{"name":"KISEI","text":"I would make an offering on behalf of my husband and son, as well as my dear stepdaughter, Minato. I throw myself on your mercy, Lord Hien─allow them a place within the mausoleum, that their spirits may know peace."},{"name":"HIEN","text":"There is no need to beg forgiveness, Kisei. Please, rise."},{"name":"KISEI","text":"She will come...for you..."},{"name":"HIEN","text":"By the kami! She gave her life to draw out the blasphemy!?"},{"name":"GOSETSU","text":"(-???-)Apologies for the untimely arrival, my lord."},{"name":"HIEN","text":"Gosetsu? What is that staff?"},{"name":"GOSETSU","text":"Pilgrimage proved a most enlightening experience, and is where I chanced to discover the benefits of ascetic training. I may no longer be fit to wield a blade, my lord, but shugendo affords me another way to turn the tide of battle."},{"name":"HIEN","text":"Stubborn as ever... I shall have to thank you later."},{"name":"HIEN","text":"Let us put an end to this!"},{"name":"HIEN","text":"A deceiver to the bitter end. But she is still a daughter of Doma. She will have a proper burial, and her family's belongings enshrined with the others."},{"name":"HIEN","text":"I have gathered you here today not to speak of the future, but to reflect on the past. To pay respects to loved ones fallen on the field of battle."},{"name":"HIEN","text":"In honor of their sacrifices, these sons and daughters of Doma shall be given a place here, at the Swallow's Compass."},{"name":"HIEN","text":"Though they no longer walk with us in life, they walk with us in spirit. Pray never forget their bravery, that the memories of their legacy give you comfort and strength."},{"name":"HIEN","text":"Maroya Motokawa, the aspiring painter. He was a man who saw beauty in all things, and one day would have become a renowned artist in Kugane."},{"name":"HIEN","text":"Motosue Jito, the warrior-in-training. He longed to become a samurai like his father, and bring honor to his family."},{"name":"HIEN","text":"Suzushiro Kodakumi, the carpenter. A man wholly dedicated to his craft, who hoped to one day pass on his talents to his two loving children."},{"name":"HIEN","text":"And lastly, Minato Shihogaki, and her stepmother Kisei. Theirs was once a happiness to be envied."},{"name":"HIEN","text":"Minato's parents were murdered by imperial soldiers, and after being rescued by the Confederacy, Minato was given into the care of the village of Isari. Though she arrived with a broken heart, it was soon mended by the man who would become her husband. The son of Kisei, who herself had been borne to Isari on winds of tragedy."},{"name":"HIEN","text":"Kisei was a child of the deep, born in Sui–no–Sato. For her gifts she was exiled, but with her courage and tenacity found a new home on the shores of the Ruby Sea. She was a devoted wife and mother, and though not related by blood, she loved Minato as if she were their own."},{"name":"HIEN","text":"That is how she lived─how they all lived─and how they should be remembered. Let your hearts swell not with sorrow, but with joy for their memory. Know that proof of their mark left on this world shall remain here, enshrined within the Swallow's Compass for all eternity."},{"name":"HIEN","text":"Let us still our voices, and in silence pray for their souls. That they may share in the peace we have found."},{"name":"YUGIRI","text":"Many tears were shed throughout the ceremony. Not for grief, but for relief, I think. Happiness, even."},{"name":"GOSETSU","text":"Traditionally the royal mausoleum is reserved for the ruling clans, but I have no doubt Lord Kaien would approve of his son's decision."},{"name":"HIEN","text":"Well, I certainly wasn't expecting battle with a blasphemy as a prelude to the ceremony. At least now we may breathe easy, if only for a short while."},{"name":"HIEN","text":"The villagers have all returned home, and I believe it is time we did the same."},{"name":"YUGIRI","text":"Never in my wildest dreams did I foresee Gosetsu embracing the ascetic arts."},{"name":"GOSETSU","text":"I am not yet well versed in healing magicks, but thankfully it was enough to be of some use to Lord Hien."},{"name":"HIEN","text":"We've held a national funeral and slain a blasphemy besides. A rather productive day, would you not agree?"},{"name":"HIEN","text":"The former conscripts will be elated to finally return home."},{"name":"HIEN","text":"Speaking of returns, I think I speak for us all when I say your appearance at the Swallow's Compass came as something of a shock. What of your injuries from training?"},{"name":"GOSETSU","text":"Quite painful for some time, I assure you. Despite my best efforts to reclaim my former skills, my back and my hips vigorously protested."},{"name":"GOSETSU","text":"I planned to sleep that I might be well rested for the morrow's hunt, but a voice called out to me. I was needed, and so I grabbed my cane and ran as quickly as my ailing body would allow."},{"name":"YUGIRI","text":"The cane suits you, Gosetsu, but your mastery of healing magicks was a sight to behold. Almost as surprising as your resurrection following the fall of Doma Castle."},{"name":"GOSETSU","text":"I am still but a novice in dire need of training. 'Tis my hope that I will be able to refine my ascetic arts during my next pilgrimage."},{"name":"HIEN","text":"So you are leaving, then?"},{"name":"GOSETSU","text":"Worry not, Lord Hien. Should you find yourself in dire straits once more, I shall fly to your side. Not as a samurai, perhaps, but I will nonetheless give our enemies cause to tremble."},{"name":"GOSETSU","text":"And with that, I take my leave!"},{"name":"HIEN","text":"Though it may be years, if not decades, until we truly make peace with our past, we have turned a corner and begun to heal. We may look to the future unburdened by grief ignored and sadness denied. The path ahead is ever fraught with peril, but we shall walk it with eyes unclouded...and with pride."},{"name":"HIEN","text":"You have done so much for us, for Doma. I wish there was more I could do for you."},{"name":"HIEN","text":"If I may ask one last favor, before you leave, please inform our representative at Radz-at-Han that the blasphemy has been vanquished, and the people of Doma are safe. With any luck, our experiences here will prove useful to other nations that yet grapple with these beasts."},{"name":"HIEN","text":"Safe travels, <span class=\"highlight\">Forename</span>, and may the kami bless you. "},{"name":"YUGIRI","text":"The people of Sui-no-Sato will be relieved to hear of recent events. I wonder what Mother and Father would say...?"},{"name":"DOMANRESIDENTOFFICER","text":"<span class=\"alternative-container\"><span class=\"alternative\">Lady</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, you are returned! What word from Doma?"},{"name":"DOMANRESIDENTOFFICER","text":"The blasphemy is no more!? That is most wonderful news! I must inform the other delegates at once."},{"name":"DOMANRESIDENTOFFICER","text":"Thank you again for answering our summons. If another threat should rear its dastardly head, I pray we can count on your assistance again."},{"name":"SYSTEM","text":"You can now dye the job-specific gear for level 90 physical ranged DPS."},{"name":"SYSTEM","text":"Job-specific gear will become available once you have fulfilled certain conditions within the main scenario quests for Endwalker."}],"reward":{"gil":2000,"items":[{"num":2,"id":33919},{"num":2,"id":33920},{"num":2,"id":33918}]},"reqs":{"jobs":[{"lvl":90,"id":189}],"quests":[69660]}},"partials":[{"type":"npc","id":"1038458","obj":{"i":1038458,"n":"Yugiri","l":2813,"q":5}},{"type":"npc","id":"1039102","obj":{"i":1039102,"n":"Doman Delegate","l":3707,"q":2}},{"type":"item","id":"33919","obj":{"i":33919,"n":"Savage Aim Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Critical Hit","category":0}}},{"type":"item","id":"33920","obj":{"i":33920,"n":"Savage Might Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Determination","category":0}}},{"type":"item","id":"33918","obj":{"i":33918,"n":"Heavens' Eye Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Direct Hit Rate","category":0}}},{"type":"quest","id":"69660","obj":{"i":69660,"n":"A Singular Gift","g":187,"l":"The Doman Enclave","s":441,"f":1}}]}