{"quest":{"name":"A Friend in Need","location":"Old Sharlayan","id":69673,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1039203,"target":1039203,"genre":173,"journal":["All is not well with Rurusha.","Rurusha has tasked you with crafting gold mechanical voice boxes.<br><br>※Minimum collectability rating for this delivery is 160. Delivering items with a rating of 340 or more will earn greater rewards.","You deliver the voice boxes to Rurusha. The Golden Dhyata's speech, however, is unintelligible, and Rurusha is now focused on determining a new course of action."],"objectives":["Deliver the gold mechanical voice boxes to Rurusha."],"dialogue":[{"name":"RURUSHA","text":"Oh, sorry, didn't see you there. I was just mulling something over."},{"name":"RURUSHA","text":"I dismantled the Golden Dhyata after you left, and even tried oiling all its parts with lubricants graciously lent to me by the Faculty of Alchemy. But after reassembling it, nothing has changed..."},{"name":"RURUSHA","text":"That said, I did make one new discovery: I found this small part within its mouth. It seems to be an artificial voice box of sorts."},{"name":"RURUSHA","text":"That this piece should have anything to do with its malfunctioning is highly unlikely, but it <span class=\"emphasis\">is</span> damaged. I thought it may be worth replacing. What do you think?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It might help if we could communicate with it."},{"name":"A1","text":"It'd be nice if it said something..."},{"name":"BORIC","text":"Wait! You think the Golden Dhyata may be capable of speech?"},{"name":"RURUSHA","text":"Hah, a novel idea indeed!"},{"name":"RURUSHA","text":"Well, she is capable of flight. It would not surprise me if she could talk as well. Perhaps then we could ask what ails her."},{"name":"RURUSHA","text":"Could I trouble you to make a gold mechanical voice box for our friend? Just imagine what interesting things she might share with us!"},{"name":"SYSTEM","text":"The Studium Deliveries list for Rurusha has been updated. To view the new list, speak with Rurusha."},{"name":"BORIC","text":"To think we might be able to speak with the Golden Dhyata... Although, I do worry how this might impact our research funds..."},{"name":"RURUSHA","text":"A mechanical voice box may be just the thing we need to learn more about our little friend here. Just imagine what she may have to tell us!"},{"name":"RURUSHA","text":"Oh, thank you! I can hardly wait to hear her speak."},{"name":"RURUSHA","text":"Oh, thank you! Exquisite as always. We'll have her talking in no time with a voice box like this!"},{"name":"RURUSHA","text":"All right. Let's see if she speaks..."},{"name":"RURUSHA","text":"(-The Golden Dhyata-)☆＆▼△　＄※◇　◎％××"},{"name":"SYSTEM","text":"The Golden Dhyata says...something! However, you haven't the foggiest idea what it's trying to tell you."},{"name":"RURUSHA","text":"She speaks! I knew it."},{"name":"BORIC","text":"Did I truly hear that just now? Oh, Professor. This could be the discovery of a lifetime."},{"name":"BORIC","text":"That said, while it definitely made a noise, it sounded more like a song than speech to me."},{"name":"NAMONOTAYAMONO","text":"Still wasting time on your little pet, I see."},{"name":"RURUSHA","text":"Ah, Professor Namono. Perfect timing! If you could spare a moment, we have need of your keen insight."},{"name":"NAMONOTAYAMONO","text":"I beg your pardon? Did I do something to suggest I wish to waste my time alongside you? Don't tell me you've actually made progress─"},{"name":"RURUSHA","text":"All thanks to <span class=\"highlight\">Forename</span>, yes. In fact, our recent discovery falls within your realm of expertise. Well, I say discovery, but it is more of a clue that may lead to one."},{"name":"NAMONOTAYAMONO","text":"A <span class=\"emphasis\">clue</span>? Oh, well that's very impressive given all the time you've already wasted on this lark. Honestly, are you even listening to yourself?"},{"name":"NAMONOTAYAMONO","text":"Regardless, I did not come here to discuss your latest failings as a researcher."},{"name":"NAMONOTAYAMONO","text":"Allow me to be brief: in light of your wasting of research funding, I have asked the Studium to consider if your continued employment is of worth to anyone here aside from yourself."},{"name":"NAMONOTAYAMONO","text":"Just look at how stressed your assistant is!"},{"name":"BORIC","text":"..."},{"name":"NAMONOTAYAMONO","text":"Fret not, Boric. I promise to look after you once Professor Rurusha is removed from her position. Of course, in return I expect you to sign my petition to proceed with this inquiry."},{"name":"RURUSHA","text":"Hmm, well that didn't go to plan, did it? Considering the linguistic nature of our problem, I was hoping Professor Namono might be willing to assist us."},{"name":"BORIC","text":"If only I had spoken up sooner. Perhaps it would not have come to this... Forgive me, Professor, but the day has given me much to consider. If you'll excuse me."},{"name":"RURUSHA","text":"I...I never realized he was under such stress."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Will you not go and speak with him?"},{"name":"A2","text":"Is it wise to leave him alone?"},{"name":"RURUSHA","text":"This is the life we choose as researchers, my friend. Callous though it may sound, there are certain matters we must work out for ourselves."},{"name":"RURUSHA","text":"There are certain matters we must work out for ourselves. I have faith he will make the right decision for himself, whatever that may be."},{"name":"RURUSHA","text":"But come, he would not wish for our work to remain at a halt on his return. We must consider our next course of action."},{"name":"SYSTEM","text":"Rurusha is thrilled with your efforts. She now considers you a <span class=\"highlight\">Top-drawer Relic Restorer</span>!"},{"name":"SYSTEM","text":"A new quest continuing the story of the Faculty of Archaeology is now available. Speak with Rurusha as either a blacksmith, armorer, or goldsmith at level 90 or above to undertake the quest."}],"reward":{"items":[{"num":2,"id":36060}]},"reqs":{"jobs":[{"lvl":88,"id":151}],"quests":[69672]},"next":[69674]},"partials":[{"type":"npc","id":"1039203","obj":{"i":1039203,"n":"Rurusha","l":3706,"q":7}},{"type":"item","id":"36060","obj":{"i":36060,"n":"Tsai tou Vounou","l":554,"c":24417,"t":46}},{"type":"quest","id":"69672","obj":{"i":69672,"n":"Boric's Choice","g":173,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69674","obj":{"i":69674,"n":"Wayback Machine","g":173,"l":"Old Sharlayan","s":0}}]}