{"quest":{"name":"One Step Forward","location":"Old Sharlayan","id":69678,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1038525,"target":1038525,"genre":174,"journal":["Jude eagerly awaits you.","Jude has tasked you with crafting aetherial amplifiers.<br><br>※Minimum collectability rating for this delivery is 150. Delivering items with a rating of 320 or more will earn greater rewards.","You deliver the aetherial amplifiers to Jude. The chocobo in his breast has transformed into a mighty hobgoblin, and, thus emboldened, he would gladly have your company again once the time is right."],"objectives":["Deliver aetherial amplifiers to Jude."],"dialogue":[{"name":"JUDE","text":"<span class=\"highlight\">Forename</span>, let us jump straight into the next part of the process!"},{"name":"JUDE","text":"I ask that you would craft another vital part of the starlens."},{"name":"JUDE","text":"You see, the operation of this particular type of telescope requires highly specialized magic. "},{"name":"JUDE","text":"While I understand the mechanics behind this magic, the sheer volume required far surpasses that at my disposal."},{"name":"JUDE","text":"Please, might you be so kind as to craft aetherial amplifiers for me?"},{"name":"JUDE","text":"There are no words to express how thankful I am, <span class=\"highlight\">Forename</span>. Not only are you assisting me with producing the starlens, but you continue to encourage me every step of the way! "},{"name":"JUDE","text":"The Studium Deliveries list for Jude has been updated. To view the new list, speak with Jude."},{"name":"JUDE","text":"With the aetherial amplifiers, I should finally be able to channel enough magic to operate our starlens!"},{"name":"JUDE","text":"Isn't she beautiful!"},{"name":"JUDE","text":"<span class=\"highlight\">Forename</span>, it's absolutely perfect! Thank you."},{"name":"JUDE","text":"I've just finished looking over the last delivery. We are so close to having all the parts necessary to begin assembly!"},{"name":"JEROMERE","text":"Jude, today must be your lucky day─the ever-busy Jeromere has decided to grace you with his presence!"},{"name":"JUDE","text":"Wh-Who are these people!? No doubt they're here to extort coin from me! I must report them to the Studium's guard posthaste!"},{"name":"JEROMERE","text":"Thinking aloud again, are we?"},{"name":"JEROMERE","text":"You need not worry. They are with me. In fact, they are members of the poetry group I mentioned. I brought them here so everyone could get acquainted."},{"name":"COOLFEMALE04142","text":"It's nice to meet you, Jude!"},{"name":"JUDE","text":"Sh-She's speaking to me!"},{"name":"JEROMERE","text":"Of course she's speaking to you. That is, of course, the reason we are here, is it not?"},{"name":"COOLMALE04142","text":"Ah, you must be the crafts<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> assisting Jude. Do also feel free to drop in on one of our poetry meets sometime, should it strike your fancy!"},{"name":"JEROMERE","text":"So what do you think? A magnificent group of people, are they not? We were just on our way to the Last Stand─would you care to join us?"},{"name":"JUDE","text":"Steady now. Jeromere is trying to help you. He knows you have no friends, and is attempting to coax you out of your shell. You really should be thankful...truly."},{"name":"JUDE","text":"Absolutely not."},{"name":"JUDE","text":"Apologies, but I am currently in the middle of producing something known as a starlens. Perhaps another time..."},{"name":"JEROMERE","text":"What is this nonsense!?"},{"name":"JEROMERE","text":"Come now, Jude. Join us just this one time. Only regret awaits, should you continue down this dark path."},{"name":"JUDE","text":"How can you say that with such certainty?"},{"name":"JEROMERE","text":"I..."},{"name":"COOLMALE04142","text":"Trust me, he knows exactly what he's talking about!"},{"name":"JEROMERE","text":"Please, that's enough. L-Let us just be on our way, shall we?"},{"name":"JUDE","text":"&lt;sigh&gt; Having to meet new people is quite draining... I must say, however, I'm rather proud of myself. Normally, I would have been so nervous, even the thought of speaking would cause me to lose consciousness! I must be growing."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You did well."},{"name":"A1","text":"You're improving."},{"name":"A1","text":"Get a hold of yourself!!!"},{"name":"JUDE","text":"It is you I have to thank, <span class=\"highlight\">Forename</span>! Your continued support has allowed me to really blossom."},{"name":"JUDE","text":"B-But I am calm...!"},{"name":"JUDE","text":"...Did I just speak up for myself? It seems I have changed even more than I initially thought since meeting <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"JUDE","text":"I see! It was a test. No doubt <span class=\"highlight\">Forename</span> was trying to see just how much I have grown!"},{"name":"JUDE","text":"Now enough about me! We are so close to the finish line. With just a bit more work, the starlens will be complete!"},{"name":"JUDE","text":"Before we proceed, however, there is one thing I must confirm."},{"name":"JUDE","text":"Please come back to see me when you next find the time."},{"name":"JUDE","text":"Thanks to <span class=\"highlight\">Forename</span>, the chocobo in my heart has transformed into a mighty goblin!"},{"name":"SYSTEM","text":"Jude is overjoyed with your efforts. He now considers you a <span class=\"highlight\">Good-natured Individual</span>!"},{"name":"SYSTEM","text":"A new quest continuing the story of the Faculty of Astronomy is now available. Upon its completion, the Studium Deliveries list for Jude will be updated."}],"reward":{"items":[{"num":2,"id":36046}]},"reqs":{"jobs":[{"lvl":85,"id":152}],"quests":[69677]},"next":[69679]},"partials":[{"type":"npc","id":"1038525","obj":{"i":1038525,"n":"Jude","l":3706,"q":7}},{"type":"item","id":"36046","obj":{"i":36046,"n":"Happiness Juice","l":527,"c":24405,"t":46}},{"type":"quest","id":"69677","obj":{"i":69677,"n":"Poetry Recital","g":174,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69679","obj":{"i":69679,"n":"A Ten-year Promise","g":174,"l":"Old Sharlayan","s":0}}]}