{"quest":{"name":"Boric's Choice","location":"Old Sharlayan","id":69672,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1039203,"target":1039203,"genre":173,"usedItems":[35835,35836],"journal":["Rurusha has something to ask of you."],"objectives":["Speak with the merchant.","Speak with Rurusha.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a gold core <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the gold core <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Rurusha</span></span>."],"dialogue":[{"name":"RURUSHA","text":"Welcome back, <span class=\"highlight\">Forename</span>. So wonderful to see you again."},{"name":"RURUSHA","text":"We just received word our delivery of core materials has come into port."},{"name":"RURUSHA","text":"Boric was just leaving to go and fetch them, but now that you're here, might I ask you to accompany him? I would be certain of the quality of these goods, and I trust your discerning artisan's eye."},{"name":"RURUSHA","text":"Fantastic! Well, hurry along, you two."},{"name":"BORIC","text":"Let's be on our way, then. The merchant said she would be waiting for us in Scholar's Harbor."},{"name":"RURUSHA","text":"Sorry for sending you off when you've only just arrived, but I would leave nothing to chance with these supplies."},{"name":"BORIC","text":"Ah, <span class=\"highlight\">Forename</span>! This is the merchant I was telling you about."},{"name":"MERCHANT04136","text":"'Ello, 'ello! 'Ow are you on this fine day? You're both from the Studium, yes?"},{"name":"BORIC","text":"Why yes, we are actually. We've been sent by Professor Rurusha for─"},{"name":"MERCHANT04136","text":"Ah, so you'd be 'ere for the minerals then. 'Ave a gander at 'em and let me know if they meet with your approval."},{"name":"BORIC","text":"Well, they seem to be what we asked for. Any thoughts, <span class=\"highlight\">Forename</span>?"},{"name":"BORIC","text":"Oh, that's great to hear! What a relief."},{"name":"MERCHANT04136","text":"Pleasure doin' business with you!"},{"name":"NAMONOTAYAMONO","text":"Do you have the tome I recently ordered for the Studium? The order was placed under Namono Tayamono."},{"name":"MERCHANT04136","text":"Ah, Professor Namono! Always a pleasure. Of course I do!"},{"name":"MERCHANT04136","text":"'Ere it is. I hope it's to your likin'."},{"name":"NAMONOTAYAMONO","text":"Yes, this is indeed what I requested you acquire, though I must say its contents appear to be somewhat lacking."},{"name":"MERCHANT04136","text":"Deary me! Do you wish to return it, then?"},{"name":"NAMONOTAYAMONO","text":"No, no. You did your job and deserve to be compensated accordingly."},{"name":"MERCHANT04136","text":"Thank you kindly. If there's nothin' else, I'll be on my way."},{"name":"NAMONOTAYAMONO","text":"Here, perhaps with this you will learn something about what constitutes worthwhile research."},{"name":"NAMONOTAYAMONO","text":"If it piques your interest, then feel free to visit me in my office. I would gladly welcome someone as determined as you to join my staff; we could do with another pair of hands."},{"name":"BORIC","text":"A compendium of linguistic research. I fear its contents are beyond me."},{"name":"BORIC","text":"Archaeology has always been my preferred field of study. However, my marks in school often left much to be desired... To even call me a second-rate researcher would be flattery."},{"name":"BORIC","text":"But that mattered little to Professor Rurusha. She took me under her wing in spite of my shortcomings, and my performance greatly improved thanks to her tutelage."},{"name":"BORIC","text":"So much so, I was offered a position working at Saint Coinach's Find after graduation. But I couldn't accept it─I owe a great debt to the professor for all she has done for me. So long as she has need, I will remain at her side."},{"name":"BORIC","text":"Alas, I don't feel I've been much help to her of late. Perhaps it would be for the best if I took on a few odd jobs for Professor Namono. At least then I would be contributing to the field in some way, however insignificant it may be..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Then Professor Rurusha would be all on her own."},{"name":"A1","text":"Only you can decide how you live your life."},{"name":"A1","text":"Namono would work you to the bone, you know."},{"name":"BORIC","text":"Ugh, you are right... This is not a decision to be made lightly."},{"name":"BORIC","text":"Apologies for my jabbering. You did not come all this way to hear my lamentations."},{"name":"BORIC","text":"Come, let us return to the professor."},{"name":"BORIC","text":"I do hope the relic is restored soon... I fear the stress of this endeavor may be the death of me."},{"name":"RURUSHA","text":"Welcome back, you two. Everything went well I take it?"},{"name":"RURUSHA","text":"Good to hear! Thanks again for lending us that discerning eye of yours."},{"name":"RURUSHA","text":"I say, Boric, what is that tome you have there?"},{"name":"BORIC","text":"Oh, this? Er, well, we happened to run into Professor Namono when we met the merchant, and..."},{"name":"BORIC","text":"...The tome he ordered seemed to underwhelm him, and so he shoved it into my hands. He, er, also asked if I might consider working for him."},{"name":"RURUSHA","text":"Look at you! Getting scouted by other professors. You're coming up in the world, Boric."},{"name":"BORIC","text":"Alas, he only wanted me to help out with odd jobs. I could never hope to aid anyone in deciphering ancient languages, as you well know..."},{"name":"RURUSHA","text":"I do wish he wouldn't put himself down like this. He contributes more than his fair share to my work, at the very least. But let us set that aside for now. The time is come for you to get to work on the core."},{"name":"RURUSHA","text":"If you should have need of additional materials, Boric will provide."},{"name":"BORIC","text":"I made a point of ordering slightly more than we needed just in case something like this happened. Here you go!"},{"name":"BORIC","text":"It's...beautiful. Go and show it to the professor!"},{"name":"RURUSHA","text":"We're so, so close. Let me know once you've finished making the core."},{"name":"RURUSHA","text":"Well, that was nerve-racking work, but I've successfully replaced the old core with your new one. Now we need but pray that it works..."},{"name":"SYSTEM","text":"For the briefest of moments, the Golden Dhyata took flight! Unfortunately, it immediately falls to the table. A rattling sound can now be heard coming from within."},{"name":"RURUSHA","text":"Well, what do you know? It really <span class=\"emphasis\">can</span> fly like an airship!"},{"name":"BORIC","text":"I can hardly believe my eyes! Are you certain it is not Allagan in origin? I can think of no other ancient civilization capable of fashioning such a mammet."},{"name":"BORIC","text":"Hmm... Strange, though, that it continues to function poorly despite replacing all its parts."},{"name":"BORIC","text":"Which leaves us with what is now essentially a prohibitively expensive ornament."},{"name":"RURUSHA","text":"I'll grant you our results thus far are somewhat less than satisfactory, but this is not cause for panic."},{"name":"RURUSHA","text":"Archaeology is at its most interesting when you come up against a hurdle like this!"},{"name":"RURUSHA","text":"Don't you just love being challenged to solve a good mystery?"},{"name":"BORIC","text":"Well..."},{"name":"RURUSHA","text":"Only time will tell if the Golden Dhyata is truly a mammet, or simply someone's old plaything. But I could never forgive myself were I to move on to another project without first uncovering all our friend's secrets."},{"name":"RURUSHA","text":"Just think back to the state we found it in, and yet it's now capable of flight for goodness' sake! We've made incredible progress."},{"name":"RURUSHA","text":"That said, the rattling noise just now does have me worried. Perhaps I made a mistake somewhere when inserting the new parts. We'll need to dismantle it once more and see if we can't deduce what went wrong."},{"name":"RURUSHA","text":"Until then, I bid you get some rest. I will let you know the very moment we have finished."},{"name":"SYSTEM","text":"The next request will be available from Rurusha upon reaching level 88 as a blacksmith, armorer, or goldsmith."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"items":[{"num":2,"id":36053}]},"reqs":{"jobs":[{"lvl":85,"id":151}],"quests":[69671]},"next":[69673]},"partials":[{"type":"npc","id":"1039203","obj":{"i":1039203,"n":"Rurusha","l":3706,"q":7}},{"type":"item","id":"36053","obj":{"i":36053,"n":"Giant Haddock Dip","l":540,"c":24258,"t":46}},{"type":"item","id":"35835","obj":{"i":35835,"n":"Gold Core Material","l":536,"c":21474,"t":63}},{"type":"item","id":"35836","obj":{"i":35836,"n":"Gold Core","l":536,"c":21283,"t":63}},{"type":"quest","id":"69671","obj":{"i":69671,"n":"Rubbished Research","g":173,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69673","obj":{"i":69673,"n":"A Friend in Need","g":173,"l":"Old Sharlayan","s":0}}]}