{"quest":{"name":"Wayback Machine","location":"Old Sharlayan","id":69674,"patch":6.0,"sort":0,"icon":101136,"eventIcon":71221,"issuer":1039203,"target":1039203,"genre":173,"usedItems":[35837,35838],"journal":["Rurusha is in need of your sage advice.","Rurusha has discovered something strange inside the relic which appears to resemble an Allagan tomestone. She theorizes the device contains some heretofore forgotten knowledge, but a faulty connector may be preventing the mammet from accessing this repository of wisdom. To that end, she bids you fashion a new connector that should finally allow the Golden Dhyata to function as it was intended.<br><br>※Check Rurusha's box for more materials should you run out while attempting to craft the gold connector.","You deliver the gold connector to Rurusha only to learn from Boric that her very employment is under threat. Professor Namono has gathered the signatures needed to hold an inquiry into Rurusha's use of funding and the merit of her continued tenure at the Studium. Repairs on the relic are not yet complete, however, and so she sends you and Boric ahead of her to Learners' Meet while she completes her work.","After Boric fails spectacularly to stall for time, the scholarch commences his inquiry. However, it soon becomes clear that her continued employment can only benefit the Studium when she presents the fruits of her labor. The relic all believed to be little more than rubbish is, in truth, capable of translating ancient languages. Professor Namono apologizes for his animosity, after which Montichaigne suggests the two professors work together in their pursuit of knowledge. With the inquiry ended, Rurusha invites you back to Makers' Meet to thank you properly.","The two professors are prepared to join forces, and with Boric to assist them, there is no telling what groundbreaking research they may produce. Rurusha thanks you again for all you have done. When next you meet, she hopes to regale you with her myriad discoveries."],"objectives":["Synthesize a gold connector <img class=\"hq-icon small\" src=\"images/item/hq.png\"> and deliver it to Rurusha.","Speak with Namono Tayamono.","Speak with Rurusha."],"dialogue":[{"name":"RURUSHA","text":"Ah, <span class=\"highlight\">Forename</span>. Fortuitous timing as ever."},{"name":"RURUSHA","text":"As you can see, Boric has yet to return to the workshop. To be honest, it has been somewhat lonely here without him."},{"name":"RURUSHA","text":"For a mercy, I have managed to make progress with the Golden Dhyata by way of a rather curious discovery."},{"name":"RURUSHA","text":"Initially, I thought to leave her be, fearful of damaging the parts you've labored so hard to provide...but then curiosity got the better of me."},{"name":"RURUSHA","text":"I dismantled her yet again, but this time I discovered a black stone inside, a connector of some sort coiled all about it. Any ideas what it might be?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Is that...an Allagan tomestone?"},{"name":"A1","text":"Is that...? Are you sure that Allagan tomestone didn't drop from my pocket?"},{"name":"RURUSHA","text":"Ah, an Allagan tomestone, you say? It doesn't have the customary patterns of a tomestone, but the texture is certainly similar."},{"name":"RURUSHA","text":"Hmm... Based on where we found her, I very much doubt our friend here was created in the Third Astral Era. No, the Fifth Astral Era is much more likely. Perhaps even the beginning of the Sixth."},{"name":"RURUSHA","text":"It is entirely possible the people of that age, after unearthing Allagan relics, repurposed the technology. Or, perhaps, they merely drew inspiration from Allagan designs in their work."},{"name":"RURUSHA","text":"If this was meant to store records, which I believe it does, I would have expected it to serve as her core, much like the mammets of Ul'dah."},{"name":"RURUSHA","text":"However, the Golden Dhyata's core has an altogether different function. Which is why I suspect the stone, and whatever knowledge is stored within, is meant to supplement the core, hence the connector I found wrapped around it."},{"name":"RURUSHA","text":"Tell me, little one, just what secrets are you hiding?"},{"name":"RURUSHA","text":"<span class=\"highlight\">Forename</span>, would you be able to fashion a new connector for her? The one I found attached to the stone is clearly not working as intended."},{"name":"RURUSHA","text":"Honestly, what would I do without you? Let's not waste any time, then. We must finish our work before Professor Namono convinces the Studium to hold that inquiry."},{"name":"RURUSHA","text":"This may very well be the last request I ask of you. So please, any materials you require, but ask and I will see to the rest."},{"name":"SYSTEM","text":"This box is full to bursting with materials. Rurusha bids you take as much as you require."},{"name":"SYSTEM","text":"No need to be greedy. Rurusha is waiting for you to deliver the gold connector."},{"name":"RURUSHA","text":"Pray make that gold connector as quickly as possible."},{"name":"RURUSHA","text":"Excellent. The connector is in place."},{"name":"RURUSHA","text":"Now we need but insert the stone and see how she responds."},{"name":"BORIC","text":"Professor! Professor Rurusha!"},{"name":"RURUSHA","text":"Boric! So good to see you! If you're come to apologize─don't. You're here now and that's all that matters."},{"name":"BORIC","text":"No, that's not it. I mean, yes, I am sorry for being away for so long, but..."},{"name":"BORIC","text":"I came to apologize, Professor. I... I signed the petition for your inquiry."},{"name":"BORIC","text":"Your research is leading you nowhere, Professor, and I thought it better you resign than tarnish your legacy with this final project."},{"name":"BORIC","text":"So I signed the petition. And now...now Professor Namono has the signatures he needs to submit his petition."},{"name":"BORIC","text":"It was only after I signed that I realized my mistake. If that relic yet holds secrets of a bygone era, it is our duty to find them... But now we may never have that chance."},{"name":"NAMONOTAYAMONO","text":"I take it you have heard the good news."},{"name":"BORIC","text":"P-Professor Namono..."},{"name":"NAMONOTAYAMONO","text":"The faculty are ready to hold their inquiry, Professor. I suggest you make your way to Learners' Meet, lest you miss the ending of your own career."},{"name":"NAMONOTAYAMONO","text":"You two may as well come along, too. The more the merrier, as they say."},{"name":"RURUSHA","text":"Always in a hurry, that one. He really must learn how to relax."},{"name":"RURUSHA","text":"Boric, would you be a dear and do me a favor?"},{"name":"RURUSHA","text":"I wish to finish fitting this part to the Golden Dhyata. Once finished, I am positive we will learn all we need to know. But I need you to delay the inquiry, if only for a short time."},{"name":"RURUSHA","text":"No need to worry. I suspect it won't be long before the old girl stirs to life this time. Go ahead with Boric and wait for me at Learners' Meet."},{"name":"RURUSHA","text":"Just a few finishing touches and everything should be in order. Pray go ahead with Boric to Learners' Meet."},{"name":"BORIC","text":"I, er, Professor Namono! Um..."},{"name":"NAMONOTAYAMONO","text":"What's this? Only the two of you? You're not going to tell me that the great Professor Rurusha took the coward's way out and fled, are you?"},{"name":"BORIC","text":"No, no. Her legs simply don't move as fast as they used to. Would you care for a cup of tea while we wait? Better yet, we could pay a visit to the Last Stand!"},{"name":"NAMONOTAYAMONO","text":"Boric, we are far past the time for guilt and regret, would you not agree? But you needn't fret─I'll be sure to look after you. So please, there's no need to delay the inevitable."},{"name":"NAMONOTAYAMONO","text":"At any rate, all necessary parties to this inquiry will be here soon enough. Professor Rurusha's absence merely proves that she has no intention of defending herself. Now, let us make our way into the auditorium."},{"name":"MONTICHAIGNE","text":"Allow me to preface this hearing by stating that I have the utmost respect for you as a fellow academic, Professor Rurusha. However, given the support behind this recent petition, we have no choice but to consider the matter of your continued tenure here at the Studium."},{"name":"MONTICHAIGNE","text":"You stand accused of squandering Studium funds on the restoration of a relic of questionable origin."},{"name":"NAMONOTAYAMONO","text":"And she has refused time and time again to heed my requests to cease her activities! She is convinced that the relic in question is some sort of mammet, but I have not witnessed it move even an ilm."},{"name":"NAMONOTAYAMONO","text":"What's more, the gleaner that found this so-called relic has a history of delivering counterfeits in the past. Isn't that right, Boric?"},{"name":"RURUSHA","text":"Come now, Professor Namono, nobody's perfect. And for the hundredth time: that mammet is something special. You just need to be patient with her."},{"name":"RURUSHA","text":"Come on, little one. Show them."},{"name":"BORIC","text":"Am I seeing things?"},{"name":"NAMONOTAYAMONO","text":"This proves nothing! How do we know you didn't ask this helper of yours to contrive a means for it to move on its own?"},{"name":"MONTICHAIGNE","text":"Well, I suppose it falls on me to confirm as much. Tell me, did you do as Professor Namono suggests?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I only made the parts required to restore it."},{"name":"A2","text":"I would never do anything so underhanded!"},{"name":"RURUSHA","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> speaks the truth! Naturally, someone of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> ability could doubtless make modifications to allow rudimentary movement, but I don't think even the best in <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> field could achieve this. "},{"name":"BORIC","text":"Why, isn't that the tome I received from Professor Namono?"},{"name":"RURUSHA","text":"As you may recall, the Golden Dhyata produced strange noises some time ago in our workshop. It was only until recently I realized those noises were syllables, and they match those comprising the language found in this book."},{"name":"RURUSHA","text":"Now, my dear, would you kindly read an excerpt from the book? Oh, and please be certain to translate it into a language we can all understand."},{"name":"GOLDENDHYATA","text":"&lt;rattle&gt; “The serpent that sleeps in the deep slowly sheds its skin of old...”"},{"name":"NAMONOTAYAMONO","text":"I recognize that passage. It has something to do with magicks that control the Lifestream─at least, I would wager that's what the serpent represents. It aligns with everything my research has uncovered thus far."},{"name":"BORIC","text":"Then, this relic is─"},{"name":"NAMONOTAYAMONO","text":"An ancient translation device, yes. And here I was convinced that Professor Rurusha had all but lost her critical faculties..."},{"name":"NAMONOTAYAMONO","text":"Yet clearly it was I that was entirely in the wrong... I have been too quick to belittle the work of others, thinking only of what immediate benefit they might have to mine."},{"name":"NAMONOTAYAMONO","text":"A researcher should be inquisitive and reflective, but I have only been selfish and overly prideful."},{"name":"NAMONOTAYAMONO","text":"Please, allow me to extend my sincerest apologies. If anyone should be removed from their post, it is I..."},{"name":"RURUSHA","text":"Oh, stop. You needn't be so dramatic! If not for your passion for linguistics, I would never have discovered the importance of this relic."},{"name":"MONTICHAIGNE","text":"Well, it would seem there is no further need for these proceedings. If I may make a suggestion, would you two consider working together? It is clear to me, at least, that such an arrangement would be mutually beneficial."},{"name":"RURUSHA","text":"What a fantastic idea! I would love nothing more than to work alongside Professor Namono."},{"name":"MONTICHAIGNE","text":"Pray allow me to thank you for helping Professor Rurusha with her research. Were it not for your intervention, I fear we may have committed a grave error and silenced a perfectly capable researcher along with her work."},{"name":"RURUSHA","text":"All's well that ends well, eh? Let's head back to Makers' Meet. I need to thank you properly for everything you've done."},{"name":"BORIC","text":"&lt;sob&gt; Oh, I'm so relieved..."},{"name":"NAMONOTAYAMONO","text":"It seems I owe you an apology. Still, it is most pleasing to think this will aid my work as well. There is yet much learning to be done!"},{"name":"BORIC","text":"I thought I was acting in your best interests, but... Well..."},{"name":"BORIC","text":"Professor, I'm more sorry than you'll ever know... Would you ever consider allowing me to work as your assistant once more? I'll give you all the time you need to deci─"},{"name":"RURUSHA","text":"Listen, Boric. You don't need to apologize to me because nothing's changed between us. You never stopped being my assistant."},{"name":"RURUSHA","text":"And please, do yourself a favor and stop being so hard on yourself all the time. I couldn't ask for a better colleague!"},{"name":"RURUSHA","text":"Though, I suppose there is one thing you could do with learning: patience. Our work often takes time to bear results, after all. Now, are you ready to get back to work?"},{"name":"BORIC","text":"Oh, Professor!"},{"name":"RURUSHA","text":"Ah, what a nice surprise! Are you here to ask for our little friend's help?"},{"name":"NAMONOTAYAMONO","text":"Something like that, yes."},{"name":"NAMONOTAYAMONO","text":"The book I gave your assistant was merely an abridged compilation of works on ancient languages. What I have now are complete inscriptions of the texts I am presently studying."},{"name":"NAMONOTAYAMONO","text":"I simply must know what is written here! I have spent far too long toiling away to decipher their contents to no avail."},{"name":"RURUSHA","text":"I'm all too familiar with that feeling. I suppose all researchers are spurred on by that thirst for answers."},{"name":"RURUSHA","text":"Perhaps said answers will even help with these recent anomalies in the Lifestream. I'm sure some of the other professors at the Studium would love to hear your findings."},{"name":"BORIC","text":"Well, you two have certainly reconciled your differences quite quickly. Would that I could relinquish my worries so easily..."},{"name":"RURUSHA","text":"Thank you once again, <span class=\"highlight\">Forename</span>. If you hadn't stuck around to help as long as you did, I might have lost an irreplaceable assistant and countless colleagues."},{"name":"RURUSHA","text":"And that is to say nothing of the huge academic leap forward we're about to make thanks to all your hard work."},{"name":"RURUSHA","text":"A gift I hope to repay with hard work of my own. When next you visit, I'll be sure to have a number of fascinating discoveries to share with you."},{"name":"RURUSHA","text":"I hope you're prepared, Boric. You have <span class=\"emphasis\">two</span> professors to attend to now, so no more moping, all right?"},{"name":"NAMONOTAYAMONO","text":"Oh, I'm quite sure he'll have no time for that. As I no longer have the resources required to hire additional help, you are my one and only assistant now, Boric, so do try to keep your wits about you."},{"name":"BORIC","text":"Oh dear! What have I gotten myself into now...? Well, at least the subject matter is interesting."},{"name":"SYSTEM","text":"Rurusha is deeply moved by your efforts. She now considers you a <span class=\"highlight\">Masterful Relic Restorer</span>!"},{"name":"SYSTEM","text":"Keep an eye out for others at the Studium who require the help of an able artisan. You never know who might be in need of your skills."},{"name":"SYSTEM","text":"You have completed all of the Studium quests. It seems Qih Aliapoh has something she would like to ask of you."},{"name":"SYSTEM","text":"Pay a visit to Searchers' Meet should you wish to hear her out."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":1044,"items":[{"id":33938,"one":1},{"id":33939,"one":1},{"id":33940,"one":1}]},"reqs":{"jobs":[{"lvl":90,"id":151}],"quests":[69673]},"next":[70010]},"partials":[{"type":"npc","id":"1039203","obj":{"i":1039203,"n":"Rurusha","l":3706,"q":7}},{"type":"item","id":"33938","obj":{"i":33938,"n":"Craftsman's Competence Materia X","l":560,"c":20290,"t":58,"materia":{"tier":9,"value":27,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"33939","obj":{"i":33939,"n":"Craftsman's Cunning Materia X","l":560,"c":20290,"t":58,"materia":{"tier":9,"value":10,"attr":"CP","category":1}}},{"type":"item","id":"33940","obj":{"i":33940,"n":"Craftsman's Command Materia X","l":560,"c":20290,"t":58,"materia":{"tier":9,"value":18,"attr":"Control","category":1}}},{"type":"item","id":"35837","obj":{"i":35837,"n":"Gold Connector Material","l":560,"c":25919,"t":63}},{"type":"item","id":"35838","obj":{"i":35838,"n":"Gold Connector","l":560,"c":26108,"t":63}},{"type":"quest","id":"69673","obj":{"i":69673,"n":"A Friend in Need","g":173,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"70010","obj":{"i":70010,"n":"The Meeting of Minds","g":178,"l":"Old Sharlayan","s":20}}]}