{"quest":{"name":"A Ten-year Promise","location":"Old Sharlayan","id":69679,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1038525,"target":1038525,"genre":174,"usedItems":[35839,35840],"journal":["Jude appears very determined."],"objectives":["Search for Jeromere.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a set of writing utensils <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the set of writing utensils <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to the cocksure student</span></span>.","Speak with Jeromere.","Speak with Jeromere once more.","Speak with Jude."],"dialogue":[{"name":"JUDE","text":"Last we met, I mentioned there was something I needed to confirm before proceeding. This something concerned Jeromere."},{"name":"JUDE","text":"Since joining the Studium, I have not had the chance to have a proper discussion with him."},{"name":"JUDE","text":"There is so much I would like to ask him, such as why he refuses to speak of our vow from ten years ago or why he insists so fervently that I drop my studies."},{"name":"JUDE","text":"For the longest time I was too scared to confront him. I thought if he had truly lost interest in astronomy maybe we wouldn't have anything in common anymore, and..."},{"name":"JUDE","text":"Never mind. That's no longer relevant. Thanks to you and our starlens journey, I've become confident enough to face my fears head-on."},{"name":"JUDE","text":"I plan to meet Jeromere and ask him what happened to the promise we made at the exact spot where we encountered the Azure Star in Tranquility."},{"name":"JUDE","text":"But I'm positive that if I ask him to come, Jeromere will find another clever excuse to avoid me."},{"name":"JUDE","text":"Please, <span class=\"highlight\">Forename</span>, would you be so kind as to ask him in my stead?"},{"name":"JUDE","text":"Thank you! You can likely find him at Auk's Landing reciting poetry with his friends."},{"name":"JUDE","text":"In the meantime I will make my way to Tranquility and wait for you and Jeromere there."},{"name":"COOLMALE04143","text":"You there! You're the crafts<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> helping out at the Faculty of Astronomy. I take it you're not here to recite poetry?"},{"name":"COOLMALE04143","text":"You're looking for Jeromere? Sure, I can point you in his direction but you have to do something for me first."},{"name":"COOLMALE04143","text":"You see, there is this girl. She spurned my advances a few days ago..."},{"name":"COOLMALE04143","text":"Hm, I can see you are also flabbergasted to learn she rejected a dashing young man such as myself!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"So what do you need me to do?"},{"name":"A1","text":"Hurry up and tell me what you want already."},{"name":"COOLMALE04143","text":"Aren't we snappy? Well, I know just the thing that will elevate me from simply charming to outstanding─a set of classy writing utensils! I want you to craft them for me."},{"name":"COOLMALE04143","text":"I will, of course, see that you are furnished with everything you need. After all, such consideration is the defining quality of a gentleman!"},{"name":"COOLMALE04143","text":"Just ask this boy right next to me for materials. He still owes me a rather large sum of gold and will see that all your expenses are covered."},{"name":"SURROUNDINGS04143","text":"Let's hurry and get this over with. I cannot stand being indebted to him for a moment longer!"},{"name":"SURROUNDINGS04143","text":"Hm? Who are you? What do you want from us?"},{"name":"COOLMALE04143","text":"Once you finish crafting me my utensils, you can deliver them directly to me."},{"name":"COOLMALE04143","text":"Excellent! With this exquisite set, I will no doubt be able to produce poetry beyond that of the average club member! She will have no choice but rethink her foolish decision!"},{"name":"COOLMALE04143","text":"Ah, right. You wanted to know where Jeromere is. You can find him at Scholar's Harbor right about this time."},{"name":"SURROUNDINGS04143","text":"A real wet blanket, this one is, if you ask me."},{"name":"COOLMALE04143","text":"No need to say that. He's only just joined and has yet to settle in, is all."},{"name":"SURROUNDINGS04143","text":"What faculty did he transfer over from again?"},{"name":"COOLMALE04143","text":"He is certainly not going to be happy if I told you. You're going to have to ask someone else."},{"name":"SURROUNDINGS04143","text":"Hm... Sounds to me like he's harboring a few secrets, then."},{"name":"COOLMALE04143","text":"Yes, yes, the utensils you crafted are superb. Rather than dallying about admiring your handiwork, however, you'd best hurry to Scholar's Harbor if you want to catch Jeromere."},{"name":"SURROUNDINGS04143","text":"Let me know if you need any more materials. &lt;sigh&gt; I should've found a way to return him his gil sooner..."},{"name":"SURROUNDINGS04143","text":"Well, at the very least, I've managed to avoid bankruptcy..."},{"name":"JEROMERE","text":"Oh! It's you─the crafts<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> working with Jude. What can I do for you?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I want to talk to you about Jude."},{"name":"A2","text":"I need to speak with you."},{"name":"JEROMERE","text":"You want to speak with me regarding Jude...?"},{"name":"JEROMERE","text":"Very well. I suppose I can spare a few moments if it concerns our dear friend Jude."},{"name":"JEROMERE","text":"Shall we talk here, or did you wish to speak in private elsewhere?"},{"name":"JEROMERE","text":"Tranquility? I'll be on my way, then."},{"name":"COOLMALE04143","text":"Do not worry! They are in good hands. Now, I suggest you hurry. Jeromere isn't going to be at Scholar's Harbor for much longer."},{"name":"SURROUNDINGS04143","text":"The mystery grows deeper. I wonder what happened to Jeromere at his previous faculty...?"},{"name":"JEROMERE","text":"So what exactly did you wish to speak with me about?"},{"name":"JEROMERE","text":"I see... I suspected as much."},{"name":"JUDE","text":"Of course I should've known you'd be suspicious. You have always been two steps ahead of me."},{"name":"JUDE","text":"Even so, you still came. And I have words for you that have been left unsaid for far too long."},{"name":"JUDE","text":"Jeromere, why did you quit the Faculty of Astronomy?"},{"name":"JEROMERE","text":"So you know I once presided there..."},{"name":"JUDE","text":"It would be odd if I didn't. Surely, even you knew you wouldn't be able to feign ignorance for long. I ask you again: why did you quit the Faculty of Astronomy?"},{"name":"JEROMERE","text":"I..."},{"name":"JUDE","text":"Ten years ago we made a vow at this very spot. We swore together we'd search for and find the Azure Star together!"},{"name":"JUDE","text":"Why would you renege on our promise now? Have you come to hate astronomy?"},{"name":"JEROMERE","text":"Me? Hate astronomy? Ha! Please do not be silly. Finding that star meant the world to me."},{"name":"JEROMERE","text":"&lt;sigh&gt; You will also be forced to face the truth one day, just as I have. Allow me to warn you before it is too late."},{"name":"JEROMERE","text":"I am but one summer older than you. I shed blood, sweat, and tears to ensure I'd be able to earn a place to study at the Studium."},{"name":"JEROMERE","text":"I kept silent about which faculty I was to enter because I had hoped to make some progress toward our goals and surprise you with it once you joined."},{"name":"JEROMERE","text":"Upon hearing members were free to use the telescope any time, I joined the Classical Astronomical Association. I planned to devote all my spare time to our investigation."},{"name":"JEROMERE","text":"For several months, day in and day out, I took that telescope and observed every last corner of the sky without fail."},{"name":"JEROMERE","text":"To my utter despair, I was unsuccessful in ever locating the Azure Star."},{"name":"JEROMERE","text":"Even so, I refused to give up on our dream. I thought perhaps a more powerful telescope was required, and so after much negotiating with my professors, I was granted leave to use the finest equipment available in the Studium."},{"name":"JEROMERE","text":"Yet for all my effort, all my planning...I could find not so much as a glimmer of that bloody star in the night sky."},{"name":"JEROMERE","text":"I grew more weary by the day and was eventually forced to come to a harrowing realization..."},{"name":"JEROMERE","text":"The Azure Star does not exist. It never did. Just as the scholars at the Studium told us back then, we imagined it."},{"name":"JUDE","text":"The Azure Star...doesn't exist?"},{"name":"JUDE","text":"If...If, in fact, what you say is true, then why not tell me sooner?"},{"name":"JEROMERE","text":"Same as me, finding that star meant everything to you. How could I possibly tell you that..."},{"name":"JUDE","text":"If the Azure Star doesn't exist, then what have I been working towards this entire time...?"},{"name":"JEROMERE","text":"I understand your feelings better than you know. Forgetting about it will take time, but it can be done."},{"name":"JEROMERE","text":"Promise me, however, you won't forget this, Jude: I am and always will be your friend and ally."},{"name":"JUDE","text":"My life─without the Azure Star giving me direction and purpose─is meaningless. What am I to do...?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"What do you <span class=\"emphasis\">want</span> to do?"},{"name":"A3","text":"You're the only one who can give your life purpose."},{"name":"JUDE","text":"Yes. You're absolutely right. Letting someone or something determine my life's path is the easy way out. I'm the only one that can decide what's right for me."},{"name":"JUDE","text":"Let's return to Makers' Meet. There is something I would like to investigate."},{"name":"JUDE","text":"If even Jeromere was unable to find it, there is a good chance the Azure Star truly does not exist..."},{"name":"JUDE","text":"There is, however, one other possibility. There is the chance it is out there, just not observable with the tools that were at his disposal."},{"name":"JUDE","text":"The journey we're about to embark upon is about as dark and uncertain as a flight through a starless night sky."},{"name":"JUDE","text":"Regardless, I shall not give up. This is a dream I've pursued for a decade. I cannot walk away without a fight."},{"name":"JUDE","text":"Alone, I would have no hope of continuing Jeromere's work, but with you by my side perhaps I can accomplish that which even he has not! <span class=\"highlight\">Forename</span>, may I count on your continued assistance?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"I will see you through your adventure."},{"name":"A4","text":"Well, I can't leave you to your own devices, can I?"},{"name":"JUDE","text":"I knew I could count on you! Thank you, <span class=\"highlight\">Forename</span>! Once I have everything sorted, let us begin production posthaste!"},{"name":"JUDE","text":"<span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> continued encouragement has really lit a fire in my heart. I feel as fierce as a bomb!"},{"name":"SYSTEM","text":"The next request will be available from Jude upon reaching level 88 as a carpenter, leatherworker, or weaver."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"items":[{"num":2,"id":36053}]},"reqs":{"jobs":[{"lvl":85,"id":152}],"quests":[69678]},"next":[69680]},"partials":[{"type":"npc","id":"1038525","obj":{"i":1038525,"n":"Jude","l":3706,"q":7}},{"type":"item","id":"36053","obj":{"i":36053,"n":"Giant Haddock Dip","l":540,"c":24258,"t":46}},{"type":"item","id":"35839","obj":{"i":35839,"n":"Writing Utensil Materials","l":536,"c":26110,"t":63}},{"type":"item","id":"35840","obj":{"i":35840,"n":"Writing Utensils","l":536,"c":53022,"t":63}},{"type":"quest","id":"69678","obj":{"i":69678,"n":"One Step Forward","g":174,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69680","obj":{"i":69680,"n":"An Astronomical Growth","g":174,"l":"Old Sharlayan","s":0}}]}