{"quest":{"name":"Poetry Recital","location":"Old Sharlayan","id":69677,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1038525,"target":1038525,"genre":174,"journal":["Jude appears eager to continue his work with you.","Jude has tasked you with crafting aetherial lenses.<br><br>※Minimum collectability rating for this delivery is 140. Delivering items with a rating of 290 or more will earn greater rewards.","You deliver the aetherial lenses to Jude. With the strength of a chocobo now raging in his heart, he seems eager to continue your work together."],"objectives":["Deliver aetherial lenses to Jude."],"dialogue":[{"name":"JUDE","text":"Aha, <span class=\"highlight\">Forename</span>! Just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I wanted to see!"},{"name":"JUDE","text":"I have another request to make of you. Would you be up to the task?"},{"name":"JUDE","text":"Thank you!"},{"name":"JUDE","text":"I need for you to craft what is to be the heart and soul of the starlens."},{"name":"JUDE","text":"You see, an ordinary telescope picks up on starlight, whereas the starlens captures aetherial flickers."},{"name":"JUDE","text":"This requires what is known as an aetherial lens. While, of course, materials of a high grade are important, it is the craftsmanship that determines quality─to which I turn to you!"},{"name":"SYSTEM","text":"The Studium Deliveries list for Jude has been updated. To view the new list, speak with Jude."},{"name":"JUDE","text":"Have you managed to finish the aetherial lenses? These are what will allow us to pick up on the aetherial firmaments in the distance."},{"name":"JUDE","text":"Thank you for your help, <span class=\"highlight\">Forename</span>! We are now a step closer to completing the starlens!"},{"name":"JUDE","text":"Magnificent! Even to the untrained eye, it is easy to see the craftsmanship is second to none! With this aetherial lens, we will be able to detect even the most distant of aetherial bodies!"},{"name":"JUDE","text":"Once again, I am indebted to you. We are still in the early stages of our journey, but I hope we can continue to press forward with the same amount of fervor."},{"name":"JEROMERE","text":"Jude, sequestering yourself in such confined quarters will eventually take a toll on your mental health. Come, there is fun to be had in the outside world!"},{"name":"JUDE","text":"And what, exactly, does this “fun” you speak of entail?"},{"name":"JEROMERE","text":"Allow me to illustrate. I began this morning with a splendid cup of freshly brewed coffee from the Last Stand. Shortly thereafter, we all gathered at Auk's Landing to perform a public poetry recital!"},{"name":"JUDE","text":"I have no poems to recite..."},{"name":"JEROMERE","text":"'Tis the spirit that counts! Poetry will help you learn to express yourself more fully, Jude. In fact, why don't you give it a try right now? Make sure you really put your feelings into it!"},{"name":"JUDE","text":"...I suppose I can give it a try, if it means I can become a bit more like you..."},{"name":"JUDE","text":"A soul shrouded by the dark abyss<br>The tears that pour forth as blood-stricken rain<br>Solidify the poison that nestles in my heart<br>The world returns to nothingness..."},{"name":"JEROMERE","text":"...Er, I regress...perhaps you need not delve <span class=\"emphasis\">so</span> deeply into your feelings..."},{"name":"JEROMERE","text":"That aside, now you've had a taste of what our sessions entail and what it is like to live every day to the fullest!"},{"name":"JEROMERE","text":"With your grades and brain, changing faculties should be fairly straightforward. By my next visit, I expect you'll have joined the Faculty of Literature and our poetry club!"},{"name":"JUDE","text":"While I know Jeromere intends well, abandoning my studies in pursuit of literature would mean relinquishing my dream of locating the Azure Star..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You can't give up on your dreams!"},{"name":"A1","text":"If your resolve is so weak, perhaps you should consider moving to the Faculty of Literature..."},{"name":"A1","text":"Get a hold of yourself!"},{"name":"JUDE","text":"You're absolutely right! The whole reason I joined the Studium and this association was to see my goals through!"},{"name":"JUDE","text":"Thank you for always being so supportive and returning me to my senses."},{"name":"JUDE","text":"P-Please do not yell! You know I scare easily..."},{"name":"JUDE","text":"That said, do I always appear so frazzled to you? Or perhaps this is your way of encouraging me...?"},{"name":"JUDE","text":"Either way, I joined the Studium and this association for one reason and one reason only. I cannot give up!"},{"name":"JUDE","text":"I just wonder why Jeromere is so unrelenting in his attempts to have me withdraw from my studies... I do not understand. Astronomy was his first love..."},{"name":"JUDE","text":"Though we were momentarily sidetracked, I would like to thank you once again for your help. I am eager to continue our work together!"},{"name":"JUDE","text":"With you by my side, the resolve in my heart has hardened, and I feel as though the strength of a chocobo rages within me."},{"name":"SYSTEM","text":"Jude is delighted with your efforts. He now considers you an <span class=\"highlight\">Individual That Takes Time to Warm Up to Strangers</span>!"},{"name":"SYSTEM","text":"The next request will be available from Jude upon reaching level 85 as a carpenter, leatherworker, or weaver."}],"reward":{"items":[{"num":250,"id":10},{"num":250,"id":11}]},"reqs":{"jobs":[{"lvl":83,"id":152}],"quests":[69676]},"next":[69678]},"partials":[{"type":"npc","id":"1038525","obj":{"i":1038525,"n":"Jude","l":3706,"q":7}},{"type":"quest","id":"69676","obj":{"i":69676,"n":"The World without You","g":174,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69678","obj":{"i":69678,"n":"One Step Forward","g":174,"l":"Old Sharlayan","s":0}}]}