{"quest":{"name":"Rubbished Research","location":"Old Sharlayan","id":69671,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1039203,"target":1039203,"genre":173,"journal":["Rurusha is in need of a particular part.","Rurusha has now tasked you with crafting gold motor components.<br><br>※Minimum collectability rating for this delivery is 150. Delivering items with a rating of 320 or more will earn greater rewards.","You deliver the components to Rurusha. Until the materials for the core arrive, however, it seems you have time to spend on honing your crafting skills."],"objectives":["Deliver the gold motor components to Rurusha."],"dialogue":[{"name":"RURUSHA","text":"<span class=\"highlight\">Forename</span>! Lovely to see you again."},{"name":"RURUSHA","text":"I do hope you've been looking after yourself. On more than one occasion, my students have fallen ill due to neglecting their health, you know. I wouldn't want you to go the same way."},{"name":"RURUSHA","text":"Goodness, listen to me prattling on like some worried old mother. Well, I may not be your mother, but the rest still stands─I am old, and I do worry about you."},{"name":"RURUSHA","text":"But never mind me─you're obviously in good health and spirits both. Now, while you were away, I took a closer look at the Golden Dhyata to determine what other parts may be faulty."},{"name":"RURUSHA","text":"The problem, it seems, is either the mammet's core or the mechanism controlling motor function."},{"name":"BORIC","text":"I've examined the core, and it appears to be made from exceedingly rare minerals."},{"name":"BORIC","text":"I could find no gleaners willing or able to procure them, but I did manage to strike a deal with a merchant in the harbor. It will take time for the materials to be delivered, however."},{"name":"RURUSHA","text":"Until they arrive, I propose we start with another rather important piece of our mammet puzzle."},{"name":"RURUSHA","text":"Your task is to craft the motor components required to support proper movement."},{"name":"BORIC","text":"This is far more complex than anything we have asked of you thus far... I sincerely hope nothing goes wrong."},{"name":"BORIC","text":"There has been so much to worry over of late, I fear there is insufficient time in the day to consider it all. The thought of overlooked troubles keeps me from sleep, and before I realize it, another day rises with a new set of problems."},{"name":"RURUSHA","text":"Goodness, Boric, that won't do at all."},{"name":"RURUSHA","text":"Well, I suppose that's one more reason for you to do your best with this. I'm sure that would put Boric's mind at ease."},{"name":"SYSTEM","text":"The Studium Deliveries list for Rurusha has been updated. To view the new list, speak with Rurusha."},{"name":"BORIC","text":"Oh, I do hope I made the right decision in dealing with that merchant. I cannot seem to shake the feeling I've been swindled..."},{"name":"RURUSHA","text":"Let me know when you have finished. I fear poor Boric will struggle to sleep until the matter of this relic is resolved."},{"name":"RURUSHA","text":"Thank you! This should do our little friend a world of good."},{"name":"RURUSHA","text":"Thank you! Fine work as always. This should fit our little friend perfectly."},{"name":"RURUSHA","text":"She's looking a lot better with that new part in place. We've still no replacement for her core, but let us see if she is at least capable of rudimentary functions."},{"name":"SYSTEM","text":"The Golden Dhyata moves a little more than before! You suspect it will be good as new once you replace its core."},{"name":"RURUSHA","text":"We're making progress. It may be slow, but we're definitely heading in the right direction. All that remains is to fashion a new core."},{"name":"NAMONOTAYAMONO","text":"(-???-)I thought I told you to cease this ridiculous “work” of yours!"},{"name":"NAMONOTAYAMONO","text":"To think the Studium's resources are being wasted on such nonsense while my efforts to decipher ancient languages go largely ignored."},{"name":"NAMONOTAYAMONO","text":"You there, clumsy assistant! How have you not yet convinced her to stop this blunder of a project? You should understand better than anyone her colleagues' misgivings for this outlandish behavior."},{"name":"BORIC","text":"Well, I..."},{"name":"BORIC","text":"I concede I do not share the professor's optimism for the potential of that...thing. But so long as I am her assistant, I will continue to support her in whatever way I can."},{"name":"NAMONOTAYAMONO","text":"Word has it Qih Aliapoh thinks rather highly of you. For her to sing such praises, you must be an artisan of remarkable skill."},{"name":"NAMONOTAYAMONO","text":"Yet for all your talent, it seems you still have much to learn about what work you should and shouldn't accept. Your gifts will go to waste if you keep humoring this old bag!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Say what you want, but I think this is a job worth doing."},{"name":"A1","text":"I couldn't pass up such a lucrative venture."},{"name":"A1","text":"..."},{"name":"NAMONOTAYAMONO","text":"Honestly, what a merry bunch of fools you all are. Do not think you can continue wasting Studium resources forever!"},{"name":"RURUSHA","text":"Is it just me, or did he seem to be in a rather good mood today?"},{"name":"RURUSHA","text":"Well, hopefully that wasn't too distressing for you, <span class=\"highlight\">Forename</span>. We simply need to keep at it. I'm certain our mammet friend will stir to life as soon as we get her a new core!"},{"name":"RURUSHA","text":"As always, your help will be indispensable."},{"name":"SYSTEM","text":"Rurusha is overjoyed with your efforts. She now considers you a <span class=\"highlight\">Rather-good Relic Restorer</span>!"},{"name":"SYSTEM","text":"A new quest continuing the story of the Faculty of Archaeology is now available. Upon its completion, the Studium Deliveries list for Rurusha will be updated."}],"reward":{"items":[{"num":2,"id":36046}]},"reqs":{"jobs":[{"lvl":85,"id":151}],"quests":[69670]},"next":[69672]},"partials":[{"type":"npc","id":"1039203","obj":{"i":1039203,"n":"Rurusha","l":3706,"q":7}},{"type":"item","id":"36046","obj":{"i":36046,"n":"Happiness Juice","l":527,"c":24405,"t":46}},{"type":"quest","id":"69670","obj":{"i":69670,"n":"Gears of Gold","g":173,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69672","obj":{"i":69672,"n":"Boric's Choice","g":173,"l":"Old Sharlayan","s":0}}]}