{"quest":{"name":"In Search of the Azure Star","location":"Old Sharlayan","id":69675,"patch":6.0,"sort":0,"icon":101137,"unlocksFunction":1,"eventIcon":71341,"issuer":1038562,"target":1038525,"genre":174,"journal":["Jude appears troubled.","You speak with Jude, the sole member of the Classical Astronomer's Association, and learn he is distraught over a broken telescope. Shortly after divulging his ails to you, he tells you of his plans to build a new one. You agree to assist him, and he hastily rushes off to Noumenon with renewed enthusiasm, hoping to rectify the situation.","You speak with Jude who requests you to search for tomes detailing the manufacturing process of telescopes. With any luck, you will find documents suitable to both his needs and budget.","A thorough search of the shelves has yielded three rather promising tomes. It remains to be seen if their contents meet with Jude's approval, however.","Skimming through the books you provided, Jude eventually settles upon the starlens. Though still incredulous as to its efficacy, he cannot deny its affordability. With the matter decided, he bids you return with him to his workshop.","Jude explains to you his reasons for joining the Faculty of Astronomy. While faint of heart, he is unwilling to compromise on his dreams of finding the Azure Star he once saw with his childhood friend. With your crafting expertise and the starlens, perhaps there is a chance he will fulfill his heart's deepest desire."],"objectives":["Speak with Jude.","Search for tomes about telescopes.","Deliver the tomes to Jude.","Speak with Jude."],"dialogue":[{"name":"JUDE","text":"Dear, oh dear. If only he were here to help..."},{"name":"JUDE","text":"Eep! Goodness me! You gave me quite the scare. ...Do I know you?"},{"name":"JUDE","text":"Ahem. I must apologize. As you've likely already gathered, I am rather easily startled."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Is aught amiss?"},{"name":"A1","text":"I heard you have work for me."},{"name":"JUDE","text":"Ah, yes. You see, I, Jude, belong to the Faculty of Astronomy and am enlisted in the Classical Astronomer's Association."},{"name":"JUDE","text":"...Despite the name, I am the sole member. Until this last year we were far more in number, but the other students graduated just as I joined."},{"name":"JUDE","text":"“Why remain a part of an association that, but for my efforts, is obsolete?” you might ask."},{"name":"JUDE","text":"The reason is quite simple. I thought it would allow me free access to their telescope!"},{"name":"JUDE","text":"Recently, however, the Faculty of Astronomy and all its constituents─the Classical Astronomer's Association included─have been urged by the Forum to contribute to a national project. As a result, I am unable to use the telescope at my own discretion."},{"name":"JUDE","text":"If only my problems ended there! After I had taken over the association's activities, I came to learn the telescope was not only old but in a state of total disrepair!"},{"name":"JUDE","text":"I have, of course, since attempted to have it repaired, but no craftsman is willing to accept my request..."},{"name":"JUDE","text":"Impatience has led me to attempt to restore it myself. All I've accomplished is making the situation worse...beyond recovery, even."},{"name":"JUDE","text":"...Ah, my apologies! I've started to ramble."},{"name":"JUDE","text":"So you're a craftsman that's been sent by Qih Aliapoh?"},{"name":"JUDE","text":"I am terribly sorry. Despite having come all this way, there is no longer any telescope to restore."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Well, if there is no telescope that needs repairing..."},{"name":"A2","text":"Why not just make a new one?"},{"name":"JUDE","text":"Indeed! The possibility had not even crossed my mind..."},{"name":"JUDE","text":"Oh, what I wouldn't give for one of those new lenses I've heard so much about. Their precision and clarity is said to be without peer! But the funding required would be astronomical..."},{"name":"JUDE","text":"Perhaps if we forgo the latest and greatest in telescope components, the modest budget I've received from the association may suffice to make one."},{"name":"JUDE","text":"I best get to work, then! Noumenon will no doubt have a plethora of information on the subject of crafting telescopes!"},{"name":"JUDE","text":"While I have an acute fear of crowded places, my desire to look upon the stars is enough to see me through the task! ...Or so I hope."},{"name":"SYSTEM","text":"Jude rushes off. His last words still ringing in your head, you take off in the direction of Noumenon after him."},{"name":"JUDE","text":"Oh! You're here to lend me a hand in searching for the necessary tomes?"},{"name":"JUDE","text":"...Thank you. Only one other person has ever extended to me such kindness!"},{"name":"JUDE","text":"Eighty-seven point ninety-six percent of those I've encountered have approached me, words dripping with honey, looking only to take advantage of my purse strings."},{"name":"JUDE","text":"But enough about that! Somewhere among these tomes are documents detailing the intricacies of telescopes. Let us split up and search for them!"},{"name":"JUDE","text":"Please, should you find any relevant documents bring them to me!"},{"name":"JUDE","text":"Hmm, it's not this... Nor is it this..."},{"name":"JUDE","text":"Did you stumble across any leads?"},{"name":"JUDE","text":"To think that you've managed to find three whole tomes! Excellent work! Let's have a look, shall we?"},{"name":"JUDE","text":"...<span class=\"emphasis\">A History of Observatories</span>? This appears to be all about observatories and the massive telescopes they boast."},{"name":"JUDE","text":"While the content contained within these pages is near perfect, to create the telescope detailed here would require a budget on par with a national project..."},{"name":"JUDE","text":"Let us now take a look at <span class=\"emphasis\">The Encyclopedia of Astronomical Telescopes</span>."},{"name":"JUDE","text":"What a treasure of a tome! It outlines the entirety of how telescopes are made, down to the smallest of details."},{"name":"JUDE","text":"Unfortunately, we have only enough gil to cover a fraction of the cost of the parts listed here..."},{"name":"JUDE","text":"Let us see what this last one has to offer. ...<span class=\"emphasis\">An Astronomer's Comprehensive Overview of the Starlens</span>, huh?"},{"name":"JUDE","text":"Starlens? I've never heard of such a thing... According to this, it is an ancient tool used by astronomers to read the stars and can be produced at a reasonable cost."},{"name":"JUDE","text":"But what good would such an ancient tool accomplish in today's world of astronomy and optics? It doesn't even use a lens! Then again...it is within my means."},{"name":"JUDE","text":"Might I ask you to craft one for me? While I can only offer you the meager stipend our association receives from the Studium in exchange, I hope you'd consider it."},{"name":"JUDE","text":"You have my sincerest of thanks! Now then, there is little time to waste. I have already requested to use the space, so let us make our way to the workshop!"},{"name":"JUDE","text":"According to my calculations, we should have just enough in the way of funds to craft a starlens."},{"name":"JUDE","text":"The question that remains, however, is if it will be powerful enough to aid me in my pursuit... &lt;sigh&gt; If only he were here..."},{"name":"JEROMERE","text":"(-???-)If it isn't Jude! You're looking gloomy as ever!"},{"name":"JUDE","text":"Eek! Wh-Who's there!?"},{"name":"JUDE","text":"Oh, it's you Jeromere. Have you finally decided to join the Faculty of Astronomy?"},{"name":"JEROMERE","text":"I know not to which Jeromere you're referring, but this one shines brighter than any of those so-called stars you gaze upon!"},{"name":"JUDE","text":"You're the only Jeromere I know... You should know that seeing as we've been friends since childhood..."},{"name":"JEROMERE","text":"Jude, I'm terribly disappointed. Ten whole years have passed since we first met. I had thought you'd grow out of it eventually, yet you insist on immersing yourself in this tedious, unrewarding work!"},{"name":"JEROMERE","text":"We are pupils of the Studium. It is all but blasphemy to whittle away the best of your years, nose stuck between dusty old tomes!"},{"name":"JEROMERE","text":"Now why don't you set aside your wayward aspirations and join me in the Faculty of Literature? We might even be able to fetch you a decent-looking bride!"},{"name":"JEROMERE","text":"I've recently joined the “Poetry Lovers” club. We speak on love and life whilst sipping the finest of teas─does that not sound pleasurable to you?"},{"name":"JUDE","text":"Jeromere... Was it not you who introduced me to the wonders of astronomy? What made you lose interest in the subject?"},{"name":"JEROMERE","text":"That is neither here nor there! I'm simply worried you're wasting away here, all on your own! ...Just promise me you'll think on it, all right?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"What's your relationship to him?"},{"name":"A3","text":"...Was that your friend?"},{"name":"JUDE","text":"Ah, I must apologize for not introducing you. That was Jeromere─a childhood friend of mine."},{"name":"JUDE","text":"Ever since I could remember, we would spend our nights together gazing up at the stars."},{"name":"JUDE","text":"It was a decade ago when it happened. The two of us took part in an astronomer's workshop. One night, when we were looking up at the night sky, we spotted a mysterious blue light."},{"name":"JUDE","text":"Concluding it was an unidentified celestial body, we immediately notified the Studium's Faculty of Astronomy."},{"name":"JUDE","text":"No matter how much they searched, they were unable to find the light we had seen. In the end, the Studium chalked it up to the ramblings of imaginative schoolchildren."},{"name":"JUDE","text":"Out of sheer frustration, we decided to join the Faculty of Astronomy, vowing to one another that we'd one day rediscover the azure body we saw that day."},{"name":"JUDE","text":"Jeromere, being a summer older than I, enrolled first. When I finally entered, it was as though he were a different person─all vestiges of the old Jeromere and the promise we made one another, forgotten."},{"name":"JUDE","text":"I joined this faculty hoping to fulfill our dream of the decade prior. Yet, ever timid and easily cowed, I do not see how I will accomplish this alone..."},{"name":"JUDE","text":"It was Jeromere always leading the way. Without him, I am lost..."},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"You're not alone."},{"name":"A4","text":"You've got me."},{"name":"A4","text":"Get a hold of yourself!"},{"name":"JUDE","text":"You are right. With your help, perhaps there is still hope..."},{"name":"JUDE","text":"I do not know what I can do or how far I will get, but I must at least try."},{"name":"JUDE","text":"Aaah! Please, do not be upset!"},{"name":"JUDE","text":"...I do not know what I can do or how far I will get, but I suppose I must at least try."},{"name":"JUDE","text":"Thank you very much. You've done so much for me already, but I have yet to even ask your name."},{"name":"JUDE","text":"<span class=\"highlight\">Forename</span>! I am looking forward to working with you!"},{"name":"SYSTEM","text":"You may now undertake deliveries for the Faculty of Astronomy at the Studium. Speak to Jude to learn more."}],"reward":{"items":[{"num":2,"id":30482}]},"reqs":{"jobs":[{"lvl":80,"id":152}],"quests":[70009]},"next":[69676]},"partials":[{"type":"npc","id":"1038562","obj":{"i":1038562,"n":"Jude","l":3706,"q":1}},{"type":"npc","id":"1038525","obj":{"i":1038525,"n":"Jude","l":3706,"q":7}},{"type":"item","id":"30482","obj":{"i":30482,"n":"Chili Crab","l":490,"c":24328,"t":46}},{"type":"quest","id":"70009","obj":{"i":70009,"n":"The Faculty","g":178,"l":"Old Sharlayan","s":10,"f":1}},{"type":"quest","id":"69676","obj":{"i":69676,"n":"The World without You","g":174,"l":"Old Sharlayan","s":0}}]}