{"quest":{"name":"Gears of Gold","location":"Old Sharlayan","id":69670,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1039203,"target":1039203,"genre":173,"journal":["Rurusha has noticed components are missing from the relic.","Rurusha has tasked you with crafting gold cogs.<br><br>※Minimum collectability rating for this delivery is 140. Delivering items with a rating of 290 or more will earn greater rewards.","You deliver the gold cogs to Rurusha, but even after their installation, the Golden Dhyata remains largely unresponsive. Rurusha resolves to unravel any lingering problems, and asks that you return when you have time to attempt further repairs."],"objectives":["Deliver the gold cogs to Rurusha."],"dialogue":[{"name":"RURUSHA","text":"Why, hello there!"},{"name":"BORIC","text":"Oh, thank the gods you're here. I was so worried you might not return that I couldn't focus on my work..."},{"name":"RURUSHA","text":"Honestly, Boric. Show a little faith. <span class=\"highlight\">Forename</span> doesn't strike me as someone who'd go back on <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> word."},{"name":"BORIC","text":"My apologies, I didn't mean anything by it. It's just that we've been turned down by so many others..."},{"name":"RURUSHA","text":"As you've probably worked out by now, Boric has a penchant to worry far more than he has any right to. Please don't take anything he says <span class=\"emphasis\">too</span> seriously."},{"name":"RURUSHA","text":"But that's enough of that for now! It's time we got back to discussing our little friend's woes. This time, I would ask you to craft minuscule cogs made of gold."},{"name":"RURUSHA","text":"While examining the insides of the relic, I discovered that it was missing some, which seems to have caused all the damage we've observed. Whatever you make will need to be tough as a coeurl. Are you up to the task?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Leave it to me!"},{"name":"A1","text":"Sounds like hard work, but..."},{"name":"RURUSHA","text":"Oh, it's great to know I can always count on you, <span class=\"highlight\">Forename</span>. Best of luck!"},{"name":"SYSTEM","text":"The Studium Deliveries list for Rurusha has been updated. To view the new list, speak with Rurusha."},{"name":"BORIC","text":"Any cog that fits inside that relic is going to be absolutely tiny. It's quite impressive technology when you consider it's from the Third Astral Era and not Allagan in origin. "},{"name":"RURUSHA","text":"I have every confidence your work will be immaculate. Indeed, I very much look forward to seeing what you can do."},{"name":"RURUSHA","text":"Solid work as always. Thank you!"},{"name":"RURUSHA","text":"Solid work as always. Look at the detail, too─it's obvious you stand head and shoulders above your peers!"},{"name":"RURUSHA","text":"The cogs were a perfect fit. Now, I would be even happier if she decided to move for us..."},{"name":"SYSTEM","text":"The Golden Dhyata flinched ever so slightly! However, it soon returned to its former static state. It appears you still have work to do."},{"name":"RURUSHA","text":"Oh, well done, little one! We'll have you moving properly in no time, don't worry."},{"name":"BORIC","text":"Well done? It merely flopped on the table like a dead fish. This is hardly cause for celebration."},{"name":"BORIC","text":"I'm growing increasingly worried that this will all come to nothing, and your reputation will end up in tatters!"},{"name":"RURUSHA","text":"Oh, calm down, Boric. Lest you forget, the relic was found buried with the body of what appeared to be a mage, possibly of some repute."},{"name":"RURUSHA","text":"Their tomb also contained a range of tools used by those highly skilled in the arcane arts. I'm <span class=\"emphasis\">positive</span> that this mammet possesses great power."},{"name":"BORIC","text":"Well, if we're discussing what it <span class=\"emphasis\">could</span> be, I would say it could just as easily be a trinket or charm they kept on their person."},{"name":"BORIC","text":"And let us not forget the shady stories we heard about the gleaner who sold it to you in the first place! How are we meant to trust someone with a track record of peddling counterfeit wares?"},{"name":"RURUSHA","text":"Boric, how many times have I told you not to hold others' pasts against them? Everyone is capable of change, and I for one remain convinced that this relic is worthy of study."},{"name":"RURUSHA","text":"It is true that a gleaner's livelihood depends on their ability to discern what is a forgery and what is the genuine article. But no one is without error. Not even me."},{"name":"RURUSHA","text":"If our little friend here does turn out to be a fake, it simply means I've made one such error. Nothing more, nothing less. Although, I don't believe for a moment that I have done so."},{"name":"RURUSHA","text":"After all, who will believe in me if I don't believe in myself? That's not to say I think myself infallible, mind you."},{"name":"RURUSHA","text":"Putting that aside for the moment, I shall examine our friend here, and see if I can determine what problems yet remain. When next you have time to spare, <span class=\"highlight\">Forename</span>, pray seek us out, and we will set about making further repairs."},{"name":"SYSTEM","text":"Rurusha is delighted with your efforts. She now considers you a <span class=\"highlight\">Reasonable Relic Restorer</span>!"},{"name":"SYSTEM","text":"The next request will be available from Rurusha upon reaching level 85 as a blacksmith, armorer, or goldsmith."}],"reward":{"items":[{"num":250,"id":8},{"num":250,"id":9}]},"reqs":{"jobs":[{"lvl":83,"id":151}],"quests":[69669]},"next":[69671]},"partials":[{"type":"npc","id":"1039203","obj":{"i":1039203,"n":"Rurusha","l":3706,"q":7}},{"type":"quest","id":"69669","obj":{"i":69669,"n":"The Dormant Dhyata","g":173,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69671","obj":{"i":69671,"n":"Rubbished Research","g":173,"l":"Old Sharlayan","s":0}}]}