{"quest":{"name":"Long Live the Gourmet","location":"Old Sharlayan","id":69686,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1039220,"target":1039220,"genre":175,"usedItems":[35843,35844],"journal":["Debroye is practically bursting with determination and purpose."],"objectives":["Speak with Debroye in Yedlihmad.","Speak with Debroye inside the entrance to Radz–at–Han.","Question a High Crucible alchemist while accompanied by Debroye.","Question another High Crucible alchemist while accompanied by Debroye.","While accompanied by Debroye, speak with her at Mehryde's Meyhane.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a jar of golden spice <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the jar of golden spice <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Debroye</span></span>.","Speak with Debroye at Makers' Meet."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Under His Wing.”"},{"name":"DEBROYE","text":"As Professor Galveroche so eagerly pointed out, our Mervynbread cannot be considered a “perfect meal” until we load it with a sufficient quantity of ascorbic acid."},{"name":"DEBROYE","text":"The problem is, all the citrus fruit varieties grown in Labyrinthos have distressingly low values of this key nutrient. They say it has something to do with how the false sun cannot entirely replace the effects of natural sunlight."},{"name":"DEBROYE","text":"Thus for our purposes, we are unlikely to improve the Mervynbread's levels of ascorbic acid simply by adding a Labyrinthos orange or two to the list of ingredients."},{"name":"DEBROYE","text":"And yet the professor claimed to have managed the feat. The question is, how...?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"He synthesized the acid himself?"},{"name":"A1","text":"He lied about using produce from within Labyrinthos?"},{"name":"DEBROYE","text":"Yes, it's entirely possible. He may have manufactured the nutrient using elements extracted from readily available Labyrinthos produce."},{"name":"DEBROYE","text":"I highly doubt that. Single-minded though he may be, the professor is not a man to bend the facts when it comes to scientific method."},{"name":"DEBROYE","text":"I think it more likely he manufactured his own source, using elements extracted from the available materials."},{"name":"DEBROYE","text":"The process he employed, however, is a mystery."},{"name":"DEBROYE","text":"It would take me <span class=\"emphasis\">months</span> to research a manufacturing method from scratch, but we cannot allow the professor to submit his panaloaf unopposed. We need to consult with another expert on the subject!"},{"name":"DEBROYE","text":"Radz–at–Han is the home of alchemy, and one of its noted practitioners, Master Jalvaaz, is the Near East's leading authority on nutritional science."},{"name":"DEBROYE","text":"I've never had the pleasure myself, but perhaps he will assent to an audience if we show up on his doorstep!"},{"name":"DEBROYE","text":"The new aetheryte allows us to travel to Thavnair directly, so that should save us some time. Let us be swift! And sure! ...We might have to work on “efficient.”"},{"name":"DEBROYE","text":"&lt;groan&gt;"},{"name":"DEBROYE","text":"Ugh, I feel sick to my stomach... But it's nothing compared to the nausea I suffered after one bite of the professor's panaloaf."},{"name":"DEBROYE","text":"Come on. We'll find Master Jalvaaz in the city proper."},{"name":"DEBROYE","text":"So this is the fabled city of Radz–at–Han. It's even more vibrant than I imagined!"},{"name":"DEBROYE","text":"...Yes, this is my first visit to Thavnair. To be perfectly honest, this is the first time I've ever left Sharlayan."},{"name":"DEBROYE","text":"What of you, <span class=\"highlight\">Forename</span>? Have you been here before?"},{"name":"DEBROYE","text":"Then you can lead the way. I've studied the layout of this place from top to bottom on parchment, but in the flesh, I'd probably get us lost before we'd taken ten steps."},{"name":"DEBROYE","text":"The documents I've read mentioned Master Jalvaaz's affiliation with the High Crucible of Al-Kimiya. I wonder, though... The man should be getting on in years, and he may very well be retired."},{"name":"DEBROYE","text":"Anyway, it's somewhere to start. Let's head there now, and see if he's still in residence."},{"name":"SYSTEM","text":"Debroye is now accompanying you. Keep her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Debroye behind by entering a different area, or by speaking with her and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Debroye accompany you again, return and speak with her at the original location."},{"name":"ALCHEMISTA","text":"Are you supposed to be in here...?"},{"name":"ALCHEMISTB","text":"Come to see the crucible, have you?"},{"name":"Q2","text":"What will you do?"},{"name":"A2","text":"Speak with Debroye."},{"name":"A2","text":"Part ways with Debroye."},{"name":"A2","text":"Nothing."},{"name":"DEBROYE","text":"It seems that everywhere you look there's another sight to dazzle the senses..."},{"name":"A2","text":"<span class=\"highlight\">Discuss the crucible.</span>"},{"name":"DEBROYE","text":"Now that is an impressive piece of alchemical apparatus! Why, I wager they could concoct almost any mixture they pleased in such a grand furnace."},{"name":"DEBROYE","text":"Ugh..."},{"name":"DEBROYE","text":"Apologies, just some lingering aetherial sickness... Let's press on."},{"name":"A2","text":"<span class=\"highlight\">Discuss alchemy.</span>"},{"name":"DEBROYE","text":"They've spared no expense on this facility... When it comes to the field of alchemy, it would seem that Radz–at–Han is malms ahead of everyone else─even the learned professors of Sharlayan."},{"name":"A2","text":"<span class=\"highlight\">Discuss local cuisine.</span>"},{"name":"DEBROYE","text":"Oh my, authentic Hannish curries! That spicy aroma is to die for!"},{"name":"DEBROYE","text":"But as much as I would love to sample all the foods on offer, my gourmet research will have to wait..."},{"name":"A2","text":"<span class=\"highlight\">Discuss local wares.</span>"},{"name":"DEBROYE","text":"So much alchemical equipment. Even with all the time I've spent at the Faculty of Medicine, I've never seen even half of these devices... Perhaps I should spend some time studying here in Thavnair."},{"name":"SYSTEM","text":"Are you sure you wish to part ways with Debroye?"},{"name":"DEBROYE","text":"Something urgent arise? Please, attend to your errand, and we can meet back near the entrance to the city. I'll have no trouble keeping myself occupied in the meantime."},{"name":"DEBROYE","text":"Welcome back! If you've the time now, shall we go and ask after Master Jalvaaz? Surely the alchemists at the High Crucible know of his whereabouts."},{"name":"DEBROYE","text":"Welcome back! Shall we see if Master Jalvaaz is to be found at Mehryde's Meyhane, then?"},{"name":"SYSTEM","text":"You must be accompanied by Debroye and have her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"Debroye has yet to arrive. Be sure she is at your side before attempting to continue."},{"name":"ALCHEMISTA","text":"Jalvaaz? Never heard of the fellow. He may have worked here once, but I know no one of that name among my present colleagues."},{"name":"DEBROYE","text":"Then I suppose he is retired after all. Actually, considering his age, there is no guarantee that the man is even..."},{"name":"DEBROYE","text":"Ahem, well let us assume he is still among us for the moment. Shall we continue our inquiries on the floor below?"},{"name":"ALCHEMISTA","text":"As I said, there's no Jalvaaz here."},{"name":"ALCHEMISTB","text":"You're looking for a “Jalvaaz”? The alchemist? That would be my great-grandfather, but it's been quite some time since he last worked here..."},{"name":"DEBROYE","text":"Your...great-grandfather. He, uh, he was a great man..."},{"name":"ALCHEMISTB","text":"He is! Over a hundred summers young, and still going strong."},{"name":"ALCHEMISTB","text":"As a prominent scholar of nutrition and health, he's always practiced what he preaches. Why, he's even spry enough to visit the tavern from time to time. If you head over to Mehryde's Meyhane, you might chance to see him there."},{"name":"DEBROYE","text":"That's wonderful news, thank you! I am very eager to meet him!"},{"name":"DEBROYE","text":"There you have it, <span class=\"highlight\">Forename</span>. Our next destination is Mehr─ &lt;groan&gt;"},{"name":"DEBROYE","text":"Ugh...oh dear. Aetheryte travel did <span class=\"emphasis\">not</span> agree with me. Ahem. Deep breaths, and away to Mehryde's Meyhane we go!"},{"name":"ALCHEMISTB","text":"When I say great-grandfather visits the tavern from time to time, what I really mean is “all the time.” ...Are you sure your friend is well enough for this, though?"},{"name":"DEBROYE","text":"I don't see anyone who matches the portrait from the books...which makes sense, considering how young he was in that particular picture. I wonder...what...he..."},{"name":"DEBROYE","text":"&lt;groan&gt;"},{"name":"JALVAAZ","text":"(-???-)Miss...?"},{"name":"JALVAAZ","text":"(-Booming Bystander-)Ah... Don't you worry now, young lady! I'll brew a remedy that'll put you back on your feet in a twinkling!"},{"name":"DEBROYE","text":"Thank you, sir, I feel ever so much better. I've never heard of a bout of aetherial sickness lasting this long..."},{"name":"JALVAAZ","text":"(-Booming Bystander-)Oh, no, my dear, you are quite clearly suffering from a severe case of anemia. All the symptoms point to a lack of ascorbic acid."},{"name":"JALVAAZ","text":"(-Booming Bystander-)Without that nutrient, your body has trouble absorbing iron, which in turn leads to thinning blood, a disturbing pallor, and extreme fatigue."},{"name":"JALVAAZ","text":"(-Booming Bystander-)The medicine I gave you will remedy the immediate issues, but I strongly suggest you rethink your dietary habits. We wouldn't want your youthful promise stolen by a fatal case of scurvy now, would we?"},{"name":"DEBROYE","text":"Now that I think on it, I've been eating nothing but panaloaf samples since we started all this."},{"name":"DEBROYE","text":"It stands to reason that our yet-to-be-perfected meals would leave me low on ascorbic acid. Thaliak save me, I almost made the same mistake as Mervyn..."},{"name":"DEBROYE","text":"Your knowledge of the nutritional sciences is most impressive, Master...?"},{"name":"JALVAAZ","text":"Hm? Oh, it's just plain old “Jalvaaz” these days, my dear. I'm retired now, but I've learned a thing or two about healthy eating and longevity over the years."},{"name":"DEBROYE","text":"So you <span class=\"emphasis\">are</span> Jalvaaz! I knew it!"},{"name":"DEBROYE","text":"My name is Debroye, and I study nutrition at the Studium in Sharlayan. I come seeking wisdom from the foremost expert in the field─that being you, of course!"},{"name":"DEBROYE","text":"If you know of a viable laboratory method for manufacturing ascorbic acid, then I humbly request that you instruct me in the process."},{"name":"JALVAAZ","text":"Well, isn't this a coincidence? It wasn't long ago that a professor from your Studium approached me looking to solve the exact same dilemma."},{"name":"JALVAAZ","text":"Yes, I know of a method─I was the one who discovered it! But the sweat of my brow comes at a price, Miss Debroye, and a rather rich one at that."},{"name":"DEBROYE","text":"How rich...?"},{"name":"JALVAAZ","text":"The professor paid it without so much as raising an eyebrow, but I'm afraid the cost of my services is beyond the means of the average student."},{"name":"JALVAAZ","text":"Still, it hardly seems fair to turn you away at the gate. I tell you what, why don't I make you a deal?"},{"name":"JALVAAZ","text":"You see, I have always been a lover of curries, but when you've eaten as many as I have, you begin to grow tired of the same Hannish flavors."},{"name":"JALVAAZ","text":"Then I recently came to learn of an Eorzean-style curry plate that I am desperate to try."},{"name":"JALVAAZ","text":"I obtained the recipe from a trader, and I've even gone so far as to gather the ingredients so the cook here can take a stab at preparing the dish."},{"name":"JALVAAZ","text":"But now destiny has seen fit to drop a pair of western travelers in my lap. And who better to make western cuisine than the natives of those lands, eh?"},{"name":"JALVAAZ","text":"So here's my offer: you prepare the curry, and I teach you the method...provided my palate is properly tickled."},{"name":"DEBROYE","text":"We accept! I promise you, we will make the most delicious curry you've ever tasted!"},{"name":"DEBROYE","text":"That other visitor was almost certainly Professor Galveroche. Which means the process he learned is one which can be followed using resources from Labyrinthos!"},{"name":"DEBROYE","text":"And what's more, Eorzean curry is one of the Last Stand's most famous dishes. I've made it many times."},{"name":"DEBROYE","text":"First you caramelize the onions to bring out their sweetness, add the bouillon, dice your choice of meat and stew until tender, oh, and be sure to skim the floaty bits from the water, of course, and then..."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Debroye, save it for the kitchen!"},{"name":"A3","text":"Uh, you lost me..."},{"name":"DEBROYE","text":"Sorry, I did it again, didn't I?"},{"name":"DEBROYE","text":"Anyway, yes, I know all the steps...aside from mixing the “golden spice.” Master Dickon was always the one to prepare that ingredient."},{"name":"DEBROYE","text":"If you could take care of that part, then I'd be more than happy to handle everything else."},{"name":"JALVAAZ","text":"As I said, I have all the ingredients you need and more besides. Cook away, and let me know if you're running low on anything! Ah, my mouth is watering already..."},{"name":"JALVAAZ","text":"You were in charge of preparing the spice, weren't you? Take whatever you need to complete that curry, and don't spare me the sting!"},{"name":"JALVAAZ","text":"That should be enough spice for a single dish. ...Well, do you mean to starve me first? Hand it to your friend there, and let's taste this curry already!"},{"name":"DEBROYE","text":"How is that spice mixture coming along?"},{"name":"DEBROYE","text":"Mmm, it smells wonderful! This will give our curry the perfect amount of zest..."},{"name":"JALVAAZ","text":"Hmmm, so this is what Eorzean curry looks like─the colors, the aroma, it's so different to what we serve here. Now, for the all-important taste..."},{"name":"DEBROYE","text":"Is it...is it to your liking, sir?"},{"name":"JALVAAZ","text":"...It's fantastic! The more you eat, the more the layers of flavor compound into a harmonious orchestra of deliciousness!"},{"name":"JALVAAZ","text":"They say you can taste the chef's intention in a meal, and your determination to impress me has infused every bite."},{"name":"DEBROYE","text":"Then, you'll share your method with us...?"},{"name":"JALVAAZ","text":"Of course I will! A meal such as that is worth more than a man's weight in gold!"},{"name":"DEBROYE","text":"...So, coconut milk is the key."},{"name":"DEBROYE","text":"Thank you so much, Jalvaaz, sir!"},{"name":"DEBROYE","text":"Ahem, there <span class=\"emphasis\">is</span> one more thing I would ask, if I may. What, in your opinion, is the biggest secret to health and long life?"},{"name":"JALVAAZ","text":"A well-balanced diet is important, no doubt about that, but I believe you must enjoy what you eat."},{"name":"JALVAAZ","text":"It's always seemed to me that digestion is aided by how much one relishes a meal. And the better one's digestion, the more nutrients one's body absorbs!"},{"name":"DEBROYE","text":"Exactly! I've often thought the same myself."},{"name":"DEBROYE","text":"You've been a great help to us, sir. We wish you many more years of healthy living to come!"},{"name":"DEBROYE","text":"And although I would love to more thoroughly explore Radz–at–Han's gourmet delights, we must hurry back to Sharlayan. Perhaps another time!"},{"name":"JALVAAZ","text":"Ah, such a glorious meal! If enjoyment truly does improve one's health, then I think I just added ten years to my life."},{"name":"DEBROYE","text":"Thank you, <span class=\"highlight\">Forename</span>, for accompanying me to such a far-flung locale, and on such short notice! I don't know if I could have secured that alchemical process from Jalvaaz without your assistance."},{"name":"DEBROYE","text":"But now that we have it, our next batch of Mervynbread will be well and truly perfect! ...This time! ...For certain!"},{"name":"SYSTEM","text":"The next request will be available from Debroye upon reaching level 88 as an alchemist or culinarian."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"items":[{"num":2,"id":36053}]},"reqs":{"jobs":[{"lvl":85,"id":153}],"quests":[69685]},"next":[69687]},"partials":[{"type":"npc","id":"1039220","obj":{"i":1039220,"n":"Debroye","l":3706,"q":7}},{"type":"item","id":"36053","obj":{"i":36053,"n":"Giant Haddock Dip","l":540,"c":24258,"t":46}},{"type":"item","id":"35843","obj":{"i":35843,"n":"Golden Spice Ingredients","l":536,"c":25977,"t":63}},{"type":"item","id":"35844","obj":{"i":35844,"n":"Golden Spice","l":536,"c":25011,"t":63}},{"type":"quest","id":"69685","obj":{"i":69685,"n":"Aroma Is Key","g":175,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69687","obj":{"i":69687,"n":"Perfectly Delectable","g":175,"l":"Old Sharlayan","s":0}}]}