{"quest":{"name":"An Astronomical Growth","location":"Old Sharlayan","id":69680,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1038525,"target":1038525,"genre":174,"journal":["Jude appears anxious to continue with the production of the starlens.","Jude has tasked you with crafting aetherial conductors.<br><br>※Minimum collectability rating for this delivery is 160. Delivering items with a rating of 340 or more will earn greater rewards.","You deliver the aetherial conductors to Jude. His spirit now aflame as if with the presence of Ifrit himself, Jude asks that you visit him soon that you might craft the final missing piece."],"objectives":["Deliver aetherial conductors to Jude."],"dialogue":[{"name":"JUDE","text":"What do you say we pick up where we left off, <span class=\"highlight\">Forename</span>?"},{"name":"JUDE","text":"Where traditional telescopes gather light to project an image, the starlens captures aetheric glimmers and casts that onto the surface of water, hence making stargazing possible."},{"name":"JUDE","text":"As I was constructing the starlens, I realized I was missing the very piece that would allow me to do just that."},{"name":"JUDE","text":"This is where I will need to, once again, borrow your seasoned hands. Might you craft some aetherial conductors for me?"},{"name":"JUDE","text":"Once these are finished, there will be but one thing left to do!"},{"name":"SYSTEM","text":"The Studium Deliveries list for Jude has been updated. To view the new list, speak with Jude."},{"name":"JUDE","text":"I'm counting on you to make me some aetherial conductors. They will allow me to project the aether captured by the starlens onto water!"},{"name":"JUDE","text":"You have my utmost gratitude, <span class=\"highlight\">Forename</span>! Regardless of how bleak the outlook is, I will find the Azure Star!"},{"name":"JUDE","text":"You have my gratitude! Truly, I am blessed to have crossed paths with a crafts<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> such as yourself! I believe our fateful union is what shall lead us to the rediscovery of the Azure Star!"},{"name":"JUDE","text":"Excellent! Now I have nearly everything I need."},{"name":"JUDE","text":"Just one last piece and we'll be one step away from a completed starlens!"},{"name":"JUDE","text":"Even if I am unable to find the Azure Star, meeting you has taught me the importance of perseverance. It is a lesson I shall never forget."},{"name":"JUDE","text":"Oh, what am I saying!? Of course I will find it. I must! It is a dream I have spent the last decade pursuing!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Exactly. Keep up the good work."},{"name":"A1","text":"Get a hold of yourself!!!"},{"name":"JUDE","text":"Yes, I will continue to give it my all!"},{"name":"JUDE","text":"Indeed, there is plenty of time to worry at a later date. For now I must give it everything I've got!"},{"name":"JUDE","text":"When you find the time to craft the final missing piece, please come and find me. I will be here eagerly awaiting your visit!"},{"name":"JUDE","text":"Thanks to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> support the fire in my heart grows by the minute. In fact, it feels almost as though Ifrit has taken up residence within me!"},{"name":"SYSTEM","text":"Jude is thrilled with your efforts. He now considers you a <span class=\"highlight\">Friend He Can Confide In</span>."},{"name":"SYSTEM","text":"A new quest continuing the story of the Faculty of Astronomy is now available. Speak with Jude as either a carpenter, leatherworker, or weaver at level 90 or above to undertake the quest."}],"reward":{"items":[{"num":2,"id":36060}]},"reqs":{"jobs":[{"lvl":88,"id":152}],"quests":[69679]},"next":[69681]},"partials":[{"type":"npc","id":"1038525","obj":{"i":1038525,"n":"Jude","l":3706,"q":7}},{"type":"item","id":"36060","obj":{"i":36060,"n":"Tsai tou Vounou","l":554,"c":24417,"t":46}},{"type":"quest","id":"69679","obj":{"i":69679,"n":"A Ten-year Promise","g":174,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69681","obj":{"i":69681,"n":"The Promised Star","g":174,"l":"Old Sharlayan","s":0}}]}