{"quest":{"name":"Sharlayan Cuisine","location":"Old Sharlayan","id":69688,"patch":6.0,"sort":0,"icon":101138,"eventIcon":71221,"issuer":1039220,"target":1039220,"genre":175,"usedItems":[35845,35846],"journal":["Debroye is brimming with confidence.","Confident that your submission will win over the Forum, Debroye expresses her eagerness to attend the forthcoming evaluation. The Rostra awaits.","Following a lengthy debate, and swayed by the arguments of Master Flaugustert─a former Forum member and current patron of the Last Stand─the assembled officials adopt Mervynbread to serve as Sharlayan's emergency food supply. Debroye turns to you after hearing the decision, ready to share her elation.","Although overjoyed at her victory, Debroye finds herself sympathetic to Professor Galveroche's disappointment. She asks that you meet her at the Last Stand, and help her prepare a meal that is sure to lift his spirits.","Debroye has learned that, as a student, Professor Galveroche once enjoyed eating fishcakes with his good friend Mervyn. Your task is to create one of the dish's most vital ingredients, and deliver it to Debroye so that she might assemble the professor's uplifting meal.<br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Dickon.","You deliver the key ingredient to Debroye, and she finishes preparing the aforementioned fishcake dish. A wary Professor Galveroche arrives soon after, only to find himself pleasantly surprised by the meal and how much he enjoys it. Transported to the past by the familiar flavors, he speaks of his efforts to save Mervyn, and of his misplaced anger towards gourmet cooking. In the end, he concedes the importance of taste in the science of nutrition, vowing to create a meal that exceeds even the divine deliciousness of Mervynbread. By the look on Debroye's face, his change in attitude was perhaps the greatest victory of all.","Debroye thanks you profusely for your assistance in her quest to create the perfect meal. With Professor Galveroche now joining her on the road of taste-related research, she vows to continue her mission to find acceptance for fine dining in the hearts─and bellies─of Sharlayan's citizens."],"objectives":["Speak with Debroye.","Speak with Debroye again.","Speak with Debroye once more.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a Sharlayan fishcake ingredient <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the Sharlayan fishcake ingredient <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Debroye</span></span>.","Speak with Debroye."],"dialogue":[{"name":"DEBROYE","text":"This is it, <span class=\"highlight\">Forename</span>─the Forum is ready to begin the evaluation process."},{"name":"DEBROYE","text":"We've worked tirelessly on perfecting our submission, and I have every confidence that Mervynbread will be the winning candidate! Come, let's make our way to the Rostra, shall we?"},{"name":"DEBROYE","text":"I know I said I was confident, but the thought of actually standing before the Forum has my stomach all in knots... Courage, Debroye, courage!"},{"name":"FACILITATOR04152","text":"Esteemed colleagues, we have convened today to evaluate and select a suitable candidate for our proposed “meal substitute.”"},{"name":"FACILITATOR04152","text":"As previously discussed, this meal substitute will serve as an emergency provision, such as when our usual sources of food are restricted or otherwise unreliable."},{"name":"FACILITATOR04152","text":"To be considered viable, a submission must satisfy our stipulated conditions: namely, that it must be possible to prepare the meal using only the ingredients available in Labyrinthos, and that it also provides all the nutrients necessary to sustain day-to-day survival."},{"name":"FACILITATOR04152","text":"Our first of two candidates is the “panaloaf,” submitted by Professor Galveroche, with whom I am sure you are all familiar."},{"name":"FACILITATOR04152","text":"The second is “Mervynbread,” submitted by one Miss Debroye, a student of the Faculty of Medicine."},{"name":"FACILITATOR04152","text":"Members of the Council of Culinary Assurance will select one of these candidates following a thorough nutritional analysis and trial consumption of the samples provided."},{"name":"ELDERLYCOUNCILOR04152","text":"Our analysis has determined that both submissions meet the basic nutritional requirements to qualify as meal replacements."},{"name":"YOUNGCOUNCILOR04152","text":"And as they share the same nutritional value, the only consideration left to judge them upon is taste. Even being generous, it would be difficult to describe the flavor of panaloaf as pleasing; Mervynbread, on the other hand, is a culinary delight."},{"name":"YOUNGCOUNCILOR04152","text":"On the grounds of this assessment, Mervynbread is clearly the superior choice."},{"name":"GALVEROCHE","text":"I beg to differ. Yes, yes, I admit that panaloaf has little to offer in the way of gastronomic enjoyment."},{"name":"GALVEROCHE","text":"But have you considered the matter from the viewpoint of efficiency?"},{"name":"GALVEROCHE","text":"Mervynbread's flavor requires the addition of specific sweeteners and oils, not to mention a particular variety of yeast─an involved process which demands excessive time and exertion."},{"name":"GALVEROCHE","text":"The recipe for panaloaf, however, was devised with simplicity in mind, allowing one to manufacture the same quantity of food with but a fraction of the effort."},{"name":"GALVEROCHE","text":"I implore you to reconsider your decision. After all, this is an emergency comestible we are discussing here...not some gourmet menu item."},{"name":"YOUNGCOUNCILOR04152","text":"You raise a valid argument, Professor. We have, indeed, overlooked the question of efficiency."},{"name":"ELDERLYCOUNCILOR04152","text":"Should a situation arise that necessitates a supply of emergency rations, then ease of manufacture would certainly be a primary concern. And in that respect, your panaloaf holds a significant advantage."},{"name":"FLAUGUSTERT","text":"(-???-)If I might offer an opinion...?"},{"name":"ELDERLYCOUNCILOR04152","text":"Master Flaugustert, to what do we owe this unexpected pleasure?"},{"name":"FLAUGUSTERT","text":"Curiosity, mostly. I may be retired, but all this talk of a “perfect meal” piqued my interest."},{"name":"DEBROYE","text":"Wait... I know you!"},{"name":"FLAUGUSTERT","text":"And I know your delicious Mervynbread."},{"name":"FLAUGUSTERT","text":"It is an unfortunate fact that fine food is oft regarded with contempt here in Sharlayan. Many see the pursuit of gourmet cuisine as a trivial distraction─an inefficient use of one's precious time."},{"name":"FLAUGUSTERT","text":"Yet when a tired researcher craves a refreshing cup of sweet tea, is it a question of simple desire? Or is it the body's way of signaling the lack of a certain nutrient?"},{"name":"FLAUGUSTERT","text":"And what of the comfort afforded by those “inefficient” tastes and flavors? Surely we have all experienced the calm and reassurance provided by a hearty dish."},{"name":"FLAUGUSTERT","text":"The same principle can be observed with the soothing familiarity of home-cooked favorites. Why, when my academic cogitations are frustrated by some intractable problem, it is for that very soothing effect that I visit my beloved Last Stand."},{"name":"FLAUGUSTERT","text":"As such, I submit that taste plays a far greater role in our well-being than simple enjoyment. Imagine, if you will, a prolonged crisis, and then tell me which of these foods you would prefer to consume, day after day after day..."},{"name":"FLAUGUSTERT","text":"Faced with a struggle to survive, which of these meals would best serve to bolster your mental and emotional fortitude?"},{"name":"ELDERLYCOUNCILOR04152","text":"To be perfectly honest, the very thought of eating panaloaf for more than a single day brings me to the edge of panic. Hardly a state one wishes to be in when dealing with a crisis..."},{"name":"YOUNGCOUNCILOR04152","text":"Yes, even when taking into account the additional effort required in its preparation, a satisfying meal is more like to contribute to a rational frame of mind. Which, in the long run, may prove to be a more efficient benefit."},{"name":"FACILITATOR04152","text":"Now that all interested parties have made their arguments, the time has come to put the matter to a vote..."},{"name":"FACILITATOR04152","text":"The results speak for themselves."},{"name":"FACILITATOR04152","text":"Panaloaf, one vote. Mervynbread, five votes. Congratulations, Miss Debroye─your submission has been accepted as Sharlayan's official emergency meal replacement recipe."},{"name":"DEBROYE","text":"Professor, your research is still very much...a part of..."},{"name":"DEBROYE","text":"Well, that was a near thing...at least until our Last Stand supporter chimed in! I never knew he was a former member of the Forum."},{"name":"DEBROYE","text":"I'd say we can safely call this the end of the matter, although there is one last thing I would like to ask of you, <span class=\"highlight\">Forename</span>."},{"name":"DEBROYE","text":"Despite his rigid way of thinking, Professor Galveroche is not a bad person. Perhaps I can make him a nice meal to soften the blow of his loss...with a little expert help?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Very well."},{"name":"A1","text":"I'll get my apron!"},{"name":"DEBROYE","text":"I knew you couldn't refuse! When you have a moment, come and meet me at the Last Stand."},{"name":"DICKON","text":"I hear your submission humbled the professor at the evaluation! Nice work, and thank you for defending the innocent taste buds of Sharlayan!"},{"name":"DEBROYE","text":"Now, as for the professor's meal, I thought we might make him a serving of fishcakes─one of our local specialties."},{"name":"DEBROYE","text":"According to Master Dickon, Mervyn and Galveroche used to eat them all the time during their student years."},{"name":"DEBROYE","text":"To prepare the fishcakes, you take a whitefish and some onion, and grind it all into a paste. Add milk and pepper and knead well, then sprinkle in the flour before rolling the mixture into oval shapes and frying them in boiling hot─"},{"name":"DEBROYE","text":"...Oil. You don't need the entire recipe."},{"name":"DEBROYE","text":"But the oil <span class=\"emphasis\">is</span> important! If you can make me some exceptional frying oil, it will improve the overall flavor of the fishcakes."},{"name":"DEBROYE","text":"But I would like you to prepare the all-important fish paste!"},{"name":"DEBROYE","text":"The rest of the dish, you can leave to me. If you find yourself lacking ingredients, Master Dickon has graciously agreed to provide us with whatever we need."},{"name":"DICKON","text":"Ask and ye shall receive! I'd pay to see you wipe the frown from that sour-faced grump."},{"name":"DEBROYE","text":"Right! Let's get cooking!"},{"name":"DICKON","text":"Running low? My pantry is yours. Considering what you did with that bread, I might have to sample this next dish as well!"},{"name":"DICKON","text":"If you're happy with what you have, I think Debroye is ready for your ingredient now."},{"name":"DEBROYE","text":"How is your part of the recipe coming along?"},{"name":"DEBROYE","text":"Perfect. This will be the ingredient which brings the whole dish together!"},{"name":"DEBROYE","text":"I've already sent a message to Professor Galveroche, asking him to meet us here. Hopefully he hasn't eaten yet!"},{"name":"GALVEROCHE","text":"Why did you send for me? To taunt me with your victory in the place which I care for the least?"},{"name":"DEBROYE","text":"Of course not, sir. We only wanted to offer you this meal, as a gesture of goodwill. Please, eat. Enjoy!"},{"name":"GALVEROCHE","text":"That was...good."},{"name":"DEBROYE","text":"They may be simple dishes, but Sharlayan does have its own local specialties. The art of quality cuisine was never wholly absent from our culture...despite what people think."},{"name":"DEBROYE","text":"I would never argue the importance of nutrition, but I believe what Master Jalvaaz says is true─enjoyment of a meal tends to encourage digestion, and thus a more efficient intake of nutrients."},{"name":"GALVEROCHE","text":"When I first proposed the recipe for Archon loaf, I did so with Mervyn in mind. He was always so focused on his research that he neglected his dietary needs, and I thought to devise a convenient-yet-nutritious source of sustenance."},{"name":"GALVEROCHE","text":"He was taken from me before I had the chance to complete it. I was grief-stricken, angry at the loss of my friend, and his gourmet lifestyle became the target of my rage."},{"name":"GALVEROCHE","text":"Though it pains me to admit it, he was responsible for his own actions. It was wrong of me to lay the blame on the thing he loved most. Loved too much, it seems."},{"name":"GALVEROCHE","text":"And after considering the arguments laid out at the evaluation, I am forced to recognize that taste is an integral part of my work."},{"name":"GALVEROCHE","text":"I shall begin research on a new perfect meal─one which will taste even better than your vaunted Mervynbread."},{"name":"DEBROYE","text":"But Mervynbread was never solely ours, Professor. It was your research, and your panaloaf, which provided the nutritional basis for our recipe."},{"name":"DEBROYE","text":"<span class=\"highlight\">Forename</span> and I simply improved the palatability while maintaining the balance which made it healthy in the first place."},{"name":"DEBROYE","text":"Mervynbread is as much your creation as it is mine or <span class=\"highlight\">Forename</span>'s!"},{"name":"DEBROYE","text":"Which is why I implore you to continue improving it! With your resources and expertise, there is no one better positioned to solve the recipe's lingering issues with inefficiency."},{"name":"GALVEROCHE","text":"In that case, I shall need an assistant. Together, you and I will test the boundaries of what is possible in the field of gourmet health cuisine!"},{"name":"GALVEROCHE","text":"Speaking of fine foods, I do have one complaint about those fishcakes of yours..."},{"name":"GALVEROCHE","text":"There were too few. I seem to recall the dish being much larger back when Mervyn and I used to eat them. Are there any more, perchance...?"},{"name":"DEBROYE","text":"I do believe that was the first time I've seen the professor smile. I'm glad our fishcake special had the desired effect!"},{"name":"DEBROYE","text":"But my work at both the Studium and the Last Stand has just begun─I have an entire city to convince of the benefits of fine dining."},{"name":"DEBROYE","text":"Fortunately, it seems the professor is on our side now. We can expect the laboratory's research to expand into taste-related fields, and as part of my ongoing mission, I will do my utmost to see that it succeeds."},{"name":"GALVEROCHE","text":"Ah, yes, this place is well suited to the study of flavor-based nutrition."},{"name":"GALVEROCHE","text":"We begin our research into more efficient preparation methods immediately!"},{"name":"DEBROYE","text":"And here I thought my days of frantic baking were over. I'd better wash out my mixing bowl..."},{"name":"DEBROYE","text":"Thank you for all your help, <span class=\"highlight\">Forename</span>. I could not have asked for a more perfect kitchen-mate!"},{"name":"DEBROYE","text":"Please, do come and visit me from time to time─both at the Studium, and as a valued patron of the Last Stand!"},{"name":"SYSTEM","text":"Debroye is deeply moved by your efforts. She now considers you a <span class=\"highlight\">Virtuoso Baker</span>!"},{"name":"SYSTEM","text":"Keep an eye out for others at the Studium who require the help of an able artisan. You never know who might be in need of your skills."},{"name":"SYSTEM","text":"You have completed all of the Studium quests. It seems Qih Aliapoh has something she would like to ask of you."},{"name":"SYSTEM","text":"Visit her at the main reception counter in the Studium."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":1001,"items":[{"id":33938,"one":1},{"id":33939,"one":1},{"id":33940,"one":1}]},"reqs":{"jobs":[{"lvl":90,"id":153}],"quests":[69687]}},"partials":[{"type":"npc","id":"1039220","obj":{"i":1039220,"n":"Debroye","l":3706,"q":7}},{"type":"item","id":"33938","obj":{"i":33938,"n":"Craftsman's Competence Materia X","l":560,"c":20290,"t":58,"materia":{"tier":9,"value":27,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"33939","obj":{"i":33939,"n":"Craftsman's Cunning Materia X","l":560,"c":20290,"t":58,"materia":{"tier":9,"value":10,"attr":"CP","category":1}}},{"type":"item","id":"33940","obj":{"i":33940,"n":"Craftsman's Command Materia X","l":560,"c":20290,"t":58,"materia":{"tier":9,"value":18,"attr":"Control","category":1}}},{"type":"item","id":"35845","obj":{"i":35845,"n":"Fishcake Ingredient Supplies","l":560,"c":26109,"t":63}},{"type":"item","id":"35846","obj":{"i":35846,"n":"Sharlayan Fishcake Ingredient","l":560,"c":25055,"t":63}},{"type":"quest","id":"69687","obj":{"i":69687,"n":"Perfectly Delectable","g":175,"l":"Old Sharlayan","s":0}}]}