{"quest":{"name":"Aroma Is Key","location":"Old Sharlayan","id":69685,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1039220,"target":1039220,"genre":175,"journal":["Debroye's nose is twitching in anticipation of your arrival.","Debroye has tasked you with crafting bottles of panaloaf oil.<br><br>※Minimum collectability rating for this delivery is 150. Delivering items with a rating of 320 or more will earn greater rewards.","You deliver the panaloaf oil to Debroye. Once she has figured out the issue with ascorbic acid, your newly dubbed “Mervynbread” will finally be perfected..."],"objectives":["Deliver bottles of panaloaf oil to Debroye."],"dialogue":[{"name":"DEBROYE","text":"I think I have it, <span class=\"highlight\">Forename</span>─a method to infuse the panaloaf with a more alluring aroma!"},{"name":"DEBROYE","text":"The key is to blend a more fragrant oil into the dough, which will not only lend our bread a lovely scent, but also improve its savory flavor!"},{"name":"DEBROYE","text":"Oils and fats need to be kept to the absolute minimum, of course, so we'll need a variety that provides the greatest effect for the smallest amount."},{"name":"DEBROYE","text":"I have a basic idea of how a low-fat aromatic substance might be achieved, but “oil” require your help with the advanced processes involved to make it. Sorry, that was terrible..."},{"name":"SYSTEM","text":"The Studium Deliveries list for Debroye has been updated. To view the new list, speak with Debroye."},{"name":"DEBROYE","text":"Fragrant oil! That will be the secret ingredient in our fourth─and hopefully final─test batch!"},{"name":"DEBROYE","text":"Oh, that's lovely! The scent of the oil alone is enough to set my belly to rumbling!"},{"name":"DEBROYE","text":"Gracious me, that smells incredible! I'm actually drooling. Once we work that aroma into the bread, people will be lining up to try a slice!"},{"name":"DEBROYE","text":"We've done it, <span class=\"highlight\">Forename</span>! The aromatic temptation of our fourth batch has proven irresistible─Last Stand patrons have even started placing <span class=\"emphasis\">orders</span> for us to bake more."},{"name":"DEBROYE","text":"And in a happy coincidence, the new oil also served to plump up our loaf until it resembles a small, scrumptious cloud."},{"name":"DEBROYE","text":"I even measured the fat content just in case, and we are well within the accepted parameters. Surely now we've achieved true bakery perfection!"},{"name":"DEBROYE","text":"I suppose there's only one way to find out. Let's head over to the café and ask for Master Dickon's verdict!"},{"name":"DEBROYE","text":"Please, Master Dickon, don't leave us in suspense..."},{"name":"DICKON","text":"This is...unacceptable."},{"name":"DICKON","text":"I cannot have you baking bread that's more delicious than mine! You've outdone yourselves this time. Full marks."},{"name":"DEBROYE","text":"Yes!"},{"name":"DEBROYE","text":"Now that we have the master's unconditional approval, I believe that signals an end to our testing process. We make a wonderful team, <span class=\"highlight\">Forename</span>!"},{"name":"GALVEROCHE","text":"(-???-)How disappointing to find you frittering away the hours like this, and <span class=\"emphasis\">here</span> of all places..."},{"name":"GALVEROCHE","text":"You set aside my assignment on digestive issues to pursue the trivial art of...of gourmet cooking!?"},{"name":"DEBROYE","text":"I'll not deny it! That is <span class=\"emphasis\">exactly</span> what I've been doing."},{"name":"DEBROYE","text":"And let me tell you why! The problem with panaloaf was never a difficulty with digestion─it was the awful taste that was making people feel ill!"},{"name":"DEBROYE","text":"Lest you believe our efforts in vain, then I ask that you try a sample of our fourth test batch. I think you'll find the flavor much improved."},{"name":"GALVEROCHE","text":"Nay, I have no interest in your mundane concerns over flavor. The very subject sickens me."},{"name":"GALVEROCHE","text":"What I will do, however, is analyze the nutritional value of your “much-improved” panaloaf. We shall see if it even meets the criteria for a proper meal substitute."},{"name":"GALVEROCHE","text":"I must inform you that your fourth test batch is a failure. It is sorely lacking in ascorbic acid─a vital nutrient which any prospective meal replacement must contain."},{"name":"GALVEROCHE","text":"Deficient levels of ascorbic acid lead to outbreaks of scurvy. 'Tis an illness which often afflicts sailors on long sea voyages, and can also be prevalent in times of famine and hardship."},{"name":"GALVEROCHE","text":"Citrus fruits are an effective measure to combat scurvy, but one cannot always rely on a fresh supply of oranges or lemons. As such, the perfect meal of choice is one which readily fulfills that role."},{"name":"GALVEROCHE","text":"I have already succeeded in adding this nutrient to my original panaloaf, and am prepared to make my submission to the Forum."},{"name":"DEBROYE","text":"B-But, the acid? How did you...?"},{"name":"GALVEROCHE","text":"You expect me to reveal my techniques to one who so blatantly disregarded my instructions? I am sorry, Miss Debroye, but you are hereby relieved from your current duty."},{"name":"DEBROYE","text":"...So be it. I will perfect our version of panaloaf without your assistance, and submit the recipe as a contender to your own."},{"name":"GALVEROCHE","text":"A contest, then."},{"name":"GALVEROCHE","text":"And may the best bread win."},{"name":"GALVEROCHE","text":"However! In the event that your recipe fails to garner the Forum's favor, I will see you disciplined for the misuse of research funding. Your punishment will be expulsion from my research facility...nay, from the Studium itself."},{"name":"DICKON","text":"Professor Galveroche. If you're so intent on ruining my employee's future, then I think I'm entitled to a question or two."},{"name":"DICKON","text":"From what old Mervyn told me, the two of you were once classmates─more than that, you were good friends. So I'd like to understand: why do you hold so much hate for the thing he held so dear?"},{"name":"GALVEROCHE","text":"Mervyn was an exceptional student...but he threw away his academic career for the love of a well-made meal."},{"name":"GALVEROCHE","text":"This café he built, the incessant “taste-testing”... Naught more than excuses to indulge in course after course of gourmet food and drink. 'Twas reckless pursuit of that passion which sent him to an early grave."},{"name":"GALVEROCHE","text":"Your “fine dining” is a curse. It befuddled the mind of a brilliant young man─slew him as surely as any slow-acting poison!"},{"name":"GALVEROCHE","text":"Now, if you have nothing further to say, I must return to my research. Swift. Sure. Efficient..."},{"name":"DEBROYE","text":"I had no idea the professor and Mervyn were ever acquainted, let alone classmates and friends."},{"name":"DEBROYE","text":"At least now I understand why my actions upset him so..."},{"name":"DEBROYE","text":"But we cannot give up! For the sake of Sharlayan's bellies, you must help me win the Forum's minds!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You can count on me!"},{"name":"A1","text":"Our crusade for culinary quality continues!"},{"name":"DEBROYE","text":"Thank you, <span class=\"highlight\">Forename</span>! I shall figure out this issue with ascorbic acid, and then we can start on test batch number five. Although..."},{"name":"DEBROYE","text":"I think it's time we had a proper name for our panaloaf. I nominate “Mervynbread,” in honor of the Last Stand's founder."},{"name":"DEBROYE","text":"Let's get the oven heated up, and show the professor what we─and our loaves─are made of!"},{"name":"SYSTEM","text":"Debroye is overjoyed with your efforts. She now considers you an <span class=\"highlight\">Irreplaceable Baker</span>!"},{"name":"SYSTEM","text":"A new quest continuing the story of the Faculty of Medicine is now available. Upon its completion, the Studium Deliveries list for Debroye will be updated."},{"name":"SYSTEM","text":"In order to undertake the subsequent quest, you must first complete the main scenario quest “Under His Wing.”"}],"reward":{"items":[{"num":2,"id":36046}]},"reqs":{"jobs":[{"lvl":85,"id":153}],"quests":[69684]},"next":[69686]},"partials":[{"type":"npc","id":"1039220","obj":{"i":1039220,"n":"Debroye","l":3706,"q":7}},{"type":"item","id":"36046","obj":{"i":36046,"n":"Happiness Juice","l":527,"c":24405,"t":46}},{"type":"quest","id":"69684","obj":{"i":69684,"n":"Remember the Texture","g":175,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69686","obj":{"i":69686,"n":"Long Live the Gourmet","g":175,"l":"Old Sharlayan","s":0}}]}