{"quest":{"name":"Make It Sweeter","location":"Old Sharlayan","id":69683,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1039220,"target":1039220,"genre":175,"journal":["Debroye is eager to begin the process of improving the panaloaf.","Debroye has tasked you with crafting jugs of panaloaf sweetener.<br><br>※Minimum collectability rating for this delivery is 110. Delivering items with a rating of 220 or more will earn greater rewards.","You deliver the panaloaf sweetener to Debroye. It seems you have time to hone your craft while she considers the problem of texture..."],"objectives":["Deliver jugs of panaloaf sweetener to Debroye."],"dialogue":[{"name":"DEBROYE","text":"Let us get straight down to business, shall we?"},{"name":"DEBROYE","text":"The main problem with panaloaf is that the recipe calls for a wide variety of wholesome substances, resulting in an extremely eclectic─and subsequently, extremely disgusting─mixture of flavors."},{"name":"DEBROYE","text":"Now, I've managed to bake a slightly less repulsive version by adjusting the balance of ingredients, but the taste remains indistinct and unsatisfying. It needs seasoning of some kind, and badly."},{"name":"DEBROYE","text":"To that end, I've put together a recipe for a sweetener using those materials which are readily available in Labyrinthos. Not in any amount which would contradict our healthy and nutritious mandate, of course."},{"name":"DEBROYE","text":"Concocting the sweetener itself, however, is a job for the experts, and so I'd like to entrust it to you. Very soon, we will have taken our first step to making the panaloaf halfway enjoyable!"},{"name":"SYSTEM","text":"Faculty of Medicine Deliveries are now available. By delivering the requested items to Debroye and raising yourself in her esteem, you can assist her with her mission to turn panaloaf into a properly perfect meal."},{"name":"DEBROYE","text":"The recipe for the sweetener isn't giving you any trouble, I hope? I can hardly wait to see how it turns out!"},{"name":"DEBROYE","text":"Thank you, <span class=\"highlight\">Forename</span>! This should go a long way to improving the panaloaf's flavor."},{"name":"DEBROYE","text":"Thank you, <span class=\"highlight\">Forename</span>! After trying a little taste, I can safely say that you've managed to hit the sweet spot─not overly mild, and not overly rich."},{"name":"SYSTEM","text":"In making your first successful delivery, you have begun to earn Debroye's trust."},{"name":"SYSTEM","text":"Deliver the items Debroye needs, and deliver them often to improve your standing with the Faculty of Medicine!"},{"name":"DEBROYE","text":"With your sweetener added to the mix, I went ahead and baked a second test batch of panaloaf."},{"name":"DEBROYE","text":"As for the result, well, I took some samples over to the Last Stand for the customers to try."},{"name":"DEBROYE","text":"And they said the taste was...passable! Which is a significant improvement over the nausea-inducing wretchedness of the original recipe. As I had hoped, a little sweetness was instrumental in tying the myriad flavors together."},{"name":"DEBROYE","text":"The key here being “a little sweetness”─we wouldn't want to go overboard and endanger the nutritional balance of our perfect meal!"},{"name":"DEBROYE","text":"Oh, I'm told one of our regulars is at his table today, and he is a man with a decidedly particular palate. Why don't we head over and ask for his impression of our second batch?"},{"name":"DEBROYE","text":"If I may ask, what did you think of the bread, sir?"},{"name":"FLAUGUSTERT","text":"(-Refined Gentleman-)Hm, not bad, not bad..."},{"name":"FLAUGUSTERT","text":"(-Refined Gentleman-)I give the flavor a passing grade. The texture, however, needs some attention."},{"name":"DEBROYE","text":"Ah, the texture..."},{"name":"FLAUGUSTERT","text":"(-Refined Gentleman-)'Tis not overly noticeable with a bite-sized sample, but after one or two full slices, I fear one might begin to struggle with the somewhat dry and powdery consistency."},{"name":"DEBROYE","text":"I...had not considered that. Thank you for your most valuable insight, sir! We will certainly keep that in mind for future batches!"},{"name":"DEBROYE","text":"Well, that was a much-needed reminder. In my rush to enhance the flavor, I've neglected to account for changes in the texture."},{"name":"DEBROYE","text":"Introducing the sweetener must have affected the consistency of the dough... &lt;sigh&gt; Nothing is ever simple, is it?"},{"name":"DEBROYE","text":"Improving the texture will be our next task, then. I'll give the problem some thought, then we can work together on creating the solution!"},{"name":"SYSTEM","text":"Debroye is pleased with your efforts. She now considers you a <span class=\"highlight\">Reliable Baker</span>!"},{"name":"SYSTEM","text":"The next request will be available from Debroye upon reaching level 83 as an alchemist or culinarian."}],"reward":{"items":[{"num":250,"id":12},{"num":250,"id":13}]},"reqs":{"jobs":[{"lvl":80,"id":153}],"quests":[69682]},"next":[69684]},"partials":[{"type":"npc","id":"1039220","obj":{"i":1039220,"n":"Debroye","l":3706,"q":7}},{"type":"quest","id":"69682","obj":{"i":69682,"n":"Perfectly Awful","g":175,"l":"Old Sharlayan","s":0,"f":1}},{"type":"quest","id":"69684","obj":{"i":69684,"n":"Remember the Texture","g":175,"l":"Old Sharlayan","s":0}}]}