{"quest":{"name":"Cultured Pursuits","location":"Old Sharlayan","id":69689,"patch":6.0,"sort":0,"icon":101139,"unlocksFunction":1,"eventIcon":71341,"issuer":1038504,"target":1038501,"genre":176,"journal":["Hinageshi is worried for her professor.","Hinageshi seeks the aid of a capable <span class=\"alternative-container\"><span class=\"alternative\">tradeswoman</span><span class=\"alternative\">tradesman</span></span> to assist Professor Tankin in his research. The problem, as she explains it, is he has yet to decide what it is he needs assistance with. Even so, she hopes speaking with him in person will help make clear their dire circumstances. And so you set off for Noumenon for an audience with Professor Tankin.","You find the professor sound asleep, though he seems grateful enough when you stir him from slumber. He notes your arrival is quite timely, as he but recently decided on the subject of his research. He then asks you to accompany him back to Searchers' Meet in order to hear more about his academic efforts.","Professor Tankin explains that his research is focused on recreating the lifestyles of other cultures so that he can ascertain which is best suited to enrich the lives of the people in Sharlayan. You agree to aid him by gathering whatever materials he needs to carry out his work. Not wishing to waste time, Professor Tankin excuses himself to consider where to begin with his research, leaving you to speak with Hinageshi.","You aren't entirely surprised to learn that Hinageshi harbors romantic feelings for the professor. However, she is delighted to hear you will aid in both her academic and romantic pursuits."],"objectives":["Search for Tankin.","Speak with Tankin.","Speak with Hinageshi."],"dialogue":[{"name":"HINAGESHI","text":"Excuse me, kind <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>."},{"name":"HINAGESHI","text":"Pardon my forthrightness, but might I beg a moment of your time? I work under Professor Tankin, and am in search of a capable [Job] to assist with his research."},{"name":"HINAGESHI","text":"That is your profession, is it not? In which case, I wish to discuss potential employment with the Faculty of Anthropology. Assuming, that is, you have an interest in our work? "},{"name":"HINAGESHI","text":"Magnificent!"},{"name":"HINAGESHI","text":"Searchers' Meet, where we currently find ourselves, is a place where gleaners connect with the faculty and students of the Studium. It allows us to acquire the necessary materials for our studies and also provides us with a place to store supplies and specimens."},{"name":"HINAGESHI","text":"And with your help, I believe I may be able to procure what is needed for the professor's research."},{"name":"HINAGESHI","text":"Of course, such work is predicated on the assumption Professor Tankin has decided on a focus for his next project, which sadly he has not..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Would you say he's the indecisive sort?"},{"name":"A1","text":"How exactly am I supposed to help then?"},{"name":"HINAGESHI","text":"Oh, that is certainly one way of putting it. If he doesn't hurry and submit a research proposal to the Studium soon, he will be unable to secure funding for his work. Why, his very tenure could be cut short!"},{"name":"HINAGESHI","text":"Ah, my apologies. In my haste to find aid, it would seem I've gotten ahead of myself. You see, the professor must submit a research proposal to the Studium, and soon. Otherwise, he will be unable to secure funding for his work. In fact, his very tenure could be cut short!"},{"name":"HINAGESHI","text":"It would be a great loss for the Studium, as he is a remarkable scholar. The very definition of calm and collected...until he discovers something that piques his interest."},{"name":"HINAGESHI","text":"Then his eyes widen and his cheeks take on a rosy hue. Honestly, it's like he regresses to being a young boy!"},{"name":"HINAGESHI","text":"...Ahem. Returning to the topic at hand: your first task will be to “procure” Professor Tankin himself! I imagine you'll find him somewhere in Noumenon, if you would be so kind...?"},{"name":"HINAGESHI","text":"Wonderful. And when you find him, pray offer him this slice of Archon loaf. Like as not, he's forgotten to eat as usual."},{"name":"HINAGESHI","text":"The sheer size of the library can prove daunting at times, but I have spent enough time with the professor to know he is in there somewhere."},{"name":"HINAGESHI","text":"How I can be so certain of his whereabouts? He is a Sharlayan scholar through and through. Where else would a man seeking knowledge while away his time?"},{"name":"HINAGESHI","text":"I would also bet my left leg that he has forgotten to break for a meal, or even sleep! So please be sure he eats that Archon loaf."},{"name":"TANKIN","text":"Wh-What!? Damn it all, I succumbed to the sweet song of slumber yet again. She always strikes when I least suspect it."},{"name":"TANKIN","text":"I don't suppose you would happen to have a morsel of food to spare on your person? I seem to have built up quite the appetite whilst dead to the world."},{"name":"TANKIN","text":"Hinageshi sent you, eh? Of course she would insist that I eat Archon loaf..."},{"name":"TANKIN","text":"At any rate, you have my thanks. I hope you do not think me rude for indulging right away."},{"name":"TANKIN","text":"That ought to silence my stomach for a while. Truly, I am indebted to you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Dozing in the midst of research is an all-too-common─and routinely ignored─occurrence around here. There is no telling how long I would have slept had you not come when you did."},{"name":"TANKIN","text":"In fact, it calls to mind the tale of a researcher seeking a means to traverse the aetherial sea. He wished to do so while still amongst the living, you see, but they found him dead in the midst of a pile of books..."},{"name":"TANKIN","text":"But that is neither here nor there. I take you are come seeking employment? Your timing is quite fortuitous, as I but recently decided upon a topic for my thesis. Pray accompany me to Searchers' Meet once more, and I shall explain all to you there."},{"name":"HINAGESHI","text":"I was right, wasn't I? This is far from the first time he has been found facedown in a book, and certainly won't be the last."},{"name":"TANKIN","text":"There you are. My savior from slumber."},{"name":"HINAGESHI","text":"Professor, please. It would be most rude to waste any more of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> time. Might we discuss the focus of your next research project, and what it is you require of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>?"},{"name":"TANKIN","text":"Yes, of course. Time is of the essence! Honestly, Hinageshi, I do not know what I would do without you."},{"name":"HINAGESHI","text":"I, er, well, that is most flattering, Professor... Thank you."},{"name":"TANKIN","text":"I mean it, Hinageshi! I would be lost. Completely and utterly lost..."},{"name":"HINAGESHI","text":"Professor Tankin, I..."},{"name":"TANKIN","text":"...Yes, and quite famished besides. So absorbed was I in my research that I had all but forgotten my need for rest and sustenance. Were it not for your kind gift, I would surely have expired by now."},{"name":"HINAGESHI","text":"Oh, I thought you meant─ I mean, yes! Yes, of course. Always happy to help..."},{"name":"TANKIN","text":"Provided our research is deemed of value to the Studium, we are supplied with clothing, food, and shelter. But only the bare essentials, mind you."},{"name":"TANKIN","text":"You need but look around to know the veracity of my words."},{"name":"TANKIN","text":"We do as we are instructed, researching and gathering resources, but what value do these things truly have in the grand scheme of things?"},{"name":"TANKIN","text":"The study of a thousand thousand civilizations, and nothing here has changed. The culture of Sharlayan remains as stagnant as the threadbare attire we wear day in and day out."},{"name":"HINAGESHI","text":"I must confess you do have a point about our garments... Should my shirt and trousers be soiled, I would have little recourse but to wear them inside out."},{"name":"HINAGESHI","text":"But to be perfectly honest, I have no real qualms with the way we live here in Sharlayan."},{"name":"TANKIN","text":"That is all well and good, Hinageshi, but would you be content to let your children live in such austere conditions? Your children's children?"},{"name":"HINAGESHI","text":"Ch-Children? Professor, why ever would you bring up such a thing?"},{"name":"TANKIN","text":"It is a subject I have thought to broach for some time. After all, you shall be my sole company for the foreseeable future, and I yours, correct?"},{"name":"HINAGESHI","text":"Y-Yes, I suppose you're right. And I am perfectly content as we are. Of course, if you would prefer other company..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Perhaps I've come at a bad time..."},{"name":"A2","text":"This has been wonderful, but I should be going."},{"name":"TANKIN","text":"Perish the thought! I have long wished for the help of a third party, and insist you stay to aid with our research."},{"name":"TANKIN","text":"And deny us the pleasure of your company? I have long wished for the help of a third party, and insist you stay to aid with our research."},{"name":"HINAGESHI","text":"A third party. Splendid..."},{"name":"TANKIN","text":"I am resolved to change our current way of life. However, in order to do so successfully, I must first determine what cultures are best suited to blend with ours."},{"name":"TANKIN","text":"As such, my research shall involve recreating the lifestyles of other cultures within this very building."},{"name":"HINAGESHI","text":"So that was the cause for your furrowed brow of late. Well, it is a marvelous idea, Professor! "},{"name":"TANKIN","text":"Which is where your experience as a [Job] comes into play. I would have you gather the materials necessary for said recreations."},{"name":"TANKIN","text":"Though we do have a great deal of resources on hand at present, they are as yet inadequate for my plans."},{"name":"TANKIN","text":"Now, if you will excuse me, I require time to consider which culture I shall attempt to emulate first."},{"name":"HINAGESHI","text":"Have you ever seen such an inspiring sight?"},{"name":"TANKIN","text":"My intention is to research as diverse a collection of cultures as possible. To which end, I will focus on those whose unique customs set them apart from other walks of life."},{"name":"HINAGESHI","text":"It is a relief to see Professor Tankin has at last chosen a subject for his research proposal."},{"name":"HINAGESHI","text":"I myself have long been interested in the world's myriad peoples and their customs. In fact, that is precisely why I was so keen to work with gleaners, well versed as they are in the lore of distant lands."},{"name":"HINAGESHI","text":"My parents too had a love for learning of other cultures. It was their fondness for the Far East, and its beautiful flowers, that gave them inspiration for my name."},{"name":"HINAGESHI","text":"Despite knowing the origins of my name, I never gave it much thought. That is, until one day when the professor commented on it in one of his enthralling lectures."},{"name":"HINAGESHI","text":"However, he did not stop there. Professor Tankin continued by musing on how even a single flower can go by many names—different regions will know it differently, after all. He then went on to talk of how this difference in location, language, and lifestyle can have a profound impact on how we think."},{"name":"HINAGESHI","text":"“We Au Ra have our roots in the Far East, though I only know the Sharlayan way of life,” he said."},{"name":"HINAGESHI","text":"“I have long wondered what change might occur within my own mind should I someday visit my ancestral home. It is this very question which drives my research.”"},{"name":"HINAGESHI","text":"Yes, even now I remember his words oh-so clearly. That lecture inspired me to take up my current post."},{"name":"HINAGESHI","text":"Yet though I have done my utmost to assist him, our failure to present any findings has left me with naught to show of my own achievements."},{"name":"HINAGESHI","text":"Oh, how I long to conduct research with him in the Far East. Just the two of us..."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Just the two of you, eh?"},{"name":"A3","text":"Why don't you tell him about all of this?"},{"name":"HINAGESHI","text":"Wh-What are you implying with that tone!?"},{"name":"HINAGESHI","text":"...Hmm. No, perhaps it is time I was honest for once."},{"name":"HINAGESHI","text":"You see, I am...rather fond of Professor Tankin."},{"name":"HINAGESHI","text":"To be honest, it is more than a little disconcerting that he has not noticed my feelings when even you have."},{"name":"HINAGESHI","text":"However, given that his current research is squarely focused on creating a better life for us, I feel this is an opportunity I cannot pass up."},{"name":"HINAGESHI","text":"But I have no experience in matters of the heart. Like a fool, my youth was spent with my nose buried in books..."},{"name":"HINAGESHI","text":"Would you, perchance, be more experienced in matters of romance? I would be forever grateful for your help in winning the professor's affections!"},{"name":"HINAGESHI","text":"Truly, you will help me? Oh, thank you so much!"},{"name":"TANKIN","text":"Well, you two certainly seem to be getting along."},{"name":"HINAGESHI","text":"Oh, Professor! Have you come to a decision?"},{"name":"TANKIN","text":"As you are doubtless aware, Sharlayan is frightfully cold all year round. However, this has led to rapid progress in our ability to control our environs."},{"name":"TANKIN","text":"Nothing proves this fact more than Labyrinthos. It is so pleasantly warm down there you would be forgiven for thinking you were somewhere altogether more tropical."},{"name":"TANKIN","text":"This has inspired me to look into the lifestyles of those who actually reside in balmy climes. We may yet happen upon a discovery or two that would never be made simply shivering in the cold."},{"name":"TANKIN","text":"In line with this, the culture we shall seek to emulate first is none other than Radz–at–Han's!"},{"name":"HINAGESHI","text":"Splendid!"},{"name":"TANKIN","text":"We will need you to go and collect a few things that can only be obtained in Radz-at-Han proper. Hinageshi will brief you in more detail."},{"name":"SYSTEM","text":"You may now undertake deliveries for the Faculty of Anthropology at the Studium. Speak to Hinageshi to learn more."}],"reward":{"items":[{"num":2,"id":30481}]},"reqs":{"jobs":[{"lvl":80,"id":154}],"quests":[70009]},"next":[69690]},"partials":[{"type":"npc","id":"1038504","obj":{"i":1038504,"n":"Hinageshi","l":3706,"q":1}},{"type":"npc","id":"1038501","obj":{"i":1038501,"n":"Hinageshi","l":3706,"q":7}},{"type":"item","id":"30481","obj":{"i":30481,"n":"Crab Cakes","l":490,"c":24329,"t":46}},{"type":"quest","id":"70009","obj":{"i":70009,"n":"The Faculty","g":178,"l":"Old Sharlayan","s":10,"f":1}},{"type":"quest","id":"69690","obj":{"i":69690,"n":"Cooking Up a Culture","g":176,"l":"Old Sharlayan","s":0}}]}