{"quest":{"name":"Perfectly Delectable","location":"Old Sharlayan","id":69687,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1039220,"target":1039220,"genre":175,"journal":["Debroye is in a state of despair.","Debroye has tasked you with crafting pinches of ascorbic additive.<br><br>※Minimum collectability rating for this delivery is 160. Delivering items with a rating of 340 or more will earn greater rewards.","You deliver the ascorbic additive to an ecstatic Debroye. The current incarnation of Mervynbread is a delectable success, and she insists that you be in attendance when the Forum is ready to make their evaluation."],"objectives":["Deliver pinches of ascorbic additive to Debroye."],"dialogue":[{"name":"DEBROYE","text":"Oh, <span class=\"highlight\">Forename</span>..."},{"name":"DEBROYE","text":"I've been trying and trying to make that ascorbic acid."},{"name":"DEBROYE","text":"I've done exactly as Jalvaaz instructed, followed his steps to the letter, but it all ends in failure."},{"name":"DEBROYE","text":"As embarrassing as it is to admit, I simply lack the expertise─the process requires a far more competent hand than mine."},{"name":"DEBROYE","text":"So, here I am at the last, asking for your help once more..."},{"name":"DEBROYE","text":"Please, I need you to manufacture the additive that will perfect our perfect meal!"},{"name":"SYSTEM","text":"The Studium Deliveries list for Debroye has been updated. To view the new list, speak with Debroye."},{"name":"DEBROYE","text":"All our Mervynbread needs is a viable ascorbic additive. I may have failed in that endeavor, but I have faith that you will succeed!"},{"name":"DEBROYE","text":"Ascorbic acid created from plain old coconut milk... I understand the idea in practice, but as you saw, the process itself was beyond my abilities. Thank you, <span class=\"highlight\">Forename</span>."},{"name":"DEBROYE","text":"Incredible─it's practically glowing with goodness! With this added to our creation, I have every confidence that the bread will pass any test they care to subject it to!"},{"name":"DEBROYE","text":"With your additive, well, added to the mix, I put a batch of Mervynbread into the oven to bake. It should be ready any moment now!"},{"name":"DEBROYE","text":"This is it─the final, fluffy result of much trial and error."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It looks delicious!"},{"name":"A1","text":"It looks so...familiar."},{"name":"DEBROYE","text":"Well, have a bite!"},{"name":"DEBROYE","text":"And? How does it taste?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"As amazing as it looks!"},{"name":"A2","text":"Like streams of flavor, blending into a single river of ambrosial delight!"},{"name":"DEBROYE","text":"Wonderful! And the texture...?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"It's like biting into a soft-baked cloud!"},{"name":"A3","text":"It's like natural law has been suspended to create this one moment of unparalleled, puffy-crusted bliss!"},{"name":"DEBROYE","text":"Fantastic! And last but not least, what did you think of the aroma?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"That luscious, savory smell is to die for!"},{"name":"A4","text":"It's like a siren scent of savory temptation which no mortal stomach can resist!"},{"name":"DEBROYE","text":"Exactly what I thought! All the disparate elements have come together so well..."},{"name":"DEBROYE","text":"Flavor, texture, aroma─not to mention a perfect balance of nutrients."},{"name":"DEBROYE","text":"And I have you to thank for this delectable achievement!"},{"name":"DEBROYE","text":"Yes, I believe this current incarnation of Mervynbread has a good chance of swaying the Forum in our favor. You <span class=\"emphasis\">are</span> attending the evaluation, aren't you? In fact, I must insist upon it!"},{"name":"SYSTEM","text":"Debroye is thrilled with your efforts. She now considers you a <span class=\"highlight\">Consummate Baker</span>!"},{"name":"SYSTEM","text":"The next request will be available from Debroye upon reaching level 90 as an alchemist or culinarian."}],"reward":{"items":[{"num":2,"id":36060}]},"reqs":{"jobs":[{"lvl":88,"id":153}],"quests":[69686]},"next":[69688]},"partials":[{"type":"npc","id":"1039220","obj":{"i":1039220,"n":"Debroye","l":3706,"q":7}},{"type":"item","id":"36060","obj":{"i":36060,"n":"Tsai tou Vounou","l":554,"c":24417,"t":46}},{"type":"quest","id":"69686","obj":{"i":69686,"n":"Long Live the Gourmet","g":175,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69688","obj":{"i":69688,"n":"Sharlayan Cuisine","g":175,"l":"Old Sharlayan","s":0}}]}