{"quest":{"name":"The Promised Star","location":"Old Sharlayan","id":69681,"patch":6.0,"sort":0,"icon":101137,"eventIcon":71221,"issuer":1038525,"target":1038525,"genre":174,"usedItems":[35841,35842],"journal":["Jude hopes to speak with you before completing the starlens.","Upon speaking with Jude, he asks you to craft a wand for the starlens, which allows the user to channel magic into the ancient telescope.","You deliver the starlens wand to Jude who reveals to you that he plans to speak with Jeromere one final time before beginning his search for the Azure Star. While he is putting the starlens together, he asks that you find his dear friend at Auk's Landing.","Other members of the poetry club overhear Jude's conversation about the Azure Star, and openly mock him after learning the sheer amount of time Jeromere spent searching for it. This prompts Jude to lash out in his friend's defense, much to everyone's surprise. The poetry club members soon take their leave, and Jude implores Jeromere to accompany him in this last attempt to search for the Azure Star. He reluctantly agrees, and so the three of you make for Scholar's Harbor.","With the starlens in place, Jude casts his aether out into the waters of Scholar's Harbor. Try as he might, however, the Azure Star fails to appear. As Jude begins to lose hope, you add your aether to his, strengthening the starlens's gaze into the heavens. Watching his friend struggle, Jeromere feels suddenly compelled to lend his strength as well. After a few moments, a new light begins to shine in the harbor─the Azure Star. Equal parts exhausted and elated, they return to Jude's workshop, their dream at last realized.","Jeromere hypothesizes that modern telescopes fail to pick up on the existence of certain heavenly bodies, including the Azure Star, because they detect light rather than aether. By contrast, the starlens detects aetherial fluctuations, detecting the very life force of stars that would otherwise remain unnoticed. Jeromere is inspired to resume his studies in astronomy and explore the celestial skies alongside his dear friend. Jude bids you farewell, and though you may find yourselves worlds apart, you will always be with him each night when he gazes at the stars."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a starlens wand <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the starlens wand <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Jude</span></span>.","Speak with Jeromere.","Wait at the designated location.","Speak with Jude."],"dialogue":[{"name":"JUDE","text":"Thanks to you, the completion of the starlens is in sight."},{"name":"JUDE","text":"Without you by my side, I would have no doubt given up before the journey even began. And I speak not just of finding the Azure Star but also confronting Jeromere as to why he quit astronomy."},{"name":"JUDE","text":"Words are not enough to express my gratitude."},{"name":"JUDE","text":"Now here we stand at the finish line and I have one last request to make of you. Channeling magic into the starlens requires a wand─would you please craft one for me?"},{"name":"JUDE","text":"Should you ever find yourself short on materials, please help yourself to whatever is in the trunk!"},{"name":"JUDE","text":"Have you finished crafting the final piece?"},{"name":"JUDE","text":"It's absolutely perfect! Now that I have the necessary parts, all that's left to do is search for the Azure Star!"},{"name":"JUDE","text":"When that time comes, might I be so bold as to ask you to join me? There is also one other individual I wish could be there..."},{"name":"JUDE","text":"That being said, there is no guarantee that the Azure Star even exists. I do not wish to disappoint them again."},{"name":"JUDE","text":"Even so, I would like to search the skies once again with Jeromere! After all, it is a dream we've shared for a decade. Not at least asking would be a form of betrayal in itself."},{"name":"JUDE","text":"Given the time, he is most likely at Auk's Landing reciting poetry with his friends."},{"name":"JUDE","text":"As soon as I finish putting everything together I will go straight there. Please, wait with Jeromere for me at Auk's Landing!"},{"name":"SYSTEM","text":"The Faculty of Astronomy has provided the Classical Astronomical Association with a wooden box full of materials. Feel free to help yourself."},{"name":"SYSTEM","text":"Seeing as all the parts are now ready, go ahead and deliver the completed wand to Jude."},{"name":"JEROMERE","text":"Ah, it's you again. I apologize, but we have nothing more to discuss."},{"name":"JUDE","text":"(-???-)You may have nothing more to say, but I have plenty."},{"name":"JEROMERE","text":"Jude..."},{"name":"JUDE","text":"The starlens that <span class=\"highlight\">Forename</span> and I have been working on is now complete. It would mean the world to me if you came to watch me begin my search for the Azure Star."},{"name":"JEROMERE","text":"I'm sorry, Jude. I'm afraid that is something I cannot do."},{"name":"SURROUNDINGS04145","text":"What do you mean “you cannot”? This is your childhood friend we're talking about..."},{"name":"SURROUNDINGS04145","text":"You should go with him. If the Azure Star truly doesn't exist, isn't it your duty to be by his side when he learns the truth?"},{"name":"JEROMERE","text":"You don't understand. I searched for a decade for that star. It is nowhere to be found."},{"name":"SURROUNDINGS04145","text":"A decade. Surely, you jest..."},{"name":"SURROUNDINGS04145","text":"What an absolute waste of time that was!"},{"name":"SURROUNDINGS04145","text":"Ha! To think you were this close to throwing out <span class=\"emphasis\">all</span> the best years of your life chasing a figment of your imagination!"},{"name":"SURROUNDINGS04145","text":"If such a thing existed, the top academics in the Faculty of Astronomy would've already found it! Did you not even take that into consideration? By the gods, you must be even dumber than a sack of rocks!"},{"name":"JUDE","text":"You..."},{"name":"JUDE","text":"How dare you speak such atrocities!"},{"name":"SURROUNDINGS04145","text":"Huh!? Are you talking to me!?"},{"name":"JUDE","text":"You, nor anyone else, has the right to ridicule us! Threaten and laugh at me all you like, you will not strip me of my dream!"},{"name":"SURROUNDINGS04145","text":"Then, maybe what you need is some sense knocked into you!"},{"name":"COOLMALE04145","text":"I'd strongly recommend against that. You see that crafts<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> there? <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s an adventurer from overseas, and certainly not someone you want to pick a fight with. Even you don't stand a chance."},{"name":"SURROUNDINGS04145","text":"Hmph! You'd best watch your back!"},{"name":"JEROMERE","text":"Jude, in all our years together, I don't think I've ever seen you so upset, much less speak up the way you did..."},{"name":"JUDE","text":"I'll admit I surprised myself a little. My heart is still pounding!"},{"name":"JUDE","text":"I just couldn't let it go when I thought about everything you had invested. The audacity he has to utter such words!"},{"name":"JEROMERE","text":"I lived, ate, and breathed that dream. When I discovered there was no hope of fulfilling it, the despair that overcame me was beyond words... I felt worthless."},{"name":"JEROMERE","text":"That is why I could say nothing earlier. Even if some of the members of the poetry club are a little rough around the edges, this is the only place I have..."},{"name":"JUDE","text":"When we were children and I was crying because I did not fit in with the others, you invited me to join you in stargazing. You gave me a place to belong in this world."},{"name":"JUDE","text":"And now I'm asking you to join me in that place once more, gazing up at the skies!"},{"name":"JEROMERE","text":"...Very well. But this will be it for me, Jude."},{"name":"JUDE","text":"Then let us make our way to Scholar's Harbor. I must first return to the workshop and retrieve the starlens, so I will meet the two of you there."},{"name":"JEROMERE","text":"To think that Jude has changed so drastically and in such a short span of time... It seems what he needed was not someone to take him by the hand, but rather coax him forward from behind."},{"name":"JUDE","text":"I will head right over as soon as I finish assembling everything. Please wait for me with Jeromere at Auk's Landing."},{"name":"SURROUNDINGS04145","text":"Hm? What're you looking at?"},{"name":"COOLMALE04145","text":"Thanks to the exquisite utensil set you crafted for me, she has finally started to take an interest in me! Are you looking for Jeromere again? "},{"name":"JUDE","text":"...And there we go!"},{"name":"JUDE","text":"Let us begin, then!"},{"name":"JEROMERE","text":"So this is the starlens... It doesn't look like much."},{"name":"JUDE","text":"Ten years ago on that fateful day, we were attempting to observe the constellations aligning with the fifth heaven's gate. I will begin by positioning the starlens in the same manner."},{"name":"JEROMERE","text":"Incredible. Absolutely incredible. The stars can be seen with such clarity..."},{"name":"JEROMERE","text":"However, the Azure Star we saw back then does not shine among them.  "},{"name":"JEROMERE","text":"Not that I expected anything different. After all, one cannot see, even with state-of-the-art technology, that which does not exist."},{"name":"JEROMERE","text":"You did well, Jude. The starlens is quite an impressive piece of work."},{"name":"JUDE","text":"Wait!"},{"name":"JUDE","text":"It is for this exact reason the amplifier exists!"},{"name":"JUDE","text":"Or do we need more?"},{"name":"JEROMERE","text":"Jude, I want to believe it exists just as much as you, but...!"},{"name":"JUDE","text":"It exists. It's there somewhere right before our very eyes!"},{"name":"JUDE","text":"Please, reveal to us your brilliance once more, just as you did ten years ago!"},{"name":"JUDE","text":"Jeromere, look! It's real! It truly does exist! We didn't imagine it!"},{"name":"JEROMERE","text":"It's...real..."},{"name":"JEROMERE","text":"Why did I give up so easily...? Jude, you are extraordinary."},{"name":"JEROMERE","text":"While I am surprised to see how much Jude has changed, that does not change the fact that the Azure Star does not exist..."},{"name":"JUDE","text":"<span class=\"highlight\">Forename</span>, it is all thanks to you that our decade of hard work did not go to waste."},{"name":"JUDE","text":"Which reminds me, did you see where Jeromere wandered off to? He was with us when we entered the Studium grounds..."},{"name":"JEROMERE","text":"Ah, yes. This feels much better."},{"name":"JUDE","text":"Now that's more like the Jeromere I know! <span class=\"highlight\">Forename</span>, wouldn't you agree this style suits him better?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It looks good."},{"name":"A1","text":"That's, uh...some nice fabric."},{"name":"JEROMERE","text":"Thank you. I've finally come to realize that simply transforming my appearance does not change who I am on the inside."},{"name":"JEROMERE","text":"By the sound of it, <span class=\"highlight\">Forename</span> wholeheartedly disagrees. Thank you, at least, for attempting to mask your distaste with a polite compliment."},{"name":"JEROMERE","text":"Either way, I've finally come to realize that simply transforming my appearance does not change who I was on the inside."},{"name":"JEROMERE","text":"But that is neither here nor there. What I wished to talk about is the Azure Star. There is something about it that has been niggling at the back of my mind..."},{"name":"JEROMERE","text":"How is it you succeeded with an ancient lens made of water where the latest, most advanced equipment of the Studium failed?"},{"name":"JEROMERE","text":"Ah, of course!"},{"name":"JEROMERE","text":"The starlens allows us to see by capturing not the light of stars, but their aether, correct?"},{"name":"JUDE","text":"I see. You believe that, due to how far away the Azure Star resides from us, a traditional telescope would have trouble capturing the light it emits."},{"name":"JUDE","text":"The starlens, meanwhile, can capture an image of its aether─the very life force of the star."},{"name":"JEROMERE","text":"I can scarcely imagine how much further our technology must advance for telescopes to perceive such distant celestial bodies."},{"name":"JUDE","text":"Strange, then, that we were able to see the Azure Star all those years ago. How do you suppose we accomplished such a feat?"},{"name":"JEROMERE","text":"At the time, we were using a toy crafted for children. The lens, contrary to proper telescopes, was made from low-quality crystal."},{"name":"JEROMERE","text":"The aether of that crystal lens is likely what allowed us to pick up on the star's glow."},{"name":"JUDE","text":"But after we reported what we saw, the Faculty of Astronomy conducted their own observations under similar─if not identical─conditions and found nothing."},{"name":"JEROMERE","text":"Hmmm... What if the intensity of its aetherial emissions is prone to periodic fluctuations? An aetherial cycle, if you will."},{"name":"JEROMERE","text":"It stands to reason that night ten years ago, the Azure Star had reached its peak."},{"name":"JEROMERE","text":"A brief, miraculous window wherein the star's aether was such that we could catch a glimpse with our crystal-lensed telescope."},{"name":"JUDE","text":"Incredible, as always Jeromere! You've always been very sharp."},{"name":"JEROMERE","text":"Sharp or not, my abilities pale in comparison to your sheer drive, Jude. Thanks to said drive, we have rediscovered an alternate means of viewing stars in the night sky."},{"name":"JUDE","text":"And if your theory is correct, then that means there are far more stars out there than we ever even suspected waiting to be discovered!"},{"name":"JEROMERE","text":"It would certainly seem that way. This may very well revitalize and revolutionize the field of astronomy."},{"name":"JUDE","text":"Then let us continue working together to find them, Jeromere! Let us continue to breathe life into the dreams of those two young boys from ten years ago!"},{"name":"JEROMERE","text":"Jude, you forget I am no longer with the Faculty of Astronomy..."},{"name":"JUDE","text":"In case you've already forgotten, I'm a rather persistent fellow. I waited this long; I can stand to wait a bit longer for your return."},{"name":"JEROMERE","text":"I cannot argue with that."},{"name":"JUDE","text":"Never did I think when we began this journey that it would come to such a spectacular end! Thank you once again, <span class=\"highlight\">Forename</span>."},{"name":"JUDE","text":"While our time together was short, it was incredibly fruitful. I am devastated to have to say good-bye..."},{"name":"JUDE","text":"We, however, shall continue to reside under the same stars. When I want to remember our time together, I will simply look to the skies."},{"name":"JUDE","text":"I pray we will meet again! You shall always remain a treasured and true friend of mine."},{"name":"JUDE","text":"The fires of Ifrit─nay─the Phoenix have taken up residence in my heart, where they will continue to burn forevermore!"},{"name":"SYSTEM","text":"Jude is deeply moved by your efforts. He now considers you a <span class=\"highlight\">Treasured and Trusted Friend</span>!"},{"name":"SYSTEM","text":"Keep an eye out for others at the Studium who require the help of an able artisan. You never know who might be in need of your skills."},{"name":"SYSTEM","text":"You have completed all of the Studium quests. It seems Qih Aliapoh has something she would like to ask of you."},{"name":"SYSTEM","text":"Visit her at the main reception counter in the Studium."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":1130,"items":[{"id":33938,"one":1},{"id":33939,"one":1},{"id":33940,"one":1}]},"reqs":{"jobs":[{"lvl":90,"id":152}],"quests":[69680]},"next":[70010]},"partials":[{"type":"npc","id":"1038525","obj":{"i":1038525,"n":"Jude","l":3706,"q":7}},{"type":"item","id":"33938","obj":{"i":33938,"n":"Craftsman's Competence Materia X","l":560,"c":20290,"t":58,"materia":{"tier":9,"value":27,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"33939","obj":{"i":33939,"n":"Craftsman's Cunning Materia X","l":560,"c":20290,"t":58,"materia":{"tier":9,"value":10,"attr":"CP","category":1}}},{"type":"item","id":"33940","obj":{"i":33940,"n":"Craftsman's Command Materia X","l":560,"c":20290,"t":58,"materia":{"tier":9,"value":18,"attr":"Control","category":1}}},{"type":"item","id":"35841","obj":{"i":35841,"n":"Starlens Wand Material","l":560,"c":26523,"t":63}},{"type":"item","id":"35842","obj":{"i":35842,"n":"Starlens Wand","l":560,"c":32761,"t":63}},{"type":"quest","id":"69680","obj":{"i":69680,"n":"An Astronomical Growth","g":174,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"70010","obj":{"i":70010,"n":"The Meeting of Minds","g":178,"l":"Old Sharlayan","s":20}}]}