{"quest":{"name":"Perfectly Awful","location":"Old Sharlayan","id":69682,"patch":6.0,"sort":0,"icon":101138,"unlocksFunction":1,"eventIcon":71341,"issuer":1039227,"target":1039220,"genre":175,"journal":["Debroye is looking a little green around the gills.","After an abortive attempt to enlist your assistance, Debroye explains that her debilitating nausea was caused by an experimental foodstuff of highly questionable flavor. Rather than attempt to explain the taste, she bids you join her at Makers' Meet and try the newly created comestible yourself.","You meet with Debroye, and she provides you with a sample of Professor Galveroche's new bread. It is, quite possibly, the worst thing you have ever tasted. By way of apology, the self-proclaimed student of nutrition offers to serve you a palate cleanser at the Last Stand while she more fully explains the severity of the situation at hand.","Reinvigorated by Debroye's sumptuous lobster dish, you listen intently as she describes how the professor's revolting panaloaf came to be. Debroye is greatly concerned by the idea that the awful bread may be adopted not only as an emergency recipe, but also as a staple of the Sharlayan diet. She pleads with you to return with her to Makers' Meet, and aid her efforts in improving the taste of this “perfect meal.”","You arrive at Makers' Meet, and indicate your willingness to assist Debroye in her gastronomic endeavor. The fate of Sharlayan's dietary culture hangs in the balance..."],"objectives":["Speak with Debroye.","Speak with Debroye again.","Speak with Debroye once more."],"dialogue":[{"name":"DEBROYE","text":"Greet...greetings, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. I am Debroye, a student of the nutritional sciences from Professor Galveroche's research laboratory. At... Urgh, pray excuse me... At your service."},{"name":"DEBROYE","text":"If I'm not mistaken, you're the [Job] who has come to us by way of Qih Aliapoh's introduction, yes?"},{"name":"DEBROYE","text":"Wonderful! I would very much like to request your help with a cert─ugh... Ahem, a certain..."},{"name":"DEBROYE","text":"Urgh. &lt;belch&gt; Oh my..."},{"name":"DEBROYE","text":"Forgive me, my stomach is not entirely...at its best. Professor Galveroche bid me try a sample of a newly created comestible, you see."},{"name":"DEBROYE","text":"The taste was...well... And the texture! Oh dear..."},{"name":"DEBROYE","text":"...Perhaps you should just experience it firsthand─one mouthful is worth a thousand words, and all that."},{"name":"DEBROYE","text":"Pray join me over at Makers' Meet, and I can initiate you in the “wonders” of experimental foodstuffs."},{"name":"DEBROYE","text":"Thank you ever so much for coming. Let's set the table for you, shall we?"},{"name":"DEBROYE","text":"On first inspection, it seems to be an ordinary loaf of bread, yes? Now, try a slice."},{"name":"SYSTEM","text":"The initial flavor is <span class=\"alternative-container\"><span class=\"alternative\">akin to chewing on rotten garbage</span><span class=\"alternative\">one of otherworldly astringency</span><span class=\"alternative\">so complex as to be unidentifiable</span><span class=\"alternative\">like a numbness in the tip of your tongue</span><span class=\"alternative\">akin to mushy grain filling your mouth</span><span class=\"alternative\">like a rush of indescribable hatred</span><span class=\"alternative\">like savoring the absurdity of mankind</span><span class=\"alternative\">an affront to the gods themselves</span></span>, which gradually transitions into <span class=\"alternative-container\"><span class=\"alternative\">an overwhelming sensation of nausea</span><span class=\"alternative\">a feeling of intense regret</span><span class=\"alternative\">a hauntingly unpleasant aftertaste</span><span class=\"alternative\">an overall sense of crushing emptiness</span><span class=\"alternative\">a disturbingly solid mass of congealed blandness</span><span class=\"alternative\">a sense of deep and abiding despair</span><span class=\"alternative\">an awareness of your own futility in the face of inexorable fate</span><span class=\"alternative\">a bleakly entropic aftertaste</span></span>. It is quite possibly the worst thing you have ever eaten."},{"name":"DEBROYE","text":"Doesn't it taste awful?"},{"name":"GALVEROCHE","text":"(-???-)When it comes to the perfect meal, flavor is irrelevant!"},{"name":"DEBROYE","text":"Professor Galveroche! I wasn't─"},{"name":"GALVEROCHE","text":"Why, the very concept of “gourmet” cuisine has led to all manner of unhealthy excess! Too much salt, too much sugar, and entirely too much fatty content is employed in the pursuit of satisfying this...this <span class=\"emphasis\">obsession</span> with taste."},{"name":"GALVEROCHE","text":"The panaloaf we are laboring so hard to produce will contain everything necessary to sustain an adult body in one efficient, easily consumed serving. As I said: the perfect meal!"},{"name":"DEBROYE","text":"Ahem, Professor? If I might introduce─"},{"name":"GALVEROCHE","text":"By Thaliak, all this time wasted on idle chatter! If we are ever to attain true perfection, then every spare moment must be spent upon our research."},{"name":"GALVEROCHE","text":"Your task was to improve the panaloaf's digestibility, was it not? Then let us be getting on with it! Swift. Sure. Efficient!"},{"name":"DEBROYE","text":"You must excuse the professor's brusque manner."},{"name":"DEBROYE","text":"I know he seems eccentric, but the field of nutritional science was practically built upon the foundation of that man's research. Surely you've heard of the infamous Archon loaf? It was Professor Galveroche who proposed the recipe."},{"name":"DEBROYE","text":"In any case, I do apologize for serving you such a foul-tasting creation. But I needed you to understand the gravity of the situation."},{"name":"DEBROYE","text":"Come to the Last Stand, and I shall offer you something to cleanse your palate while I more fully explain the issue at hand."},{"name":"DEBROYE","text":"Pray take a seat, and I shall be with you in a moment."},{"name":"DEBROYE","text":"I hope you still have an appetite."},{"name":"DEBROYE","text":"When I'm not studying, I actually work here in the kitchens. And that one there is a dish I devised myself, using all the knowledge I've acquired about food and flavor. Enjoy!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"This is heavenly!"},{"name":"A1","text":"Incredible. As if my tongue has been purified by some divine nectar!"},{"name":"DEBROYE","text":"I'm so glad you liked it!"},{"name":"DEBROYE","text":"What you do is, you take a lobster, freshly caught from the Indigo Deep, scoop out the meat and sauté with butter and olive oil. Next you steam in white wine, but you must take care not to overcook it at this point..."},{"name":"DEBROYE","text":"...You then need to stuff it back into the shell, sprinkle liberally with thyme, oregano, and rosemary before baking in the oven at a steady heat, not too hot, of course, and then─"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Yes! Thank you! I'll take your word for it!"},{"name":"A2","text":"Well, whatever you did, it was delicious!"},{"name":"DEBROYE","text":"Ahem, my apologies. As you may have noticed, cooking is something of a passion of mine."},{"name":"DEBROYE","text":"Which brings us to my present problem, and the reason I so desperately require your assistance."},{"name":"DEBROYE","text":"It all began when agents of the Forum contacted Professor Galveroche, seeking to draw upon his wisdom and the nutritional expertise of his research facility."},{"name":"DEBROYE","text":"Their request was simple: they wished him to invent a singular meal that could provide all the daily nutrients a person needs to survive."},{"name":"DEBROYE","text":"They expressed their intent to develop a “food supply for emergencies,” and thus the only condition imposed was that it be possible to prepare this miracle dish from ingredients readily available in Labyrinthos."},{"name":"DEBROYE","text":"For his part, the professor threw himself into the work with routine intensity, using Archon loaf as a base to devise a new type of bread─the most recent batch of which I inflicted upon you earlier."},{"name":"DEBROYE","text":"Archon loaf was never praised for its flavor to begin with, and it seems the more nutrients you pack into the mix, the more revolting it becomes. Some volunteers have even been known to retch up the contents of their bellies after choking down a sample."},{"name":"DEBROYE","text":"Suspecting that a difficulty with digestion was to blame, Professor Galveroche asked that I work on making our meal easier to stomach. But the fact is...it simply tastes terrible."},{"name":"DEBROYE","text":"Can you imagine if there truly was some emergency, and we were forced to live on panaloaf alone? People would survive, of course, but gods, would they wish they hadn't."},{"name":"DEBROYE","text":"To make matters worse, the professor sees gourmet cooking as a wasteful abomination. If the Forum adopts his recipe, there is a very real chance he might champion panaloaf not only as a candidate for emergency supplies, but as a new, nationwide food staple."},{"name":"DEBROYE","text":"By and large, Sharlayans prefer meals that are easily prepared and easily consumed over more flavorful, but less time-efficient, culinary efforts. Scholars busy with their research will settle for sandwiches more often than not."},{"name":"DEBROYE","text":"And that ambivalent attitude towards food is exactly why I fear this horrible bread might actually be accepted into our everyday diets!"},{"name":"DEBROYE","text":"As a Sharlayan myself, I never had much interest in fine dining. Then I tried a dish at the Last Stand, and it was as if an entirely new world had opened up before me..."},{"name":"DEBROYE","text":"I soon discovered that a course in nutritional science would grant access to a vast repository of information on recipes and ingredients, so I enrolled as a student at the Studium's Faculty of Medicine."},{"name":"DEBROYE","text":"But their approach to food preparation was purely academic. Utilitarian. I reasoned that if I was to learn anything about gourmet cooking, then finding employment here would be the surest route."},{"name":"DEBROYE","text":"In fact, I was on the brink of abandoning my formal studies altogether when this request came in from the Forum."},{"name":"DEBROYE","text":"As a lover of fine foods─nay, as a person with a functional tongue─I am compelled to prevent this crime against cuisine from entering society in its current form!"},{"name":"DEBROYE","text":"Fortunately, I have the opportunity to improve the panaloaf's flavor under the guise of carrying out the professor's instructions."},{"name":"DEBROYE","text":"It will, however, be exceedingly difficult to enhance the taste without sacrificing any nutritional value─especially considering my lack of practical experience. My theory is sound, but when it comes to technical expertise..."},{"name":"DEBROYE","text":"And that, my dear [Job], is why I need you! If you do decide to help, then please, I beg you, come and see me at Makers' Meet."},{"name":"DEBROYE","text":"Ah, there you are! Can I assume this means you wish to aid me with my panaloaf predicament?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Sharlayan's larders must be saved!"},{"name":"A3","text":"No one else must suffer as I have..."},{"name":"DEBROYE","text":"Then I gladly accept your assistance! Praise the Scholar for bringing us this savior in our hour of need!"},{"name":"DEBROYE","text":"Oh dear me, I just realized... How could I put you through all that and not ask your name?"},{"name":"DEBROYE","text":"Well then, <span class=\"highlight\">Forename</span>, I look forward to working with you!"},{"name":"SYSTEM","text":"You may now undertake deliveries for the Faculty of Medicine at the Studium. Speak to Debroye to learn more."}],"reward":{"items":[{"num":2,"id":30482}]},"reqs":{"jobs":[{"lvl":80,"id":153}],"quests":[70009]},"next":[69683]},"partials":[{"type":"npc","id":"1039227","obj":{"i":1039227,"n":"Debroye","l":3706,"q":1}},{"type":"npc","id":"1039220","obj":{"i":1039220,"n":"Debroye","l":3706,"q":7}},{"type":"item","id":"30482","obj":{"i":30482,"n":"Chili Crab","l":490,"c":24328,"t":46}},{"type":"quest","id":"70009","obj":{"i":70009,"n":"The Faculty","g":178,"l":"Old Sharlayan","s":10,"f":1}},{"type":"quest","id":"69683","obj":{"i":69683,"n":"Make It Sweeter","g":175,"l":"Old Sharlayan","s":0}}]}