{"quest":{"name":"The Culture of Carrots","location":"Old Sharlayan","id":69692,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1038501,"target":1038501,"genre":176,"journal":["Hinageshi is mulling over her recent findings.","Hinageshi has asked that you supply her with lunar staples.<br><br>※Lunar staples can be gathered from the Crushing Brand by miners, and from Heimdall's Last Sight by botanists.<br><br>※Minimum collectability rating for this delivery is 240. Delivering items with a rating of 600 or more will earn greater rewards.","You deliver the lunar staples to Hinageshi. Although romantic pursuits seem to be at the forefront of her mind, Hinageshi endeavors to focus on the research to come."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Deliver  gathered from the Crushing Brand to Hinageshi.</span><span class=\"alternative\">Deliver  gathered from Heimdall's Last Sight to Hinageshi.</span><span class=\"alternative\">As a botanist or miner, deliver  to Hinageshi.</span></span>"],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Helping Hands.”"},{"name":"HINAGESHI","text":"Oh, I am positively desperate to know what culture we shall experience next."},{"name":"TANKIN","text":"Welcome back, my friend. We will be continuing our experience as Garleans a while longer, though I would like you to set about procuring materials for the next step in our research."},{"name":"TANKIN","text":"...Though to be honest, I've still to decide on where that step might be."},{"name":"HINAGESHI","text":"Well, thus far we have lived as people do in the freezing cold and the ferocious heat, so I would say it is time we set our sights on an altogether different sort of inclement environment."},{"name":"TANKIN","text":"Spot on as always, Hinageshi. The people of Garlemald may have overcome nature's fury with their sterling use of technology, but they are far too reliant on ceruleum."},{"name":"TANKIN","text":"Consider this: how would they cope if they were suddenly unable to obtain their precious fuel? One should never be without a contingency plan in case they are thrust into much less hospitable environs."},{"name":"HINAGESHI","text":"That is certainly true. However, what kind of culture could take root in an area that is effectively uninhabitable?"},{"name":"TANKIN","text":"That is precisely what I have been mulling over of late, Hinageshi."},{"name":"TANKIN","text":"I wish to look into how exactly culture could come to exist in such places. The issue is, well...such regions tend to be uninhabited as a result of their harsh conditions. In short, there is nowhere that meets my criteria to begin with!"},{"name":"HINAGESHI","text":"Inhabiting the uninhabitable... Yes it does seem to be something of a paradox, but there could be merit in investigating the idea."},{"name":"TANKIN","text":"You are a well-traveled adventurer, yes? Can you think of any place that may suit our curious criteria?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"What of Mare Lamentorum?"},{"name":"A1","text":"Have you considered the moon?"},{"name":"TANKIN","text":"A settlement on the moon by the name of Mare Lamentorum? Well, that would certainly fulfill my requirements, but even if it truly exists, it's not as if one can travel to the moon on a whim."},{"name":"TANKIN","text":"...You're being entirely serious, aren't you? Good gracious, you never fail to surprise."},{"name":"HINAGESHI","text":"Indeed! However, I feel obliged to mention that we know absolutely nothing of life on the moon, assuming it is even possible."},{"name":"HINAGESHI","text":"Pray head to Mare Lamentorum and gather whatever items you believe are necessary to recreate life there."},{"name":"SYSTEM","text":"The lunar staples you require can be gathered near the Crushing Brand."},{"name":"SYSTEM","text":"The lunar staples you require can be gathered near Heimdall's Last Sight."},{"name":"SYSTEM","text":"Faculty of Anthropology Deliveries are now available. By delivering the requested items to Hinageshi and raising yourself in her esteem, you can help bring her and Professor Tankin a little closer together."},{"name":"TANKIN","text":"Honestly, is there anything you cannot do? I am starting to think we ought to study <span class=\"emphasis\">your</span> way of life next."},{"name":"HINAGESHI","text":"I don't suppose you would know how best to store items from the moon? I wish to avoid accidentally ruining any precious samples you acquire on our behalf."},{"name":"HINAGESHI","text":"By the Twelve, you really are capable of travel to the moon! This may be the most surreal moment of my life to date..."},{"name":"HINAGESHI","text":"By the Twelve, you really are capable of travel to the moon! I know nothing of life on its surface, but even at a glance I can recognize the outstanding quality of these samples."},{"name":"HINAGESHI","text":"These are...carrots, aren't they? Not what I expected to be found buried in the crust of the moon, but...thank you. Thank you very much!"},{"name":"HINAGESHI","text":"These are...carrots, aren't they? Not what I expected to be found growing on the moon, but...thank you. Thank you very much!"},{"name":"SYSTEM","text":"Professor Tankin and Hinageshi take the items you brought them and set to work emulating lunar culture."},{"name":"HINAGESHI","text":"Professor... Are you certain this is representative of life on the moon?"},{"name":"TANKIN","text":"But of course it is, Hinageshi. I cannot reveal my source, but I have it on excellent authority that this is how they go about their days up there."},{"name":"HINAGESHI","text":"Well, that may be so, but is it necessary for us to don these ridiculous outfits?"},{"name":"TANKIN","text":"Alas, my source was somewhat vague concerning lunar clothing. However, I did my best to make up for it with a little imagination."},{"name":"TANKIN","text":"But of course it is, Hinageshi. My information comes from the Loporrits, a race that calls Mare Lamentorum home."},{"name":"HINAGESHI","text":"Well, that is all well and good, but is it necessary for us to don these ridiculous outfits?"},{"name":"TANKIN","text":"I, er, well... I thought it might help us to experience life as the Loporrits do."},{"name":"HINAGESHI","text":"And as for all these carrots... Make no mistake, Professor, it is wonderful to know that agriculture is possible even on the moon."},{"name":"HINAGESHI","text":"But I fear a diet comprised entirely of one type of root vegetable will not hold up to scrutiny..."},{"name":"TANKIN","text":"That may be so, but civilizations have had to move and adapt countless times throughout history, and they were not always able to eat exactly what they longed for. There may come a day when we too are forced to move to the moon."},{"name":"HINAGESHI","text":"The professor doesn't seem to be enjoying himself much. Perhaps he is not especially fond of carrots..."},{"name":"HINAGESHI","text":"I realize this is not the most opportune time to focus on my romantic pursuits, but soon my time will come. I can feel it!"},{"name":"HINAGESHI","text":"Hinageshi is overjoyed with your efforts. She now considers you an <span class=\"highlight\">Experienced Matchmaker</span>!"},{"name":"SYSTEM","text":"A new quest continuing the story of the Faculty of Anthropology is now available. Upon its completion, the Studium Deliveries list for Hinageshi will be updated."}],"reward":{"items":[{"num":2,"id":36047}]},"reqs":{"jobs":[{"lvl":85,"id":154}],"quests":[69691]},"next":[69693]},"partials":[{"type":"npc","id":"1038501","obj":{"i":1038501,"n":"Hinageshi","l":3706,"q":7}},{"type":"item","id":"36047","obj":{"i":36047,"n":"Carrot Nibbles","l":527,"c":24165,"t":46}},{"type":"quest","id":"69691","obj":{"i":69691,"n":"The Culture of Ceruleum","g":176,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69693","obj":{"i":69693,"n":"Hinageshi in Hingashi","g":176,"l":"Old Sharlayan","s":0}}]}