{"quest":{"name":"The Culture of the Past","location":"Old Sharlayan","id":69694,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1038501,"target":1038501,"genre":176,"journal":["Hinageshi is in a reflective mood.","Hinageshi has asked that you supply her with Elpis staples.<br><br>※Elpis staples can be gathered from the Hungering Gardens by miners, and from Anagnorisis by botanists.<br><br>※Minimum collectability rating for this delivery is 240. Delivering items with a rating of 600 or more will earn greater rewards.","You deliver the Elpis staples to Hinageshi. Professor Tankin appears to have taken Hinageshi's words to heart, and you sense a conclusion to their saga─romantic or otherwise─is about to be reached..."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Deliver  gathered from the Hungering Gardens to Hinageshi.</span><span class=\"alternative\">Deliver  gathered from Anagnorisis to Hinageshi.</span><span class=\"alternative\">As a botanist or miner, deliver  to Hinageshi.</span></span>"],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Hunger in the Garden.”"},{"name":"HINAGESHI","text":"You know, on our return voyage to Sharlayan, the professor said he'd been duly inspired and eager to continue our work. What culture do you suppose he intends to study next?"},{"name":"HINAGESHI","text":"Ah, Professor. Now that we're all gathered, might we discuss your plans moving forward?"},{"name":"TANKIN","text":"Yes, of course."},{"name":"TANKIN","text":"Our research thus far on the lifestyles of peoples in various regions has proved quite enlightening. However, after much deliberation, I have concluded that to merely compare and contrast locations alone will not suffice. No, we must consider different time periods as well."},{"name":"HINAGESHI","text":"Oh my. Well, I suppose that means we will be studying Allag, then? I can think of no other bygone cultures worthy of scrutiny."},{"name":"TANKIN","text":"And I understand full well why you would reach that conclusion. However, I recently happened upon records that suggest there exists a civilization that predates Allagans. A civilization older than time, far more advanced than one might believe possible."},{"name":"TANKIN","text":"It sounds a fantasy, I know. But if it truly exists, I wish to recreate that paradise."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I believe I know the place you speak of."},{"name":"A1","text":"I have seen part of it. A place called Elpis."},{"name":"TANKIN","text":"Please, tell us all you know."},{"name":"HINAGESHI","text":"A facility for the testing of creation magicks... Fascinating!"},{"name":"TANKIN","text":"Were it anyone else I would call them mad, but you did travel to the moon..."},{"name":"TANKIN","text":"I realize I am asking a great deal of you, but if there is a way to procure relics from that age, I would be eternally grateful. I will make what preparations I can for your return."},{"name":"HINAGESHI","text":"This may yet prove to be the discovery of a lifetime! Anything you can bring back to us will surely prove a boon to his research."},{"name":"SYSTEM","text":"The Elpis staples you require can be gathered near the Hungering Gardens."},{"name":"SYSTEM","text":"The Elpis staples you require can be gathered near Anagnorisis."},{"name":"SYSTEM","text":"The Studium Deliveries list for Hinageshi has been updated. To view the new list, speak with Hinageshi."},{"name":"TANKIN","text":"I find it immensely more constructive to prove, rather than disprove, the existence of past civilizations. And with your help, I believe we can do just that."},{"name":"HINAGESHI","text":"You know, a part of me thinks it odd that we now strive to emulate an ancient civilization. Would that not, after all, mean we are taking a step back? Though, if this Elpis is as advanced as you say, perhaps it will prove to be a step forward."},{"name":"HINAGESHI","text":"Goodness me, you really did it! If I may ask, how exactly did you come by this...? Perhaps I'm better off not knowing."},{"name":"HINAGESHI","text":"Goodness me, this material is unlike anything I've ever seen. Honestly, I find it hard to believe it is as old as you say... All the better for our work, I suppose."},{"name":"HINAGESHI","text":"These minerals are possessed of immensely high concentrations of aether. Whatever could they have used this for?"},{"name":"HINAGESHI","text":"I was not expecting the materials to be quite so...large. However did they manage to use them for crafting, I wonder?"},{"name":"SYSTEM","text":"Professor Tankin and Hinageshi take the items you brought them and set to work emulating Elpis culture."},{"name":"TANKIN","text":"<span class=\"highlight-purple\">Welcome, friend, to our humble abode...</span>"},{"name":"HINAGESHI","text":"I beg your pardon, Professor?"},{"name":"TANKIN","text":"Oh, my apologies, Hinageshi. I was simply imagining what the people of Elpis might have sounded like."},{"name":"TANKIN","text":"Ahem. We did our best to recreate their culture based on what you have told us. Frankly, it felt like I had wandered into a faerie tale at times, but I do find their way of life has its merits. They do not waste time on the frivolous. Everything has a clear, functional purpose."},{"name":"HINAGESHI","text":"Perhaps, but I find their clothes make it rather difficult to go about one's duties..."},{"name":"TANKIN","text":"It is entirely possible they did not need to engage in physical labor. Their proficiency in creation magicks may have led to the decline of their physical frames. Wielding writing quills and such was no doubt a simple matter, but it is unlikely they could bear anything weighty."},{"name":"HINAGESHI","text":"What role do you suppose these masks played, exactly? Mayhap, they were averse to showing their faces?"},{"name":"TANKIN","text":"I would posit that they distinguished each other not by their outward appearances, but by their aether. Or, perhaps, they all led such fulfilling lives that they simply had no need to express themselves as individuals."},{"name":"TANKIN","text":"To think that such a sophisticated civilization vanished in but the blink of an eye. I wonder if all cultures are ultimately destined to meet the same fate."},{"name":"HINAGESHI","text":"We will discover that answer in due time, I'm sure. Though part of me wishes we could live like this forever."},{"name":"TANKIN","text":"Haha, an interesting idea, Hinageshi, but I am not so sure it is a wise one. Still, it is gladdening to see you enjoy the cultures of the old world so."},{"name":"HINAGESHI","text":"Oh, no. That's not what I meant. Not exactly..."},{"name":"HINAGESHI","text":"I was merely thinking how nice it would be if every day could be like this, experiencing new ways of living together."},{"name":"HINAGESHI","text":"Studying the length and breadth of a people's history as a whole, we could see naught but trends and tendencies. Like this, however, taking a glimpse of their lives, day by day, the parallels between our cultures become quite clear."},{"name":"HINAGESHI","text":"Even these ancients of Elpis no doubt enjoyed the simple pleasures of life as we do, taking each day as they came."},{"name":"HINAGESHI","text":"It would be oh-so lovely if we could do the same. Enjoying the simple pleasures of life. One day at a time."},{"name":"TANKIN","text":"Why, Hinageshi..."},{"name":"TANKIN","text":"You are exactly right! I sometimes feel I learn more from you than I do my own research."},{"name":"HINAGESHI","text":"You flatter me, Professor, but I've said nothing worthy of such praise."},{"name":"SYSTEM","text":"Hinageshi is thrilled with your efforts. She now considers you a <span class=\"highlight\">Veteran Matchmaker</span>!"},{"name":"SYSTEM","text":"A new quest continuing the story of the Faculty of Anthropology is now available. Speak with Hinageshi as either a miner or botanist at level 90 or above to undertake the quest."},{"name":"SYSTEM","text":"In order to undertake the subsequent quest, you must first complete the main scenario quest “Endwalker.”"}],"reward":{"items":[{"num":2,"id":36061}]},"reqs":{"jobs":[{"lvl":88,"id":154}],"quests":[69693]},"next":[69695]},"partials":[{"type":"npc","id":"1038501","obj":{"i":1038501,"n":"Hinageshi","l":3706,"q":7}},{"type":"item","id":"36061","obj":{"i":36061,"n":"Sideritis Cookie","l":554,"c":24051,"t":46}},{"type":"quest","id":"69693","obj":{"i":69693,"n":"Hinageshi in Hingashi","g":176,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69695","obj":{"i":69695,"n":"The Culture of Love","g":176,"l":"Old Sharlayan","s":0}}]}