{"quest":{"name":"The Culture of Love","location":"Old Sharlayan","id":69695,"patch":6.0,"sort":0,"icon":101139,"eventIcon":71221,"issuer":1038501,"target":1038501,"genre":176,"usedItems":[35848],"journal":["Hinageshi is loving life.","Much to your and Hinageshi's surprise, Tankin announces their research will be coming to an end. It seemed as though he had more in store, but he is taken aback when Hinageshi makes an announcement of her own─she will be returning home to meet with her parents and an unknown suitor. A most unfortunate turn of events as Tankin explains to you he has feelings for his erstwhile assistant. He is not ready to give up on Hinageshi, however, and tells you of his plan to fashion an eternity ring for her. To see his plan through, he asks you to gather materials for its crafting from Labyrinthos, where he and Hinageshi first worked together.","With the necessary materials assembled, Tankin takes his leave to fashion an eternity ring. But not before he gives you a letter to deliver to Hinageshi.","Hinageshi reads the letter, and is confused to learn that Tankin wishes for her to return, but she agrees to do as he asks nonetheless.","Professor Tankin at last musters the courage to propose to Hinageshi, albeit in a roundabout fashion. He worries she will instead choose her mysterious suitor, but his fears of rejection are soon allayed when she explains this “suitor” is, in fact, a financial supporter of her parents' botanist research. He is relieved, but he has yet to make a clear and straightforward proposal. And so again he asks her plain and true for her hand. No sooner do the words escape his lips than she takes the eternity ring from his hands with emphatic joy.","Hinageshi thanks you once more not only for aiding in their research, but for bringing her and Tankin together. You take your leave of the professor and his assistant, glad for the joy you have brought to their lives."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine Eternity Ring Material in lower Acrinthos.</span><span class=\"alternative\">Deliver Eternity Ring Material gathered from lower Acrinthos to Tankin.</span><span class=\"alternative\">Gather Eternity Ring Material at Meryall Agronomics.</span><span class=\"alternative\">Deliver Eternity Ring Material gathered from Meryall Agronomics to Tankin.</span><span class=\"alternative\">As a botanist or miner, deliver Eternity Ring Material to Tankin.</span></span>","Deliver Tankin's letter to Hinageshi.","Speak with Tankin.","Speak with Hinageshi."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Endwalker.”"},{"name":"HINAGESHI","text":"We have already amassed so much data for the professor's research, I cannot imagine where we will turn our attention to next."},{"name":"TANKIN","text":"Good, you're here. There is something I wished to discuss with you both."},{"name":"TANKIN","text":"I will be informing the Studium that my research has concluded."},{"name":"HINAGESHI","text":"What!? But why?"},{"name":"TANKIN","text":"My apologies for keeping this from you, but my research had an ulterior motive. It was, in fact, part of a contingency plan devised by the Forum. That plan being mass exodus to another star."},{"name":"TANKIN","text":"The true goal was to determine what cultures were worthy of preservation, and how said preservation might be accomplished."},{"name":"HINAGESHI","text":"I...I don't understand. Are you saying the Forum had resigned itself to abandoning this world!?"},{"name":"TANKIN","text":"I'm afraid so. Yet the fact remains that culture can only survive and thrive through the people who share in it. Any knowledge we might feasibly preserve now is no different from the myriad tomes collecting dust in the halls of the Studium."},{"name":"TANKIN","text":"Which is why, apart from research being conducted in Labyrinthos, we were tasked with finding suitable cultural elements we might actively preserve for those in the future."},{"name":"TANKIN","text":"And it was during our most recent endeavor that I found my answer to this great conundrum. Hence, there is no need for further research. I need simply summarize our findings in my thesis."},{"name":"TANKIN","text":"My sincere thanks to you both for all your hard work."},{"name":"HINAGESHI","text":"Truly, the pleasure was all mine. A pity our work must come to an end..."},{"name":"TANKIN","text":"Yes, well... Ahem. Did you have any plans for after our research was finished?"},{"name":"HINAGESHI","text":"I cannot say that I do. Our work together has been so engaging I could scarcely think of aught else. In fact, it has been quite some time since I've paid visit to my parents."},{"name":"HINAGESHI","text":"Which reminds me, they said they found a new suitor when last we spoke. Something to look forward to on the voyage home, I suppose."},{"name":"TANKIN","text":"A s-suitor!?"},{"name":"TANKIN","text":"Gods, am I too late? If only she had stayed a short while longer... What do I do now?"},{"name":"TANKIN","text":"I was hoping she would accompany me on my next venture─research of a, uh...a ceremony of sorts... I say research, but it's more of a...um..."},{"name":"TANKIN","text":"Oh, Tankin. Such roundabout thinking is how you got yourself into this mess."},{"name":"TANKIN","text":"My recent endeavors together with Hinageshi have made me realize just how much she means to me."},{"name":"TANKIN","text":"I realize the foolishness of harboring these unrequited feelings, but I can contain them no longer."},{"name":"TANKIN","text":"Which is precisely why I intended to propose!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It's about time!"},{"name":"A1","text":"There's nothing foolish about love, Tankin."},{"name":"TANKIN","text":"I appreciate your enthusiasm, though I don't understand why you're so moved by my proclamation."},{"name":"TANKIN","text":"Thank you, my friend. I certainly hope you're right."},{"name":"TANKIN","text":"But before I propose, it would be prudent to learn how she feels about the matter, and for that, I require your help."},{"name":"TANKIN","text":"Though I understand if you would rather not involve yourself in such a personal matter..."},{"name":"TANKIN","text":"You will help me? Truly? Then perhaps hope is not yet lost. You see, my plan was to fashion an eternity ring."},{"name":"TANKIN","text":"I wished for it to be something memorable, which is why I would ask you to procure materials for the ring from the place where Hinageshi and I first worked together─Labyrinthos."},{"name":"TANKIN","text":"I shall see to the rest...and have hopefully steeled my nerves in the interim."},{"name":"SYSTEM","text":"The eternity ring material you require can be found in lower Acrinthos."},{"name":"SYSTEM","text":"The eternity ring material you require can be found near Meryall Agronomics."},{"name":"HINAGESHI","text":"The view from here is beautiful, isn't it? Boundless and beautiful, with untold discoveries looming on the horizon."},{"name":"TANKIN","text":"Have you found something suitable? I do not mean to rush you, but I fear time is not on our side."},{"name":"TANKIN","text":"Thank you! Now to set about fashioning the ring."},{"name":"TANKIN","text":"Before you go, may I ask one last favor of you? Please deliver this letter to Hinageshi."},{"name":"TANKIN","text":"Language has evolved to convey our emotions so accurately and with such colorful prose, yet we still rely upon tokens for the truly momentous occasions. A curious quirk of our culture, you might say."},{"name":"HINAGESHI","text":"I can still hardly believe our work with Professor Tankin is over..."},{"name":"HINAGESHI","text":"It was foolish of me to grow so attached, I know, but I've never been so happy as when I'm with him."},{"name":"HINAGESHI","text":"A part of me wishes he felt the same, that we might have grown closer in the short time we had together..."},{"name":"HINAGESHI","text":"Alas, life rarely lives up to expectations, but thank you again for all your help. I had better be going now."},{"name":"HINAGESHI","text":"A letter? From the professor?"},{"name":"HINAGESHI","text":"It says he wishes to discuss his future works with the Studium, and that I am to return immediately."},{"name":"HINAGESHI","text":"But he should be readying his thesis. Whatever could be so urgent? Only one way to find out, I suppose."},{"name":"HINAGESHI","text":"Whatever it is he has to say, it must be urgent. This is the first time the professor has ever written me a letter."},{"name":"TANKIN","text":"You delivered the letter? Good."},{"name":"TANKIN","text":"Now I but need wait for her arrival."},{"name":"HINAGESHI","text":"Sorry to keep you waiting, Professor!"},{"name":"TANKIN","text":"Thank you for returning on such short notice. You see, there is something I must tell you..."},{"name":"TANKIN","text":"To be brief, I... Er... How should I say this?"},{"name":"HINAGESHI","text":"You noted in your missive that you wished to discuss future matters with me. Have you, perchance, decided on another subject of study?"},{"name":"TANKIN","text":"No, not exactly. You see, Hinageshi, I...I would like to officially list you as the lead author of my current thesis."},{"name":"TANKIN","text":"Naturally, this will require you to contribute extensively to its composition as well. A fine opportunity for you to put forth writings of your own as well."},{"name":"HINAGESHI","text":"You would trust me with the position of lead author? I would be honored, of course, but it was you who did most of the work. I could not possibly steal the plaudits you so rightfully earned."},{"name":"TANKIN","text":"Nonsense. I have learned so much from you over the course of our research. It would be nigh fraudulent of me to take all the credit."},{"name":"HINAGESHI","text":"Is that so? I had no idea..."},{"name":"HINAGESHI","text":"Well, I'm afraid I must disappoint you, Professor Tankin, for I cannot stay."},{"name":"HINAGESHI","text":"My parents have completed arrangements for me to meet with this new suitor they've found, and so I must return home at once."},{"name":"TANKIN","text":"You shall do nothing of the sort!"},{"name":"HINAGESHI","text":"Professor, please. There is still plenty of time until the thesis must be submitted, correct? Surely it can stand to wait until I've met with─"},{"name":"TANKIN","text":"The thesis is not what concerns me, Hinageshi. It's...erm..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Speak from the heart."},{"name":"A2","text":"Ahem. Didn't you prepare a gift for her?"},{"name":"TANKIN","text":"Y-Yes, of course. If not for you, I fear my nerves would have gotten the better of me. Thank you."},{"name":"TANKIN","text":"Our work together has taught me a most valuable lesson. It is not an environment that makes a home, but rather the people one shares it with. And in time, those people may form the deepest of bonds... "},{"name":"TANKIN","text":"Hinageshi, the time we've spent together has been the happiest of my life, and I do not wish for it to end."},{"name":"TANKIN","text":"Say that you will stay with me, that we may enjoy the simple pleasures of life together. One day at a time."},{"name":"HINAGESHI","text":"Professor Tankin, I...I don't know what to say."},{"name":"TANKIN","text":"You are well within your rights to refuse if that is your wont. Should you choose instead to be bonded with this suitor of yours, I will not stop you."},{"name":"HINAGESHI","text":"Bonded? Whatever are you talking about?"},{"name":"TANKIN","text":"Did you not say your parents found you a suitor?"},{"name":"HINAGESHI","text":"No, no, no, you have it all wrong, Professor! The suitor is not for me. It's a business partner─for my parents!"},{"name":"TANKIN","text":"Your parents!?"},{"name":"HINAGESHI","text":"You did know that my parents are both botanists, yes? They were recently introduced to a potential financial supporter who also wished to know more of my research interests."},{"name":"HINAGESHI","text":"I thought it an opportunity to secure funding for our next venture, and so I agreed to meet with him."},{"name":"TANKIN","text":"Our...next venture...?"},{"name":"HINAGESHI","text":"Of course! You won't be getting rid of me so easily, Professor! There is still so much for us to see, so much to do!"},{"name":"TANKIN","text":"Then, does this mean you have accepted my proposal?"},{"name":"HINAGESHI","text":"Proposal...? I'm not sure I follow. And may I ask why you have that ring?"},{"name":"TANKIN","text":"Well, you see, this ring is used in the Ceremony of Eternal Bonding, and... I was hoping you might join me in a recreation of the ceremony."},{"name":"HINAGESHI","text":"A recreation? Absolutely not."},{"name":"TANKIN","text":"Then let this be the first of many real experiences together. Hinageshi, will you join me in the Ceremony of Eternal Bonding?"},{"name":"HINAGESHI","text":"I thought you would never ask."},{"name":"TANKIN","text":"I know not what the future holds, but so long as we are together, I know our days will be filled with joy and happiness."},{"name":"HINAGESHI","text":"A lifetime of new experiences, and endless possibilities."},{"name":"TANKIN","text":"I cannot thank you enough for all you have done for us and our research. Perhaps someday scholars in the future will find elements of our lives worthy of preservation."},{"name":"HINAGESHI","text":"This was all so sudden... If you told me this was a dream, I might be inclined to believe you. Nevertheless, it gladdens me to know we will continue living together as we are."},{"name":"HINAGESHI","text":"Though a small change of pace now and again would not be a terrible idea. Perhaps we'll take a trip once our thesis is dealt with. Ah, speaking of trips, we will have to pay a visit to my parents first and foremost."},{"name":"TANKIN","text":"A splendid idea."},{"name":"HINAGESHI","text":"I had a feeling you'd think so."},{"name":"HINAGESHI","text":"But before all of that, I wish to thank you. For helping to complete our great work, and more importantly, for bringing the two of us together. I believe I speak for us both when I say you have our eternal gratitude."},{"name":"SYSTEM","text":"Hinageshi could not be happier with your efforts. She now considers you a <span class=\"highlight\">Master Matchmaker</span>!"},{"name":"SYSTEM","text":"Keep an eye out for others at the Studium who require the help of an able artisan. You never know who might be in need of your skills."},{"name":"SYSTEM","text":"You have completed all of the Studium quests. It seems Qih Aliapoh has something she would like to ask of you."},{"name":"SYSTEM","text":"Pay a visit to Searchers' Meet should you wish to hear her out."}],"reward":{"gil":1087,"items":[{"id":33935,"one":1},{"id":33936,"one":1},{"id":33937,"one":1}]},"reqs":{"jobs":[{"lvl":90,"id":154}],"quests":[69694]}},"partials":[{"type":"npc","id":"1038501","obj":{"i":1038501,"n":"Hinageshi","l":3706,"q":7}},{"type":"item","id":"33935","obj":{"i":33935,"n":"Gatherer's Guerdon Materia X","l":560,"c":20288,"t":58,"materia":{"tier":9,"value":25,"attr":"Gathering","category":2}}},{"type":"item","id":"33936","obj":{"i":33936,"n":"Gatherer's Guile Materia X","l":560,"c":20288,"t":58,"materia":{"tier":9,"value":25,"attr":"Perception","category":2}}},{"type":"item","id":"33937","obj":{"i":33937,"n":"Gatherer's Grasp Materia X","l":560,"c":20288,"t":58,"materia":{"tier":9,"value":10,"attr":"GP","category":2}}},{"type":"item","id":"35848","obj":{"i":35848,"n":"Eternity Ring Material","l":536,"c":22630,"t":63}},{"type":"quest","id":"69694","obj":{"i":69694,"n":"The Culture of the Past","g":176,"l":"Old Sharlayan","s":0}}]}