{"quest":{"name":"Hinageshi in Hingashi","location":"Old Sharlayan","id":69693,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1038501,"target":1038501,"genre":176,"usedItems":[35847],"journal":["Hinageshi is having a splendid time.","Wait at the designated location on Pier #2.","Speak with Tankin.","Ask the locals about Hinageshi's whereabouts.","Survey the designated location.","Deliver the piece of hairpin material to Tankin.","Speak with Tankin.","Speak with Hinageshi in Searchers' Meet."],"objectives":["Wait at the designated location on Pier #2.","Speak with Tankin.","Ask the locals about Hinageshi's whereabouts.","Search for Hinageshi at the designated location.","<span class=\"alternative-container\"><span class=\"alternative\">Mine Hairpin Material at Hells' Lid.</span><span class=\"alternative\">Deliver Hairpin Material gathered from Hells' Lid to Tankin.</span><span class=\"alternative\">Gather Hairpin Material at Onokoro.</span><span class=\"alternative\">Deliver Hairpin Material gathered from Onokoro to Tankin.</span><span class=\"alternative\">As a botanist or miner, deliver Hairpin Material to Tankin.</span></span>","Speak with Tankin.","Speak with Hinageshi."],"dialogue":[{"name":"HINAGESHI","text":"I do wonder what culture we shall be examining next. Knowing even the moon is inhabitable, the possibilities seem endless."},{"name":"TANKIN","text":"I bear good tidings─permission has been granted for our voyage."},{"name":"TANKIN","text":"I decided it was about time we went and experienced other cultures firsthand rather than recreate them here in our workshop."},{"name":"HINAGESHI","text":"A fabulous idea, indeed! Wherever are we going, Professor?"},{"name":"TANKIN","text":"Hingashi. Kugane, to be specific."},{"name":"HINAGESHI","text":"Oh, how wonderful!"},{"name":"TANKIN","text":"Though our journey has been approved, we cannot afford to tarry. We have been granted but a short amount of time to stay there, you see."},{"name":"TANKIN","text":"Are you, perchance, knowledgeable of the Far East?"},{"name":"TANKIN","text":"In that case, could we ask you to act as our guide?"},{"name":"TANKIN","text":"You have my thanks."},{"name":"TANKIN","text":"We should arrive at Pier #2 when we reach Kugane. Pray meet us there when you are ready."},{"name":"TANKIN","text":"Would that we could travel via aetherytes. Mayhap then we would have more time for research. Alas..."},{"name":"HINAGESHI","text":"I can scarcely believe it. Our first holid─I mean, our first research trip together!"},{"name":"SYSTEM","text":"Some time later..."},{"name":"TANKIN","text":"We braved the experimental aetheryte, and came via Radz–at–Han. Much to our delight and surprise both, they were renting local attire, and I was not about to pass up the opportunity to dress in authentic Hingan garb."},{"name":"HINAGESHI","text":"I still cannot quite believe I am here in this foreign land with the professor!"},{"name":"TANKIN","text":"Now, where is Kugane Castle...?"},{"name":"TANKIN","text":"Wherever it is, it does not seem to be visible from here. Would you happen to know a better place to take in its splendor?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"The roof of the Shiokaze Hostelry should do nicely."},{"name":"A1","text":"How about the Tasogare Bridge?"},{"name":"TANKIN","text":"Wait just a moment. Are mere tourists such as ourselves allowed on the roof of said establishment? I enjoy fine views as much as anyone, but I would rather avoid becoming a criminal..."},{"name":"TANKIN","text":"Perhaps Tasogare Bridge would be the better option. If I am not mistaken, it should be close by. Shall we have a look from there?"},{"name":"TANKIN","text":"Tasogare. I rather like the sound of that. Very well, show us the way."},{"name":"TANKIN","text":"A fortress most formidable. This may be an island like Sharlayan, but it is quite clear our cultures are as night and day."},{"name":"TANKIN","text":"However, one must keep in mind that Kugane is unlikely to be a true representation of life in Hingashi."},{"name":"TANKIN","text":"After all, this port town is but a tiny part of a larger region, and sadly the only section of it open to the wider world."},{"name":"TANKIN","text":"If we are to get a truly accurate picture, we must speak with the locals."},{"name":"TANKIN","text":"Speaking of which, this place is surprisingly peaceful considering recent events."},{"name":"TANKIN","text":"The ruling class doubtless controls what information is allowed into the area. Which begs the question: how much is known by those here regarding affairs in the rest of the world? Perhaps they are convinced they are strong enough to weather any storm alone..."},{"name":"TANKIN","text":"At any rate, our work here is certain to prove a most enlightening experience. Already am I glad for this trip."},{"name":"HINAGESHI","text":"Ahem, Professor. If possible, I would very much like to visit the Umineko Teahouse and sample their dango. I have heard very good things!"},{"name":"TANKIN","text":"Hinageshi... Do not forget why we are here. We are researchers, not tourists. You would do well to remember that."},{"name":"HINAGESHI","text":"My apologies, Professor..."},{"name":"TANKIN","text":"Forgive me, I did not mean to upset you. I fear the long journey has left me on edge. Kugane does indeed thrive on tourism, and you are not wrong to deem that aspect of their culture worthy of investigation."},{"name":"HINAGESHI","text":"You are too kind, Professor."},{"name":"TANKIN","text":"Now, let us pay a visit to Pier #1 and take in the storehouses, then make our way to Kokajiya."},{"name":"TANKIN","text":"Ah, such heat. Greater, perhaps, even than the Garlean heaters. It is an honor to witness the forging of Kugane's world-famous katana blades."},{"name":"TANKIN","text":"Ah, but we mustn't forget why we are come here. I suppose now it is Hinageshi's turn to rebuke me."},{"name":"TANKIN","text":"...Hinageshi? Where could she have gone?"},{"name":"TANKIN","text":"I was so entranced by the sights and sounds of the city, I cannot rightly say when last I saw her."},{"name":"TANKIN","text":"Let us split up and search for her. If you would check the Ijin District, I will search on Kogane Dori."},{"name":"SEKISEIGUMIBLADE","text":"A woman lost on the streets, you say?"},{"name":"SEKISEIGUMIBLADE","text":"A tourist would have no cause to come this way. You would be better served searching near the gates of Kugane Castle. Much of the city can be seen from there."},{"name":"SEKISEIGUMIBLADE","text":"Now, if you will excuse me."},{"name":"TANKIN","text":"Hinageshi! &lt;pant&gt; &lt;pant&gt; We've found you at last!"},{"name":"HINAGESHI","text":"Professor! Oh, thank goodness."},{"name":"HINAGESHI","text":"I thought if I waited here long enough, you would come eventually."},{"name":"TANKIN","text":"Yes, we did plan on visiting the castle, didn't we? I should have expected you would memorize our itinerary."},{"name":"TANKIN","text":"But what happened? I could have sworn you were right behind me."},{"name":"HINAGESHI","text":"Well, I was approached by a merchant on Kogane Dori whilst we were making for Pier #1. I stopped to say I was not interested, and when I turned around you were nowhere to be seen..."},{"name":"HINAGESHI","text":"I should not have been so careless. You did warn me not to behave as a tourist, after all..."},{"name":"TANKIN","text":"No, I should have been more attentive. When engrossed in my work, my surroundings all but fade away."},{"name":"TANKIN","text":"The thought of you lost, wandering aimlessly through the streets of Kugane... My heart was fit to burst."},{"name":"TANKIN","text":"But to see you here, safe and sound... Words fail to express my relief. I can only imagine the distress I've caused you."},{"name":"HINAGESHI","text":"Oh, Professor. I..."},{"name":"TANKIN","text":"What can I do to comfort her?"},{"name":"TANKIN","text":"That's it!"},{"name":"TANKIN","text":"Terribly sorry to ask this of you, but I wish to fashion a hairpin for Hinageshi to lift her spirits. Might I trouble you to procure the necessary material?"},{"name":"TANKIN","text":"The Ruby Sea is said to be a treasure trove of resources. Perhaps you can find something there along the shore or beneath the waves."},{"name":"TANKIN","text":"Thank you. I would be a fool to leave her alone, so I will wait with her here until you return."},{"name":"SYSTEM","text":"The hairpin material you require can be found at Hells' Lid."},{"name":"SYSTEM","text":"The hairpin material you require can be found on Onokoro."},{"name":"HINAGESHI","text":"I am terribly sorry for all this. Our stay was meant to be a short one, and yet I have wasted so much of your time..."},{"name":"TANKIN","text":"They say the Ruby Sea is a treasure trove of natural resources. I am certain you can find what I need there."},{"name":"TANKIN","text":"Absolutely stunning!"},{"name":"TANKIN","text":"I shall waste no time in taking this to a craftsman. Pray keep Hinageshi company here while I am gone."},{"name":"HINAGESHI","text":"Where do you suppose the professor has run off to? &lt;sigh&gt; I suppose it doesn't matter. I would only prove a hindrance were I to accompany him further."},{"name":"TANKIN","text":"My apologies for disappearing like that. I went on a little errand to have this made for you, Hinageshi."},{"name":"HINAGESHI","text":"Wait. The flower on this hairpin is..."},{"name":"TANKIN","text":"Nothing gets past you! Indeed, it is the flower the locals here know as a “hinageshi.” I thought it would be a shame were we to return home from our travels empty-handed."},{"name":"TANKIN","text":"I...hope it is to your liking."},{"name":"HINAGESHI","text":"It's perfect..."},{"name":"HINAGESHI","text":"Thank you, Professor! I shall treasure it for all my days!"},{"name":"TANKIN","text":"Strange... These excursions to other lands are always a rather stressful ordeal. With Hinageshi here, though, things are...different."},{"name":"TANKIN","text":"Ahem. But this is no time for self-reflection! We must needs survey the rest of the town posthaste. Let us make for the Rakuza District, followed by the Bokairo Inn."},{"name":"TANKIN","text":"Ah, but wait. Before all that, we must pay a visit to the Umineko Teahouse to sample their finest dango and tea."},{"name":"HINAGESHI","text":"Thank you, Professor. I can hardly wait!"},{"name":"HINAGESHI","text":"I just had the most wonderful time chatting with the patrons of the hot springs."},{"name":"TANKIN","text":"The springs were exquisite, though it was the view that took my breath away."},{"name":"TANKIN","text":"I yet struggle to believe that on the other side of this ocean lies Doma, and the Azim Steppe, my ancestral home."},{"name":"TANKIN","text":"How I would love to travel there just once, to see how the nomads live firsthand."},{"name":"HINAGESHI","text":"You will, Professor. Someday. And I shall be by your side when we do!"},{"name":"TANKIN","text":"I should like that very much."},{"name":"TANKIN","text":"...Alas, the time has come for us to return to Sharlayan."},{"name":"TANKIN","text":"Pray stop by Searchers' Meet once you've returned. I would see you compensated for your work here."},{"name":"TANKIN","text":"A most fruitful trip indeed. However, I am yet mystified by the feelings of warmth and comfort I found there in Kugane. If I could somehow get to the bottom of that, I am certain it would benefit our research greatly."},{"name":"HINAGESHI","text":"Ah, it is good to be home. Traveling is lovely, of course, but best enjoyed in moderation like all good things."},{"name":"HINAGESHI","text":"I should hope you have some place to call home as well?"},{"name":"HINAGESHI","text":"Then I would bid you return there, and take a well-deserved rest. I will be in touch again once we are ready to resume our work."},{"name":"SYSTEM","text":"The next request will be available from Hinageshi upon reaching level 88 as a miner or botanist."},{"name":"SYSTEM","text":"In order to undertake the subsequent quest, you must first complete the main scenario quest “Hunger in the Garden.”"}],"reward":{"items":[{"num":2,"id":36054}]},"reqs":{"jobs":[{"lvl":85,"id":154}],"quests":[69692]},"next":[69694]},"partials":[{"type":"npc","id":"1038501","obj":{"i":1038501,"n":"Hinageshi","l":3706,"q":7}},{"type":"item","id":"36054","obj":{"i":36054,"n":"Yakow Moussaka","l":540,"c":24112,"t":46}},{"type":"item","id":"35847","obj":{"i":35847,"n":"Hairpin Material","l":536,"c":22641,"t":63}},{"type":"quest","id":"69692","obj":{"i":69692,"n":"The Culture of Carrots","g":176,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69694","obj":{"i":69694,"n":"The Culture of the Past","g":176,"l":"Old Sharlayan","s":0}}]}