{"quest":{"name":"The Culture of Ceruleum","location":"Old Sharlayan","id":69691,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1038501,"target":1038501,"genre":176,"journal":["Hinageshi is on a hot streak.","Hinageshi has asked that you supply her with Garlean staples.<br><br>※Garlean staples can be gathered from Monitoring Station G by miners, and from Camp Broken Glass by botanists.<br><br>※Minimum collectability rating for this delivery is 240. Delivering items with a rating of 600 or more will earn greater rewards.","You deliver the Garlean staples to Hinageshi. Despite a momentary lapse into daydreaming, she realizes there is yet work to be done, both on her research and her relationship."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Deliver  gathered from Monitoring Station G to Hinageshi.</span><span class=\"alternative\">Deliver  gathered from Camp Broken Glass to Hinageshi.</span><span class=\"alternative\">As a botanist or miner, deliver  to Hinageshi.</span></span>"],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must complete the main scenario quest “A Frosty Reception.”"},{"name":"HINAGESHI","text":"You've come at a good time. I do believe the professor has another assignment for you."},{"name":"TANKIN","text":"Good to see you, my friend. We were in the midst of summarizing what we've learned living an approximation of the Hannish lifestyle. While we commit our thoughts to parchment, I would ask you to acquire a few things we need for our next sampling of culture."},{"name":"HINAGESHI","text":"And where did you have in mind, exactly?"},{"name":"TANKIN","text":"Garlemald."},{"name":"HINAGESHI","text":"The Empire!? Oh my. I certainly wasn't expecting that. Do you truly believe there is aught we can learn from them to improve our way of living?"},{"name":"TANKIN","text":"I understand your trepidation, Hinageshi. While their history is filled with countless invasions and much suffering, there may yet come a day where we live in peace alongside the people of Garlemald."},{"name":"TANKIN","text":"Though I realize how unlikely that may seem at present."},{"name":"TANKIN","text":"But the winds of change blow fiercely now, and there may soon come a day when they seek shelter here in Sharlayan. Knowing they cannot manipulate aether as we do, I wish to better understand their culture should we need to play the hospitable host."},{"name":"HINAGESHI","text":"Now I feel like a fool for thinking you were only pursuing this project to improve the lives of those who presently call Sharlayan home. Such genius!"},{"name":"TANKIN","text":"To that end, I would ask you procure a most essential staple of Garlean living."},{"name":"TANKIN","text":"I speak of an ore unique to the region and a certain fruit there that has adapted to grow even in the coldest of climates. Oh, and do not fret─you do not need to bring back both. One or the other will suffice."},{"name":"SYSTEM","text":"The Garlean staples you require can be gathered around Monitoring Station G."},{"name":"SYSTEM","text":"The Garlean staples you require can be gathered around Camp Broken Glass."},{"name":"SYSTEM","text":"The Studium Deliveries list for Hinageshi has been updated. To view the new list, speak with Hinageshi."},{"name":"TANKIN","text":"Word has it the Garlean Empire may not be long for this world, which is precisely why I see value in preserving their culture. Pray keep your wits about you when you're there—the region is anything but safe."},{"name":"HINAGESHI","text":"We have been relying on the tomes in Noumenon and existing theses in order to accurately emulate foreign cultures, and I have realized that there are a great many things you would never discover without experiencing them firsthand."},{"name":"HINAGESHI","text":"Thank you so much! To even picture you searching out there in those cold climes sends a shiver down my spine. Truly, we are in your debt."},{"name":"HINAGESHI","text":"Goodness, I did not expect you to bring back specimens of such quality. This will make our work much easier."},{"name":"HINAGESHI","text":"They use this ore to create alloys like adamantite, you know. Magitek couldn't exist without it."},{"name":"HINAGESHI","text":"This fruit is fantastic at growing in even the coldest conditions. Oh, I can't wait to experience Garlean cuisine for myself and see firsthand how it's been shaped by their climate."},{"name":"SYSTEM","text":"Professor Tankin and Hinageshi take the items you brought them and set to work emulating Garlean culture."},{"name":"HINAGESHI","text":"I must say I'm warming up to these cozy clothes and magitek heaters. All of this would definitely improve life in Sharlayan!"},{"name":"TANKIN","text":"Alas, we've only been granted permission to use the heaters for the duration of our research. We'll have to return them to the Studium after we're done."},{"name":"HINAGESHI","text":"...That said, I think I just felt a bead of sweat trickle down my neck. Perhaps I won't miss them as much as I thought. "},{"name":"TANKIN","text":"Then I take it you have no need of this piping hot Garlean cuisine, cooked with magitek kitchen utensils?"},{"name":"HINAGESHI","text":"Oh, Professor. No, I would gladly sample any food prepared with skillful hands such as yours!"},{"name":"TANKIN","text":"Provided one is given the necessary instruction, even a child could operate these magitek devices."},{"name":"TANKIN","text":"And at the heart of all magitek lies ceruleum. A most efficient and convenient energy source, indifferent to the whims of nature like wind and hydraulic power."},{"name":"TANKIN","text":"Its mass production allowed the Empire to bring magitek to the people at large, with further refinements to their manufacturing process affording them surplus time and manpower, which they applied to even greater innovations."},{"name":"TANKIN","text":"That said, the importance of alternatives to ceruleum cannot be ignored. It is, after all, a finite resource."},{"name":"TANKIN","text":"Should we completely squander the world's resources, we will inevitably suffer for our lack of foresight."},{"name":"HINAGESHI","text":"Professor, this looks exquisite! I thought as much when we were studying Hannish culture, but you really are a fantastic cook."},{"name":"TANKIN","text":"You flatter me, Hinageshi. I would be nothing without the recipes that guide me. Although, it does warm my heart to see you enjoy my cooking so."},{"name":"TANKIN","text":"There are many, many dishes I still wish to try my hand at, and I would be delighted if you were willing to sample them as well."},{"name":"HINAGESHI","text":"Oh, it would be my pleasure!"},{"name":"HINAGESHI","text":"Is it my imagination or has the professor been more affectionate towards me of late?"},{"name":"HINAGESHI","text":"It really makes me wonder what will become of our relationship when his research reaches its conclusion... Oh, but I must stop daydreaming. There is yet work to be done!"},{"name":"SYSTEM","text":"Hinageshi is delighted with your efforts. She now considers you a <span class=\"highlight\">Novice Matchmaker</span>!"},{"name":"SYSTEM","text":"The next request will be available from Hinageshi upon reaching level 85 as a miner or botanist."},{"name":"SYSTEM","text":"In order to undertake the subsequent quest, you must first complete the main scenario quest “Helping Hands.”"}],"reward":{"items":[{"num":30,"id":12669}]},"reqs":{"jobs":[{"lvl":83,"id":154}],"quests":[69690]},"next":[69692]},"partials":[{"type":"npc","id":"1038501","obj":{"i":1038501,"n":"Hinageshi","l":3706,"q":7}},{"type":"item","id":"12669","obj":{"i":12669,"n":"Hi-Cordial","l":100,"c":20623,"t":44}},{"type":"quest","id":"69690","obj":{"i":69690,"n":"Cooking Up a Culture","g":176,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69692","obj":{"i":69692,"n":"The Culture of Carrots","g":176,"l":"Old Sharlayan","s":0}}]}