{"quest":{"name":"History Lesson","location":"Old Sharlayan","id":69699,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1038551,"target":1038551,"genre":177,"journal":["T'laqa Tia has an unquenchable thirst for data.","T'laqa Tia has asked that you supply him with Garlean clams for data collection purposes.<br><br>※Garlean clams can be fished near Camp Broken Glass using leeches as bait.<br><br>※Minimum collectability rating for this delivery is 78. Delivering items with a rating of 184 or more will earn greater rewards.","You deliver the Garlean clams to T'laqa Tia. The associate professor would likely appreciate your further assistance when the time comes to complete his thesis."],"objectives":["Catch Garlean clams near Camp Broken Glass and deliver them to T'laqa Tia."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “The Martyr.”"},{"name":"TLAQATIA","text":"Ah, hello again! I truly can't thank you enough. The samples you've provided me with have allowed me to make incredible progress in my work. As it happens, I actually just decided on the next specimen I'd like to ask you to procure."},{"name":"TLAQATIA","text":"You see, I've essentially completed my analysis of the currents surrounding Thavnair. I must say, it's been most enlightening."},{"name":"TLAQATIA","text":"Next, I would ask you to travel to a place where we have no pre-existing data. To wit, I mean to research the currents in Garlemald."},{"name":"TLAQATIA","text":"We've been unable to even set foot in the region until now, which means that gathering data there could lead to a truly revolutionary discovery. After all, we still have no idea how the underwater aether currents there are connected with those in other regions."},{"name":"TLAQATIA","text":"Alas, lacking data from years past, it won't be such a simple task to identify the changes that have occurred over the decades."},{"name":"TLAQATIA","text":"I do, however, have an idea how we might get around that. The answer, my friend, is shellfish! Studying the growth lines within their shells should allow me to draw some conclusions about how their habitat has changed over time."},{"name":"TLAQATIA","text":"After carefully perusing Professor Nele's tomes, I've come to the conclusion that Garlean clams would be particularly suitable as a research specimen. Do you think you'd be up to the task of catching some for me?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I know that place like the back of my hand."},{"name":"A1","text":"Clams, you say? Leave it to me."},{"name":"TLAQATIA","text":"Wonderful! I'm quite confident that quality data from Garlemald is what will allow my thesis to truly begin to take shape."},{"name":"TLAQATIA","text":"Ah, yes. I also read that clams exist in abundance in the area around Camp Broken Glass, and that leeches are particularly effective in luring them up from the water's bottom."},{"name":"TLAQATIA","text":"Pray forgive me for asking you to travel to such a perilous location. Please, do whatever you must to stay safe."},{"name":"SYSTEM","text":"The Studium Deliveries list for T'laqa Tia has been updated. To view the new list, speak with T'laqa Tia."},{"name":"TLAQATIA","text":"Any luck finding those clams? As I mentioned, you should be able to find them in abundance right around Camp Broken Glass. And don't forget to bring a healthy supply of leeches!"},{"name":"TLAQATIA","text":"I've heard that Garlemald continues to be a most volatile and perilous place. I admire your courage, friend─even were it not for my aether sickness, I doubt I could work up the nerve to go there myself."},{"name":"TLAQATIA","text":"You've done it! My colleagues will be burning with envy when they hear I've obtained a specimen from Garlemald! How can I even begin to express my gratitude?"},{"name":"TLAQATIA","text":"You've done it! And what a remarkable sample it is! My colleagues will be burning with envy when they hear I've obtained a specimen from Garlemald. How can I even begin to express my gratitude?"},{"name":"TLAQATIA","text":"Oh, you might be wondering who this is. My research has been progressing so well of late that I've brought on a few of my students to serve as assistants and help me analyze all this data."},{"name":"TLAQATIA","text":"At any rate, I cannot thank you enough for braving such hostile environs for the sake of my life's work. No one in my field has had the chance to obtain substantial data from Garlemald until now. It would be no understatement to say your contribution is historic!"},{"name":"TLAQATIA","text":"Needless to say, this puts even more pressure on me to deliver with my thesis. Oh dear, my stomach's starting to feel queasy just thinking about it."},{"name":"NELE","text":"Ah, T'laqa. Would you believe you're the talk of the Studium? Even the senior faculty can scarcely wait to hear what you are able to glean about the aether currents of Garlemald."},{"name":"TLAQATIA","text":"Professor! Yes, it's all thanks to <span class=\"highlight\">Forename</span> here. Without <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> aid, I never could have procured this most invaluable specimen."},{"name":"NELE","text":"Indeed. Truly, I have not seen a partnership between scholar and gleaner bear such fruit so swiftly in a very long time."},{"name":"TLAQATIA","text":"Oh, that's right! Speaking of gleaning, I meant to tell you about everything I'd learned from the clams you brought."},{"name":"TLAQATIA","text":"I'm pleased to report that analyzing Garlean clams appears to have been the right call. Examining their growth lines, I was able to find specimens as old as ninety-seven years─giving me almost a full century of data to analyze!"},{"name":"TLAQATIA","text":"By far the most interesting thing I've noticed so far is the reverse correlation between the aether levels near Thavnair and those in Garlemald."},{"name":"TLAQATIA","text":"That is to say, over periods of time when the aether concentration was high near Thavnair, it was low in Garlemald. The reverse was also true."},{"name":"NELE","text":"I see. That bit of evidence would seem to corroborate your hypothesis that the planet's aether currents move in tandem with each other."},{"name":"NELE","text":"Should you manage to collect data from more regions still, I suspect you may very well be able to accurately predict changes in the fish population across the world. This could have remarkable implications for the future of the fishing trade."},{"name":"TLAQATIA","text":"I was thinking the very same, Professor! Nothing would give me greater joy than if my research were to bring about a tangible improvement in people's lives."},{"name":"TLAQATIA","text":"Before meeting you, I never dreamed I would make it this far. But now, I feel more confident than ever that I will be able to prove my hypothesis one day!"},{"name":"TLAQATIA","text":"Why, I can almost see my completed thesis in my mind's eye! But I can't afford to get too complacent just yet. The most important work remains to be done!"},{"name":"NELE","text":"I am pleased to see that all is progressing well. And yet, do not be surprised if there comes a time when T'laqa's resolve as a researcher is tested."},{"name":"NELE","text":"A time when he is forced to consider what it is that truly drives him to engage in his work─for such times come to all scholars, no matter how naturally gifted they may be."},{"name":"NELE","text":"Should T'laqa find himself at an impasse, can I trust you to lend him your support when it is needed most? It would mean the world to him...and to me."},{"name":"SYSTEM","text":"T'laqa Tia is overjoyed with your efforts. He now considers you a <span class=\"highlight\">Seasoned Fisher</span>!"},{"name":"SYSTEM","text":"A new quest continuing the story of the Faculty of Aetherology is now available. Upon its completion, the Studium Deliveries list for T'laqa Tia will be updated."},{"name":"SYSTEM","text":"In order to undertake the subsequent quest, you must first complete the main scenario quest “At World's End.”"}],"reward":{"items":[{"num":2,"id":36047}]},"reqs":{"jobs":[{"lvl":85,"id":155}],"quests":[69698]},"next":[69700]},"partials":[{"type":"npc","id":"1038551","obj":{"i":1038551,"n":"T'laqa Tia","l":3706,"q":7}},{"type":"item","id":"36047","obj":{"i":36047,"n":"Carrot Nibbles","l":527,"c":24165,"t":46}},{"type":"quest","id":"69698","obj":{"i":69698,"n":"Data across the Decades","g":177,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69700","obj":{"i":69700,"n":"The Wandering Whale","g":177,"l":"Old Sharlayan","s":0}}]}