{"quest":{"name":"Fear the Thesis","location":"Old Sharlayan","id":69696,"patch":6.0,"sort":0,"icon":101140,"unlocksFunction":1,"eventIcon":71341,"issuer":1038549,"target":1038551,"genre":177,"journal":["T'laqa Tia could use a helping hand with his research.","You strike up a conversation with Associate Professor T'laqa Tia, a member of the Faculty of Aetherology specializing in the research of underwater aetheric currents. In a cruel twist of fate, the professor is afflicted with a severe case of aether sickness. Suspecting that you may not grasp the sheer gravity of his situation, he bids you accompany him to the aetheryte plaza, that you might witness just how dire it is firsthand.","T'laqa approaches the aetheryte and promptly voids the entire contents of his stomach onto the pavement, leaving little doubt that his malady is indeed severe. After he recovers, the professor further explains that he is under great pressure to prove the worth of his work so that he might properly repay his mentor, Professor Nele, for the faith he has shown in the young scholar. You agree to lend him a hand by helping him collect the data he requires for his thesis, and head back to Searchers' Meet to learn more.","Back at Searchers' Meet, T'laqa Tia thanks you again for aiding him in his time of need, and bids you speak with him once again whenever you are ready to take on the task. You prepare to offer what assistance you can, trusting that the young professor's research could lead to a major breakthrough in aetheric studies if you can help him succeed."],"objectives":["Speak with T'laqa Tia.","Speak with T'laqa Tia again."],"dialogue":[{"name":"TLAQATIA","text":"Could it be? Yes, you must be the gleaner I've heard so much about! Let me get straight to the point—"},{"name":"TLAQATIA","text":"Oh, but where are my manners? Allow me to introduce myself first. My name is T'laqa Tia, and I'm an associate professor in the Faculty of Aetherology here."},{"name":"TLAQATIA","text":"To tell the truth, I'm in a bit of a bind. I'm scheduled to make a major presentation at a conference in the near future, but─as ashamed as I am to admit it─I've not been able to get enough data to properly finish my thesis."},{"name":"TLAQATIA","text":"If I'm unable to prove the worth of my research, then my funding is all but certain to dry up! As you can see, the stakes are high."},{"name":"TLAQATIA","text":"You have the look of an adept angler about you─am I right? If so, you could be just the person I need. This section here is one I've rented out for my work. Might I interest you in taking a look?"},{"name":"TLAQATIA","text":"Impressive, isn't it? I bet you've never laid eyes on such a fine fish tank before. Sadly, as you can see, it's entirely devoid of fish."},{"name":"TLAQATIA","text":"Anyhow, I suppose I should tell you about my work. You see, I research water veins. Not just any old ones, mind you, but those that carry aether—not unlike the Lifestream, or the aetheric currents in the wind."},{"name":"TLAQATIA","text":"Life is naturally drawn to areas abundant in aether, which is why you might observe that popular fishing spots are often also aether-rich."},{"name":"TLAQATIA","text":"My research focuses in particular on veins which carry especially high concentrations of aether─currents commonly known as “spectral currents.” Are you perchance familiar with the phenomenon?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I've heard of it."},{"name":"A1","text":"Can't say I am."},{"name":"A1","text":"I've seen one before!"},{"name":"TLAQATIA","text":"Oho! I'd expect nothing less from a veteran gleaner. I must say, it's always nice to meet someone familiar with the subject of my life's work."},{"name":"TLAQATIA","text":"Well, that's hardly a surprise. Most people never venture far enough out at sea to where one might encounter them."},{"name":"TLAQATIA","text":"In any event, the most important point to remember is just how important aether currents are for aquatic life."},{"name":"TLAQATIA","text":"To look at it the other way, it is possible to identify how strong the local aether currents are by studying the fish and other aquatic life in any given area."},{"name":"TLAQATIA","text":"And that's where we come full circle: I require specimens of fish from various bodies of water to confirm my hypothesis regarding underwater aether currents."},{"name":"TLAQATIA","text":"And there's the rub: the areas most worth researching also happen to be the hardest to reach. Of course, I would not be averse to risking the journey myself, if only it were not for my...condition."},{"name":"TLAQATIA","text":"Ah, yes. I suppose I should explain."},{"name":"TLAQATIA","text":"Put simply, I have long suffered from a particularly nasty case of aether sickness. Why, I can't even use the Aethernet or any sort of teleportation magicks. Quite annoying when your work partially depends on such things, to say the least."},{"name":"TLAQATIA","text":"I know, I know. An aetherologist who can't stomach aether. I wouldn't believe it were I not living this nightmare myself."},{"name":"TLAQATIA","text":"But perhaps you are skeptical? I have an idea. Follow me to the aetheryte plaza, and I'll show you just how bad I've got it."},{"name":"TLAQATIA","text":"Ah, there you are. All right, watch closely now..."},{"name":"TLAQATIA","text":"Blegh..."},{"name":"TLAQATIA","text":"You see? I'm feeling so queasy, it's all I can do to hold down the contents of my stomach..."},{"name":"TLAQATIA","text":"Urk... The whole world! It is spinning! Someone, make it stop!"},{"name":"TLAQATIA","text":"What is this? Urk...urk... Forgive me!"},{"name":"TLAQATIA","text":"Well, there you have it. My condition has manifested itself all over the ground for you."},{"name":"NELE","text":"(-???-)I say, T'laqa...are you quite all right?"},{"name":"TLAQATIA","text":"P-Professor Nele!"},{"name":"NELE","text":"I see your condition's as bad as ever. One would think you'd avoid a place like this..."},{"name":"NELE","text":"And you... Ah, are you perchance assisting T'laqa with his research?"},{"name":"NELE","text":"The boy may suffer from terrible aether sickness, but as a scholar, he has as much potential as anyone I've seen. You develop an eye for these things when you've been in academia for as long as I have."},{"name":"NELE","text":"But I must be on my way. I very much look forward to reading your finished thesis, T'laqa."},{"name":"TLAQATIA","text":"Urk... Did I mention that I don't handle pressure particularly well? I've barely written the introduction to my paper, and Professor Nele is already selling it up to his peers. How can I possibly live up to his expectations?"},{"name":"TLAQATIA","text":"Incidentally, Professor Nele is one of the leading authorities in the world of aetherology. Some would even say he's the equal of Master Matoya. And for some reason, he seems to have taken a liking to me."},{"name":"TLAQATIA","text":"He's the one who pushed for the school to allow me to form my own research team, as the first and trial phase of a program to support young scholars. Otherwise, a humble associate professor such as myself would never be able to conduct such an ambitious project."},{"name":"TLAQATIA","text":"And yet, I run the risk of losing everything if I don't turn my potential into actual results at the upcoming conference."},{"name":"TLAQATIA","text":"Not only would my own research team be disbanded, but there's a high likelihood that Professor Nele's program would be terminated, meaning that no other young scholar would ever again receive the opportunity I did. The very future of the Studium is at stake!"},{"name":"TLAQATIA","text":"Part of me wishes I could just drink my worries away. Sadly, I handle alcohol about as well as I handle aether..."},{"name":"TLAQATIA","text":"I may not be good at dealing with aether or pressure, but one thing is certain: for Professor Nele's sake, I must not fail. I <span class=\"emphasis\">cannot</span>!"},{"name":"TLAQATIA","text":"And so I beg of you! Pray help me. There is no one else to whom I can turn."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Leave it to me!"},{"name":"A2","text":"Oh, fine..."},{"name":"TLAQATIA","text":"Thank you! Oh, thank you! You are a shining beacon of hope for all young scholars here in Sharlayan!"},{"name":"TLAQATIA","text":"Now, let us head back to Searchers' Meet so we can get to the task. I shall meet you back at my office!"},{"name":"TLAQATIA","text":"Ah, <span class=\"highlight\">Forename</span>! I was just compiling a list of fish that I'll be needing for my research."},{"name":"TLAQATIA","text":"Let me know when you're ready to get fishing. I'll fill you in on exactly what I would ask you to do."},{"name":"SYSTEM","text":"You may now undertake deliveries for the Faculty of Aetherology at the Studium. Speak to T'laqa Tia to learn more."}],"reward":{"items":[{"num":2,"id":30481}]},"reqs":{"jobs":[{"lvl":80,"id":155}],"quests":[70009]},"next":[69697]},"partials":[{"type":"npc","id":"1038549","obj":{"i":1038549,"n":"T'laqa Tia","l":3706,"q":1}},{"type":"npc","id":"1038551","obj":{"i":1038551,"n":"T'laqa Tia","l":3706,"q":7}},{"type":"item","id":"30481","obj":{"i":30481,"n":"Crab Cakes","l":490,"c":24329,"t":46}},{"type":"quest","id":"70009","obj":{"i":70009,"n":"The Faculty","g":178,"l":"Old Sharlayan","s":10,"f":1}},{"type":"quest","id":"69697","obj":{"i":69697,"n":"Go with the Flow","g":177,"l":"Old Sharlayan","s":0}}]}