{"quest":{"name":"Go with the Flow","location":"Old Sharlayan","id":69697,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1038551,"target":1038551,"genre":177,"journal":["T'laqa Tia is in dire need of some data.","T'laqa Tia has asked that you supply him with giant aetherlice for data collection purposes.<br><br>※Giant aetherlice can be fished from the Phreatic Conduit using gold salmon roe as bait.<br><br>※Minimum collectability rating for this delivery is 70. Delivering items with a rating of 166 or more will earn greater rewards.","You deliver the giant aetherlice to T'laqa Tia. When you are ready, the scholar will no doubt welcome your continued aid as he strives to prove his theory."],"objectives":["Catch giant aetherlice near the Phreatic Conduit and deliver them to T'laqa Tia."],"dialogue":[{"name":"TLAQATIA","text":"All right, then. Shall we get started?"},{"name":"TLAQATIA","text":"To review, I require samples of aquatic life from various bodies of water, that I might analyze them and ascertain the current state of the respective regions' underwater aether currents."},{"name":"TLAQATIA","text":"Before I send you off to far-flung locales, I'd like to gather data from somewhere nearby. Collecting samples from a stable, controlled environment like Labyrinthos should give me a good basis with which to compare any future findings."},{"name":"TLAQATIA","text":"To that end, I'd like to ask you to catch me some giant aetherlice─and a fair share of them, to ensure a representative sample size. According to my preliminary research, they swim in abundance near the Phreatic Conduit, and have a noted fondness for gold salmon roe."},{"name":"SYSTEM","text":"You may now undertake deliveries for the Faculty of Aetherology at the Studium. By delivering the requested items to T'laqa Tia and raising yourself in his esteem, you can help him to finally complete his thesis."},{"name":"TLAQATIA","text":"Have you had any luck catching those lice? If not, I suggest heading to the Phreatic Conduit with some gold salmon roe in your tackle box. That is what you fishers call it, yes?"},{"name":"TLAQATIA","text":"You've brought the aetherlice I requested? Splendid! I must analyze these at once and record my findings."},{"name":"TLAQATIA","text":"Now <span class=\"emphasis\">this</span> is a remarkable catch! Impressive specimens like these will give me even more quality data. I can't thank you enough!"},{"name":"SYSTEM","text":"In making your first successful delivery, you have begun to earn T'laqa Tia's trust."},{"name":"SYSTEM","text":"Deliver the items T'laqa Tia needs, and deliver them often to improve your standing with the Faculty of Aetherology!"},{"name":"TLAQATIA","text":"Thanks to your efforts, I've been able to compile a full set of reference data. Now, we can finally get started on spots further afield."},{"name":"TLAQATIA","text":"But before that, I haven't yet explained my research to you in detail, have I? Simply put, there's a certain hypothesis I want to prove."},{"name":"TLAQATIA","text":"In my studies over the years, I have come to believe that much like the tide ebbs and flows with the phases of the moon, so, too, do the underwater aether currents that cover our entire planet."},{"name":"TLAQATIA","text":"When the concentration of aether in any given current changes, aquatic life in the area grows more or less abundant, which ultimately affects the currents of the ocean itself."},{"name":"TLAQATIA","text":"My hope is that─if I can prove this and accurately predict these changes─we might theoretically identify the best times for fishing, and even know when it's safest to navigate the seas."},{"name":"TLAQATIA","text":"Needless to say, it would be a major breakthrough! And I'm one step closer to realizing it all, thanks to you."},{"name":"NELE","text":"Ah, T'laqa. It looks like your research is progressing well."},{"name":"TLAQATIA","text":"Professor Nele!"},{"name":"NELE","text":"I heard that your friend here had started gathering samples for you, so I brought a few choice tomes with me that might serve to point you in the right direction."},{"name":"TLAQATIA","text":"As always, you are too kind, Professor. I can't thank you enough!"},{"name":"NELE","text":"Don't mention it. When the time comes that your research bears fruit, that will be all the thanks I need."},{"name":"NELE","text":"Your mind for developing compelling hypotheses has always impressed me. You lacked only for a skilled gleaner to help you overcome the limits of your affliction. I will be watching this new partnership of yours with great interest."},{"name":"TLAQATIA","text":"Phew! Why, that actually wasn't so bad. Just having you around has already taken a huge weight off my shoulders."},{"name":"TLAQATIA","text":"Up until now, Professor Nele's confidence in me only made me feel pressured to deliver something that I wasn't even sure I was capable of."},{"name":"TLAQATIA","text":"But now I've finally started to make some tangible progress, and it's all because of you. For the first time, I feel like I may have a bright future in academia after all!"},{"name":"TLAQATIA","text":"Yes, I have a feeling everything is going to go swimmingly─no pun intended─as long as you're by my side!"},{"name":"SYSTEM","text":"T'laqa Tia is pleased with your efforts. He now considers you a <span class=\"highlight\">Dependable Fisher</span>!"},{"name":"SYSTEM","text":"The next request will be available from T'laqa Tia upon reaching level 83 as a fisher."}],"reward":{"items":[{"num":30,"id":12669}]},"reqs":{"jobs":[{"lvl":80,"id":155}],"quests":[69696]},"next":[69698]},"partials":[{"type":"npc","id":"1038551","obj":{"i":1038551,"n":"T'laqa Tia","l":3706,"q":7}},{"type":"item","id":"12669","obj":{"i":12669,"n":"Hi-Cordial","l":100,"c":20623,"t":44}},{"type":"quest","id":"69696","obj":{"i":69696,"n":"Fear the Thesis","g":177,"l":"Old Sharlayan","s":0,"f":1}},{"type":"quest","id":"69698","obj":{"i":69698,"n":"Data across the Decades","g":177,"l":"Old Sharlayan","s":0}}]}