{"quest":{"name":"Cooking Up a Culture","location":"Old Sharlayan","id":69690,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1038501,"target":1038501,"genre":176,"journal":["Hinageshi is ready to research.","Hinageshi has asked that you supply her with Hannish staples.<br><br>※Hannish staples can be gathered from the Hamsa Hatchery by miners, and from the Giantsgall Grounds by botanists.<br><br>※Minimum collectability rating for this delivery is 240. Delivering items with a rating of 600 or more will earn greater rewards.","You deliver the Hannish staples to Hinageshi. Matters appear to be going swimmingly, and she is much pleased with your efforts."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Deliver  gathered from the Hamsa Hatchery to Hinageshi.</span><span class=\"alternative\">Deliver  gathered from the Giantsgall Grounds to Hinageshi.</span><span class=\"alternative\">As a botanist or miner, deliver  to Hinageshi.</span></span>"],"dialogue":[{"name":"HINAGESHI","text":"I've made a list of a few Hannish staples we require to emulate life in Radz–at–Han, and, well...there are certainly quite a few things you would struggle to procure here in Sharlayan."},{"name":"HINAGESHI","text":"There is one in particular which is used to make both vibrant dyes and special spices. Anyroad, best of luck gathering this in Thavnair!"},{"name":"SYSTEM","text":"The Hannish staples you require can be gathered near the Hamsa Hatchery."},{"name":"SYSTEM","text":"The Hannish staples you require can be gathered near the Giantsgall Grounds."},{"name":"SYSTEM","text":"Faculty of Anthropology Deliveries are now available. By delivering the requested items to Hinageshi and raising yourself in her esteem, you can help bring her and Professor Tankin a little closer together."},{"name":"HINAGESHI","text":"We won't get very far without at least a few goods from the regions we seek to emulate. But I trust you'll have no trouble procuring what we need."},{"name":"HINAGESHI","text":"Perfectly splendid! Oh my, how vibrant—you can certainly tell this wasn't sourced around here."},{"name":"HINAGESHI","text":"Oh my, what fine specimens you've found. And so vibrant! Yes, these will be most helpful indeed. Thank you!"},{"name":"HINAGESHI","text":"These rocks are used to create the vibrant dyes Hannish clothing is often known for. They say each color has its own special meaning in their culture."},{"name":"HINAGESHI","text":"These leaves are desiccated before being turned into spices. They're commonly found in Hannish cooking as you might expect, but alchemists there also use them to fashion various medicinal tinctures."},{"name":"SYSTEM","text":"In making your first successful delivery, you have begun to earn Hinageshi's trust."},{"name":"SYSTEM","text":"Deliver the items Hinageshi needs, and deliver them often to improve your standing with the Faculty of Anthropology!"},{"name":"SYSTEM","text":"Professor Tankin and Hinageshi take the items you brought them and set to work emulating Hannish culture."},{"name":"HINAGESHI","text":"Most colorful, would you not agree? Alas, one would surely freeze to death wearing these clothes in Sharlayan for very long..."},{"name":"HINAGESHI","text":"And while their cuisine is quite delectable, I must say it is rather spicy for my own palate. Perhaps their love for spices developed out of necessity?"},{"name":"TANKIN","text":"A fine hypothesis indeed, Hinageshi! Food is prone to expire all too quickly in climes such as Radz–at–Han's. Copious use of spices not only helps to increase one's appetite, it also masks any unpleasant odors that may come from food on the brink of spoiling."},{"name":"TANKIN","text":"And with spoiling food comes the risk of harmful bacteria─a likely reason for the region's struggles with sickness over the years. I can think of no better catalyst to spur innovation in medicine through the mastery of alchemy."},{"name":"TANKIN","text":"This, for example─a tonic to raise the body's core temperature to protect from the cold."},{"name":"HINAGESHI","text":"Resourceful as always. Thank you, Professor."},{"name":"TANKIN","text":"Returning to their penchant for colorful hues, I believe I understand their reasoning for that as well. Simply put, primary colors stand out even under the unrelenting rays of the sun. Hence, everything from their buildings to their bracelets are made in bold, primary colors."},{"name":"TANKIN","text":"And each color represents different concepts. Red, for example, represents fire. Its close relative, orange, represents the spiritual fire that rages within one's soul─the very source of life itself. This is why they believe orange to be an auspicious color for would-be mothers and the like."},{"name":"HINAGESHI","text":"Would-be..."},{"name":"HINAGESHI","text":"Y-You don't say! My, that is...good to know, Professor. What else can you tell us of Radz–at–Han?"},{"name":"TANKIN","text":"Oh, plenty! But I find experience to be the better teacher. So come, let us live as the Hannish do, and I am sure we will happen upon countless discoveries."},{"name":"HINAGESHI","text":"Well, this is all going rather swimmingly! I had hoped this research might bring us closer together, but I never dreamed we would end up <span class=\"emphasis\">living</span> together."},{"name":"HINAGESHI","text":"Of course it would not have been possible without your help, and for that you have my thanks!"},{"name":"SYSTEM","text":"Hinageshi is pleased with your efforts. She now considers you a <span class=\"highlight\">Fledgling Matchmaker</span>!"},{"name":"SYSTEM","text":"The next request will be available from Hinageshi upon reaching level 83 as a miner or botanist."},{"name":"SYSTEM","text":"In order to undertake the subsequent quest, you must first complete the main scenario quest “A Frosty Reception.”"}],"reward":{"items":[{"num":30,"id":12669}]},"reqs":{"jobs":[{"lvl":80,"id":154}],"quests":[69689]},"next":[69691]},"partials":[{"type":"npc","id":"1038501","obj":{"i":1038501,"n":"Hinageshi","l":3706,"q":7}},{"type":"item","id":"12669","obj":{"i":12669,"n":"Hi-Cordial","l":100,"c":20623,"t":44}},{"type":"quest","id":"69689","obj":{"i":69689,"n":"Cultured Pursuits","g":176,"l":"Old Sharlayan","s":0,"f":1}},{"type":"quest","id":"69691","obj":{"i":69691,"n":"The Culture of Ceruleum","g":176,"l":"Old Sharlayan","s":0}}]}