{"quest":{"name":"Data across the Decades","location":"Old Sharlayan","id":69698,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1038551,"target":1038551,"genre":177,"journal":["T'laqa Tia has high hopes that your partnership will bear fruit.","T'laqa Tia has asked that you supply him with garjana wrasse for data collection purposes.<br><br>※Garjana wrasse can be fished from the Great Runoff using shrimp balls as bait.<br><br>※Minimum collectability rating for this delivery is 133. Delivering items with a rating of 313 or more will earn greater rewards.","You deliver the garjana wrasse to T'laqa Tia. Continue improving your fishing skills until the associate professor has decided on the next data collection point."],"objectives":["Catch garjana wrasse at the Great Runoff and deliver them to T'laqa Tia."],"dialogue":[{"name":"TLAQATIA","text":"Oh, hello again!"},{"name":"TLAQATIA","text":"Did you notice the fish tank, by the way? I went ahead and put one of my research specimens in it. Quite the looker, wouldn't you say?"},{"name":"TLAQATIA","text":"I tell you, so many things have fallen into place ever since you showed up. I'm having the time of my life analyzing all this data!"},{"name":"TLAQATIA","text":"I mean to continue my analysis of aetherlice, of course, but I will task another gleaner with such mundane tasks."},{"name":"TLAQATIA","text":"Instead, I'd like to make full use of your skills by having you visit an area I've long been fascinated with."},{"name":"TLAQATIA","text":"I speak of the oceans surrounding Thavnair!"},{"name":"TLAQATIA","text":"I have reason to believe there was a significant change in the aether currents in those waters that occurred around the time of the Calamity. Professor Nele shared with me some data from twenty years prior, and I would compare it with current data to ascertain if I am correct."},{"name":"TLAQATIA","text":"The waters around Thavnair, you see, have long been one of the focal points of Professor Nele's research."},{"name":"TLAQATIA","text":"I wish to study them more to honor his work, whilst also using it as a starting point for my own."},{"name":"TLAQATIA","text":"Before you go, however, a word of warning: ever since the Calamity, the region is notorious for shipwrecks. I realize that you are a seasoned professional, but I fully understand if you do not want to take on the risk."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Consider it done!"},{"name":"A1","text":"I almost didn't return from my voyage on the Sirensong Sea..."},{"name":"TLAQATIA","text":"Oh, thank you! I knew I could count on you."},{"name":"TLAQATIA","text":"So the rumors were true! Still, you could always fish off the island's coast. I reckon there wouldn't be much risk in that."},{"name":"TLAQATIA","text":"Anyhow, I'd like you to fish the same species that Professor Nele studied twenty years ago: to wit, the garjana wrasse."},{"name":"TLAQATIA","text":"According to the books the professor gave me, they live near the Great Runoff, and are known to enjoy nibbling on shrimp balls. And that should do it! Be safe out there, yes?"},{"name":"SYSTEM","text":"The Studium Deliveries list for T'laqa Tia has been updated. To view the new list, speak with T'laqa Tia."},{"name":"TLAQATIA","text":"Have you managed to reel in any wrasse? According to my references, they live in relative abundance near the Great Runoff and favor the taste of shrimp balls."},{"name":"TLAQATIA","text":"Speaking of which, how do you plan to travel to Thavnair? I suspect teleportation magicks would be the most convenient way─if, sadly, not one available to me. In either event, do take care!"},{"name":"TLAQATIA","text":"Well, would you look at that wrasse! Splendid! I can scarcely wait to analyze it, that I might compare my findings with Professor Nele's from two decades ago!"},{"name":"TLAQATIA","text":"Dear me! What an impressive specimen! This should allow me collect data as complete as Professor Nele's from two decades ago. I can't wait to compare my findings!"},{"name":"TLAQATIA","text":"Well, I daresay I've more than enough samples now. Pray wait for just a moment—I'm going to ask Professor Nele to take a look."},{"name":"NELE","text":"It's not every day that you ask after me, T'laqa. I trust this means that your research is coming along well?"},{"name":"TLAQATIA","text":"Better than I could have ever imagined! As a matter of fact, I was hoping to hear your thoughts on my latest findings."},{"name":"TLAQATIA","text":"Comparing my data with yours from twenty years ago, I can say with confidence that the concentration of aether in the area did indeed show an increase around the time of the Calamity. From these numbers, I would posit that smaller fish species in the area have increased in abundance severalfold!"},{"name":"TLAQATIA","text":"The garjana wrasse, in particular, is known for protecting itself from predators by creating disturbances in the surrounding aether. A population increase of such scale would undoubtedly result in a dramatic impact on its habitat."},{"name":"TLAQATIA","text":"Which would go a long way to explaining the countless shipwrecks. The sheer number of these fish would surely play havoc with ships' aether compasses."},{"name":"NELE","text":"Outstanding work, T'laqa! Of course, more data will be needed to prove your assertions as fact. Should it hold true, however, this could be a discovery of no small import."},{"name":"NELE","text":"Come to think of it, I remember you showing considerable interest in my research into the seas around Thavnair. What exactly was it that drew you to my work?"},{"name":"TLAQATIA","text":"Oh! It's just, well, I always found the figures somewhat...unnatural. Call it a hunch, but I couldn't help but feel like it warranted further research."},{"name":"NELE","text":"Ah, now <span class=\"emphasis\">that's</span> the true spirit of a scholar. Even the most epoch-making of discoveries often started from observation of a simple irregularity or curiosity."},{"name":"NELE","text":"With that intuition and power of observation, you're going to go places, T'laqa. I knew my faith in you was not misplaced."},{"name":"TLAQATIA","text":"I...I am!? You flatter me, Professor..."},{"name":"NELE","text":"Haha! Take care not to let it go to your head. Your potential will only be stifled if you allow yourself to be content with minor progress and faint praise."},{"name":"TLAQATIA","text":"O-Of course, Professor. I will redouble my efforts, and work harder than ever to deliver results!"},{"name":"TLAQATIA","text":"And on that note, I'd best get to work summarizing my findings for inclusion in my thesis."},{"name":"TLAQATIA","text":"If I am able to identify an explicit correlation amongst the post-Calamity change in aether concentration, the explosion of the fish population, and the increase in shipwrecks, it will go a long way toward proving my theory correct!"},{"name":"TLAQATIA","text":"Of course, I'll be needing more fish specimens before that can happen. Fair warning─I might have to send you to even more hazardous locales. And yet I'm sure you're up to the challenge, yes?"},{"name":"TLAQATIA","text":"Splendid! I swear, this is the most invigorated I've ever felt about my research! Now, where to start...?"},{"name":"SYSTEM","text":"T'laqa Tia is delighted with your efforts. He now considers you a <span class=\"highlight\">Formidable Fisher</span>!"},{"name":"SYSTEM","text":"The next request will be available from T'laqa Tia upon reaching level 85 as a fisher."},{"name":"SYSTEM","text":"In order to undertake the subsequent quest, you must first complete the main scenario quest “The Martyr.”"}],"reward":{"items":[{"num":30,"id":12669}]},"reqs":{"jobs":[{"lvl":83,"id":155}],"quests":[69697]},"next":[69699]},"partials":[{"type":"npc","id":"1038551","obj":{"i":1038551,"n":"T'laqa Tia","l":3706,"q":7}},{"type":"item","id":"12669","obj":{"i":12669,"n":"Hi-Cordial","l":100,"c":20623,"t":44}},{"type":"quest","id":"69697","obj":{"i":69697,"n":"Go with the Flow","g":177,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69699","obj":{"i":69699,"n":"History Lesson","g":177,"l":"Old Sharlayan","s":0}}]}