{"quest":{"name":"Cutting the Cheese","location":"Old Sharlayan","id":69703,"patch":6.0,"sort":8110,"icon":112441,"unlocksFunction":1,"eventIcon":71341,"issuer":1041861,"target":1041862,"genre":119,"journal":["This panic-stricken Loporrit is desperate for the aid of an able-bodied adventurer.","There is an emergency on the moon, and despite lacking any specific details of the situation, the panic-stricken Loporrit is beside himself. He only knows that Buildingway is searching for you, and asks that you head to Mare Lamentorum posthaste.","According to Buildingway, their automated construction machine─the Big Cheese─has gone out of control, burrowing into the moon causing untold havoc. The survey team sent to investigate has yet to return, and now Buildingway would ask you to force your way inside and assess the situation. You need only make your way to Smileton, and he will see to it you have clearance to enter.<br><br>※Smileton can be accessed via the Duty Finder.","The path through Smileton is treacherous, thanks in no small part to the Loporrits' security system. Nevertheless you press on, and at the center of it all you find the Big Cheese. After a thunderous battle, the great machine falls silent. Buildingway will be heartened to know the threat is over.","You report back to Buildingway and the look of relief on his face speaks volumes. He is disappointed to see his plans go awry, but without the threat of the Final Days and impending doom, he has time to begin anew. This time, he affirms, he will take his time, and make certain to avoid any more abrupt changes of heart."],"objectives":["Speak with Buildingway at Mare Lamentorum.","Enter Smileton.","Speak with Buildingway."],"dialogue":[{"name":"LOPORRIT04167","text":"<span class=\"highlight\">Forename</span>! Oh, thank goodness you're here. It's absolutely terrible! Awful! An emergency of cataclysmic proportions!"},{"name":"LOPORRIT04167","text":"What is it...? I-I don't know, actually. They didn't say. But doesn't it sound simply dreadful!?"},{"name":"LOPORRIT04167","text":"What I <span class=\"emphasis\">do</span> know is Buildingway has been asking after you. He said if I happen to see you, I should tell you to hurry over to Kydonia Knolls with all haste.<br>...Well? What are you standing around here for? Away with you!"},{"name":"LOPORRIT04167","text":"Whatever the problem is, it sounds absolutely dreadful. I'm afraid you'll have to speak with Buildingway for the nub of this carrot."},{"name":"BUILDINGWAY","text":"You're here! And not a moment too soon. Sorry to call you here so abruptly, but you were the first person who came to mind that might be able to help."},{"name":"BUILDINGWAY","text":"Do you recall the domiciles we were planning to build for the evacuation?"},{"name":"BUILDINGWAY","text":"I don't mean to brag, but they were immaculate─positively perfect. Except, of course, for the ever-so-small oversight of being three times larger than necessary."},{"name":"BUILDINGWAY","text":"At least, that's what I believed before speaking with Urianger. I learned a lot from him about what we should and shouldn't make of the domiciles, and so I began making changes. Small at first, but they soon became much bigger, more drastic!<br>By the end I'd swear I was drawing up wholly new plans by the minute."},{"name":"BUILDINGWAY","text":"But I was too ambitious─the myriad plans I dreamt up overwhelmed our automated construction machine, the Big Cheese! Even as we speak, it's burrowing underground with reckless abandon."},{"name":"BUILDINGWAY","text":"If we don't stop it, the domiciles will be the least of our problems. The entire moon is likely to end up looking like a truckle of hole-filled cheese! Delectable? Perhaps, but utterly unfit for habitation."},{"name":"BUILDINGWAY","text":"We tried going after it ourselves, but the survey team never made it past the security systems down there. At least, I don't think so. They've yet to return and aren't answering our communications."},{"name":"BUILDINGWAY","text":"I'd rather not resort to brute force, but I can think of no other way─and no other person─to see the deed done. Would you be willing to go down there and stop the Big Cheese?"},{"name":"BUILDINGWAY","text":"Thank you! Thank you! Head down to Smileton, and I'll see that you're let in."},{"name":"BUILDINGWAY","text":"I'll see to it you have clearance to enter Smileton. Now hurry along, you have to stop the Big Cheese!"},{"name":"BUILDINGWAY","text":"You're back! What happened to the Big Cheese?"},{"name":"BUILDINGWAY","text":"It's gone...? I suppose that's a mite better than the alternative. And you say the survey team is safe? Oh, thank heavens..."},{"name":"BUILDINGWAY","text":"Smileton was meant to be a paradise, and the Big Cheese its architect. It was designed to learn what it is that makes people happy, and make manifest whatever we could dream up, no matter how seemingly impossible."},{"name":"BUILDINGWAY","text":"But I've been unduly fickle, every new plan contradicting the last. I fear my indecisiveness overloaded the Big Cheese, and it lost sight of what true happiness is. &lt;sigh&gt; All I wanted was to make the people of Etheirys happy, and look upon their smiling faces..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You still can. Just take your time, think things through, and all will be well."},{"name":"A1","text":"Have you considered visiting residential areas on Etheirys for inspiration?"},{"name":"BUILDINGWAY","text":"You're right. Next time I'll make absolutely sure of my plans before putting them into practice. No more radical changes at the last moment."},{"name":"BUILDINGWAY","text":"Now there's an idea. I mean, sure, Urianger has been incredibly helpful with his advice, but actually seeing how people live would surely be more informative than simply hearing about it."},{"name":"BUILDINGWAY","text":"And now that the Final Days have been averted, there's no longer a need to rush! I'll be sure to bear that in mind so nothing like this happens again."},{"name":"BUILDINGWAY","text":"Perhaps I'll start with something simple like furniture. Oh, and I can design a new automated system to build them! I'll call it the, uh...the Bigger Cheese!"}],"reward":{"gil":1087,"items":[{"id":33917},{"id":33929}],"instance":85},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70000]}},"partials":[{"type":"npc","id":"1041861","obj":{"i":1041861,"n":"Panic-stricken Loporrit","l":3706,"q":1}},{"type":"npc","id":"1041862","obj":{"i":1041862,"n":"Buildingway","l":3711,"q":1}},{"type":"item","id":"33917","obj":{"i":33917,"n":"Piety Materia IX","l":560,"c":20281,"t":58,"materia":{"tier":8,"value":12,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"item","id":"33929","obj":{"i":33929,"n":"Quicktongue Materia IX","l":560,"c":20282,"t":58,"materia":{"tier":8,"value":12,"attr":"Spell Speed","category":0}}},{"type":"instance","id":"85","obj":{"i":85,"n":"Smileton","c":61801,"t":"Dungeons","min_lvl":90,"max_lvl":90,"min_ilvl":540,"max_ilvl":600}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}}]}