{"quest":{"name":"Pastures New","location":"Old Sharlayan","id":69702,"patch":6.0,"sort":0,"icon":101140,"eventIcon":71221,"issuer":1038551,"target":1039239,"genre":177,"usedItems":[35850],"journal":["T'laqa Tia is looking to apply the finishing touches to his thesis.","Though T'laqa Tia's thesis has been proceeding well─in no small part due to the specimens of aquatic life you procured for him─he continues to struggle with the question of what his true duty as a scholar is. In hopes of clearing his mind, he decides to head to Tranquility to be alone with his thoughts and bids you join him to exchange thoughts after some time has passed.","T'laqa Tia has developed a measure of confidence thanks to the progress of his research, but refuses to rest on his laurels. To prove his theory beyond all doubt─and in the process, develop a practical means to save the creatures endangered by the aetheric fluctuations─he would seek data from the moon itself. You agree to venture forth to Mare Lamentorum and ask the Loporrit locals how you might go about accomplishing this task.","At Mare Lamentorum, a particularly knowledgeable Loporrit kindly suggests that catching a lunar lamenter might be your best chance at providing T'laqa Tia with the data he desires. Grey worms in hand, you set out to do some fishing.","T'laqa Tia thanks you profusely for the lunar lamenter you procured for him, and sets out to finish his thesis, that he might present it to his peers. He bids you head over to Phenomenon and sit in the audience for his presentation, that you serve as a friendly face in the seats amidst the intimidating contingent of senior faculty.","T'laqa Tia's thesis receives rave reviews, securing him future funding and a promotion to a full-fledged professorship. Furthermore, he resolves to make good use of the new aether sickness medicine developed to treat the whale, that he might take a more active role in his own field work in the future. Proud of how far the young scholar has come, you prepare to head back to Searchers' Meet to speak with him one last time before taking your leave.","At Searchers' Meet, Professor Nele announces his forthcoming retirement, the veteran scholar heartened that his pupil T'laqa Tia has blossomed into a formidable researcher in his own right. For his part, T'laqa vows to redouble his efforts, that he might live up to his mentor's legacy, and asks that you pay visit from time to time."],"objectives":["Search for T'laqa Tia in Tranquility.","Speak with the knowledgeable Loporrit in Bestways Burrow.","Catch a lunar lamenter and deliver it to T'laqa Tia.","Speak with the Studium staff at Phenomenon.","Speak with T'laqa Tia."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake the subsequent quest, you must first complete the main scenario quest “Endwalker.”"},{"name":"SYSTEM","text":"In order to undertake the subsequent quest, you must first complete the fisher quest “One Man's Fish Is Another Man's Poison.”"},{"name":"TLAQATIA","text":"Ah, <span class=\"highlight\">Forename</span>. Always a pleasure to see you. I fear I haven't quite made up my mind regarding the issue we discussed last time."},{"name":"TLAQATIA","text":"Please don't be overly concerned. I fully intend to finish writing my thesis for the upcoming conference."},{"name":"TLAQATIA","text":"At the same time, I can't stop thinking about what Professor Nele said."},{"name":"TLAQATIA","text":"In fact, I was just thinking I'd head to Tranquility to be alone with my thoughts for a while. Would you mind joining me a bit later? An exchange of ideas might do me well."},{"name":"TLAQATIA","text":"Ah, thank you for coming."},{"name":"TLAQATIA","text":"Do you recall how Professor Nele encouraged me to consider what path would most inspire me?"},{"name":"TLAQATIA","text":"I was thinking it over, and it occurred to me─had I not met you, I doubtless would have continued to use my aether sickness as an excuse to stay cooped up in the Studium forever. Likely I would have succumbed to the weight of expectations, and given up on my research entirely."},{"name":"TLAQATIA","text":"Thanks to you, however, I was able to obtain the data I had so long sought, and now my thesis is nearly complete. For that, you have my eternal thanks."},{"name":"TLAQATIA","text":"And yet, I am now struck with the profound feeling that I must do more. I must seek even greater heights!"},{"name":"TLAQATIA","text":"I suspect my colleagues would laugh me out of the room if they heard this, but..."},{"name":"TLAQATIA","text":"I have a mind to obtain data from the moon itself. If I can only get my hands on that, I'm confident that I could find a way to stabilize the aether currents─and in doing so, save the poor creatures of the sea from their suffering!"},{"name":"TLAQATIA","text":"Yes, this is no time to rest on my laurels. There is so much more that must be done!"},{"name":"TLAQATIA","text":"Of course, I'll hardly be able to accomplish this on my own. What do you say? Will you lend me your help one last time?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"But of course!"},{"name":"A1","text":"I can hardly turn you down now, can I?"},{"name":"TLAQATIA","text":"Oh, thank you! I promise that this will be the last request I make of you."},{"name":"TLAQATIA","text":"As for precisely <span class=\"emphasis\">what</span> I would have you procure...this is where it gets a bit complicated. Normally I would reference the tomes in Noumenon, but as one might expect, none of them cover the ecosystem of the moon."},{"name":"TLAQATIA","text":"Perhaps you might seek advice with those who reside in Mare Lamentorum? If anyone could tell you what's worth catching, I suppose it would be them."},{"name":"TLAQATIA","text":"In the meanwhile, I shall focus on writing my thesis. I cannot wait to see what sort of exotic specimen you find for me this time!"},{"name":"SYSTEM","text":"Perhaps one of the knowledgeable Loporrits of Bestways Burrow could point you in the right direction..."},{"name":"TLAQATIA","text":"Would that I could join you on the moon, but this thesis isn't going to write itself!"},{"name":"LOPORRIT04166","text":"Well, hello there, <span class=\"highlight\">Forename</span>! Whatever brings you here today?"},{"name":"LOPORRIT04166","text":"You don't say! That strikes me as a rather curious thing to be researching, but to each their own, I suppose!"},{"name":"LOPORRIT04166","text":"At any rate, I do believe the most representative specimen of the aquatic ecosystem here is a fish we call the lunar lamenter. They're quite plentiful in the waters of Vallis Vulneris."},{"name":"LOPORRIT04166","text":"They're known to have a fondness for grey worms, which we suspect is one reason they taste so atrocious. Believe me, you won't find any of our chefs complaining if you take home your fair share!"},{"name":"LOPORRIT04166","text":"That said, it's most surprising to hear that the destruction of Zodiark has impacted your world so. Do be careful down there, yes?"},{"name":"LOPORRIT04166","text":"Did you manage to snag yourself any lunar lamenters? No matter how curious you might be, I strongly encourage you <span class=\"emphasis\">not</span> to try to eat one."},{"name":"LOPORRIT04166","text":"And do take care down on Etheirys. It sounds like things are rather...<span class=\"emphasis\">unstable</span> there."},{"name":"TLAQATIA","text":"You're back! I'd love nothing more than for you to regale me with tales of the moon, but before that─do I smell what I think I smell?"},{"name":"TLAQATIA","text":"Incredible! So <span class=\"emphasis\">this</span> is the sort of creature that dwells in the lunar seas! I can't wait to dig in and start examining it."},{"name":"TLAQATIA","text":"While there's no telling until I see the data, I'm quite confident that this discovery will allow me to revise my theory and complete my thesis!"},{"name":"TLAQATIA","text":"I'll be making my presentation at Phenomenon, but...to be honest, I've never been very good at talking in front of the senior faculty. Might you be so kind as so come sit in the audience? Just knowing that I had a friend among the audience would go a long way to putting my heart at ease."},{"name":"TLAQATIA","text":"Normally only the faculty and students are allowed to attend such events, but I'll have a word with the administrators. Given all you've contributed to my research, I can see no reason you shouldn't be permitted to attend."},{"name":"TLAQATIA","text":"Let's see, now... One, summarize my latest findings. Two, prepare my presentation. Oh, and I mustn't forget to check back in on the whale! Dear me, I feel like I'm being pulled in a hundred different directions..."},{"name":"UNIVERSITYSTAFF04166","text":"Ah, you must be Professor T'laqa Tia's guest. Please, go right in. I do believe your friend's presentation is about to get underway."},{"name":"TLAQATIA","text":"Ahem... Thank you for assembling here today, er, everyone. I am T'laqa Tia, an associate professor here in the Faculty of Aetherology, and today I would like to...um...present some recent findings from my research on, er...aether currents."},{"name":"TLAQATIA","text":"Ahem... My presentation is entitled “Aethertide: On the Waxing and Waning of Aether Levels in Underwater Currents.”"},{"name":"TLAQATIA","text":"Simply put, my hypothesis was thus: the world's underwater aether ebb and flow in tandem. When the concentration of aether drops in one area, it rises in another. This phenomenon repeats itself periodically."},{"name":"TLAQATIA","text":"Long did I believe this was so, but never was I able to accumulate sufficient data to prove it for certain. This all changed recently, thanks to the talents of a truly remarkable gleaner who risked life and limb to gather the samples I needed."},{"name":"TLAQATIA","text":"In the course of my research, however, I also discovered many things which I had never imagined at the outset. First and foremost among these was the aether Zodiark exerted upon those selfsame currents."},{"name":"TLAQATIA","text":"Now, as you all know, Zodiark is no more. As such, aether levels have temporarily fluctuated across our entire star as the aetheric state of our world gradually readjusts to how it was in the days of yore, before Zodiark came into being."},{"name":"TLAQATIA","text":"Having had the fortune recently to analyze some samples obtained from the lunar surface, it has become apparent that this fluctuation in aether levels was at its most dramatic during a full moon."},{"name":"TLAQATIA","text":"We have reason to suspect that the recent incident with the wayward whale was also caused by the selfsame phenomenon. In other words, a sudden change in the local aether levels caused it to suffer from symptoms akin to severe aether sickness."},{"name":"TLAQATIA","text":"Needless to say, this would be all mere speculation if it were not corroborated by concrete data. To that end, kindly turn to page fourteen in the booklets I have handed out and take a moment to peruse the chart on that page."},{"name":"PROFESSOR04166","text":"Quite fascinating. Many scholars stubbornly stick to their initial convictions despite the circumstances, but you have clearly taken even the most recent developments into consideration in fleshing out your thesis. Admirable, indeed."},{"name":"TLAQATIA","text":"You are too kind, Professor. And yet there is more I would share."},{"name":"TLAQATIA","text":"Utilizing my own findings in combination with some alchemical techniques I learned from my colleagues in Thavnair, I do believe I have crafted a spell that might help to stabilize the underwater aether currents."},{"name":"TLAQATIA","text":"More so than my academic findings, I believe <span class=\"emphasis\">this</span> to be my greatest accomplishment. Isolating the relationship between the moon and the underwater aether currents was an important first step, no doubt. But helping those suffering creatures will be of far greater import in the end."},{"name":"TLAQATIA","text":"Our planet is currently in a state of transition. I suspect the imbalance in aether levels will continue for quite a while still."},{"name":"TLAQATIA","text":"And so I intend to do everything in my power to minimize the effects of this on both beast and man until our aetheric environment stabilizes and returns to normal."},{"name":"PROFESSOR04166","text":"Thank you, T'laqa Tia. We shall inform you of your evaluation in due time. In the meanwhile, pray continue to attend to that poor beast in the harbor. We wish you the best of luck."},{"name":"TLAQATIA","text":"Thank you, Professor!"},{"name":"TLAQATIA","text":"There you are! I simply had to tell you before anyone else. My colleagues couldn't stop praising my thesis! And to say I could never have gotten to this day without your help would be an understatement."},{"name":"TLAQATIA","text":"Not only have I secured more funding to continue my research, but I've also been promoted to a full-fledged, tenured professor!"},{"name":"TLAQATIA","text":"I simply cannot believe that the day has come that I can wear this prestigious gown. Why, I've dreamed of this since the very first day I set foot in the Studium!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"It looks good on you."},{"name":"A2","text":"Your old outfit suited you better..."},{"name":"TLAQATIA","text":"Oh, you're far too kind! I've still a long way to go before I'd be worthy of this garb in the way that, say, Professor Nele is."},{"name":"TLAQATIA","text":"You know, I daresay sometimes I feel the same. Still, I shall do my best to prove myself worthy of the gown, as Professor Nele and those who came before me have been."},{"name":"NELE","text":"I always believed in T'laqa's potential, but I daresay he would have been hard-pressed to fulfill it were it not for his fortuitous meeting with you, <span class=\"highlight\">Forename</span>. For that, I, too, owe you my thanks."},{"name":"TLAQATIA","text":"Oh, and this is neither here nor there, really, but I received some rather delightful news recently from the Faculty of Medicine."},{"name":"TLAQATIA","text":"It would seem the professor there who was researching methods for treating the whale has developed an experimental medicine that can lessen the effects of aether sickness."},{"name":"TLAQATIA","text":"Even more fortunately, it is said to work even better on men than on beasts! Yes, with this new medicine at my disposal, I can finally take responsibility for my own fieldwork, and stop forcing generous gleaners such as yourself to travel in my stead."},{"name":"TLAQATIA","text":"Just think of all the places I'll go! Distant lands, the open sea...why, maybe even the moon! I simply can't wait to really stretch my legs and explore the world."},{"name":"TLAQATIA","text":"And with that, I'd best be off! But this isn't farewell─not by a long shot! I have no doubt our paths will cross again somewhere upon some distant sea. I thank you once again for everything, my friend!"},{"name":"TLAQATIA","text":"I'm standing here in this new gown, but to be honest, it still hasn't all sunk in."},{"name":"NELE","text":"Congratulations, T'laqa Tia. You have come far indeed, and you've earned every bit of it through your diligence and dedication."},{"name":"NELE","text":"And glad I am for it. For now I've seen you realize the potential I always knew you had, I can finally retire with my heart at ease."},{"name":"TLAQATIA","text":"R-Retire!? Professor Nele, what are you saying?"},{"name":"NELE","text":"No need to act so surprised. I've been considering it for quite some time now. I'm no spring chicken, and there's little reason for me to cling to my position when promising researchers like you wait in the wings."},{"name":"NELE","text":"Of course, I will continue to share my experiences with you if you so desire. But finding that which most inspires you and pursuing it with all of your body and soul—this is something you must do for yourself. I have already imparted all I can."},{"name":"NELE","text":"You were able to find this in yourself, in no small part through your chance encounter with <span class=\"highlight\">Forename</span>. I was happy to be there for you along the way, but I daresay you will fare well enough without me."},{"name":"TLAQATIA","text":"But...Professor!"},{"name":"NELE","text":"The future of aetherology is bright indeed as long as young talents like yourself continue your research here."},{"name":"NELE","text":"And so I very much look forward to hearing of your myriad achievements as I enjoy my golden years. And if you're ever in need of conversation, pray visit, that we might muse about the mysteries of the world─not as teacher and student, but as colleagues and friends."},{"name":"TLAQATIA","text":"That would be delightful, Professor. I could not have asked for a greater parting gift than your vote of confidence."},{"name":"TLAQATIA","text":"And thank you once again, <span class=\"highlight\">Forename</span>. I will be continuing my research here at the Studium, so do stop by whenever you would care to talk aetherology with a friend."},{"name":"TLAQATIA","text":"Likewise, I look forward to hearing even more about your adventures and the far-flung lands you've been exploring. And perhaps if you happen to come across any exotic species of fish, you could snag one or two for me? Just for old times' sake."},{"name":"SYSTEM","text":"T'laqa Tia could not be happier with your efforts. He now considers you a <span class=\"highlight\">Master Fisher</span>!"},{"name":"SYSTEM","text":"Keep an eye out for others at the Studium who require the help of an able artisan. You never know who might be in need of your skills."},{"name":"SYSTEM","text":"You have completed all of the Studium quests. It seems Qih Aliapoh has something she would like to ask of you."},{"name":"SYSTEM","text":"Pay a visit to Searchers' Meet should you wish to hear her out."}],"reward":{"gil":1260,"items":[{"id":33935,"one":1},{"id":33936,"one":1},{"id":33937,"one":1}]},"reqs":{"jobs":[{"lvl":90,"id":155}],"quests":[69701]}},"partials":[{"type":"npc","id":"1038551","obj":{"i":1038551,"n":"T'laqa Tia","l":3706,"q":7}},{"type":"npc","id":"1039239","obj":{"i":1039239,"n":"T'laqa Tia","l":3706,"q":1}},{"type":"item","id":"33935","obj":{"i":33935,"n":"Gatherer's Guerdon Materia X","l":560,"c":20288,"t":58,"materia":{"tier":9,"value":25,"attr":"Gathering","category":2}}},{"type":"item","id":"33936","obj":{"i":33936,"n":"Gatherer's Guile Materia X","l":560,"c":20288,"t":58,"materia":{"tier":9,"value":25,"attr":"Perception","category":2}}},{"type":"item","id":"33937","obj":{"i":33937,"n":"Gatherer's Grasp Materia X","l":560,"c":20288,"t":58,"materia":{"tier":9,"value":10,"attr":"GP","category":2}}},{"type":"item","id":"35850","obj":{"i":35850,"n":"Lunar Lamenter","l":560,"c":29767,"t":63}},{"type":"quest","id":"69701","obj":{"i":69701,"n":"Fish Time Forgot","g":177,"l":"Old Sharlayan","s":0}}]}