{"quest":{"name":"Fish Time Forgot","location":"Old Sharlayan","id":69701,"patch":6.0,"sort":0,"eventIcon":71221,"issuer":1038551,"target":1038551,"genre":177,"journal":["T'laqa Tia is pondering the past.","T'laqa Tia has asked that you supply him with smaragdos for data collection purposes.<br><br>※Smaragdos can be fished from Lethe in Elpis using a sky spoon lure as bait.<br><br>※Minimum collectability rating for this delivery is 503. Delivering items with a rating of 1183 or more will earn greater rewards.","You deliver the smaragdos to T'laqa Tia. It seems the associate professor has some soul-searching to do before he will be ready to submit his thesis."],"objectives":["Catch smaragdos from Lethe in Elpis and deliver them to T'laqa Tia."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must complete the main scenario quest “Thou Must Live, Die, and Know.”"},{"name":"TLAQATIA","text":"Oh, hello there. I've been racking my brains trying to come up with new ideas. Alas, nothing has come to me thus far."},{"name":"TLAQATIA","text":"No matter how much I ponder, I keep coming back to the same thought. I have to get my hands on some specimens from a time before Zodiark came to be."},{"name":"TLAQATIA","text":"I simply can't accept that all the work I have put─<span class=\"emphasis\">we</span> have put─into confirming my theory might amount to naught in the end!"},{"name":"TLAQATIA","text":"You know what? Give me any idea you've got, no matter how outlandish it may seem. Please, <span class=\"highlight\">Forename</span>! I am in dire need of inspiration!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"So all you need is an ancient fish, right?"},{"name":"A1","text":"You'd be surprised at what I can do..."},{"name":"TLAQATIA","text":"Oh, but you─ Wait... Do you truly mean it?"},{"name":"TLAQATIA","text":"As a scholar, I would love to probe deeper into the details of exactly how you mean to do this, but this is hardly the time for idle chatter. If you can indeed procure this sample for me, I beg of you, please do it!"},{"name":"TLAQATIA","text":"Why, this could very well be the solution to what I thought an insurmountable problem!"},{"name":"TLAQATIA","text":"Ideally, I would examine an ancient specimen that shares some common traits with creatures that still exist today. Reading through Professor Nele's tomes, I remember thinking that a species called the smaragdos would be perfect."},{"name":"TLAQATIA","text":"I know not where you mean to find them, but I wish you safety and good fortune in your journey, <span class=\"highlight\">Forename</span>."},{"name":"SYSTEM","text":"Use a sky spoon lure to fish some smaragdos from Lethe in Elpis, and deliver them to T'laqa Tia."},{"name":"TLAQATIA","text":"Someday, when I am done with my thesis, you will have to tell me all about how you seemingly can do the impossible."},{"name":"SYSTEM","text":"Use a sky spoon lure to fish some smaragdos from Lethe in Elpis, and deliver them to T'laqa Tia."},{"name":"TLAQATIA","text":"Are my eyes to be believed? An actual smaragdos! I never imagined I'd see one outside of a book! I know not how you accomplished this, <span class=\"highlight\">Forename</span>, but you have my eternal gratitude."},{"name":"TLAQATIA","text":"Are my eyes to be believed? An actual smaragdos─and it's even more impressive than anything I saw in my books! I know not how you accomplished this, <span class=\"highlight\">Forename</span>, but you have my eternal gratitude."},{"name":"TLAQATIA","text":"Ah, <span class=\"highlight\">Forename</span>! I've just finished my preliminary analysis of the smaragdos, and─needless to say─it has proved truly fascinating!"},{"name":"TLAQATIA","text":"Incidentally, I recently overheard some of the senior members of the faculty discussing the days before the world was sundered. This led to me wondering just how far back you traveled."},{"name":"TLAQATIA","text":"I have long heard rumors of a collective of goblin scientists who were attempting to traverse the fabric of time itself. To be honest, I always thought it a mere jest. But is it possible you used such a method to journey into the past yourself...?"},{"name":"TLAQATIA","text":"But I will not ask you to reveal your secrets─not now. You have provided me with exactly what I need to break this impasse in my research, and I must seize the opportunity!"},{"name":"TLAQATIA","text":"At any rate, examining the relative states of the smaragdos' scales, it appears quite evident that the levels of aether in the underwater currents fluctuated regularly even in those pre-Zodiark days."},{"name":"TLAQATIA","text":"That said, the shifts in concentration appear much gentler compared to the present day. I suspect that the inflated aether levels of the moon caused by the presence of Zodiark are the key to explaining this change."},{"name":"TLAQATIA","text":"Put simply, these recent incidents have a manifestation of aether levels returning to how they once were so very long ago."},{"name":"TLAQATIA","text":"Frankly, I should be elated─this effectively proves my hypothesis correct. However, something does not sit right with me..."},{"name":"TLAQATIA","text":"I feel like I must do more than just identify what is happening. How can I sit around here in my office poring over specimens and tomes while these poor sea creatures are suffering? The next whale might very well come ashore to its doom like the fish in Thavnair!"},{"name":"TLAQATIA","text":"Oh, thank you for coming, Professor Nele! I am most pleased to say that with <span class=\"highlight\">Forename</span>'s help, I believe I'll finally be able to finish my thesis!"},{"name":"NELE","text":"Is this to say that you truly were able to obtain a specimen from ancient times? Impressive. Yes, most impressive indeed..."},{"name":"NELE","text":"...Truth be told, the senior faculty of the Studium have been aware of this form of travel for some time now. Sadly, as much as I argued your case, I was strictly forbidden from granting you access to it."},{"name":"NELE","text":"Fortunate you are to have <span class=\"highlight\">Forename</span> at your side. With your diligence and aptitude, and <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> unparalleled gleaning skills, I am expecting greater and greater things from your thesis."},{"name":"TLAQATIA","text":"I knew it! So if I am promoted to full professorship, I might gain access to that knowledge as well? Then I must work even harder toward that goal!"},{"name":"TLAQATIA","text":"And yet, at the same time, I find myself with a dilemma. Is it not selfish of me to focus entirely on my own research at a time like this? Is it not my duty as a scholar to help in a more concrete manner?"},{"name":"NELE","text":"Very astute questions, those. And questions for which you must find your own answer."},{"name":"NELE","text":"Of course, none would object if you were to publish your findings. You've done more than enough to support up-and-coming researchers at the Studium, and your work will doubtless prove a fine starting point for any who wish to explore the subject further."},{"name":"NELE","text":"There are plenty of academics who are driven wholly by their own curiosity. Who devote their entire lives to their studies, and research for its own sake."},{"name":"NELE","text":"However, there is also demand for another type of researcher: one who uses their findings to seek out tangible solutions to the problems of our world."},{"name":"NELE","text":"Your research has brought you face-to-face with innocent creatures in peril, and united you with a brave companion who has traveled to the edge of the world─and beyond─for you. It is little surprise that you might find new motivation from their presence."},{"name":"NELE","text":"Yet at the end of the day, it is your choice to make. You must decide what inspires you most as a scholar. That is all I can say."},{"name":"TLAQATIA","text":"As always, Professor Nele has given me much to ponder. Up until now, I'd simply enjoyed solving the mysteries of the world through my research. Only now have I begun to realize there may be more to it than that."},{"name":"TLAQATIA","text":"Forgive me, but I would like to consider the matter further. Might I be able to count on your aid again once my mind is made up?"},{"name":"TLAQATIA","text":"I swear, I feel there are no limits to what I might achieve as long as you're by my side!"},{"name":"SYSTEM","text":"T'laqa Tia is thrilled with your efforts. He now considers you a <span class=\"highlight\">Fantastic Fisher</span>!"},{"name":"SYSTEM","text":"The next request will be available from T'laqa Tia upon reaching level 90 as a fisher."},{"name":"SYSTEM","text":"In order to undertake the subsequent quest, you must first complete the main scenario quest “Endwalker.”"}],"reward":{"items":[{"num":2,"id":36061}]},"reqs":{"jobs":[{"lvl":88,"id":155}],"quests":[69700]},"next":[69702]},"partials":[{"type":"npc","id":"1038551","obj":{"i":1038551,"n":"T'laqa Tia","l":3706,"q":7}},{"type":"item","id":"36061","obj":{"i":36061,"n":"Sideritis Cookie","l":554,"c":24051,"t":46}},{"type":"quest","id":"69700","obj":{"i":69700,"n":"The Wandering Whale","g":177,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69702","obj":{"i":69702,"n":"Pastures New","g":177,"l":"Old Sharlayan","s":0}}]}