{"quest":{"name":"A Place to Train","location":"Radz-at-Han","id":69709,"patch":6.0,"sort":2201,"unlocksFunction":1,"eventIcon":71341,"issuer":1041747,"target":1040741,"genre":122,"journal":["A hardy-looking Radiant is waiting for you with word of a new facility."],"objectives":["Speak with the sharp-eyed Radiant at Palaka's Stand."],"dialogue":[{"name":"STARWARRIORA04171","text":"Hail, adventurer! I had sincerely hoped you might return to this fair city of ours someday."},{"name":"STARWARRIORA04171","text":"After all, it is thanks to you and the Scions that I am standing before you now! And as a token of my gratitude, I wish to share something useful with you."},{"name":"STARWARRIORA04171","text":"Although I shan't be the one doing the sharing: seek out my sharp-eyed comrade at Palaka's Stand for further details, adventurer. Godsspeed!"},{"name":"STARWARRIORA04171","text":"I shan't spoil the surprise, but I promise it will be worth your while!"},{"name":"STARWARRIORB04171","text":"Aha! You must be the adventurer I've heard so much about. Yes... That gleam in your eyes suggests you might be worthy of the Burning Field after all."},{"name":"STARWARRIORB04171","text":"Ah... Forgive me. I suppose I ought to show more respect to the hero of Radz–at–Han. You are doubtless quite busy, so I won't waste your time."},{"name":"STARWARRIORB04171","text":"Permit me to introduce to you the Burning Field, esteemed training arena where we Radiant hone our skills in preparation for felling our enemies in combat."},{"name":"STARWARRIORB04171","text":"You'll find no distractions there─just you and a wooden dummy. Imagine that a fearsome foe stands before you, and strike it with all your might. The design of the dummy itself originates from the Far East, as does the practice of bashing it repeatedly to attain martial mastery.<br>It is said that, “<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> who fights with strength of stone unyielding, breathes deep of boundless sky and embraces serenity of rolling sea, against <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> none can stand.”"},{"name":"STARWARRIORB04171","text":"Heh... I can tell you're eager to start training right away. Yes, I've no doubts you're worthy of such a place."},{"name":"STARWARRIORB04171","text":"In that case, feel free to practice there as you see fit. Simply speak with me when you wish to begin and I shall be your guide."},{"name":"STARWARRIORB04171","text":"I believe I speak on behalf of the Radiant Host when I say it is an honor to provide assistance to an adventurer such as yourself. And with that, let the striking commence!"},{"name":"SYSTEM","text":"You now have access to the Burning Field─an expansion of Stone, Sky, Sea. This training ground can be accessed by speaking with the sharp-eyed Radiant at Palaka's Stand."}],"reward":{"gil":699},"reqs":{"jobs":[{"lvl":90,"id":34}],"questsType":"all","quests":[70000,67654]}},"partials":[{"type":"npc","id":"1041747","obj":{"i":1041747,"n":"Hardy-looking Radiant","l":3707,"q":1}},{"type":"npc","id":"1040741","obj":{"i":1040741,"n":"Sharp-eyed Radiant","l":3709,"q":1}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}},{"type":"quest","id":"67654","obj":{"i":67654,"n":"A Striking Opportunity","g":101,"l":"Idyllshire","s":6000,"f":1}}]}