{"quest":{"name":"That Specimen Came from the Moon","location":"Old Sharlayan","id":69713,"patch":6.0,"sort":30010,"unlocksFunction":1,"eventIcon":71341,"issuer":1037060,"target":1037059,"genre":119,"journal":["Northota is looking decidedly smug."],"objectives":["Speak with J'lakshai."],"dialogue":[{"name":"SYSTEM","text":"Associate guildship hunts will be available once you have fulfilled certain conditions within the main scenario quests for Endwalker."},{"name":"NORTHOTA","text":"Good to see you, <span class=\"highlight\">Forename</span>. I've heard a great deal about your recent exploits─as has everyone else!"},{"name":"NORTHOTA","text":"That's why I feel confident recommending you for associate-level hunts. The challenges you face from here on out will be significantly tougher to contend with, but I wager you can handle them─you've yet to give me reason to believe otherwise!"},{"name":"NORTHOTA","text":"Associate specimens are not only more threatening, but also more difficult to track down. You'll have to seek them out in the world's most inaccessible and inhospitable reaches─like bloody Garlemald. Gods, I hate that place."},{"name":"NORTHOTA","text":"Now, if Ilsabard's unfriendly north was our only problem, I'd simply remind you to strap on your furs and take some ale for the road, but... Well, perhaps it's best if you ask J'lakshai what <span class=\"emphasis\">she's</span> working on. There's nothing quite like hearing it straight from the chocobo's mouth."},{"name":"NORTHOTA","text":"No, no, I do think I'll leave this bit to J'lakshai. Don't worry, she won't bite."},{"name":"JLAKSHAI","text":"Yes, yes, I heard from here. If Northota insists, I will tell you <span class=\"emphasis\">precisely</span> what I'm dealing with at the moment."},{"name":"JLAKSHAI","text":"Let's look at this request from Chrysielle, shall we? She's Sharlayan's sole xenobiologist─a self-proclaimed one, mind you─and it's her raison d'être to prove that life exists upon stars other than our own."},{"name":"JLAKSHAI","text":"The astronomers have long since banned her from their meetings and refuse any request she makes on principle, but alas, we have no such luxury. She's been demanding samples from the moon for some time now, despite the obvious impossibility of acquiring them."},{"name":"JLAKSHAI","text":"Associate hunts often present such challenges─ones with no ready solution. Though we gleaners pride ourselves on our resourcefulness, all we can do in such cases is post them on the board and hope for a miracle."},{"name":"JLAKSHAI","text":"Try telling that to the clients, though..."},{"name":"JLAKSHAI","text":"In any case, I would be thankful if you'd take a look at the board and try your hand at any bills that suit you. The guildship has high hopes for your success! ...No pressure, of course."},{"name":"SYSTEM","text":"Associate guildship mark bills are now available."},{"name":"SYSTEM","text":"You are now permitted to take bills for associate hunts from guildship hunt boards found in Old Sharlayan and Radz-at-Han."},{"name":"SYSTEM","text":"New quests and senior marks will become available from Northota in Old Sharlayan upon reaching level 89."}],"reward":{"gil":751},"reqs":{"jobs":[{"lvl":83,"id":34}],"quests":[69712]},"next":[69714]},"partials":[{"type":"npc","id":"1037060","obj":{"i":1037060,"n":"Northota","l":3706,"q":4}},{"type":"npc","id":"1037059","obj":{"i":1037059,"n":"J'lakshai","l":3706,"s":3,"q":3,"t":"Guildship Hunt Vendor","r":1,"a":3827,"c":[11.96,13.3]}},{"type":"quest","id":"69712","obj":{"i":69712,"n":"The Hunt for Specimens","g":119,"l":"Old Sharlayan","s":30001,"f":1}},{"type":"quest","id":"69714","obj":{"i":69714,"n":"A Hunt for the Ages","g":119,"l":"Old Sharlayan","s":30020,"f":1}}]}