{"quest":{"name":"Sights of the End","location":"Old Sharlayan","id":69710,"patch":6.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1040955,"target":1040955,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"BABETHIRONHEART","text":"Beg pardon, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. I could scarce help but notice that sightseeing log on your person. You wouldn't happen to be the adventurer my niece wrote about...would you?"},{"name":"BABETHIRONHEART","text":"...Aha! So it <span class=\"emphasis\">is</span> you. Pleased to make your acquaintance. I am Babeth Ironheart, Millith's aunt and seasoned explorer."},{"name":"BABETHIRONHEART","text":"Be a dear and hand me that log of yours. Millith told me all about how she helped you embark on explorations of your own, so it's only right that I share with you some wisdom of my own."},{"name":"BABETHIRONHEART","text":"Let me see here... Oh, I can't forget to mention that... And done!"},{"name":"BABETHIRONHEART","text":"You should be all set, dear. I've jotted down everything I've heard about the most remarkable vistas the realm has to offer."},{"name":"BABETHIRONHEART","text":"Of course, a few notes I've shared are naught more than rumors─some describing locales so fantastical that I can barely believe they exist. But as I always say, the true joy of exploration lies not in the destination, but in the journey."},{"name":"BABETHIRONHEART","text":"So go forth, dear, and see what sort of journey these hints take you on. That sightseeing log of yours won't fill itself, you know!"},{"name":"SYSTEM","text":"Endwalker entries have been added to your sightseeing log!"},{"name":"SYSTEM","text":"You must be level 80 or above to record Endwalker vistas. Travel to the location indicated and fulfill the necessary conditions and you will complete the entry for that vista, earning experience points in the process."},{"name":"SYSTEM","text":"Use your wits and the notes provided by Babeth to identify these stunning sights and the proper way to appreciate them, and see Thavnair, Sharlayan, and beyond as only the greatest explorers have seen them!"},{"name":"BABETHIRONHEART","text":"（★未使用／削除予定★）"},{"name":"SYSTEM","text":"（★未使用／削除予定★）"}],"reqs":{"jobs":[{"lvl":80,"id":1}],"questsType":"all","quests":[65698,69894]}},"partials":[{"type":"npc","id":"1040955","obj":{"i":1040955,"n":"Babeth Ironheart","l":3706,"q":1}},{"type":"quest","id":"65698","obj":{"i":65698,"n":"A Sight to Behold","g":92,"l":"Gridania","s":200,"f":1}},{"type":"quest","id":"69894","obj":{"i":69894,"n":"Old Sharlayan, New to You","g":11,"l":"Old Sharlayan","s":512}}]}