{"quest":{"name":"A Hunt for the Ages","location":"Old Sharlayan","id":69714,"patch":6.0,"sort":30020,"unlocksFunction":1,"eventIcon":71341,"issuer":1037060,"target":1037059,"genre":119,"journal":["Northota is feeling the effects of the Forum's proclamation."],"objectives":["Speak with J'lakshai."],"dialogue":[{"name":"SYSTEM","text":"Senior marks will be available once you have fulfilled certain conditions within the main scenario quests for Endwalker."},{"name":"NORTHOTA","text":"'Tis good to see you, <span class=\"highlight\">Forename</span>! I'm not sure if you're aware, but the scholarly world has been in an uproar since the Forum announced their plans for the mass exodus. To think that we may well step foot on the very moon..."},{"name":"NORTHOTA","text":"We expected that once word got out, we might receive more requests for lunar samples than was previously considered acceptable. What we did <span class=\"emphasis\">not</span> expect was the veritable deluge of absurdity unleashed upon us."},{"name":"NORTHOTA","text":"We've designated the most mind-boggling requests “senior” bills. At this point, any assistance you can provide would be more than welcome."},{"name":"NORTHOTA","text":"J'lakshai is in the midst of organizing the latest offerings─why don't you speak with her to get a better idea of what to expect?"},{"name":"NORTHOTA","text":"J'lakshai is currently organizing the senior mark bills. Why don't you speak with her to get a better idea of what to expect?"},{"name":"JLAKSHAI","text":"Aye, I heard your conversation─these ears aren't just for show. As for what plagues me at the moment..."},{"name":"JLAKSHAI","text":"Here we are─Basildere. Both emblematic of our woes with senior bills, and direct source of many."},{"name":"JLAKSHAI","text":"Basildere is a highly esteemed scholar of mythological studies. He has a pet theory that the creatures described in myths can be traced to those that once existed in ancient times."},{"name":"JLAKSHAI","text":"Simply put, he requests samples from ancient organisms─organisms which I need not remind you <span class=\"emphasis\">no longer exist</span>. The audacity! Are we meant to travel through time for him!? "},{"name":"JLAKSHAI","text":"...And there you have it. &lt;sigh&gt; Take a look at the guildship hunt board, and if there's anything─and I mean <span class=\"emphasis\">anything</span> at all─that you think you can handle, please do. You're our only hope."},{"name":"SYSTEM","text":"Senior guildship mark bills are now available."},{"name":"SYSTEM","text":"You are now permitted to take bills for senior marks from guildship hunt boards in Old Sharlayan and Radz-at-Han."},{"name":"SYSTEM","text":"New quests and elite guildship marks will be available from Northota in Old Sharlayan upon reaching level 90."},{"name":"NORTHOTA","text":"（★未使用／削除予定★）"}],"reward":{"gil":781},"reqs":{"jobs":[{"lvl":89,"id":34}],"quests":[69713]},"next":[69715]},"partials":[{"type":"npc","id":"1037060","obj":{"i":1037060,"n":"Northota","l":3706,"q":4}},{"type":"npc","id":"1037059","obj":{"i":1037059,"n":"J'lakshai","l":3706,"s":3,"q":3,"t":"Guildship Hunt Vendor","r":1,"a":3827,"c":[11.96,13.3]}},{"type":"quest","id":"69713","obj":{"i":69713,"n":"That Specimen Came from the Moon","g":119,"l":"Old Sharlayan","s":30010,"f":1}},{"type":"quest","id":"69715","obj":{"i":69715,"n":"Perfect Specimens","g":119,"l":"Old Sharlayan","s":30030,"f":1}}]}