{"quest":{"name":"A Waiting Love","location":"Old Sharlayan","id":69716,"patch":6.0,"sort":10,"eventIcon":71221,"issuer":1039336,"target":1039336,"genre":119,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The waiting woman sighs with impatience."],"objectives":["Search for the brown-haired councilor near Nyunkrepf's Sight.","Get the brown-haired councilor's attention with a /poke.","Speak with the waiting woman."],"dialogue":[{"name":"WAITINGWOMEN","text":"&lt;sigh&gt; How long must I wait...?"},{"name":"WAITINGWOMEN","text":"Oh, forgive me, I was just...thinking out loud. I made plans to meet my paramour, you see, but the time of our rendezvous is long past."},{"name":"WAITINGWOMEN","text":"As a member of the Forum, his work keeps him ever so busy─even more so than usual, in recent days. Still, he promised he would put some time aside for me... For us."},{"name":"WAITINGWOMEN","text":"...I don't suppose your wanderings will take you anywhere near Nyunkrepf's Sight today, will they? I need someone to check if he's there, while I stay here─just in case."},{"name":"WAITINGWOMEN","text":"Thank you ever so much! My tardy sweetheart is an Auri man. Brown hair. Serious mien. Should you happen to spot him, pray convey the state of my rapidly mounting impatience!"},{"name":"WAITINGWOMEN","text":"I won't wait for him forever, you know! Two or three bells at the most! Perhaps four."},{"name":"BROWNHAIRCONGRESSMAN","text":"If we are to efficiently supply the... &lt;mumble&gt; &lt;mumble&gt; ...requisition requests for the gleaners, and... &lt;mumble&gt; &lt;mumble&gt; ...no time for mistakes..."},{"name":"SYSTEM","text":"The Auri man appears to be lost in contemplation. Perhaps a gentle <span class=\"highlight\">poke</span> will get his attention."},{"name":"BROWNHAIRCONGRESSMAN","text":"&lt;mumble&gt; &lt;mumble&gt; ...really <span class=\"emphasis\">must</span> focus..."},{"name":"SYSTEM","text":"The Auri man appears to be lost in contemplation. Perhaps a gentle <span class=\"highlight\">poke</span> will get his attention."},{"name":"BROWNHAIRCONGRESSMAN","text":"By Thaliak's quill! Where did you spring from!?"},{"name":"BROWNHAIRCONGRESSMAN","text":"...She grows tired of waiting? I'm not sure I─"},{"name":"BROWNHAIRCONGRESSMAN","text":"Oh gods, that was <span class=\"emphasis\">today</span>!? I was so engaged with my tasks, that I─ Ahem! I must go to her immediately!"},{"name":"BROWNHAIRCONGRESSMAN","text":"And you! You must be rewarded for this service. Come along, please. Quickly, now, quickly!"},{"name":"WAITINGWOMEN","text":"Well, my sweetheart finally arrived thanks to your gentle reminder. He looked so exhausted from his endless labors, however, that I sent him home to rest."},{"name":"WAITINGWOMEN","text":"I had a feeling he would be at Nyunkrepf's Sight... They say that spur of rock was where the eponymous Archon used to sit when he had matters to meditate upon."},{"name":"WAITINGWOMEN","text":"My habitually late love holds Nyunkrepf in great esteem, both for his role as the founder of Sharlayan, and the ark he built to save people from the floodwaters of the Sixth Umbral Calamity."},{"name":"WAITINGWOMEN","text":"Thus I have an inkling of where to look when the appointed time of our trysts has passed. In any case, I should go and be with him whilst we still have some spare moments to enjoy."},{"name":"WAITINGWOMEN","text":"Oh, but I mustn't forget your reward. A little token of appreciation, from the two of us to you."}],"reward":{"gil":815},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69894]}},"partials":[{"type":"npc","id":"1039336","obj":{"i":1039336,"n":"Waiting Woman","l":3706,"q":1}},{"type":"quest","id":"69894","obj":{"i":69894,"n":"Old Sharlayan, New to You","g":11,"l":"Old Sharlayan","s":512}}]}