{"quest":{"name":"Scholarly Perspective","location":"Old Sharlayan","id":69717,"patch":6.0,"sort":20,"eventIcon":71221,"issuer":1037211,"target":1037211,"genre":119,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>You seem to have caught Bhaldswys's interest."],"objectives":["Speak with the statue gazer.","Speak with the statue gazer again.","Speak with Bhaldswys."],"dialogue":[{"name":"BHALDSWYS","text":"Hello, friend, are you new to Sharlayan? You have that look about you."},{"name":"BHALDSWYS","text":"I thought as much. Oh, I'm not bothering you, am I? I so rarely meet travelers from beyond our shores, and couldn't pass up an opportunity to broaden my horizons."},{"name":"BHALDSWYS","text":"Can I assume a visitor such as yourself is eager to do the same? If you've an interest in learning about this city's history, for example, then I know the perfect person to give you an impromptu lesson."},{"name":"BHALDSWYS","text":"Head on over to Scholar's Harbor, and keep an eye out for a black-haired Roegadyn. That would be my brother. He'll know the tale of any pillar and statue you care to point out, and would be more than happy to share it with you!"},{"name":"BHALDSWYS","text":"As I said, if you've any interest in history, then seek out my brother over at Scholar's Harbor. I'm sure he won't mind the company─in fact, he'll likely talk your ear off!"},{"name":"THALIAKWATCHER","text":"Yes, was there something I might help you with?"},{"name":"THALIAKWATCHER","text":"...Ah, my dear sister, you say? Well, she did indeed send you to the right man, for who better to teach you about Sharlayan's history than a Studium-certified history professor!"},{"name":"THALIAKWATCHER","text":"Here, take my spyglass. Go on, take it─no time like the present to learn about the past! We shall begin your education with divine Thaliak, the Scholar Himself."},{"name":"SYSTEM","text":"Inspect the statue of Thaliak. You may move the camera, as well as zoom in and out. Target a section and examine it in more detail with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"THALIAKWATCHER","text":"And there you have it! I hope you enjoyed your introduction to Sharlayan historical architecture."},{"name":"THALIAKWATCHER","text":"If we are to do justice to the towering Thaliak, however, there is one last snippet of knowledge that we simply cannot overlook. Come along! To the foot of the statue!"},{"name":"THALIAKWATCHER","text":"Pray direct your attention to yon doors."},{"name":"THALIAKWATCHER","text":"Behind them, nestled within the statue itself, is a chamber known as the Pathless Way."},{"name":"THALIAKWATCHER","text":"Those who have acquired mastery over specialized disciplines, or whose deeds have led to significant advances in their chosen field, are invited to enter said chamber and receive the title of “Archon.”"},{"name":"THALIAKWATCHER","text":"We place great value on the pursuit of knowledge, and thus the Archons are held in especially high regard. As the embodiment of our ideals, they are permitted to browse the forbidden archives, and have ever stood at the center of our nation's greatest achievements."},{"name":"THALIAKWATCHER","text":"Now, as for the most secret and sacred ceremony which awards them their title, I am afraid that even I am not privy to the particulars. You will forgive me my ignorance on this subject, I hope?"},{"name":"THALIAKWATCHER","text":"A scholar and a <span class=\"alternative-container\"><span class=\"alternative\">gentlewoman</span><span class=\"alternative\">gentleman</span></span>! And thus concludes the lesson─should you happen to return by the same route, pray convey my warmest regards to Bhaldswys."},{"name":"BHALDSWYS","text":"Ah, you've just come back from hearing one of my brother's lectures, haven't you. That's another look I'm quite familiar with."},{"name":"BHALDSWYS","text":"His breadth of historical knowledge is extensive─sufficient to earn him the title of Archon, he hopes. The problem is, if his contributions to the field are to be officially acknowledged, he must have written recommendations from high-ranking professors. But in these tumultuous times, such ceremonial concerns have been pushed to one side."},{"name":"BHALDSWYS","text":"And so he idles away his spare moments at the harbor now, just gazing out at the ocean. I thought having an eager student might relight his spark...which is why I jumped at the chance to speak with you."},{"name":"BHALDSWYS","text":"I must apologize for not being more honest with my intentions. Please accept this gift for your troubles, and allow me to welcome you once more to Sharlayan!"}],"reward":{"gil":815},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69894]}},"partials":[{"type":"npc","id":"1037211","obj":{"i":1037211,"n":"Bhaldswys","l":3706,"q":1}},{"type":"quest","id":"69894","obj":{"i":69894,"n":"Old Sharlayan, New to You","g":11,"l":"Old Sharlayan","s":512}}]}