{"quest":{"name":"A Literary Delivery","location":"Old Sharlayan","id":69718,"patch":6.0,"sort":30,"eventIcon":71221,"issuer":1039509,"target":1039509,"genre":119,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Toffwyb seems excited to meet a real-life adventurer."],"objectives":["Deliver the books.","Speak with Toffwyb."],"dialogue":[{"name":"TOFFWYB","text":"Are you... Are you one of those adventuring types I've heard so much about!? Oh, but this is perfect! I just happen to have an errand of the kind that adventurers love! Or so I'm told."},{"name":"TOFFWYB","text":"I'm holding on to some volumes my customers ordered in, but instead of coming to pick them up, they've all decided that they want their goods delivered. So, I find myself in need of a delivery drudge...er, person. Might that person be you!?"},{"name":"TOFFWYB","text":"Huzzah! Let me give you the details, then. All in all, there are three books on the delivery docket."},{"name":"TOFFWYB","text":"The first, <span class=\"emphasis\">Ishgardian Astrology: A Comprehensive Theory</span>, should be handed to the servant at Albright Manor. <span class=\"emphasis\">The White Yonder</span> is for a certain talkative booklover who you'll know by the constant stream of chatter. And the last, <span class=\"emphasis\">Narrow Road through the Deep Grass</span>, goes to one of the toughest, most unflappable gleaners I have ever met."},{"name":"TOFFWYB","text":"I'll just mark their locations on this handy map...like so. The books are bought and paid for─no need to collect any coin─but do return to me for your own reward!"},{"name":"TOFFWYB","text":"If you just throw the books in the harbor, I <span class=\"emphasis\">will</span> find out. Not that I think you would! ...I'm watching you."},{"name":"MAIDINSEVESTRE","text":"Welcome to Albright Manor! ...Do you have an appointment?"},{"name":"MAIDINSEVESTRE","text":"Ah, yes, one copy of <span class=\"emphasis\">Ishgardian Astrology: A Comprehensive Theory</span>, just as his lordship requested."},{"name":"MAIDINSEVESTRE","text":"I must confess to some confusion, however... What interest would his lordship, an esteemed practitioner of Sharlayan astrology, have in such an outdated Ishgardian discipline?"},{"name":"MAIDINSEVESTRE","text":"...Not that I am in any position to question his lordship's reading habits, of course. Ahem. On your way, then."},{"name":"CHATTYBIBLIOPHILIA","text":"Please tell me you've brought my new book! I've been waiting for what feels like <span class=\"emphasis\">ages</span> for the latest shipment to arrive!"},{"name":"CHATTYBIBLIOPHILIA","text":"Yes! Finally! Did you know <span class=\"emphasis\">The White Yonder</span> was written by a lad of fourteen years? I myself questioned how reliable such a work could possibly be, but a Far Eastern colleague with whom I've been exchanging correspondence says he absolutely swears by it."},{"name":"CHATTYBIBLIOPHILIA","text":"It describes the wonders of the Abalathian Sea of Clouds in exquisite detail, and is, by all accounts, a roaring good read. The bit about the fighting paissas is said to be an especially entertaining episode."},{"name":"CHATTYBIBLIOPHILIA","text":"Well, I should let you return to your deliveries and whatnot. Thank you kindly for putting this long-awaited treat into my ever-so-grateful hands!"},{"name":"FEARLESSGLEANER","text":"...Something I can help you with?"},{"name":"FEARLESSGLEANER","text":"Ah, is that my book? Good. I need it for my journey."},{"name":"FEARLESSGLEANER","text":"I usually don't have a great deal of time for reading, but as I'm leaving for Othard on requisition duty, I wanted to do some research on Far Eastern cultures. I know little of the peoples of the Azim Steppe..."},{"name":"FEARLESSGLEANER","text":"Hm... It says here that “there are fifty-one distinct Xaela tribes, each with their own customs and traditions. The Buduga, for example, are exclusively male, and are known for kidnapping male outsiders to replenish lost numbers...”"},{"name":"FEARLESSGLEANER","text":"Is...is this accurate!? I'll need to tread carefully, it seems. Thank you for the timely delivery."},{"name":"TOFFWYB","text":"All safely delivered? Hah! Of course they were!"},{"name":"TOFFWYB","text":"My shop is well known for carrying publications not only from Sharlayan authors, but from all manner of foreign chroniclers and tale-tellers. Meaning every time a new shipment comes in, I'm faced with an avalanche of work."},{"name":"TOFFWYB","text":"I would've been buried alive without your assistance today, so here's a little something to show my gratitude. Go on, you've earned it!"}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69894]}},"partials":[{"type":"npc","id":"1039509","obj":{"i":1039509,"n":"Toffwyb","l":3706,"q":1}},{"type":"quest","id":"69894","obj":{"i":69894,"n":"Old Sharlayan, New to You","g":11,"l":"Old Sharlayan","s":512}}]}