{"quest":{"name":"The Hunt for Specimens","location":"Old Sharlayan","id":69712,"patch":6.0,"sort":30001,"unlocksFunction":1,"eventIcon":71341,"issuer":1041960,"target":1037060,"genre":119,"journal":["The diminutive gleaner is on the lookout for an able-bodied adventurer."],"objectives":["Speak with Northota."],"dialogue":[{"name":"LITTLEGLEANER04176","text":"...Do my eyes deceive me, or are you <span class=\"highlight\">Forename Surname</span>?"},{"name":"LITTLEGLEANER04176","text":"Well, as I live and breathe, it <span class=\"emphasis\">is</span> you. Ha! I knew I'd be the first to track you down. Who's the guildship's top hunter now, eh!?"},{"name":"LITTLEGLEANER04176","text":"Wait─you <span class=\"emphasis\">have</span> heard of guildship hunts, yes? They are not so different from the hunts you're familiar with in Eorzea, as I understand it. I'd wager they're rather more challenging, but an adventurer of your caliber would never turn down a challenge, would you?"},{"name":"LITTLEGLEANER04176","text":"No, no you would not! Pray speak with Northota at the peristyle to register your interest at your earliest convenience."},{"name":"NORTHOTA","text":"Aye, I'm Northota. Have you come to place a bounty on an unruly beast?"},{"name":"NORTHOTA","text":"By the Scholar! You're <span class=\"highlight\">Forename</span>? I was half-convinced I'd set the others an impossible task, asking them to find you."},{"name":"NORTHOTA","text":"The gleaners' guildship has begun posting hunt bills, you see, in the hopes that capable individuals will take up arms to lighten our ever-increasing load..."},{"name":"NORTHOTA","text":"Unfortunately, “capable individuals” remain the sticking point. Few hailing from our fair polis are willing to take up arms─let alone able to stand against the more fearsome specimens."},{"name":"NORTHOTA","text":"You, however, have the experience and the grit that we need. When I heard that you had arrived on our shores, it was music to my ears!"},{"name":"NORTHOTA","text":"You needn't work for free, of course─we've done our research, and the rewards we offer are as fine as any you'll find abroad. The currency we employ is a relic of times when “gleaner” was a great deal less figurative, so you may find it somewhat...eccentric, but it's as good as gil here!"},{"name":"NORTHOTA","text":"...Speaking of eccentric, it should be noted that the majority of our clients are scholars. You probably won't have heard of half the creatures they send you after, but I find it's best not to worry about that overmuch."},{"name":"NORTHOTA","text":"Slay beasts, collect samples─try not to think about the long-term effects of touching said samples─and get paid. Simple, no?"},{"name":"NORTHOTA","text":"That being said, I wouldn't dream of throwing you in the deep end just yet. Let's have you start off with some junior marks so you can get your feet wet."},{"name":"SYSTEM","text":"You are now permitted to take bills for junior marks from guildship hunt boards in Old Sharlayan and Radz-at-Han."},{"name":"SYSTEM","text":"Defeat the monsters described on the bills and you will be rewarded with tokens that can be exchanged for exclusive items."},{"name":"SYSTEM","text":"To exchange tokens for exclusive items, speak with either J'lakshai in Old Sharlayan, or with Wilmetta in Radz-at-Han."},{"name":"SYSTEM","text":"New quests and associate marks will become available from Northota in Old Sharlayan upon reaching level 83."}],"reward":{"gil":775},"reqs":{"jobs":[{"lvl":80,"id":34}],"questsType":"all","quests":[67658,69894]},"next":[69713]},"partials":[{"type":"npc","id":"1041960","obj":{"i":1041960,"n":"Diminutive Gleaner","l":3706,"q":1}},{"type":"npc","id":"1037060","obj":{"i":1037060,"n":"Northota","l":3706,"q":4}},{"type":"quest","id":"67658","obj":{"i":67658,"n":"Elite and Dangerous","g":96,"l":"Ishgard","s":16001,"f":1}},{"type":"quest","id":"69894","obj":{"i":69894,"n":"Old Sharlayan, New to You","g":11,"l":"Old Sharlayan","s":512}},{"type":"quest","id":"69713","obj":{"i":69713,"n":"That Specimen Came from the Moon","g":119,"l":"Old Sharlayan","s":30010,"f":1}}]}