{"quest":{"name":"A Hard Task to Digest","location":"Labyrinthos","id":69727,"patch":6.0,"sort":1150,"eventIcon":71221,"issuer":1039515,"target":1039515,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Chatbert appears to have worked himself into a panic."],"objectives":["Search for the runaway coblyn at the designated location, weaken the creature, then capture it in the sturdy sack.","Deliver the coblyn-filled sack to Chatbert."],"dialogue":[{"name":"CHATBERT","text":"It will be alright, I just need to...to... Oh gods, what do I do!?"},{"name":"CHATBERT","text":"I asked a gleaner to bring me a lively coblyn specimen, but perhaps I was a tad too insistent on the “lively” part─the thing flung itself about with such force that it broke the wall of its enclosure and escaped!"},{"name":"CHATBERT","text":"For a moment, I considered chasing after it myself...then realized it would likely beat my soft, academic frame into a bloody pulp. You, on the other hand, seem to possess a rather higher degree of fortitude."},{"name":"CHATBERT","text":"The last I saw, it was skittering off towards Mornveil Forest. Please, track down and subdue our frisky fugitive, stuff it in this sturdy sack, then bring it back here to me. My humble gratitude will be yours, as well as a generous reward!"},{"name":"CHATBERT","text":"Remember: subdue, then capture! Even as sturdy as that sack is, I rather doubt it will hold a wildly thrashing coblyn."},{"name":"CHATBERT","text":"Did you get it!? Did you bag the coblyn!?"},{"name":"CHATBERT","text":"Oh, praise the Scholar..."},{"name":"CHATBERT","text":"You see, I've been assigned to evaluate the dietary claims of a work entitled <span class=\"emphasis\">Coblyn Cuisine</span>, and had been about to prepare my first dish."},{"name":"CHATBERT","text":"How will it taste? Is it even edible? You, my friend, have made it possible for me to answer such questions. Thank you for your contribution to culinary science!"}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69898]}},"partials":[{"type":"npc","id":"1039515","obj":{"i":1039515,"n":"Chatbert","l":3708,"q":1}},{"type":"quest","id":"69898","obj":{"i":69898,"n":"Glorified Ratcatcher","g":11,"l":"Labyrinthos","s":516}}]}