{"quest":{"name":"Learning to Sow","location":"Labyrinthos","id":69728,"patch":6.0,"sort":1160,"eventIcon":71221,"issuer":1037523,"target":1037523,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Jonquinet requires a sturdy back to assist him."],"objectives":["Plant the experimental seeds at the designated locations.","Report to Jonquinet."],"dialogue":[{"name":"JONQUINET","text":"Might you have some time to spare for an old researcher, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>? Physical labor doesn't come to me as easily as it once did, and I'm in search of someone a bit more spry to assist me."},{"name":"JONQUINET","text":"The task is a simple one, rest assured. You need only plant these experimental seeds in the nearby fields. You would be compensated for your troubles, of course."},{"name":"JONQUINET","text":"No special skills are required of you. If you've planted one seed, you've planted most of them. Well then, I look forward to seeing what you can do."},{"name":"JONQUINET","text":"You have the seeds, yes? I expect you know what to do with them. If not, well...I'm afraid we may have more troubling issues at hand."},{"name":"JONQUINET","text":"Slightly flushed, are you? Good. I take it that means you've planted the seeds. You have my thanks, and if all goes to plan, the realm's as well."},{"name":"JONQUINET","text":"You see, my research involves the production of nutrient-rich plants that can be harvested in greater numbers than any we have seen thus far."},{"name":"JONQUINET","text":"However, even the most extraordinary crop is useless if they cannot be planted and raised by the common <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>."},{"name":"JONQUINET","text":"I've long made ease of use a priority when I develop new seeds, asking everyone from experienced researchers to eager children to plant them in the earth and then comparing results."},{"name":"JONQUINET","text":"But of course, I'm sure you've had more than enough long-winded explanations over your journeys to last a lifetime. Take this reward for your contribution, and take satisfaction in a job well done."}],"reward":{"gil":735,"items":[{"id":35673}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69901]}},"partials":[{"type":"npc","id":"1037523","obj":{"i":1037523,"n":"Jonquinet","l":3708,"q":1}},{"type":"item","id":"35673","obj":{"i":35673,"n":"Horse Chestnut Necklace Coffer (IL 515)","l":1,"c":26565,"t":61}},{"type":"quest","id":"69901","obj":{"i":69901,"n":"The Full Report, Warts and All","g":11,"l":"Labyrinthos","s":519}}]}