{"quest":{"name":"Uncommon Scents","location":"Labyrinthos","id":69726,"patch":6.0,"sort":1140,"eventIcon":71221,"issuer":1039513,"target":1039513,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Boragchin eyes you with a calculating look."],"objectives":["Place the slabs of raw meat.","Report to Boragchin."],"dialogue":[{"name":"BORAGCHIN","text":"You have an air of dangerous competence, and you are most certainly <span class=\"emphasis\">not</span> Sharlayan. Yes...yes, you should do nicely!"},{"name":"BORAGCHIN","text":"For what, you may ask? As the overseer of the wildlife in this sector, I often find myself in need of new volunteers to help with the feeding."},{"name":"BORAGCHIN","text":"While I am perfectly content to perform the task myself, it would be, ahem, <span class=\"emphasis\">unwise</span> to allow the carnivores to grow too accustomed to my scent─or that of any of my colleagues, for that matter."},{"name":"BORAGCHIN","text":"Which is why I am pleased to encounter “fresh meat” like you, if you'll excuse the phrase. So! What say you to a brief foray into the forest? You will be provided with suitable recompense, of course."},{"name":"BORAGCHIN","text":"Wonderful! Here, take these hunks of raw flesh and just set them down at these locations. Hurry back as soon as you're done!"},{"name":"BORAGCHIN","text":"Once you've placed the meat, I don't suggest you tarry in the area...unless you wish to be mistaken for the main course!"},{"name":"BORAGCHIN","text":"Look at you─all finished, and with a distinct lack of bleeding and sobbing! This is why I prefer to employ mercenary types to feed our more aggressive specimens."},{"name":"BORAGCHIN","text":"Fortunately, I can simply let the carnivores hunt down their own meals much of the time. But this is a closed habitat..."},{"name":"BORAGCHIN","text":"If we don't intervene to fill bellies on occasion, the delicate equilibrium between predator and prey will all come crashing down. Thank you for helping to maintain that balance."}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69898]}},"partials":[{"type":"npc","id":"1039513","obj":{"i":1039513,"n":"Boragchin","l":3708,"q":1}},{"type":"quest","id":"69898","obj":{"i":69898,"n":"Glorified Ratcatcher","g":11,"l":"Labyrinthos","s":516}}]}