{"quest":{"name":"An Ore-ful Lot","location":"Labyrinthos","id":69723,"patch":6.0,"sort":1110,"eventIcon":71221,"issuer":1039333,"target":1039333,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The burly researcher looks at you appraisingly."],"objectives":["Speak with the lightly built lab assistant.","Pick up the ore-filled crate.","Speak with the lightly built lab assistant and follow his lead.","Speak with the burly researcher."],"dialogue":[{"name":"GOODSHAPERESEARCHER04187","text":"You look strong, sturdy, and─most importantly─idle. Which is a wonderful coincidence, as I'm in need of a spare pair of hands. Let me explain."},{"name":"GOODSHAPERESEARCHER04187","text":"I sent one of my younger colleagues off to the Aesthete's Tholos to organize a shipment of ore...but after a second glance at the order sheet, I realized why it was taking him so blasted long."},{"name":"GOODSHAPERESEARCHER04187","text":"Seems the order was more than triple the size we usually handle─something to do with all these large-scale preparations, I suppose. And I can hardly expect that pup to shift it all on his lonesome."},{"name":"GOODSHAPERESEARCHER04187","text":"Come and pitch in with the hauling, and I'll make it worth your while. What say you?"},{"name":"GOODSHAPERESEARCHER04187","text":"Good. Many hands make light work─well, lighter, at least. Let's go."},{"name":"NEWRESEARCHER04187","text":"Please tell me you're the help I was promised..."},{"name":"NEWRESEARCHER04187","text":"Oh, thank the stars! My supervisor came past not a moment ago and scooped up half the ore himself. I swear he's part forest troll... But even so, I don't think I can manage the rest without doing myself an injury."},{"name":"NEWRESEARCHER04187","text":"Listen, if I take this crate, do you think you could carry that other load? Once you have it settled into a comfortable grip, I'll lead us to where we need to go."},{"name":"NEWRESEARCHER04187","text":"Yes, that big box there full of ore. And don't ask me about carts─I put in a request <span class=\"emphasis\">weeks</span> ago."},{"name":"SYSTEM","text":"Commence hauling?"},{"name":"SYSTEM","text":"Follow the lightly built lab assistant and try not to fall behind."},{"name":"SYSTEM","text":"You will have three minutes to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"NEWRESEARCHER04187","text":"I see you're no stranger to hauling heavy things about! Come on─let's get moving before my arms fall off!"},{"name":"NEWRESEARCHER04187","text":"Yes, um, I'll need you to actually bring the crate. You know, <span class=\"emphasis\">physically</span>."},{"name":"GOODSHAPERESEARCHER04187","text":"Where's the rest of the ore? Did you leave it back in the Outer Circuit?"},{"name":"GOODSHAPERESEARCHER04187","text":"That ought to do it. Come on back to the Archeion, and I'll pay you what you're owed."},{"name":"NEWRESEARCHER04187","text":"Thanks, I can handle the rest from here─the worst of it is over!"},{"name":"NEWRESEARCHER04187","text":"Thanks, I can handle the rest from here─the worst of it is over!"},{"name":"GOODSHAPERESEARCHER04187","text":"I'm glad you came along when you did. I can't be hauling ore all day, and my colleague is not exactly built for hard labor."},{"name":"GOODSHAPERESEARCHER04187","text":"The Aesthete's Tholos is where we store our mineral deposits, you see, and it <span class=\"emphasis\">is</span> our job to field and fill requests from our fellow researchers..."},{"name":"GOODSHAPERESEARCHER04187","text":"But we're not equipped to process orders of that quantity, especially if the Central Circuit keeps sending up requisition papers at the same frenzied pace."},{"name":"GOODSHAPERESEARCHER04187","text":"We'll run out of stock before long─assuming our backs don't give out first. Anyway, you're not here to listen to me gripe. Take your wages, and good work!"}],"reward":{"gil":895},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69898]}},"partials":[{"type":"npc","id":"1039333","obj":{"i":1039333,"n":"Burly Researcher","l":3708,"q":1}},{"type":"quest","id":"69898","obj":{"i":69898,"n":"Glorified Ratcatcher","g":11,"l":"Labyrinthos","s":516}}]}