{"quest":{"name":"It's Not the Heat, It's the Humidity","location":"Labyrinthos","id":69720,"patch":6.0,"sort":50,"eventIcon":71221,"issuer":1039329,"target":1039329,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The Outer Circuit researcher's brow is creased in consternation."],"objectives":["Speak with the Outer Circuit researcher.","Investigate the mist sprayers.","Speak with the Outer Circuit researcher.","Speak with the Outer Circuit researcher once more."],"dialogue":[{"name":"RESEARCHER04184","text":"Excuse me, do you have a moment? I have an urgent task to attend to and I could use some assistance."},{"name":"RESEARCHER04184","text":"As the supervisor of this sector, I was concerned with how cool the air in Mornveil Forest felt as I walked through on my usual rounds. Ordinarily, it should be a touch more humid."},{"name":"RESEARCHER04184","text":"My colleagues assure me that the gauges are displaying acceptable temperatures, and, well, hinted that I was being oversensitive. My instincts, however, inform me otherwise. Would you mind assisting me with a more thorough investigation?"},{"name":"RESEARCHER04184","text":"Thank you. Payment will be forthcoming, of course, but first, let us begin by assessing the problem from within the forest itself."},{"name":"RESEARCHER04184","text":"Take a close look at this mist sprayer. You'll find these devices throughout Mornveil Forest, and I need you to see if they're functioning properly."},{"name":"RESEARCHER04184","text":"It's nothing too complicated: if the sprayer's crystal is glowing blue, then that means it's working; if the crystal is dull, then it's most likely broken."},{"name":"RESEARCHER04184","text":"Here, I'll jot down the locations of the sprayers I wasn't able to check yet."},{"name":"RESEARCHER04184","text":"Meanwhile, I'll go and see if there are any problems at Mistloom─that's the big tower over there responsible for regulating the sprayers. That can be our meeting spot once you've finished checking the devices."},{"name":"STAFF04184","text":"Mornveil's temperature is holding steady. There are no failures in the equipment here, as far as I can tell..."},{"name":"SYSTEM","text":"The crystal is glowing blue. This mist sprayer appears to be functioning correctly."},{"name":"SYSTEM","text":"The sprayer's case is cracked, the crystal within inert and dull. This device appears to be malfunctioning."},{"name":"RESEARCHER04184","text":"Well, the Mistloom technicians can detect nothing awry with the tower's workings. Any issues with the sprayers?"},{"name":"RESEARCHER04184","text":"Aha! So there was a malfunction after all."},{"name":"RESEARCHER04184","text":"The sprayers' job is to keep this area blanketed in mist, to accurately simulate the moist-laden air of certain forest habitats."},{"name":"RESEARCHER04184","text":"One broken device had no effect on the temperature, but the humidity had fallen out of the optimal range. If we hadn't caught the change, we would have started seeing an adverse effect on the forest's flora and fauna."},{"name":"RESEARCHER04184","text":"Nice work, but I, ah...I didn't bring your payment with me. Come back to upper Acrinthos, and we can settle accounts there."},{"name":"STAFF04184","text":"A faulty mist sprayer, eh? Those devices were built to last, so I'm surprised you found a damaged one."},{"name":"RESEARCHER04184","text":"Thank you again for agreeing to help. It goes to show that mechanical gauges aren't always as important as trusting one's own senses."},{"name":"RESEARCHER04184","text":"Your remuneration, as promised. Now I must see about organizing repairs for that broken sprayer..."}],"reward":{"gil":895},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69898]}},"partials":[{"type":"npc","id":"1039329","obj":{"i":1039329,"n":"Outer Circuit Researcher","l":3708,"q":1}},{"type":"quest","id":"69898","obj":{"i":69898,"n":"Glorified Ratcatcher","g":11,"l":"Labyrinthos","s":516}}]}