{"quest":{"name":"Building Good Habitats","location":"Labyrinthos","id":69722,"patch":6.0,"sort":1101,"eventIcon":71221,"issuer":1039332,"target":1039332,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The green gleaner seems to want a word with you."],"objectives":["Defeat caribou.","Speak with the green gleaner."],"dialogue":[{"name":"GLEANER04186","text":"Excuse me, but aren't you the one who was assisting Erenville? If you have a moment, I could also use some help with a certain task..."},{"name":"GLEANER04186","text":"Simply put, I'm to hunt down a number of caribou. But as this is the first job I've accepted which requires any degree of violence, I'm not entirely confident in how I should approach my prey."},{"name":"GLEANER04186","text":"You seem like the type of <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who's seen <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> fair share of combat─what if I could observe you from concealment while you engage my target fauna!?"},{"name":"GLEANER04186","text":"I wouldn't need you to spend all day on it, of course─one or two examples in the forest west of here should be plenty! Let's say two, shall we? I'll even pay you! ...Please?"},{"name":"GLEANER04186","text":"The caribou shouldn't give you too much trouble. And if they do, well...that will also teach me a valuable lesson!"},{"name":"GLEANER04186","text":"Thank you for the instruction! While I doubt I could emulate your particular style, seeing you in action was enormously helpful."},{"name":"GLEANER04186","text":"You've also provided a service by culling a few of Labyrinthos's more prolific animals. Lest you worry, it's essential we reduce the caribou's numbers every now and again to maintain a stable habitat."},{"name":"GLEANER04186","text":"And nothing here is killed for mere sport. Every part of a carcass is harvested and put to use─a practice I will make sure to carry out with the creatures you slew."},{"name":"GLEANER04186","text":"There are still a few more that need culling, but I think I can handle that on my own now. Such is the gleaner's lot, and I should learn how to do it sooner rather than later."},{"name":"GLEANER04186","text":"Oh, and here's your payment. Wish me luck!"}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69898]}},"partials":[{"type":"npc","id":"1039332","obj":{"i":1039332,"n":"Green Gleaner","l":3708,"q":1}},{"type":"quest","id":"69898","obj":{"i":69898,"n":"Glorified Ratcatcher","g":11,"l":"Labyrinthos","s":516}}]}