{"quest":{"name":"A Ripe Trade","location":"Labyrinthos","id":69729,"patch":6.0,"sort":1170,"eventIcon":71221,"issuer":1037522,"target":1037522,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Rubh'a Epocan has work for a swift pair of legs."],"objectives":["Deliver the sack of fruit to Sibylane at the mitato.","Deliver the golden cheese to Rubh'a Epocan."],"dialogue":[{"name":"RUBHAEPOCAN","text":"Greetings. You seem eager to give a small portion of your time up in the name of progress. All I require is help with a simple delivery, and rest assured, you will receive just recompense."},{"name":"RUBHAEPOCAN","text":"I've been expecting someone from the dairy farm to come pick up this batch of fruit, but I've seen neither hide nor hair of them. I'd deliver it myself, but my duties have prevented me from stepping even an ilm from these crates."},{"name":"RUBHAEPOCAN","text":"The fruit is liable to rot if not stored properly, so if it isn't too much trouble, please make haste to the mitato and deliver them to my colleague there."},{"name":"RUBHAEPOCAN","text":"Pray make haste to the mitato and deliver the fruit to my colleague stationed there before it begins to rot."},{"name":"SIBYLANE","text":"Oh, hello. Was there something you needed?"},{"name":"SIBYLANE","text":"Oh, what specimens! So plump and fragrant─you said you came all the way from Meryall Agronomics? Thank you for making the trek─it would've been a shame to see these go to waste. Sometimes the cattle here are so temperamental that I quite forget my other obligations."},{"name":"SIBYLANE","text":"Rubh'a must be cross with me─this isn't the first time I've accidentally shirked my appointments with him. I must give him something by way of apology... Hmm, perhaps this golden cheese will do the trick."},{"name":"SIBYLANE","text":"As you well know, we at the mitato pride ourselves on our research into the various methods of animal husbandry and fermentation used throughout the realm, and this cheese is our latest masterpiece. "},{"name":"SIBYLANE","text":"It came about in no small part thanks to the fruit you just delivered. We feed it to our cattle, and it is the main contributor to the cheese's heavenly fragrance. If it's not too much trouble, could you deliver this wheel to Rubh'a?"},{"name":"SIBYLANE","text":"Please, deliver the cheese to Rubh'a while it's still fit for eating. I'm sure that once he catches a whiff of it, all memory of my forgetfulness will vanish!"},{"name":"RUBHAEPOCAN","text":"No fruit, I see. I trust you delivered it without incident? You didn't eat it, did you?"},{"name":"RUBHAEPOCAN","text":"This is...this is golden cheese! The legends say only the masters of Werlyt knew the secret of its creation─I never thought I'd lay my eyes on a single slice, let alone a whole wheel!"},{"name":"RUBHAEPOCAN","text":"If I receive one of these each time Sibylane forgets her obligations, then she can be as absent-minded as she pleases. What does it taste like, I wonder? Will it live up to the tall tales?"},{"name":"RUBHAEPOCAN","text":"...Oh, my apologies. I do tend to get carried away when it comes to cheese. Anyroad, thank you for your assistance, and take this for your time. I would share this cheese with you, but..."}],"reward":{"gil":735,"items":[{"num":2,"id":24282}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69901]}},"partials":[{"type":"npc","id":"1037522","obj":{"i":1037522,"n":"Rubh'a Epocan","l":3708,"q":1}},{"type":"item","id":"24282","obj":{"i":24282,"n":"Reunion Cheese","l":370,"c":24452,"t":45}},{"type":"quest","id":"69901","obj":{"i":69901,"n":"The Full Report, Warts and All","g":11,"l":"Labyrinthos","s":519}}]}