{"quest":{"name":"Raised on the Fallen","location":"Labyrinthos","id":69724,"patch":6.0,"sort":1120,"eventIcon":71221,"issuer":1037506,"target":1037506,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>N'nagali is looking at you with motherly concern."],"objectives":["Obtain rotting logs.","Deliver the rotting logs to N'nagali."],"dialogue":[{"name":"NNAGALI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Madame</span><span class=\"alternative\">Sir</span></span>, if you could hold out your hand? I have something you really must eat. Please, I insist!"},{"name":"NNAGALI","text":"Is that not the juiciest, sweetest, most invigorating thing you've ever tasted? I just finished baking a batch, and judging by your somewhat wan complexion, I thought you could use a little treat!"},{"name":"NNAGALI","text":"Oh, don't worry─I know exactly what I'm feeding you. Though I've settled here in this haven of archived cultural treasures, I was once a student of the nutritional sciences at the Faculty of Medicine."},{"name":"NNAGALI","text":"The knowledge from that course certainly comes in useful when it comes to keeping my weary colleagues healthy and hale. ...Although I do struggle to find the time to collect all the ingredients I need."},{"name":"NNAGALI","text":"In fact, I wonder if you'd be willing to help in that regard? I was about to head out and gather some things east of here, but if you could scour the area to the northwest for a couple of rotting logs, I'd be ever so grateful!"},{"name":"NNAGALI","text":"Yes, rotting logs! They don't need to be massive, but I will need them intact!"},{"name":"NNAGALI","text":"Any luck with the logs?"},{"name":"NNAGALI","text":"Yes! These should be <span class=\"emphasis\">riddled</span> with the little darlings!"},{"name":"NNAGALI","text":"Thank you, both from me, and on behalf of my sure-to-be-appreciative fellow archivists! After all, no dish has more nutritional value than one made with beetle larvae! "}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69898]}},"partials":[{"type":"npc","id":"1037506","obj":{"i":1037506,"n":"N'nagali","l":3708,"q":1}},{"type":"quest","id":"69898","obj":{"i":69898,"n":"Glorified Ratcatcher","g":11,"l":"Labyrinthos","s":516}}]}