{"quest":{"name":"No Laughing Matter","location":"Labyrinthos","id":69721,"patch":6.0,"sort":60,"eventIcon":71221,"issuer":1037492,"target":1037492,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Nonolato greets you with wild-eyed hope."],"objectives":["Deliver the alchemical compound to the senior researcher.","Report to Nonolato."],"dialogue":[{"name":"NONOLATO","text":"Ahem, ho there, friend! Fancy lending a hand to a gleaner in need?"},{"name":"NONOLATO","text":"I'm fairly new to all this gleaning business, so it's only proper that someone with the requisite, uh, experience deliver this very important Ul'dahn alchemical compound to that research facility. You know, that one a short way to the west...?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Why not ask a fellow gleaner?"},{"name":"A1","text":"Why not take it yourself?"},{"name":"NONOLATO","text":"Oh, I couldn't do that! They'd never take me seriously again! No, I need someone bold and brave and unconnected to me in social circles. In other words, an itinerant adventurer! Like you!"},{"name":"NONOLATO","text":"Wh-Why, you ask? Well, because I... I have an urgent matter to attend to elsewhere! Yes, very urgent and very far from here!"},{"name":"NONOLATO","text":"I would do it myself, of course, but duty calls! Just deliver this package to someone in a position of seniority, and I promise I'll be back here to pay you for the favor! "},{"name":"NONOLATO","text":"I'll be waiting right here! Er, that is, I will be after I've completed my other extremely pressing errand which prevents me from doing this one."},{"name":"RESEARCHER04185","text":"...Hm? May I help you?"},{"name":"RESEARCHER04185","text":"Ah yes, the Ul'dahn compound. ...Excuse me, but whatever happened to the gleaner I was told to expect? You don't quite match his description."},{"name":"RESEARCHER04185","text":"...And so here you are, in his stead. &lt;sigh&gt; I thought that might be the case."},{"name":"RESEARCHER04185","text":"This facility primarily studies small vilekin and their ilk, and their role as carriers of disease. As such, we seem to have become the subject of some rather unsettling─not to mention wholly unsubstantiated─rumors."},{"name":"RESEARCHER04185","text":"I imagine some senior gleaner was amusing himself by taunting his junior colleague with scary half-truths and outright fabrications. The Scholar lend me patience, but such jests lead to no end of trouble for us."},{"name":"RESEARCHER04185","text":"In any case, I thank you for bringing me my delivery. Should you happen to return to our faint-hearted gleaner, pray do me the service of setting him straight on what it is we do here."},{"name":"NONOLATO","text":"You...you're back! And not suffering from any horrible maladies! Well, nothing visible, anyway."},{"name":"NONOLATO","text":"...What's that? You think someone's been having a laugh at my expense?"},{"name":"NONOLATO","text":"But...but the others told me! They said the researchers ordered a forbidden substance from Ul'dah so they could concoct some kind of zombie powder...and that gleaners who deliver there are often never seen again!"},{"name":"NONOLATO","text":"...Aye, that does sound a bit unlikely now that I say it out loud. Grrr, those lying bastards. Right, well, here's what I owe you─plus a little extra for keeping quiet. Gods above, I'll never live this down..."}],"reward":{"gil":735,"items":[{"id":35675}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69898]}},"partials":[{"type":"npc","id":"1037492","obj":{"i":1037492,"n":"Nonolato","l":3708,"q":1}},{"type":"item","id":"35675","obj":{"i":35675,"n":"Horse Chestnut Ring Coffer (IL 515)","l":1,"c":26567,"t":61}},{"type":"quest","id":"69898","obj":{"i":69898,"n":"Glorified Ratcatcher","g":11,"l":"Labyrinthos","s":516}}]}