{"quest":{"name":"Shelling Out","location":"Thavnair","id":69733,"patch":6.0,"sort":1210,"eventIcon":71221,"issuer":1037625,"target":1037625,"genre":120,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mehrunnah is gazing off into the distance, as if looking for a ship on the horizon."],"objectives":["Slay kacchapa and collect their shells.","Deliver the shells to Mehrunnah."],"dialogue":[{"name":"MEHRUNNAH","text":"From a distance, I thought you to be a fishmonger, but now that I behold you up close, it's clear you don't hail from these parts. Odd as your garments are, however, even I can tell they're made for hard work. Lucky for you I have just the task. "},{"name":"MEHRUNNAH","text":"I mean to make a necklace for an acquaintance of mine, but my design calls for shells pulled from the vicious kacchapa. As fine a crafter that I am, I'm afraid hunting is quite outside of my wheelhouse."},{"name":"MEHRUNNAH","text":"If you'd do the rough work in my stead, you would be well compensated for your time, and have my undying gratitude besides. I require two shells from the hulking beasts─a simple feat for one such as you, surely."},{"name":"MEHRUNNAH","text":"I require two kacchapa shells, but if you wish to slay more then I won't deny you the pleasure. Return here when your taste for adventure has been sated─I'll be waiting!"},{"name":"MEHRUNNAH","text":"I see you've been busy. Do you have the shells?"},{"name":"MEHRUNNAH","text":"Ah, yes, yes! These are just what I seek. I mean to present my necklace to a woman with very discerning tastes, so I thank you for choosing shells of such high quality. "},{"name":"MEHRUNNAH","text":"She collects and assesses taxation at Alnair, and her duties often bring her to this very port. We've become quite close over the past few moons."},{"name":"MEHRUNNAH","text":"Only a few days ago she sent me a charm to ensure my good health and fortune. My spirits were much invigorated, for it symbolizes her deep trust in me. I've heard tell these are shared among siblings to express their love for one another."},{"name":"MEHRUNNAH","text":"It's customary to send a gift in return, so I had it in mind to craft a─"},{"name":"MEHRUNNAH","text":"...Siblings? Siblings!? Ah... Is that how she thinks of me? I was certain it was something altogether different, but now that I say it out loud..."},{"name":"MEHRUNNAH","text":"I suppose...I suppose I can still be happy with this arrangement. I'll look over her as a brother would his beloved sister. Keep her safe from harm. Yes... Anyroad, I promised you recompense, didn't I? Here─you've earned it."}],"reward":{"items":[{"id":35672}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69906]}},"partials":[{"type":"npc","id":"1037625","obj":{"i":1037625,"n":"Mehrunnah","l":3709,"q":1}},{"type":"item","id":"35672","obj":{"i":35672,"n":"Horse Chestnut Earring Coffer (IL 515)","l":1,"c":26564,"t":61}},{"type":"quest","id":"69906","obj":{"i":69906,"n":"A Fisherman's Friend","g":11,"l":"Thavnair","s":524}}]}