{"quest":{"name":"Not Mushroom for Error","location":"Labyrinthos","id":69731,"patch":6.0,"sort":1190,"eventIcon":71221,"issuer":1039514,"target":1039514,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Parbeloix is in search of someone skilled with a weapon."],"objectives":["Consult the illustration to find and obtain sample 316.","Deliver sample 316 to Parbeloix."],"dialogue":[{"name":"PARBELOIX","text":"<span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Sir</span></span>, I say, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. I seem to be in a bit of a bind, and I was wondering if you might lend your aid to remedy the plight of a struggling student."},{"name":"PARBELOIX","text":"Oh, of course─introductions. I am Parbeloix, from the Studium, where my research involves the finer points of bacteria and fungi."},{"name":"PARBELOIX","text":"I'm here to harvest mushrooms from Labyrinthos for my experiments, but I'm afraid I may be in over my head."},{"name":"PARBELOIX","text":"You see, the mushrooms are located in the thirty-third facet, but that shaft is positively swarming with things I can scarce stand to look at, let alone face in combat."},{"name":"PARBELOIX","text":"It isn't uncommon for members of the Studium to request help from the more martially inclined, and so here I am before you. Will you procure the mushrooms for me? I would be forever in your debt."},{"name":"PARBELOIX","text":"Oh, thank you, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! Well then, the sample number for my plot is three-one-six. The mushrooms stand out among the others, with red caps and a distinctive triangle shape."},{"name":"PARBELOIX","text":"Just in case, however, I do have this illustration. I understand all too well the impulse to become lost gazing at the fungi─perhaps this will help keep you on track."},{"name":"PARBELOIX","text":"If you find the sheer variety of mushrooms to be overwhelming, then simply consult the picture and it should put you back on track."},{"name":"PARBELOIX","text":"Please return with the crop labeled sample three-one-six. If you forget how they look, simply consult the illustration I gave you and resume the merry harvest."},{"name":"SYSTEM","text":"These don't appear to be the correct mushrooms, although they do have a certain charm..."},{"name":"SYSTEM","text":"This appears to be an illustration of sample 316. Find the matching mushrooms within the vast thirty-third facet."},{"name":"SYSTEM","text":"These mushrooms match the illustration in your hands. Your long search is over!"},{"name":"PARBELOIX","text":"Well, I can see by the dirt on your boots that you did some manner of digging. Were you able to find my sample?"},{"name":"PARBELOIX","text":"Ah, yes, these match my illustration exactly! Thank the Twelve that the brave of heart still walk this realm."},{"name":"PARBELOIX","text":"Do you have an interest in fungi yourself? These were developed from the spores of the elfstool, which can only be found in the Aurum Vale. A rare mushroom, but these are superior in every way."},{"name":"PARBELOIX","text":"For one, they are much less inclined to kill you. A vast improvement by any measure of the word."},{"name":"PARBELOIX","text":"Of course, I've had my failures, but the less said about those the better. What matters is now, and the revolution sample three-one-six is sure to herald!"},{"name":"SYSTEM","text":"A picture of sample 316."}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69901]}},"partials":[{"type":"npc","id":"1039514","obj":{"i":1039514,"n":"Parbeloix","l":3708,"q":1}},{"type":"quest","id":"69901","obj":{"i":69901,"n":"The Full Report, Warts and All","g":11,"l":"Labyrinthos","s":519}}]}