{"quest":{"name":"Fruit Savior","location":"Thavnair","id":69732,"patch":6.0,"sort":1201,"eventIcon":71221,"issuer":1037622,"target":1037622,"genre":120,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Qefiraz is rubbing the small of his back and smiling at you through the pain."],"objectives":["Deliver the crate of fruit to the designated location.","Report to Qefiraz."],"dialogue":[{"name":"QEFIRAZ","text":"You there. I take it by the hunger in your eyes that you're in search of work. As luck would have it, I'm in need of assistance and have the coin to make it worth your while."},{"name":"QEFIRAZ","text":"Usually I'd haul these goods ashore myself, but today my back doesn't seem amenable to the prospect. If you could help an old merchant out, I reckon we can both go to sleep today satisfied."},{"name":"QEFIRAZ","text":"Ah, very good, very good! I've marked on the map where the crates are to be delivered. Careful now─the fruits inside bruise easily!"},{"name":"QEFIRAZ","text":"Give me a shout once you're done, and we'll see about getting you paid."},{"name":"SYSTEM","text":"Deliver the crate of fruit to the designated location before the time runs out."},{"name":"SYSTEM","text":"You will have two minutes to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"QEFIRAZ","text":"Oi, you didn't drop the crate, did you? Don't go telling me <span class=\"emphasis\">your</span> back is crying out in protest─I picked you because of your robust looks. Here, have another, but lift with your legs this time!"},{"name":"QEFIRAZ","text":"Apologies for foisting this task on you, but I reckon you're up to it. I've marked the location they're to be delivered on your map─godsspeed!"},{"name":"SYSTEM","text":"The crate of fruit rests snugly among the rest of the shipments. Report your success to Qefiraz."},{"name":"SYSTEM","text":"You drop the crate, and exotic fruit spills across the ground. Qefiraz might be displeased, but you should report to him for further guidance. "},{"name":"QEFIRAZ","text":"No crate in your hands, eh? I take it that means your task is done. Good job."},{"name":"QEFIRAZ","text":"That particular shipment was packed to the brim with this region's finest fruits. Owing to this region's insufferable heat, they're sweeter than any other I've ever tasted."},{"name":"QEFIRAZ","text":"I was meant to deliver them to a client of mine in Limsa Lominsa, but no sooner had I set sail than I received word that my goods were no longer needed. A damned shame, but now that they're resting under the shade, at least they won't go to waste."},{"name":"QEFIRAZ","text":"That's life, eh? Sometimes the wind is at your back, sometimes you're left floundering. And other times you're stuck in bed on a beautiful day because your back is having none of it."},{"name":"QEFIRAZ","text":"But I tend to find that fortune smiles upon those with patience, as they did today when I saw you strolling along the docks. Anyroad, here's your payment for a job well done. Till next we meet!"}],"reward":{"items":[{"id":35675}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69906]}},"partials":[{"type":"npc","id":"1037622","obj":{"i":1037622,"n":"Qefiraz","l":3709,"q":1}},{"type":"item","id":"35675","obj":{"i":35675,"n":"Horse Chestnut Ring Coffer (IL 515)","l":1,"c":26567,"t":61}},{"type":"quest","id":"69906","obj":{"i":69906,"n":"A Fisherman's Friend","g":11,"l":"Thavnair","s":524}}]}