{"quest":{"name":"Tikka Hike","location":"Thavnair","id":69734,"patch":6.0,"sort":1220,"eventIcon":71221,"issuer":1039375,"target":1039377,"genre":120,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The child is looking around, trying to catch the attention of any passersby."],"objectives":["Speak with the auburn-haired Au Ra.","Lie in wait and slay the sotormurg when it appears.","Deliver the sotormurg meat to the auburn-haired Au Ra.","Speak with the auburn-haired Au Ra at Yedlihmad."],"dialogue":[{"name":"CHILDA04198","text":"Oh, you look fierce! Are you? Can you help me find my sister?"},{"name":"CHILDA04198","text":"She went off to hunt sotormurg so she could make me chicken tikka. She's so brave, but she's been gone for quite some time..."},{"name":"CHILDA04198","text":"I've never strayed far from the gates, and those beasts look so frightening. She shouldn't be far─can you find her for me?"},{"name":"CHILDA04198","text":"She has red hair, and she looks so elegant in her hunting garb. She set off to the northwest─I'll be waiting here for you to come back!"},{"name":"CHILDA04198","text":"She set off to the northwest, dressed in her breathtaking hunting garb. Oh, I do hope she's safe."},{"name":"CHILDB04198","text":"Quiet, you... I'm lying in wait, can't you see? What is it?"},{"name":"CHILDB04198","text":"My sister? Oh, she does worry after me so. I apologize for her imposition."},{"name":"CHILDB04198","text":"Today is her nameday, and I wanted to do something special for her. So much has gone wrong as of late, and she's managed to always keep a smile on her face."},{"name":"CHILDB04198","text":"I thought that sotormurg would be simple prey, but now that I've seen one up close, I can barely bring myself to move. I've never been so afraid, truth be told..."},{"name":"CHILDB04198","text":"But you...you look as if you've never known fear. You could make quick work of the sotormurg, I'm certain. If you don't mind...could you slay the animal for me? I've already set the traps, so one should be along soon enough."},{"name":"CHILDB04198","text":"Without their meat, I can't hope to make the chicken tikka that my sister so adores. Please, if not for me, then do it for her?"},{"name":"CHILDB04198","text":"She's spoken of little else but chicken tikka as of late. Meat from the sotormurg would help make her dreams come true. Please, if you can spare a moment, one should be along soon."},{"name":"CHILDB04198","text":"That was an inspiring display! Were you able to procure its meat?"},{"name":"CHILDB04198","text":"Ah, this is the most delicious part! Thank you, thank you!"},{"name":"CHILDB04198","text":"You must let me repay you for your bravery. Please, meet me near the city gates, where I told my sister to wait. I do hope she hasn't wandered off."},{"name":"CHILDA04198","text":"Sister, you've returned!"},{"name":"CHILDB04198","text":"There's the brave traveler!"},{"name":"CHILDA04198","text":"Thank you for finding my sister! She said you took down that sotormurg in a single blow!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Anything for chicken tikka."},{"name":"A1","text":"It is your nameday, after all."},{"name":"CHILDA04198","text":"Thank you!"},{"name":"CHILDB04198","text":"The memories of us gathering around the table as a family over a homemade feast are among my fondest."},{"name":"CHILDB04198","text":"Our parents have gone to Radz–at–Han to find work, seeing as how there is none to be found here since that tower appeared. They've sent word they'll return for this little one's nameday."},{"name":"CHILDB04198","text":"I want them to arrive to a feast rivaling the ones from before. And thanks to you, they will. Please, take this for all you've done to give our family a memory we can cherish."}],"reward":{"items":[{"num":2,"id":36036,"one":1},{"num":2,"id":36037,"one":1},{"num":2,"id":36038,"one":1},{"num":2,"id":36039,"one":1},{"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69906]}},"partials":[{"type":"npc","id":"1039375","obj":{"i":1039375,"n":"Auri Girl","l":3709,"q":1}},{"type":"npc","id":"1039377","obj":{"i":1039377,"n":"Auburn-haired Au Ra","l":3709,"q":1}},{"type":"item","id":"36036","obj":{"i":36036,"n":"Archon Loaf","l":520,"c":24037,"t":46,"p":3829}},{"type":"item","id":"36037","obj":{"i":36037,"n":"Zurek","l":520,"c":24104,"t":46}},{"type":"item","id":"36038","obj":{"i":36038,"n":"Amra Salad","l":525,"c":24166,"t":46}},{"type":"item","id":"36039","obj":{"i":36039,"n":"Amra Lassi","l":525,"c":24454,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"69906","obj":{"i":69906,"n":"A Fisherman's Friend","g":11,"l":"Thavnair","s":524}}]}