{"quest":{"name":"Wish Upon a Crystal","location":"Thavnair","id":69736,"patch":6.0,"sort":1240,"eventIcon":71221,"issuer":1037671,"target":1037671,"genre":120,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Yedjina requires assistance at the Great Work."],"objectives":["Deliver the coin-stuffed pouch to the merchant in Yedlihmad.","Deliver the crystal-stuffed pouch to Yedjina."],"dialogue":[{"name":"YEDJINA","text":"Aren't you the adventurer that saved Matsya? Excellent timing! If you have time to spare, I would ask a favor of you."},{"name":"YEDJINA","text":"You see, the dancers of Radz–at–Han are planning a performance to raise the people's spirits. We alchemists would like to support them with some of the finest accessories we can craft."},{"name":"YEDJINA","text":"Unfortunately, none of us have time to procure the crystals we need to finish them. It would be a great help if you could fetch the crystals from the merchant at the port at Yedlihmad. Of course, we will provide you with the necessary funds."},{"name":"YEDJINA","text":"Many thanks! The merchant is already aware of the situation and should be expecting someone to come by. I'll leave the selection of stones up to your no-doubt impeccable judgment."},{"name":"YEDJINA","text":"That should be enough coin for you to buy us whichever crystals catch your eye."},{"name":"YEDLIHMADJEWELER","text":"Welcome! What can I help you with?"},{"name":"YEDLIHMADJEWELER","text":"Buying crystals for the alchemists? Yes, I did hear from them about that. Have you decided what you want to wish upon the crystals?"},{"name":"YEDLIHMADJEWELER","text":"Haven't you heard? Here in Radz-at-Han, crystals are given along with a wish."},{"name":"YEDLIHMADJEWELER","text":"There's no need to think on it too deeply. Simply envision the wish you would entrust the dancers with granting to their spectators. Once I know that, I can pick out the perfect stone for the occasion."},{"name":"Q1","text":"What will you wish for?"},{"name":"A1","text":"Inner peace."},{"name":"A1","text":"Protection from evil."},{"name":"A1","text":"Prosperity and wealth."},{"name":"YEDLIHMADJEWELER","text":"Hmmm... In that case, emeralds will do quite nicely. In olden times, it was believed that the brilliant green sparkle could heal the heart as well as physical ailments."},{"name":"YEDLIHMADJEWELER","text":"I see. I believe diamonds would be best for that. They say that the radiant gleam and hardiness of the gem makes it particularly effective against the realm's many evils."},{"name":"YEDLIHMADJEWELER","text":"For wealth, I suggest yellow sapphires. The lucid gold glimmer was once believed to invite fortune and secure riches."},{"name":"YEDLIHMADJEWELER","text":"I will provide you with as many as I can within your budget. Be sure they make it safely back to the alchemists at the Great Work."},{"name":"YEDLIHMADJEWELER","text":"Take care in delivering the crystals to the alchemist who sent you."},{"name":"YEDJINA","text":"Ah, there you are! With some precious stones for me, I assume."},{"name":"YEDJINA","text":"These are perfect. Thank you for your help! Do you mind if I ask what you wished upon them?"},{"name":"YEDJINA","text":"Inner peace... I think we could all use a bit of that after all that's happened. A fine wish, indeed."},{"name":"YEDJINA","text":"Protection from evil... It is my sincerest hope that you, as well as we, may live a peaceful life free of disaster."},{"name":"YEDJINA","text":"Prosperity and wealth? That would certainly solve a lot of these folks' problems. To have enough to live a comfortable life, content with what you have is valuable indeed."},{"name":"YEDJINA","text":"In Thavnair, they believe crystals have the power to grant wishes and heal sickness."},{"name":"YEDJINA","text":"It may sound like superstitious nonsense, but crystals are curious things. Part of them exists somewhere between the living and the material. As such, elemental energies can reside within them quite readily."},{"name":"YEDJINA","text":"They can influence your mind and spirit using the aether within you, which is precisely why the wish you imbue them with is so important. If the wish is impure, then so shall be the crystal's effects on the user."},{"name":"YEDJINA","text":"I can tell I made the right decision in asking for your help. Please, take this as thanks."},{"name":"THOUGHTFULALCHEMIST","text":"T"}],"reward":{"gil":735,"items":[{"id":35674}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69909]}},"partials":[{"type":"npc","id":"1037671","obj":{"i":1037671,"n":"Yedjina","l":3709,"q":1}},{"type":"item","id":"35674","obj":{"i":35674,"n":"Horse Chestnut Bracelet Coffer (IL 515)","l":1,"c":26566,"t":61}},{"type":"quest","id":"69909","obj":{"i":69909,"n":"Shadowed Footsteps","g":11,"l":"Thavnair","s":527}}]}