{"quest":{"name":"Alchemist or Dancer","location":"Thavnair","id":69739,"patch":6.0,"sort":1270,"unlocksFunction":1,"eventIcon":71341,"issuer":1037670,"target":1037670,"genre":120,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Jalamuc is concerned about a colleague."],"objectives":["Speak with the black-haired Hyur.","Inspect the designated locations.","Speak with the black-haired Hyur.","Speak with Jalamuc."],"dialogue":[{"name":"JALAMUC","text":"Do you have a moment, adventurer? One of my colleagues has gone missing. She said she was going to Kadjaya's Footsteps to get a bit of exercise, but she hasn't come back."},{"name":"JALAMUC","text":"I'd go search for her, but it's almost time for a shift change, and I can't very well leave the kiln to operate itself. Could you find her and fetch her for me?"},{"name":"JALAMUC","text":"You're too kind! She should be in Kadjaya's Footsteps. Keep an eye out for a Hyur with black hair."},{"name":"JALAMUC","text":"I'm sure she'll be happy to see you. She was out the last time you were by, and she was devastated that she missed out on the chance to meet the adventurer aiding the Students of Baldesion."},{"name":"JALAMUC","text":"Look for a black-haired Hyur in Kadjaya's Footsteps. It's time for her to come back."},{"name":"BLACKHAIRHYURAN","text":"Hm? What do you mean, I need to get back to work? ...Oh! Have I really been out that long? I should really go..."},{"name":"BLACKHAIRHYURAN","text":"But I was hoping to get a better look at the stage before I left... I'm sure you're busy, but could you assist me for a moment?"},{"name":"BLACKHAIRHYURAN","text":"Thank you! I'll inspect the walls, so could you make sure the stage is in order?"},{"name":"BLACKHAIRHYURAN","text":"Let me know if anything around needs fixing."},{"name":"SYSTEM","text":"Some of the paint is worn off. It could use a fresh coat."},{"name":"SYSTEM","text":"There is a small hole in the floor. That can't be good..."},{"name":"SYSTEM","text":"The cloth wavers exquisitely in the wind. No problems here."},{"name":"BLACKHAIRHYURAN","text":"Any problems? ...The floor and the paint. I'll have to fix them the next time I come by. Thank you for checking."},{"name":"BLACKHAIRHYURAN","text":"You know, it seems odd that I've never met you until now. You wouldn't happen to be the adventurer sent by the Students of Baldesion, would you?"},{"name":"BLACKHAIRHYURAN","text":"You are!? And here I was delegating you menial tasks! If I had known, I..."},{"name":"BLACKHAIRHYURAN","text":"I've always admired travelers like you. You see, I was studying to be a dancer under Mistress Nashmeira at one time. I wanted to see the realm as I traveled for performances."},{"name":"BLACKHAIRHYURAN","text":"And maybe I still can. Not as a dancer, of course, but as an alchemist!"},{"name":"BLACKHAIRHYURAN","text":"Oh, but we should hurry back to the Great Work. I don't want to cause any more trouble than I already have."},{"name":"JALAMUC","text":"Ah, there you are! I heard you helped my colleague with her stage inspection while you were out. It's greatly appreciated."},{"name":"JALAMUC","text":"She really looks up to your kind, you know. She lost her chance to become a dancer due to an unfortunate injury, and now she's working to heal the sick and injured as an alchemist."},{"name":"JALAMUC","text":"She was so happy to meet you, as am I. Here. A token of our thanks."}],"reward":{"gil":895,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69909]}},"partials":[{"type":"npc","id":"1037670","obj":{"i":1037670,"n":"Jalamuc","l":3709,"q":1}},{"type":"quest","id":"69909","obj":{"i":69909,"n":"Shadowed Footsteps","g":11,"l":"Thavnair","s":527}}]}