{"quest":{"name":"It's Not Mud","location":"Labyrinthos","id":69730,"patch":6.0,"sort":1180,"eventIcon":71221,"issuer":1037527,"target":1037527,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Emaniette seeks a brave soul for a dangerous task."],"objectives":["Gather brown mud.","Deliver the brown mud to Emaniette."],"dialogue":[{"name":"EMANIETTE","text":"If I'm not mistaken, you have the steely eyes of an adventurer. One who looks death in the eye and does not flinch."},{"name":"EMANIETTE","text":"It just so happens that I require a sample of rare earth, but it can only be found in a location rife with vicious plants and gods know what else. I would give you a hefty sack of coin if you could retrieve it for me."},{"name":"EMANIETTE","text":"If you are willing, pray make your way to Troglophile's Deep and gather for me three samples of brown mud─the darker, the better, I say. I suggest sharpening your weapons beforehand, but I won't tell you how to do your job."},{"name":"EMANIETTE","text":"I require three samples of brown mud from Troglophile's Deep. They should be easy to spot, but reaching them unscathed may be another matter entirely."},{"name":"EMANIETTE","text":"You've returned! Am I surprised? No, no, of course not. I had the utmost faith in your abilities. Well, did you bring the samples?"},{"name":"EMANIETTE","text":"Excellent work. With this, I shall continue my research into the techniques of the Nagxian, skilled fighters and farmers both."},{"name":"EMANIETTE","text":"I recently acquired texts from their homeland that go into some detail about their agriculture. Did you know they mix bat droppings into the soil to make it more fertile? Quite ingenious."},{"name":"EMANIETTE","text":"The land they live in is quite temperate, and it is writ that after one hundred summers the droppings solidify into something resembling stone, further concentrating the nutrients contained within."},{"name":"EMANIETTE","text":"Of course, the samples you've provided me today are far too ripe to be of much use on their own. However, what is the purpose of research if not to free us from the bounds of the natural world?"},{"name":"EMANIETTE","text":"What's that? Of course, I'm sure I said that the droppings <span class=\"emphasis\">resemble</span> mud, didn't I? Regardless, I aim to speed up the ripening process, creating in days what takes nature centuries to accomplish. If I succeed, farmers across the realm will rejoice, and they will have you to thank for it!"}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69901]}},"partials":[{"type":"npc","id":"1037527","obj":{"i":1037527,"n":"Emaniette","l":3708,"q":1}},{"type":"quest","id":"69901","obj":{"i":69901,"n":"The Full Report, Warts and All","g":11,"l":"Labyrinthos","s":519}}]}