{"quest":{"name":"Paint, Perfume, and Pecs","location":"Thavnair","id":69738,"patch":6.0,"sort":1260,"eventIcon":71221,"issuer":1039379,"target":1039379,"genre":120,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The muscular alchemist needs help finding ingredients for paint."],"objectives":["Speak with the muscular alchemist.","Coat the muscular alchemist in fragrant oil.","Lie in wait at the designated location and defeat the vajralangula.","Deliver the amra to the muscular alchemist.","Speak with the muscular alchemist."],"dialogue":[{"name":"MACHOALCHEMIST","text":"You there! Adventurer! I find myself in need of assistance. You will help me, won't you?"},{"name":"MACHOALCHEMIST","text":"You see, I received an order for custom paints, but the necessary ingredients are rather rare. The amra in particular is difficult to come by, as it must be taken from a vajralangula."},{"name":"MACHOALCHEMIST","text":"And not just any old fruit will do! Only one held by the strongest, most virile male specimen will suffice."},{"name":"MACHOALCHEMIST","text":"I know of a sure way to attract a suitable vajralangula, but I'm afraid defeating the beast is beyond me. If only a strong, brave, kind adventurer could protect poor little me!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'm at your service!"},{"name":"A1","text":"I expect a handsome reward."},{"name":"MACHOALCHEMIST","text":"I feel safer already! Come now, I will lead you to where the vajralangula gather. We head southeast."},{"name":"MACHOALCHEMIST","text":"I've kept you waiting long enough. Let's get to it, shall we?"},{"name":"MACHOALCHEMIST","text":"Take this perfume and douse my frail, meager body in it. I must be as a flower dripping with sweet nectar!"},{"name":"MACHOALCHEMIST","text":"Quickly, now! Slather it on, else I won't catch the attention of even the weakest vajralangula."},{"name":"MACHOALCHEMIST","text":"Perfect! I'm positively irresistible!"},{"name":"MACHOALCHEMIST","text":"Now, I'll use my wiles and enticing scent to lure a vajralangula this way. You wait here, and prepare to strike him down!"},{"name":"MACHOALCHEMIST","text":"I'll lure a vajralangula this way. You wait here, and prepare to strike!"},{"name":"MACHOALCHEMIST","text":"Such valiance! I could hardly tear my eyes away as you heroically slayed the beast! ...Now, the fruit, if you please."},{"name":"MACHOALCHEMIST","text":"Mmm, yes. Perfectly, succulently ripe. This will make a fine paint."},{"name":"MACHOALCHEMIST","text":"Our work here is done. Let us return to the Great Work before another vajralangula sets its sights on me."},{"name":"MACHOALCHEMIST","text":"Many thanks for your assistance, adventurer. I never imagined I could procure such a fine component for my paint."},{"name":"MACHOALCHEMIST","text":"Say, do you know why the vajralangula carry this fruit? They present them to their desired mates. Hence the scented oils. Pheromones, you see."},{"name":"MACHOALCHEMIST","text":"The amra is also the official fruit of Thavnair. You can eat it or use it as painting material as I shall, of course, but it is also said to ward off evil, and secure a strong family lineage."},{"name":"MACHOALCHEMIST","text":"But there's more to this fruit than mere superstition. It has sufficient antibacterial properties to be used as a household remedy to keep any family well."},{"name":"MACHOALCHEMIST","text":"Oh but listen to me, rambling on and on! Allow me to thank you once more. I hope our paths will cross again!"}],"reward":{"gil":975},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69909]}},"partials":[{"type":"npc","id":"1039379","obj":{"i":1039379,"n":"Muscular Alchemist","l":3709,"q":1}},{"type":"quest","id":"69909","obj":{"i":69909,"n":"Shadowed Footsteps","g":11,"l":"Thavnair","s":527}}]}