{"quest":{"name":"The Great Heist","location":"Thavnair","id":69735,"patch":6.0,"sort":1230,"eventIcon":71221,"issuer":1037682,"target":1037682,"genre":120,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Varpasa is searching for something at the Great Work."],"objectives":["Speak with the suspicious alchemist near Akyaali.","Investigate the stolen box.","Speak with Varpasa."],"dialogue":[{"name":"VARPASA","text":"Damn... Who could have done this?"},{"name":"VARPASA","text":"It wasn't you, was it? ...No, it couldn't have been. Besides, an upstanding adventurer like yourself wouldn't be so cruel as to steal my wares... You wouldn't be willing to lend a hand in getting them back, would you?"},{"name":"VARPASA","text":"Oh thank you, thank you!"},{"name":"VARPASA","text":"He looked to be male, about this tall, and dressed in all black alchemist's garb. That's all I can tell you. I didn't get a good look at him before he ran off toward Akyaali."},{"name":"VARPASA","text":"I can't trust anyone here... Who knows how many accomplices he has lurking about? But you're not from here, so you're in the clear. I know I can trust you to track down that thieving lowlife!"},{"name":"VARPASA","text":"The thief ran off toward Akyaali. Suspicious fellow dressed all in black alchemist's garb."},{"name":"NOONEBADGUY","text":"Heheh! That fool left herself wide open to get robbed! She didn't even notice me following her from the port. Now all I have to do is sell off this fancy metal and I'll never have to work another day in my life! Or for a few weeks at least..."},{"name":"NOONEBADGUY","text":"What are you looking at, huh? Scram! You think you're some kind of defender of justice?"},{"name":"VARPASA","text":"How did it go?"},{"name":"VARPASA","text":"My sheet metal! You got it back! Nothing stopping me from fixing up that busted old furnace now. So what can you tell me about the culprit?"},{"name":"VARPASA","text":"One of the Elezen folk? Rare to see them around these parts... He must have traveled here from somewhere else."},{"name":"VARPASA","text":"All sorts of people come to Radz-at-Han, not all of them respectable. The freedom of the city calls people from all lands and walks of life."},{"name":"VARPASA","text":"He must have been aboard the same vessel as me, seeing as he knew I was transporting valuables and tailed me from the port. I'll need to be more careful of my surroundings from now on. If only everyone were as trustworthy as you!"},{"name":"VARPASA","text":"In any case, I'm almost glad this was a clear-cut robbery. If it had been one of my comrades, that stole from me, I... Well, I won't dwell on it. Here. Take this as thanks for hunting down the thief and returning my goods."}],"reward":{"gil":815},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69909]}},"partials":[{"type":"npc","id":"1037682","obj":{"i":1037682,"n":"Varpasa","l":3709,"q":1}},{"type":"quest","id":"69909","obj":{"i":69909,"n":"Shadowed Footsteps","g":11,"l":"Thavnair","s":527}}]}