{"quest":{"name":"Cutting Edge Solutions","location":"Thavnair","id":69744,"patch":6.0,"sort":1320,"eventIcon":71221,"issuer":1037673,"target":1037673,"genre":120,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Apasa regards you with mild annoyance."],"objectives":["Distribute the coating agent to the quarry workers.","Report to Apasa."],"dialogue":[{"name":"APASA","text":"...Are you just going to stand there and watch me work? I'm really quite busy, you know."},{"name":"APASA","text":"Here, make yourself useful and distribute this coating agent amongst the quarriers at the Giantsgall Grounds."},{"name":"APASA","text":"I'll pay you for making the delivery, if that's what you're worried about...?"},{"name":"STONEMASONA04208","text":"Who are you, then?"},{"name":"STONEMASONA04208","text":"Ah, our magic alchemy oil! If we don't coat our tools with this stuff from time to time, they won't so much as scratch the giantsgall. It'd be like mining rock with a wooden spoon."},{"name":"STONEMASONA04208","text":"The durability is what makes it worth quarrying, though, and it's a fine aetherial conductor to boot. You ever need a material like that, you know where to find us!"},{"name":"STONEMASONB04208","text":"Greetings, stranger."},{"name":"STONEMASONB04208","text":"...You've brought our coating agent? The alchemists must be up to their necks in it if they're asking outsiders to run their errands─they usually prefer to make such deliveries in person."},{"name":"STONEMASONB04208","text":"Are they eating? I'll wager they're not eating. Maybe I should cook a pot of something and pay them a visit..."},{"name":"STONEMASONC04208","text":"Come to see the master quarriers at work, have you?"},{"name":"STONEMASONC04208","text":"Oh, my mistake! Seems you were here on a job of your own, and an important one at that. Without a steady supply of coating oil, things around here would grind to a halt."},{"name":"STONEMASONC04208","text":"Giantsgall is one of Thavnair's most sought-after resources, and we don't want to be caught low on stock when the trading ships start leaving port again!"},{"name":"APASA","text":"...You again? I...thank you for delivering those goods."},{"name":"APASA","text":"We have a relationship with the quarriers which stretches back for generations, and an abiding respect for the difficulties we each face. As such, I'm glad your timely delivery prevented any undue loss of labor."},{"name":"APASA","text":"One day soon, I'd like to sit down and share a drink with our stonecutting friends... Please take your payment and leave me to my work. As I said, I'm really quite busy."}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69910]}},"partials":[{"type":"npc","id":"1037673","obj":{"i":1037673,"n":"Apasa","l":3709,"q":1}},{"type":"quest","id":"69910","obj":{"i":69910,"n":"A Boy's Errand","g":11,"l":"Thavnair","s":528}}]}