{"quest":{"name":"Rushing up That Hill","location":"Thavnair","id":69745,"patch":6.0,"sort":1330,"eventIcon":71221,"issuer":1037681,"target":1037681,"genre":120,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Kusuma seems hesitant to address you."],"objectives":["Use the giantsgall knife to obtain bark shavings from the hillside tree.","Deliver the bark shavings and the giantsgall knife to Kusuma."],"dialogue":[{"name":"KUSUMA","text":"Excuse me, explorer...mercenary...adventuring person! Normally, I wouldn't dream of bothering you, but this hardly seems the time to overburden the valiant soldiers of the Radiant Host."},{"name":"KUSUMA","text":"I just need a simple ingredient to further my current research. The complicated part is harvesting said ingredient without being murdered by the local wildlife."},{"name":"KUSUMA","text":"Would you be so kind as to venture into the hills and fetch me some bark shavings from the trees which grow there? Here, I'll lend you my special bark-stripping knife!"},{"name":"KUSUMA","text":"Please take care not to lose the knife─it's made from giantsgall, and was very expensive!"},{"name":"KUSUMA","text":"Ah, you're back! Have you brought the bark...and my knife?"},{"name":"KUSUMA","text":"Yes, this smells absolutely wonderful! I can already imagine the fragrance when I craft the next batch of incense."},{"name":"KUSUMA","text":"I'm studying various methods for enhancing the effects of incense, you see─specifically the scents which promote calm and tranquility."},{"name":"KUSUMA","text":"And with everything that's been happening, well, we could all do with a dose of calm and tranquility, couldn't we?"},{"name":"KUSUMA","text":"Life can be trying at the best of times, and I'm hoping my research will help people endure the worst of them. Thank you kindly for your assistance!"}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69910]}},"partials":[{"type":"npc","id":"1037681","obj":{"i":1037681,"n":"Kusuma","l":3709,"q":1}},{"type":"quest","id":"69910","obj":{"i":69910,"n":"A Boy's Errand","g":11,"l":"Thavnair","s":528}}]}