{"quest":{"name":"Hamsa Retrieval","location":"Thavnair","id":69742,"patch":6.0,"sort":1301,"eventIcon":71221,"issuer":1037685,"target":1037685,"genre":120,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Reensarudh appears utterly distraught."],"objectives":["Search for the wayward hamsa and slay any predators that appear.","Rescue the wayward hamsa.","Speak with Reensarudh."],"dialogue":[{"name":"REENSARUDH","text":"Oh, Ham-Ham! Where could she be!?"},{"name":"REENSARUDH","text":"Please, you must help me! She's gone! My darling Ham-Ham has wandered off!"},{"name":"REENSARUDH","text":"Ah, “Ham-Ham” is the name of my hamsa. ...You're not familiar with the word? It's a species of cloudkin closely related to the Eorzean dodo."},{"name":"REENSARUDH","text":"They're not exactly swift on their feet, so you'd expect she'd be easy to catch...and yet I can't seem to find her anywhere. What if she falls into the sea!? What if some roaming predator tries to make a meal of her!?"},{"name":"REENSARUDH","text":"I can't bear the thought of it! I'll keep scouring the immediate area, but I'd be most grateful if you could search the wilds to the north of here! Oh, my poor Ham-Ham!"},{"name":"REENSARUDH","text":"You will find her, won't you? That splendid, silly bird won't last a day out there on her own..."},{"name":"SYSTEM","text":"You spot hamsa tracks. They appear to be headed westwards..."},{"name":"SYSTEM","text":"A number of feathers litter the ground here. Whatever shed them may still be close by..."},{"name":"SYSTEM","text":"“Ham-Ham” appears to be unhurt, and wholly unfazed by her little adventure. Return the wayward hamsa to Reensarudh."},{"name":"REENSARUDH","text":"Oh, I do hope nothing awful has befallen her..."},{"name":"REENSARUDH","text":"Ham-Ham!!! You found her! I'm honestly surprised she made it that far north... Was she trying to return to the hatchery, I wonder?"},{"name":"REENSARUDH","text":"You may have noticed some ruined buildings up there. Those are the remains of the Hamsa Hatchery, a place of great cultural and historical significance. Until its recent destruction, it seemed an indelible landmark..."},{"name":"REENSARUDH","text":"They were able to relocate some of the breeding birds to stables within the city proper, but many, like my precious Ham-Ham, simply scattered across the countryside. One day, when things have settled down and the hatchery is rebuilt, I hope to return these wayward chicks to their former owner."},{"name":"REENSARUDH","text":"I shall be sad to see them go. While we have the hamsa here, however, we can harvest their poison glands for use in various alchemical mixtures, not to mention enjoy their placid and entirely agreeable company."},{"name":"REENSARUDH","text":"Here, this is for bringing Ham-Ham back safe and sound. Be sure to pay her a visit once her old home has been restored to its former glory!"}],"reward":{"gil":815},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69910]}},"partials":[{"type":"npc","id":"1037685","obj":{"i":1037685,"n":"Reensarudh","l":3709,"q":1}},{"type":"quest","id":"69910","obj":{"i":69910,"n":"A Boy's Errand","g":11,"l":"Thavnair","s":528}}]}