{"quest":{"name":"My Fair Mammet","location":"Old Sharlayan","id":69748,"patch":6.0,"sort":1420,"eventIcon":71221,"issuer":1037104,"target":1037104,"genre":119,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Fraisoinne is feverishly looking around while mumbling to herself."],"objectives":["Search for the elegant mammet near the Last Stand.","Deliver the elegant mammet to Fraisoinne."],"dialogue":[{"name":"FRAISOINNE","text":"Oh, my love, my light, where have you gone? I am nothing without you."},{"name":"FRAISOINNE","text":"Oh! I didn't see you there, absorbed as I am in my search. I've lost track of my mammet, you see─a key asset for my research into the many mysteries of aether."},{"name":"FRAISOINNE","text":"I must have given her an erroneous command, or perhaps even jilted her. She is gifted with such a sensitive heart, you know. In any case, it has been some time since she has left for her task─please, can you assist me?"},{"name":"FRAISOINNE","text":"Oh, thank you, thank you! I sent her on an errand near the Last Stand, so you would do well to begin your search there. Her aura is unmistakable─keep an eye out for her elegant figure and imperious demeanor."},{"name":"FRAISOINNE","text":"I do hope she isn't cavorting with some other researcher. Or heavens forfend, a <span class=\"emphasis\">student</span>... Please, make your way to the Last Stand, and bring my beloved mammet back to me!"},{"name":"SYSTEM","text":"You see before you a mammet most striking, and you can see why its owner is so taken with it. Return it before you are unable to resist the compulsion to keep it for yourself."},{"name":"FRAISOINNE","text":"Come back to me, my princess, my queen. Come back to me!"},{"name":"FRAISOINNE","text":"This is her! My enchanting mammet! And not a single scratch upon her beautiful visage. Words cannot express how happy you've made me!"},{"name":"FRAISOINNE","text":"I commissioned this masterpiece from a gleaner, and had it modeled after the woman who has captured my heart from afar. With the aid of a tome written by Archmagus Quan, I constructed my own device to control it remotely."},{"name":"FRAISOINNE","text":"However, it seems there are yet some kinks to be hammered out. Alas, a heart in rapture is prone to such mistakes. Details are easy to overlook when the whole world is your oyster."},{"name":"FRAISOINNE","text":"I must clear my head and redouble my efforts. Thank you once again for your help today─we won't soon forget you!"}],"reward":{"gil":815,"items":[{"num":2,"id":36038}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69916]}},"partials":[{"type":"npc","id":"1037104","obj":{"i":1037104,"n":"Fraisoinne","l":3706,"q":1}},{"type":"item","id":"36038","obj":{"i":36038,"n":"Amra Salad","l":525,"c":24166,"t":46}},{"type":"quest","id":"69916","obj":{"i":69916,"n":"Sound the Bell, School's In","g":11,"l":"Old Sharlayan","s":534}}]}