{"quest":{"name":"The Creature from the Wooden Crate","location":"Old Sharlayan","id":69749,"patch":6.0,"sort":1430,"eventIcon":71221,"issuer":1041286,"target":1041286,"genre":119,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The timid student is eyeing the thing in front of him with intense curiosity."],"objectives":["Search for the strange creature.","Speak with the timid student while the strange creature is accompanying you."],"dialogue":[{"name":"COLLEGESTUDENT04213","text":"By the looks of you, you are more inclined to adventuring than the average person, yes? Apologies for the imposition, but could you tell me if you've come across a creature such as the one before me on your journeys?"},{"name":"GIANTBEAVER04213","text":"&lt;squeal&gt; &lt;squeal&gt; &lt;squeal&gt;"},{"name":"COLLEGESTUDENT04213","text":"Oh my, there it goes. I had no idea that it could move so quickly."},{"name":"COLLEGESTUDENT04213","text":"Apologies for giving you a fright. That thing was recently delivered to the door of my professor, although the reason why yet eludes us."},{"name":"COLLEGESTUDENT04213","text":"Perhaps one of the gleaners sent it to us, thinking it would make a suitable research subject. I've never seen the likes of it, but it made an awful mess of our facilities. I had hoped the fresh air might calm it down, but..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"That creature is more dangerous than you could imagine."},{"name":"A1","text":"That's a beaver. And it'll grow─quickly."},{"name":"A1","text":"I haven't the foggiest idea what that thing could be."},{"name":"COLLEGESTUDENT04213","text":"D-Dangerous!? If even one as imposing as you says so, then it must be true. And I let it escape!"},{"name":"COLLEGESTUDENT04213","text":"A beaver? I've never heard of such an animal. It must be a rare specimen indeed─and I let it escape!"},{"name":"COLLEGESTUDENT04213","text":"Truly? If even one so worldly as you has never seen such a specimen, then it must be rare indeed. And I just let it escape!"},{"name":"COLLEGESTUDENT04213","text":"If word of my oversight gets out, my professor will tan my hide! I may even be forced to delay my studies by a whole year. I must find that creature at once!"},{"name":"COLLEGESTUDENT04213","text":"We need to cover as much ground as possible─could you aid me in finding it before this day becomes a catastrophe?"},{"name":"COLLEGESTUDENT04213","text":"Thank you, my friend, thank you! Well then, it appears to have run off towards Archons' Design. I wish you good luck in the search!"},{"name":"COLLEGESTUDENT04213","text":"If I were to be seen popping my head into bushes and under benches, others would start asking questions. Rest assured I shall do my part, but I must be discreet about it."},{"name":"COLLEGESTUDENT04213","text":"You, on the other hand, should head to Archons' Design. Two sets of eyes are better than one, I say."},{"name":"SYSTEM","text":"Before you is an odd creature covered in hair."},{"name":"SYSTEM","text":"You have seen this creature before, and your memories of it are not pleasant."},{"name":"GIANTBEAVER04213","text":"&lt;squeal&gt; &lt;squeal&gt;"},{"name":"SYSTEM","text":"This seems to be the creature you are looking for. When you attempt to pick it up, it squeals harshly, but it seems more than willing to follow behind you."},{"name":"SYSTEM","text":"The strange creature is now accompanying you. Keep it at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave the creature behind by entering a different area, or by speaking with it and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have the creature accompany you again, return and speak with it at the original location."},{"name":"COLLEGESTUDENT04213","text":"Oh, hello there. How goes the search?"},{"name":"SYSTEM","text":"You must be accompanied by the strange creature and have it at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"The strange creature has yet to arrive. Be sure it is at your side before attempting to continue."},{"name":"Q2","text":"What will you do?"},{"name":"A2","text":"Speak with the creature."},{"name":"A2","text":"Part ways with the strange creature."},{"name":"A2","text":"Nothing."},{"name":"GIANTBEAVER04213","text":"&lt;squeal&gt;"},{"name":"SYSTEM","text":"Are you sure you wish to part ways with the strange creature?"},{"name":"GIANTBEAVER04213","text":"&lt;squeal&gt; &lt;squeal&gt;"},{"name":"SYSTEM","text":"The strange creature returns to Archons' Design."},{"name":"GIANTBEAVER04213","text":"&lt;squeal&gt;"},{"name":"COLLEGESTUDENT04213","text":"Oh, there you are! You...found the creature? Strange...so did I!"},{"name":"COLLEGESTUDENT04213","text":"Hmm...I could've sworn there was only one in the crate. Perhaps I was mistaken?"},{"name":"COLLEGESTUDENT04213","text":"Well, what harm could another do? All the more for us to study."},{"name":"COLLEGESTUDENT04213","text":"I had very nearly feared I would be a lowly student for yet another year. The outside world calls for my genius, and thanks to you, it shall have it!"}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69916]}},"partials":[{"type":"npc","id":"1041286","obj":{"i":1041286,"n":"Timid Student","l":3706,"q":1}},{"type":"quest","id":"69916","obj":{"i":69916,"n":"Sound the Bell, School's In","g":11,"l":"Old Sharlayan","s":534}}]}