{"quest":{"name":"High Hopes for the Hatchery","location":"Thavnair","id":69743,"patch":6.0,"sort":1310,"eventIcon":71221,"issuer":1039385,"target":1039385,"genre":120,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The Arkasodara youth seems to be trying to catch your attention."],"objectives":["Speak with the Arkasodara youth at the Hamsa Hatchery.","Sprinkle the pungent solution on the hamsa nests.","Hand the hamsa egg to the Arkasodara youth.","Speak with the Arkasodara youth at the Great Work."],"dialogue":[{"name":"RESIDENTS04207","text":"Are you an adventurer, by chance? If you're looking for work, I could use some help sorting out what's left of the hatchery."},{"name":"RESIDENTS04207","text":"You'll come, then? Good. It's just a little ways north of here."},{"name":"RESIDENTS04207","text":"Look at this place... It's a shame what they did to it, those villains from the tower."},{"name":"RESIDENTS04207","text":"I wish you could have seen the hatchery before all this happened. Until only very recently, it was busy as you please, selling meat, eggs, and poison extracts to eager merchants from across Thavnair and beyond..."},{"name":"RESIDENTS04207","text":"But lamenting the facts won't undo what's done, will it? Let's get to work."},{"name":"RESIDENTS04207","text":"Your task will be to sprinkle the nests with this pungent solution, which should keep the wildlife from making their lairs in the ruins. Most creatures won't come within ten yalms of it, but the hamsa don't seem to mind the smell."},{"name":"RESIDENTS04207","text":"And although we should probably clear away those old nests while we're at it, I want the birds to have a familiar sight to come back to...one day. Anyway, you get on with the sprinkling, and I'll start shifting the rubble."},{"name":"RESIDENTS04207","text":"We have a half-dozen vials of that solution, so don't be afraid to slosh it around!"},{"name":"SYSTEM","text":"You find a large egg in one of the nests. Even covered with the stink of the solution, it may prove too tempting for any nearby predator. It might be safest to hand the egg to the Arkasodara youth..."},{"name":"RESIDENTS04207","text":"All done...? Oh, what's that you have there?"},{"name":"RESIDENTS04207","text":"You found a hamsa egg!? One of them must have found her way back here to lay it!"},{"name":"RESIDENTS04207","text":"Whether the mother can return to hatch it, however, is another story... I realize we've only just begun cleaning up here, but I think it's best I get this egg back safely to the Great Work."},{"name":"RESIDENTS04207","text":"Sorry to have you running back and forth, but this is very important to me. While I'm grateful to the alchemists for letting me work here, my true passion was raising the birds at the hatchery."},{"name":"RESIDENTS04207","text":"After the...the “incident,” I didn't think there was much I could do aside from tidying up the mess. As soon as you handed me that egg, though, I felt hopeful again!"},{"name":"RESIDENTS04207","text":"Where there is new life, there are new beginnings, and the Hamsa Hatchery deserves to rise again! It isn't much, but please take this in exchange for the gift you've given me!"}],"reward":{"gil":895},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69910]}},"partials":[{"type":"npc","id":"1039385","obj":{"i":1039385,"n":"Arkasodara Youth","l":3709,"q":1}},{"type":"quest","id":"69910","obj":{"i":69910,"n":"A Boy's Errand","g":11,"l":"Thavnair","s":528}}]}