{"quest":{"name":"A Nose for Trouble","location":"Thavnair","id":69740,"patch":6.0,"sort":1280,"eventIcon":71221,"issuer":1039365,"target":1039365,"genre":120,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The timid Arkasodara is in need of protection."],"objectives":["Speak with the timid Arkasodara.","Speak with the timid Arkasodara again.","Survey the designated locations and defeat any enemies you encounter.","Speak with the timid Arkasodara.","Speak with the timid Arkasodara again."],"dialogue":[{"name":"WEAKARKASODARA","text":"You look pretty strong. Do you think you could help me?"},{"name":"WEAKARKASODARA","text":"I need someone to guard me while I gather Agni grass for my medicines."},{"name":"WEAKARKASODARA","text":"Its scent is difficult to follow, even for we Arkasodara. I can't concentrate and watch my back at the same time."},{"name":"WEAKARKASODARA","text":"Please. I'm afraid some beast will strike me while my guard is down."},{"name":"WEAKARKASODARA","text":"I'm in your debt. I'll sniff out some Agni grass, so follow me."},{"name":"WEAKARKASODARA","text":"&lt;sniff&gt; &lt;sniff&gt; Hmmm... &lt;snuffle&gt;"},{"name":"WEAKARKASODARA","text":"There. It's faint, but I can smell the grass from that way. Let's go."},{"name":"WEAKARKASODARA","text":"This is it! Agni grass! I'll grab a few bundles, you keep watch. I'd hate to get eaten so close to my goal..."},{"name":"WEAKARKASODARA","text":"Stand guard while I gather up this grass."},{"name":"WEAKARKASODARA","text":"Thank you for watching over me! I got all sorts of ingredients, even more than I hoped for."},{"name":"WEAKARKASODARA","text":"All thanks to you. If you weren't here, I would have been too scared to─ What was that...? Perhaps we should continue our talks back at the Great Work."},{"name":"WEAKARKASODARA","text":"Whew, we made it back in one piece. I really can't thank you enough. With your brawn and my nose, I got enough Agni grass to solve a whole army's digestive issues."},{"name":"WEAKARKASODARA","text":"Having olfactory senses five times as strong as your average Midlander's comes in handy sometimes."},{"name":"WEAKARKASODARA","text":"This place can be a bit much, though. So many smells mingling and clashing, and all of them so strong..."},{"name":"WEAKARKASODARA","text":"Anyway, thank you again, kind adventurer. Please, take this."}],"reward":{"gil":975},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69909]}},"partials":[{"type":"npc","id":"1039365","obj":{"i":1039365,"n":"Timid Arkasodara","l":3709,"q":1}},{"type":"quest","id":"69909","obj":{"i":69909,"n":"Shadowed Footsteps","g":11,"l":"Thavnair","s":527}}]}