{"quest":{"name":"Scouting for Scouts","location":"Garlemald","id":69758,"patch":6.0,"sort":1510,"eventIcon":71221,"issuer":1037755,"target":1037755,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Scouts must excel in keeping themselves hidden, but when even their own comrades cannot locate them, there is surely trouble afoot."],"objectives":["Search for the wounded contingent scout.","Speak with the wounded contingent scout.","Aid the injured civilian.","Report to Talon."],"dialogue":[{"name":"TALON","text":"Please, a moment of your time!"},{"name":"TALON","text":"A friend who was sent out on reconnaissance has been gone far too long, and she's not responding to her linkpearl."},{"name":"TALON","text":"Will you help me look for her?"},{"name":"TALON","text":"I knew you would! Let's split up─I'll search around the camp, while you head for the lake."},{"name":"TALON","text":"If this doesn't work, we'll have to cast the net a bit wider."},{"name":"WOUNDEDSOLDIER04222","text":"Thank goodness you're here. Never mind me, this man is in desperate need of aid!"},{"name":"WOUNDEDCITIZEN04222","text":"Ugh!"},{"name":"WOUNDEDCITIZEN04222","text":"I thought he could use my help, so I called out to him, but he soon bolted in fear. That's when one of these fiends appeared out of nowhere and pounced on him."},{"name":"WOUNDEDSOLDIER04222","text":"Although I rushed to fend it off, it had already signaled to its pack mates. Then, just as they had me on the back foot, you arrived."},{"name":"WOUNDEDSOLDIER04222","text":"I would've called for assistance if my hands weren't already full. But thanks to your timely intervention, I can finally send for troops to take this poor fellow to safety."},{"name":"WOUNDEDSOLDIER04222","text":"I'll move him to a more secure location until our comrades get here. While you and I are both perfectly capable of conveying the situation via linkpearl, perhaps it would set their minds at ease if you could also speak to them in person?"},{"name":"WOUNDEDSOLDIER04222","text":"Once he's caught his breath, I'll get him out of the open. I'm sure there's a good hiding place nearby."},{"name":"WOUNDEDCITIZEN04222","text":"Ugh!"},{"name":"TALON","text":"Gods be good! I'll dispatch troops at once!"},{"name":"TALON","text":"We're lucky you got there when you did, though I wonder what drew that civilian to such a dangerous place to begin with. Perhaps he was in search of supplies?"},{"name":"TALON","text":"I doubt he'd find much food in that particular area, so it must've been fuel he was after. If I were him, I'd try that enormous extraction facility on the lake, but it sounds like he was hoping to get ceruleum from the water itself."},{"name":"TALON","text":"Seems like a tricky task at the best of times, although I expect the folks around those parts have their methods. If so, they could probably stay holed up for months on end, providing there's enough food to go around."},{"name":"TALON","text":"Well, the main thing is that he and my friend are no longer in any danger. I see now you're every bit the hero people say you are, not that I ever doubted it!"}],"reward":{"gil":895},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69929]}},"partials":[{"type":"npc","id":"1037755","obj":{"i":1037755,"n":"Talon","l":3710,"q":2}},{"type":"quest","id":"69929","obj":{"i":69929,"n":"Strange Bedfellows","g":11,"l":"Garlemald","s":547}}]}