{"quest":{"name":"A Dream of Home","location":"Garlemald","id":69754,"patch":6.0,"sort":1540,"eventIcon":71221,"issuer":1041119,"target":1040898,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The commissary officer would seek out the opinions of the refugees."],"objectives":["Speak with the refugee at the runaway train.","/pray to the cairn.","Speak with the commissary officer.","Speak with the commissary officer in Camp Broken Glass."],"dialogue":[{"name":"JARECK","text":"I heard about what you did out there. My thanks for disposing of those machines."},{"name":"BLONDESUPPLYMEMBER04216","text":"One final task, and I won't bother you any longer. You needn't fight anything, at least not if you don't want to. No, this time I mean to make use of your more diplomatic faculties."},{"name":"BLONDESUPPLYMEMBER04216","text":"One of my duties here is to find out whether the refugees wish to return home or not. Naturally, each will have their own decision, and their own reasons, but getting a general feel for things will help us determine the best way to help in the days ahead."},{"name":"BLONDESUPPLYMEMBER04216","text":"I'll gather what information I can from the people in the caves. You only have to speak with one man, but it may take a bit of work to find him."},{"name":"BLONDESUPPLYMEMBER04216","text":"I've been told he ventured off toward the wreckage of the imperial train. Now, we could wait for him to return, but I'm running behind as it is. If you could do this, you'd be helping not only me, but all those who've been left without a home."},{"name":"BLONDESUPPLYMEMBER04216","text":"Excuse me, but if you could spare a moment, I'm from the contingent and would like to ask you a few questions..."},{"name":"JARECK","text":"As far as I'm concerned, we'll be happy to answer any questions you and the lass might have. You've already shown you only have our best interests at heart."},{"name":"BLONDEPROVINCIAPEOPLE04218","text":"Oh, it's not often I encounter someone else out here. If you've come here for ceruleum, then I'm afraid this area has already been picked clean."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'm here to ask if you want to return to your homeland."},{"name":"A1","text":"I'm here to ask if you wish to leave Garlemald."},{"name":"BLONDEPROVINCIAPEOPLE04218","text":"Hmm? Jareck has already asked me as much, but I suppose you must be thorough. Could you give me a moment? I would first like to offer a prayer to the departed."},{"name":"BLONDEPROVINCIAPEOPLE04218","text":"This wreckage was left in the wake of one particularly fierce battle. A dear friend of mine journeyed here to search it for abandoned supplies, but a sudden explosion cut his life short. "},{"name":"BLONDEPROVINCIAPEOPLE04218","text":"Although I had meant to offer him a lone prayer, why don't you join me? He always was one to enjoy the company of others, even those he scarcely knew. I've placed these stones to mark the spot of his passing─<span class=\"highlight\">pray</span> to his memory if you will."},{"name":"BLONDEPROVINCIAPEOPLE04218","text":"Approach the memorial and <span class=\"highlight\">pray</span>. He was a brave man, and well loved."},{"name":"SYSTEM","text":"A cairn has been erected here to commemorate a lost soul. Approach it and <span class=\"highlight\">pray</span> to the departed."},{"name":"BLONDEPROVINCIAPEOPLE04218","text":"Thank you. Whatever sustenance prayers provide to those who have passed, I am sure my friend is grateful for it."},{"name":"BLONDEPROVINCIAPEOPLE04218","text":"As for your previous question, well... I am Ala Mhigan by birth, and was taken from my home and family by the Empire and made to serve in their interminable wars."},{"name":"BLONDEPROVINCIAPEOPLE04218","text":"After ten years my hands were so stained with blood I no longer recognized them as my own. Days, weeks, years blended into one another until finally I was released from service. For the first time in a long while, I thought for myself..."},{"name":"BLONDEPROVINCIAPEOPLE04218","text":"Did my wife and child still live? Would they allow one so steeped in sin back into their home? Even now I cannot bring myself to consider the answers to those questions."},{"name":"BLONDEPROVINCIAPEOPLE04218","text":"So in short, I cannot say. Please, leave me with my thoughts. I won't be far behind, I promise."},{"name":"JARECK","text":"It's good to see you. I know these caves aren't very welcoming, but feel free to return here whenever the fancy strikes."},{"name":"BLONDESUPPLYMEMBER04216","text":"There you are! And even sooner than I had anticipated. What did the man say?"},{"name":"BLONDESUPPLYMEMBER04216","text":"I see... Such a tragic story, but sadly not an uncommon one. It seems that for some, the question of where home lies has no easy answer."},{"name":"BLONDESUPPLYMEMBER04216","text":"In any case, we've done all that we can at present. Let's return to the camp and report our findings to the contingent, eh?"},{"name":"BLONDESUPPLYMEMBER04216","text":"I've gone to the trouble of submitting my report already, so you needn't worry about that. And as I promised, that brings an end to my endless requests."},{"name":"BLONDESUPPLYMEMBER04216","text":"Truth be told, my motivations for being here aren't entirely out of a sense of duty. My father was conscripted into the Garlean forces long ago, so when I heard that refugees had been found here, I had to meet them for myself."},{"name":"BLONDESUPPLYMEMBER04216","text":"I volunteered for this duty, but unfortunately none of the refugees stirred my memories of him."},{"name":"BLONDESUPPLYMEMBER04216","text":"Still, I won't give up the search. No matter what misdeeds he was forced to commit, all I want is to see him again. To share a meal under the same roof."},{"name":"BLONDESUPPLYMEMBER04216","text":"Some, like Jareck, seem resigned to accept this place as their home. But there are others, like my father, who have people waiting for them, searching for them. If I can see even one family reunited, then all of this will have been worth it."},{"name":"BLONDESUPPLYMEMBER04216","text":"Although the road ahead is a long one, it's time I stopped forcing you to walk it with me. Thanks for all you've done, friend. Please take this─you've earned it a thousand times over."}],"reward":{"gil":895},"reqs":{"jobs":[{"lvl":80,"id":34}],"questsType":"all","quests":[69929,69753]}},"partials":[{"type":"npc","id":"1041119","obj":{"i":1041119,"n":"Commissary Officer","l":3710,"q":2}},{"type":"npc","id":"1040898","obj":{"i":1040898,"n":"Commissary Officer","l":3710,"q":2}},{"type":"quest","id":"69929","obj":{"i":69929,"n":"Strange Bedfellows","g":11,"l":"Garlemald","s":547}},{"type":"quest","id":"69753","obj":{"i":69753,"n":"Armored Up","g":123,"l":"Garlemald","s":1530}}]}