{"quest":{"name":"Help Me to Help You","location":"Garlemald","id":69756,"patch":6.0,"sort":1500,"eventIcon":71221,"issuer":1037728,"target":1037728,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Menuki's worried expression rather spoils his otherwise formidable appearance."],"objectives":["Survey Horrea Campi from the designated location.","Speak with the forthright local boy.","Report to Menuki."],"dialogue":[{"name":"MENUKI","text":"I have a question─do I look imposing? Intimidating, perhaps?"},{"name":"MENUKI","text":"Sorry, you must think it strange I would ask such a thing. The truth is, I encountered a boy near one of the storerooms, and when I called out to him, he ran away at the sight of me! I was only trying to lend a helping hand!"},{"name":"MENUKI","text":"Later on, I learned that the place was used as a granary, so the lad was most likely searching for food. Now, thanks to me scaring him off, he probably had to go hungry."},{"name":"MENUKI","text":"I couldn't live with myself if he starved because of me, though I fear he'd only run off if I tried to approach him. I wonder...perhaps you wouldn't mind going in my stead?"},{"name":"MENUKI","text":"Here, you might find him more easily with this telescope. May the kami guide you!"},{"name":"MENUKI","text":"If you have the chance, please tell him I mean no harm!"},{"name":"SYSTEM","text":"You spot the boy carrying a crate in the direction of Liminal Station IV."},{"name":"BOY04220","text":"Wh-What do you want!?"},{"name":"BOY04220","text":"Saw me, did you? So what!? I didn't do anything wrong! Finders keepers!"},{"name":"BOY04220","text":"And this food ain't just for me─the others need it, too. I know you're just trying to help, but we can look after ourselves!"},{"name":"BOY04220","text":"If your friend's worried about us, tell him we'll be all right. Until this food runs out, anyway."},{"name":"BOY04220","text":"What!? No, I don't need help carrying it! Just having a rest, that's all."},{"name":"MENUKI","text":"Did you manage to track him down?"},{"name":"MENUKI","text":"That's a relief, though his outright refusal of our help is concerning."},{"name":"MENUKI","text":"We came here with the best intentions, but barely a moment's consideration for how the people of Garlemald might feel towards us. I suppose it's only natural they'd be wary."},{"name":"MENUKI","text":"If they won't accept our aid, we can still make their lives a little easier. We'll start by making the area around the granary safer, so they can gather food whenever they please. Here, I'd like you to have this for giving me peace of mind."}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69929]}},"partials":[{"type":"npc","id":"1037728","obj":{"i":1037728,"n":"Menuki","l":3710,"q":1}},{"type":"quest","id":"69929","obj":{"i":69929,"n":"Strange Bedfellows","g":11,"l":"Garlemald","s":547}}]}