{"quest":{"name":"Bear Baiting","location":"Garlemald","id":69759,"patch":6.0,"sort":1470,"eventIcon":71221,"issuer":1037751,"target":1037751,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Man-eating bears stalk the ice fields, and Iliette has a mind to turn the tables, but not quite as one would expect."],"objectives":["Place sedative-laced venison at the designated locations.","Report to Iliette."],"dialogue":[{"name":"ILIETTE","text":"Just the person I was hoping to see! Might I interest you in a little hunting?"},{"name":"ILIETTE","text":"It's bears I'm after. If you've never tried their meat, I'd thoroughly recommend it! They're far from the easiest of prey, though I daresay you've faced much worse."},{"name":"ILIETTE","text":"If you're game, here's the plan: first, we lure them out with this deer meat, which is also laced with sleeping potion. Then, it's a simple matter of walking over and offing them in the manner of your choosing. What could be simpler?"},{"name":"ILIETTE","text":"Here's three ample servings of prime venison. Be sure to let the concoction take effect before swooping in to claim your prize!"},{"name":"ILIETTE","text":"You'd do well to stay alert while lying in wait. Wouldn't want any bears sneaking up from behind, would you?"},{"name":"ILIETTE","text":"I see you are still in possession of a full set of limbs, which can only mean the hunt was a success! Truth be told, I heard from others in the field that the bear you encountered was rather more...lively than we'd anticipated. And a fair bit bigger."},{"name":"ILIETTE","text":"What!? You felled that brute all by yourself?"},{"name":"ILIETTE","text":"Most impressive... Though it would appear that the sleeping potion provided by Lord Emmanellain was considerably less effective than he'd led us to believe..."},{"name":"ILIETTE","text":"As he tells it, he adopted this approach after incurring the wrath of his lord father for his inability to master more...sporting methods. He spoke of his exploits with some pride, despite the tales hardly painting him in a favorable light."},{"name":"ILIETTE","text":"Still, in our present situation, we must forgo the thrill of the hunt and select the means that present the surest route to success, underhanded though they may be."},{"name":"ILIETTE","text":"Regrettably, the bears of this region are entirely immune to the formula...or perhaps there was something wrong with it to begin with. In any case, no harm done, eh? To you, I mean, not the bears. Obviously."}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69919]}},"partials":[{"type":"npc","id":"1037751","obj":{"i":1037751,"n":"Iliette","l":3710,"q":2}},{"type":"quest","id":"69919","obj":{"i":69919,"n":"A Frosty Reception","g":11,"l":"The Lochs","s":537}}]}