{"quest":{"name":"Booking Books","location":"Old Sharlayan","id":69751,"patch":6.0,"sort":1450,"eventIcon":71221,"issuer":1037139,"target":1037139,"genre":119,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Isilswys is poring over a book, but her mind seems to be elsewhere."],"objectives":["Use the sleeping powder on the vicious volumes.","Return the volumes to Isilswys."],"dialogue":[{"name":"ISILSWYS","text":"Ah, I've seen you around Noumenon as of late. You're the adventurer, yes? I've been meaning to seek you out─I believe I have a task rather suited to your abilities."},{"name":"ISILSWYS","text":"We've recently added a set of volumes procured from the Great Gubal Library to our collection, but no sooner did we set them in the stacks than did a student handle them without taking the proper precautions."},{"name":"ISILSWYS","text":"A spell was activated that apparently was meant to prevent their theft, causing all five of them to go scurrying─yes, scurrying─off to gods know where."},{"name":"ISILSWYS","text":"They are quite ornery in their current state, and I'm afraid few of us are suited for combat. For you, however, books should be a simple enemy to best, if it comes to that."},{"name":"ISILSWYS","text":"As I said before, five volumes are skulking about at present. I've prepared a solution that should calm their rage somewhat, but they may require a few knocks on the spine before you can carry them safely. Would you be so kind as to collect them for us?"},{"name":"ISILSWYS","text":"Thank you, and godsspeed."},{"name":"ISILSWYS","text":"Five volumes jumped from the shelves and ran away from us before we realized what was happening. Stay safe─they aren't in the best of moods."},{"name":"SYSTEM","text":"The book is chomping at the air, as if to ward off anyone from coming too close. Use the powder to put it to sleep, but keep watch for your fingers."},{"name":"SYSTEM","text":"The book is slumbering peacefully. At least, it appears so..."},{"name":"SYSTEM","text":"The book is fast asleep. Judging from the cover, it contains stories of a Bangaa handmaiden and her lance. On the back cover is written “Restricted.”"},{"name":"ISILSWYS","text":"Did you manage to collect the books? I hope they didn't have you running about for too long."},{"name":"ISILSWYS","text":"Ah, yes, this is all of them! Thank you, adventurer. These were quite the precious finds, and it would have been a shame if they jumped off a cliff or somewhere else equally as precarious."},{"name":"ISILSWYS","text":"I see among them was a restricted tome. Hmm, I'll have a word with the student whose recklessness caused this whole incident. Although he has been chastised plenty already, you can be sure."},{"name":"ISILSWYS","text":"Unfortunately, this incident isn't the first of its kind. Books protected by this manner of ward must only be handled with gloves woven from the selfsame grass I used to make the sleeping powder."},{"name":"ISILSWYS","text":"If we don't take such measures, the books will crumble from age and the elements within a few generations. It's one of the very first lessons we teach students, but there's one almost every year who fails to listen."}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69916]}},"partials":[{"type":"npc","id":"1037139","obj":{"i":1037139,"n":"Isilswys","l":3706,"q":1}},{"type":"quest","id":"69916","obj":{"i":69916,"n":"Sound the Bell, School's In","g":11,"l":"Old Sharlayan","s":534}}]}