{"quest":{"name":"Fast Fashion","location":"Old Sharlayan","id":69750,"patch":6.0,"sort":1440,"eventIcon":71221,"issuer":1041287,"target":1041287,"genre":119,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The student appears to be deep in thought."],"objectives":["Speak with the Lalafellin student.","While donning the professorial robes, show off your /battlestance at the designated location.","Pick up the crate of crystals while donning the professorial robes.","Deliver the crate of crystals to Kekemo while donning the professorial robes.","Speak with the Lalafellin student.","Speak with the Lalafellin student again."],"dialogue":[{"name":"COLLEGESTUDENT04214","text":"Ah, you look to be the sort who's out and about, performing various feats of derring-do and so forth. Why, the scent of the outdoors is practically wafting from you!"},{"name":"COLLEGESTUDENT04214","text":"Perhaps you've heard of the competition being held in the city? Designers from across the region submit designs for academic uniforms, and the winner will be worn by none other than the members of the Forum."},{"name":"COLLEGESTUDENT04214","text":"The chosen designer becomes exalted among their peers─even a lowly student can have their name said in hushed whispers across the Studium. I would have such fame for myself!"},{"name":"COLLEGESTUDENT04214","text":"I believe my concept might be just the thing to help me win it! I have an image in my mind of a rustic scholar─one who enjoys the open air of wilderness as much as the musty air of the library stacks."},{"name":"COLLEGESTUDENT04214","text":"In fact, I have already prepared an initial design that looks to fit your frame perfectly. Would you try it on for me, that I might see if it conveys the message I have in mind?"},{"name":"Q1","text":"Lend your aid to the student?"},{"name":"COLLEGESTUDENT04214","text":"Splendid, splendid! Well then, we should find an area where you will be free to move as you please. I believe...Tranquility should be just the locale we require. Come, come!"},{"name":"COLLEGESTUDENT04214","text":"Oh...I see. Well, if you change your mind, I'll most likely still be here. You won't want to miss out on the chance to sport these robes before anyone else. "},{"name":"COLLEGESTUDENT04214","text":"This appears to be a suitable spot. Spacious, sunlight. Now try the robes on for size, although I'm somewhat certain they'll fit perfectly."},{"name":"COLLEGESTUDENT04214","text":"However, I'd like to see how easy it is for you to perform feats of heroism─swinging your weapon up and down, grinning devilishly─things like that. Show me that <span class=\"highlight\">battle stance</span> you adventurers are so famous for."},{"name":"SYSTEM","text":"You will change into the professorial robes temporarily. You must stay clothed in the robes in order to progress."},{"name":"SYSTEM","text":"If the robes are removed or you wish to wear them longer, speak with the Lalafellin student. "},{"name":"COLLEGESTUDENT04214","text":"You like them that much? Very well, feel free to wear them as long as you like!"},{"name":"COLLEGESTUDENT04214","text":"Oh, have you lost the robes? Well, not to worry─I had a spare on hand for this very occasion! ...You <span class=\"emphasis\">do</span> like them, don't you?"},{"name":"SYSTEM","text":"You must be clad in the professorial robes in order to progress."},{"name":"SYSTEM","text":"Test out how well you can move in the professorial robes. Show off your /battlestance to the Lalafellin student."},{"name":"COLLEGESTUDENT04214","text":"Ah, yes, you look ready for a grand adventure under the sun! I believe these robes shall be well suited to both the lectern and the open fields!"},{"name":"COLLEGESTUDENT04214","text":"Now, I'd like to test the fabric's breathability. Work up a bit of a sweat for me, will you?"},{"name":"COLLEGESTUDENT04214","text":"A friend of mine needs a delivery done, and who better than you to do it? Please bring this crate here to Kekemo at the Confluence. It's a bit of a trek, but you look up to the task."},{"name":"SYSTEM","text":"Deliver the crate of crystals to Kekemo at the Confluence before the time runs out."},{"name":"SYSTEM","text":"You will have 190 seconds to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"KEKEMO","text":"Hmm? Did you need something from me? Apologies, but I'm quite busy..."},{"name":"SYSTEM","text":"You must be clad in the professorial robes in order to progress."},{"name":"KEKEMO","text":"Uwah!? A member of the Forum, here!? I-I mean, welcome to my humble laboratory. What did you need, um, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>?"},{"name":"KEKEMO","text":"Oh, you gave me quite the fright. You should be more aware of the effect that such robes have on the people here, students and professors alike."},{"name":"KEKEMO","text":"Of course, I'll accept these crystals most gladly. That being said, pray inform the student who gave them to you that she should do her own work from now on, regardless of what <span class=\"emphasis\">experiments</span> she may be conducting."},{"name":"KEKEMO","text":"The crystals are much appreciated, but I worry that that student doesn't properly understand the value of doing her own work. All because she “wanted you to sweat,” you say?"},{"name":"COLLEGESTUDENT04214","text":"Welcome back, my adventurous assistant. I take it the crystals were delivered without incident?"},{"name":"COLLEGESTUDENT04214","text":"I see. Kekemo can scarcely get through a single conversation without giving her unwanted advice. No matter, when my robes are chosen, I wager she'll treat me with the respect I deserve."},{"name":"COLLEGESTUDENT04214","text":"You don't appear to be flush, so I take it the robes were light enough to allow somewhat physically taxing duties. However, I would like to examine them closer for any signs of wear. Could you return them to me?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I'll be keeping them for now."},{"name":"A2","text":"I'm more than happy to."},{"name":"COLLEGESTUDENT04214","text":"You like them that much? I'm flattered, to be sure, but I must insist. Take. Them. Off."},{"name":"COLLEGESTUDENT04214","text":"Thank you. My masterpiece draws one step closer to perfection."},{"name":"COLLEGESTUDENT04214","text":"Functionally, it appears that I'm on the right track. Now I must refine the design, so that when the members of the Forum behold it, they can think of nothing else but to wear them for years to come."},{"name":"COLLEGESTUDENT04214","text":"Of course, I didn't mean to leave your coinpurse empty after all of this. Return to where we first met, and I shall bring your reward."},{"name":"COLLEGESTUDENT04214","text":"Apologies that I could not give you more than this, but you understand that the life of a student isn't one of luxury."},{"name":"COLLEGESTUDENT04214","text":"When my name is heralded through the halls of the Studium, however, I'll be certain to share with you the windfall that will surely come my way. Until then."}],"reward":{"gil":895},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69916]}},"partials":[{"type":"npc","id":"1041287","obj":{"i":1041287,"n":"Lalafellin Student","l":3706,"q":1}},{"type":"quest","id":"69916","obj":{"i":69916,"n":"Sound the Bell, School's In","g":11,"l":"Old Sharlayan","s":534}}]}