{"quest":{"name":"Armored Up","location":"Garlemald","id":69753,"patch":6.0,"sort":1530,"eventIcon":71221,"issuer":1041122,"target":1041119,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The commissary officer is pleased to see you willing to help once more."],"objectives":["Speak with the commissary officer.","Ride the magitek armor to the designated locations and destroy the magitek drones.","Speak with the commissary officer."],"dialogue":[{"name":"JARECK","text":"That trek couldn't have been an easy one, what with the monsters and the cold and everything else besides. It ain't worth much, but you have my thanks. As this lass tells it, I might have occasion to thank you again before long."},{"name":"BLONDESUPPLYMEMBER04216","text":"So you've found it within your heart to help an old friend once again, eh? Rest assured I won't soon forget your generosity. Now, on to the matter at hand."},{"name":"BLONDESUPPLYMEMBER04216","text":"The people here have told me about the magitek weaponry stalking the frozen tundra. With no pilots to guide them, they unleash their fury upon whosoever is unfortunate enough to cross their path."},{"name":"BLONDESUPPLYMEMBER04216","text":"Several of the refugees attempted to combat the threat using a few abandoned suits of magitek armor, but they were soon overwhelmed. It's not often you see magitek turn on magitek, but not much surprises me these days."},{"name":"BLONDESUPPLYMEMBER04216","text":"Luckily no one was killed during that incident, but the mindless machines are still out there, primed and ready for their next target."},{"name":"BLONDESUPPLYMEMBER04216","text":"That's where you come in. The stories say you're a demon in magitek armor, and I reckon you'd reduce those things into piles of scrap before I even felt the chill in my fingertips. "},{"name":"BLONDESUPPLYMEMBER04216","text":"Like I said before, I'd do it myself, but seeing as how I've never even ridden in a suit of armor, I'd just be buying myself a ticket to an early grave."},{"name":"BLONDESUPPLYMEMBER04216","text":"Rest assured, however, that I'll do my best to learn from your example. Anyroad, there's a suit waiting for us outside─I'll go ahead and ready it for you. Don't leave me waiting out in the cold for too long."},{"name":"JARECK","text":"I'd help you if I could, but I'd just get in the way. For what it's worth, I'll be praying for your victory."},{"name":"BLONDESUPPLYMEMBER04216","text":"Well, she's as ready as she'll ever be. I don't think I need to tell you this, but make sure not to bring those things near the cave. I'll stand watch from here to make sure all goes to plan─stay safe out there, friend."},{"name":"BLONDESUPPLYMEMBER04216","text":"I've readied the armor for you, now it's up to you to get rid of those troublesome machines. Apologies I can't be of further help other than to say “good luck!”"},{"name":"JARECK","text":"I heard about what you did out there. My thanks for disposing of those machines."},{"name":"BLONDESUPPLYMEMBER04216","text":"There you are, safe and sound. See, I knew you'd make quick work of those heaps of metal."},{"name":"BLONDESUPPLYMEMBER04216","text":"Doubtless they were used to deadly effect when the Garleans waged war amongst themselves. In order to ensure they fired upon their own countrymen, they were made to destroy anything that came within their sights."},{"name":"BLONDESUPPLYMEMBER04216","text":"The fact that they're causing trouble this far out is distressing indeed. I must warn my superiors upon my return!"},{"name":"BLONDESUPPLYMEMBER04216","text":"Before that, however, there is yet one more task I would ask of you. I fear I might be imposing overmuch, but you have my word that this is the last one."}],"reward":{"gil":815,"items":[{"id":35682}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"questsType":"all","quests":[69929,69752]},"next":[69754]},"partials":[{"type":"npc","id":"1041122","obj":{"i":1041122,"n":"Commissary Officer","l":3710,"q":2}},{"type":"npc","id":"1041119","obj":{"i":1041119,"n":"Commissary Officer","l":3710,"q":2}},{"type":"item","id":"35682","obj":{"i":35682,"n":"Pewter Earring Coffer (IL 525)","l":1,"c":26564,"t":61}},{"type":"quest","id":"69929","obj":{"i":69929,"n":"Strange Bedfellows","g":11,"l":"Garlemald","s":547}},{"type":"quest","id":"69752","obj":{"i":69752,"n":"Best Delivered Cold","g":123,"l":"Garlemald","s":1520,"f":1}},{"type":"quest","id":"69754","obj":{"i":69754,"n":"A Dream of Home","g":123,"l":"Garlemald","s":1540}}]}