{"quest":{"name":"Heroes All","location":"Garlemald","id":69757,"patch":6.0,"sort":1480,"eventIcon":71221,"issuer":1037733,"target":1037733,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>With treatment of the tempered continuing apace, who will care for the carers?"],"objectives":["Deliver the warming ethers to the healers.","Report to June."],"dialogue":[{"name":"JUNE","text":"Could you spare a few moments to assist me?"},{"name":"JUNE","text":"The situation's rather dire, I'm afraid. Even now, our healers continue to treat the imperial troops encountered on the Magna Glacies, and prolonged use of curative magicks has pushed them beyond their limits."},{"name":"JUNE","text":"To make matters worse, spending so much time around the tempered─with all their raving and thrashing about─takes its toll on their carers. I daresay a few words of encouragement from the champion of Eorzea will help raise their spirits."},{"name":"JUNE","text":"I also have a few bottles of ether to alleviate their fatigue. Would you mind distributing these among the healers?"},{"name":"JUNE","text":"The ethers actually contain a few extra ingredients to produce a warming effect, which I'm sure the healers will appreciate."},{"name":"SOLDIERB04221","text":"Oh, I've seen you before! You fought bravely at the Naadam, as I recall. And you come bearing gifts?"},{"name":"SOLDIERB04221","text":"Yes...treating the tempered is a lot harder than I'd imagined. Before we came here, I'd only heard rumors of the condition, but to see it with my own eyes... No one deserves that. No one."},{"name":"SOLDIERB04221","text":"That's why the work we do is so important. Once I have finished resting─as I was ordered─I shall return to the patients. I thank you for your kindness."},{"name":"SOLDIERC04221","text":"The Warrior of Light? It's an honor to meet you."},{"name":"SOLDIERC04221","text":"Oh, I'm just doing my job, is all─ No need to thank me. Well...truth be told, it's beginning to wear on me, bit by bit."},{"name":"SOLDIERC04221","text":"I once lost a friend to tempering, and every time we manage to cure one of the afflicted, I'm reminded of those we couldn't save. If only we'd had a way of treating them...before they were..."},{"name":"SOLDIERC04221","text":"...No, I mustn't let such thoughts cloud my mind. And we're all very grateful for the work of the Scions in creating this treatment. For my part, I'll do everything in my power to save as many lives as possible."},{"name":"SOLDIERD04221","text":"Hmm? Sorry, I was a bit...distracted."},{"name":"SOLDIERD04221","text":"Aye...you wouldn't believe some of the things I've seen. Those poor bastards...calling out to Varis for salvation, wailing out anthems praising the Empire─and then there's the screaming. Gods, I can still hear them..."},{"name":"SOLDIERD04221","text":"But I mustn't let that stop me from fulfilling my duty. I'll fill my ears with wax if I have to. And once I get this ether down my neck, I'll return to my post."},{"name":"SOLDIERB04221","text":"This ether tastes quite good, and even a few sips seems to have worked wonders!"},{"name":"SOLDIERC04221","text":"Gods only know how many more tempered need curing. We'll do what we can, I just pray it's enough."},{"name":"SOLDIERD04221","text":"This stuff seems to be doing the trick, and it's even taking the edge off the cold."},{"name":"JUNE","text":"Ah, you've finished your rounds, then. Did the healers have anything to share?"},{"name":"JUNE","text":"...It's worse than I'd thought."},{"name":"JUNE","text":"Even the tempered we'd seen in our homelands did little to prepare us for the sheer numbers we've encountered here. Curing them all may appear to be an insurmountable task, but we must try."},{"name":"JUNE","text":"That's why maintaining morale and the well-being of our healers is so important, and you've made a valuable contribution. I'd like you to have this, by way of thanks."}],"reward":{"gil":735,"items":[{"num":2,"id":36040}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69923]}},"partials":[{"type":"npc","id":"1037733","obj":{"i":1037733,"n":"June","l":3710,"q":1}},{"type":"item","id":"36040","obj":{"i":36040,"n":"Island Miq'abob","l":525,"c":24351,"t":46}},{"type":"quest","id":"69923","obj":{"i":69923,"n":"A Way Forward","g":11,"l":"Garlemald","s":541}}]}