{"quest":{"name":"Your Inventory Is Not Full","location":"Garlemald","id":69755,"patch":6.0,"sort":1460,"eventIcon":71221,"issuer":1039381,"target":1039381,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Keeping tabs on its supplies does not appear to be the Ilsabard contingent's forte."],"objectives":["Speak with the soldiers.","Report to the contingent quartermaster."],"dialogue":[{"name":"OFFICER04219","text":"I've an important task to perform, and by that, I mean “have someone else perform.”"},{"name":"OFFICER04219","text":"I've been lumbered with the unenviable duty of keeping inventory of supplies brought by each delegation. Though weaponry and basic provisions have been accounted for, I can't say the same for what might be considered...creature comforts."},{"name":"OFFICER04219","text":"You see, even the most frivolous of things can make a huge difference out here in the frozen wastes, so I'm trying to put together a list of the luxury goods at our disposal. Seeing as you're on good terms with practically everyone here─better than me, at any rate─perhaps you could help?"},{"name":"OFFICER04219","text":"Much appreciated. I've already sent one of my subordinates to speak with the Maelstrom, Temple Knights, and Ala Mhigan Resistance."},{"name":"OFFICER04219","text":"I need you to ask the remaining groups, namely the Twin Adders, Immortal Flames, and our Far Eastern allies. Any information you can bring me would be most welcome."},{"name":"OFFICER04219","text":"It's not important who you ask, as long as they know what they're talking about!"},{"name":"JUNE","text":"Creature comforts? Well, we did bring a large shipment of tea leaves provided by the Carline Canopy."},{"name":"JUNE","text":"Mother Miounne and Fufucha both agreed that there's no better way to stave off the cold than a nice, hot brew, and I can personally attest to that! We've enough for everyone if they've a mind to try it."},{"name":"MENUKI","text":"Hmm... There is one thing that springs to mind. We brought several bolts of felt, which might seem a bit odd to some."},{"name":"MENUKI","text":"Most people don't realize how effective it is in keeping the cold out and the warm in, and that's not all. We use it in everything from clothing, to our yurts, and even for patching up wounds! Of course, we're more than willing to share it with the rest of the contingent."},{"name":"MENUKI","text":"We also have a whole crate of what you might call “warming stones” in the common tongue. Hold one in your hands and you'll see what I mean. There are plenty of those to go around as well."},{"name":"KOCHACHA","text":"Let me see... Other than the usual materiel, we also have a number of tents donated by Lord Lolorito."},{"name":"KOCHACHA","text":"A few of them have been pitched around the camp, and you might be interested to know they were woven by Ala Mhigan refugees. We're all glad they've found meaningful employment, and the quality of their work speaks for itself."},{"name":"KOCHACHA","text":"We do appear, however, to have overestimated how many tents we would need, and find ourselves with a surplus of cloth. We soon discovered, however, that when folded up, the tent sheets make for surprisingly good bedding. I'd be happy to donate a few."},{"name":"JUNE","text":"I'm told some of the varieties of herbal tea we've brought have medicinal properties, though I have trouble remembering what does what."},{"name":"MENUKI","text":"With a lining of felt and a warming stone in your hand, you'll soon forget all about these freezing conditions! ...Well, almost."},{"name":"KOCHACHA","text":"While I'm sure the weavers would balk at their cloth being used for anything other than its intended purpose, their hard work is appreciated all the same."},{"name":"OFFICER04219","text":"Do the others have anything to share?"},{"name":"OFFICER04219","text":"Yes, that will do nicely. What's more, the Temple Knights, Maelstrom, and Ala Mhigan Resistance had a fair few useful supplies of their own, so my list of creature comforts is a lot longer than I was expecting."},{"name":"OFFICER04219","text":"In all honesty, I was worried that taking in all those imperials might put everyone, including them, in a very unfavorable position. Even those of us most committed to the cause might find it hard to put the needs of our former enemies before those of our sworn comrades."},{"name":"OFFICER04219","text":"A valid point, perhaps, until you stop to consider the terrible fate that has befallen Garlemald. I wouldn't wish that on anyone... In any case, they're the reason we're here in the first place, so it's our duty to lend them what aid we can."},{"name":"OFFICER04219","text":"Ah, listen to me ramble on! Anyway, for your part in making our lives a little more bearable, please accept this as a token of my gratitude."}],"reward":{"gil":895,"items":[{"id":35683}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69919]}},"partials":[{"type":"npc","id":"1039381","obj":{"i":1039381,"n":"Contingent Quartermaster","l":3710,"q":1}},{"type":"item","id":"35683","obj":{"i":35683,"n":"Pewter Necklace Coffer (IL 525)","l":1,"c":26565,"t":61}},{"type":"quest","id":"69919","obj":{"i":69919,"n":"A Frosty Reception","g":11,"l":"The Lochs","s":537}}]}