{"quest":{"name":"Children Are Our Future","location":"Garlemald","id":69768,"patch":6.0,"sort":1670,"unlocksFunction":1,"eventIcon":71341,"issuer":1040633,"target":1040633,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>A woman with startling blue hair is in search of her son who has disappeared without a trace."],"objectives":["Search for the azure-haired boy.","Search the designated location and follow the azure-haired boy.","Follow the azure-haired boy and defeat any enemies that threaten him.","Rescue the azure-haired boy.","Report to the azure-haired woman."],"dialogue":[{"name":"BLUEHAIRMOTHER04232","text":"Excuse me, <span class=\"alternative-container\"><span class=\"alternative\">ma'am</span><span class=\"alternative\">sir</span></span>? Have you seen a little boy with hair a similar shade to mine? He's my son, and I can't find him anywhere!"},{"name":"BLUEHAIRMOTHER04232","text":"It all started when I told him we ought to seek refuge in your encampment, and he started wailing and sobbing like I'd never seen. The next thing I knew, he was running hell-for-leather goodness knows where."},{"name":"BLUEHAIRMOTHER04232","text":"I'm worried he may have left the station altogether, and the streets above are rife with danger! Please, could you find him for me?"},{"name":"BLUEHAIRMOTHER04232","text":"Oh you will? Bless your heart! If I know my son, he's probably tried to return to our house to the north of Palatium Novum. Try there first before anywhere. He'll be easy to recognize I should think, what with the color of his hair and all."},{"name":"BLUEHAIRMOTHER04232","text":"I will try searching the station again just in case, though I'd bet anything he's gone back to our house near Palatium Novum."},{"name":"BLUEHAIRBOY04232","text":"Another blocked street...?"},{"name":"BLUEHAIRBOY04232","text":"Wh-Who are you?"},{"name":"BLUEHAIRBOY04232","text":"Mother sent you? Hmph! Tell her I won't go to the enemy's camp─ I'm going home!"},{"name":"SYSTEM04232","text":"The boy with the sky blue hair has made good his escape. You had best resume your search for this obstreperous youth."},{"name":"BLUEHAIRBOY04232","text":"Stop following me!"},{"name":"SYSTEM04232","text":"Once again, the boy with the sky blue hair has taken flight, and will likely be looking over his shoulder for signs of trouble from now on. With a weary sigh, you resume the hunt."},{"name":"SYSTEM04232","text":"Follow the boy from a safe distance. The objective will end in failure if you are noticed, or if you fall too far behind."},{"name":"SYSTEM04232","text":"Should you fail to complete the objective, you may try again by looking out over this location."},{"name":"SYSTEM04232","text":"Attempt to follow the azure-haired boy?"},{"name":"BLUEHAIRBOY04232","text":"No... Our home, it was here─right here!"},{"name":"BLUEHAIRBOY04232","text":"You again? Leave me alone! I'm staying here to build a new house─bigger and better than the old one!"},{"name":"SYSTEM04232","text":"The child has escaped your grasp yet again. Though this may be construed as a particularly tiresome endeavor, remember that he is only a child and knows no better. You should find him before he comes to harm."},{"name":"BLUEHAIRBOY04232","text":"Why do you care so much?"},{"name":"BLUEHAIRBOY04232","text":"We're enemies, remember? Why are you trying to help me?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You need help, and I'm offering it."},{"name":"A1","text":"How would your mother feel if something were to happen to you?"},{"name":"BLUEHAIRBOY04232","text":"&lt;sniffle&gt; I don't care what you say! We don't need your help!"},{"name":"BLUEHAIRBOY04232","text":"But Mother's worried. I should go back. To the station."},{"name":"BLUEHAIRMOTHER04232","text":"I was wondering when I would see you again. I'm happy to report my son has returned. Poor creature... You should have seen him─tears pouring down his little cheeks, crying his apologies to me. I know that you were the one who found him, though he didn't mention a word of it to me."},{"name":"BLUEHAIRMOTHER04232","text":"I almost couldn't believe my ears when he said he wouldn't mind moving to your camp. He was dead against it only hours ago. What could have happened, I wonder?"},{"name":"BLUEHAIRMOTHER04232","text":"What? He was attacked? By that horrid magitek, you say? Goodness, that must have been quite a shock for my little man. Thank you for coming to his rescue."},{"name":"BLUEHAIRMOTHER04232","text":"There is a salutary lesson to be gained from all this, though, one that I hope he retains. Do not scorn a proffered hand when one is in need, whether that hand be friend or foe's. At any rate, I thank you for finding him. It's not much, but please, I insist."}],"reward":{"gil":1055,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69929]}},"partials":[{"type":"npc","id":"1040633","obj":{"i":1040633,"n":"Azure-haired Woman","l":3710,"q":1}},{"type":"quest","id":"69929","obj":{"i":69929,"n":"Strange Bedfellows","g":11,"l":"Garlemald","s":547}}]}