{"quest":{"name":"Under Lock and Code","location":"Garlemald","id":69760,"patch":6.0,"sort":1490,"eventIcon":71221,"issuer":1037729,"target":1037729,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Ambaghai has a need for your ability to solve problems, or rather, your ability to help others solve problems."],"objectives":["Speak with the perpetually perturbed Maelstrom officer.","Gather information and speak with the perpetually perturbed Maelstrom officer.","Report to Ambaghai."],"dialogue":[{"name":"AMBAGHAI","text":"Um... I beg your pardon, but I hear you're a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of the world. We've a slight problem, and your knowledge might help us solve it."},{"name":"AMBAGHAI","text":"Actually, they came to me first, but when it comes to anything other than the martial arts, I'm unable to provide much in the way of assistance. I did, however, offer to find someone who can, so hopefully I may yet make myself useful."},{"name":"AMBAGHAI","text":"A man of the Maelstrom is over by the storeroom, no doubt scratching his head as we speak. I'm sure he'd benefit from your wisdom."},{"name":"AMBAGHAI","text":"I imagine the fellow is still where I saw him last. He seemed determined not to give up until he'd exhausted every possibility."},{"name":"SOLDIERA04224","text":"I was told someone'd come to help, but I never thought it would be you!"},{"name":"SOLDIERA04224","text":"Well, now that you're here, I'd like you to take a look at this container we recovered from the Magna Glacies. It was one of several, in fact, and though we've succeeded in cracking the others open, this stubborn bugger refuses to yield!"},{"name":"SOLDIERA04224","text":"All I know is a four-letter password is needed to unlock it. What that might be, I haven't the foggiest idea."},{"name":"SOLDIERA04224","text":"There might be someone around here who either knows what it is, or can point us in the right direction. Could you try asking around for me?"},{"name":"CITIZENA04224","text":"Sorry, I don't know the exact code, but given that the container belonged to the IIIrd Legion, perhaps the password has some sort of significance to them?"},{"name":"CITIZENA04224","text":"I understand it's common for people to choose dates and so forth of special importance as their password. As for the members of the IIIrd, nothing springs to mind... Perhaps an anniversary or something along those lines?"},{"name":"SOLDIERA04224","text":"Container? Sorry, I've never had much to do with them."},{"name":"SOLDIERA04224","text":"But if you're after clues that could lead you to the password, a little background information on the IIIrd Legion might be of use."},{"name":"SOLDIERA04224","text":"It was formed in the first year of Emperor Solus's reign and spent the first few decades engaged in campaigns across the northern territories."},{"name":"SOLDIERA04224","text":"In the 42nd year, for its exemplary service to the Empire, it was assigned a new role─the protection of the capital, a far more prestigious position."},{"name":"HAWISIA","text":"As it's one of the IIIrd Legion's containers, you'd do well to seek out combinations of letters with some sort of importance to its history."},{"name":"WILLELM","text":"I've a feeling it's an anniversary or some such...but it could be <span class=\"emphasis\">anything</span>..."},{"name":"SOLDIERA04224","text":"Oh, have you already forgotten what I said? Very well, I'll tell you again. The IIIrd Legion was formed in the first year of the Empire. They were later charged with the protection of the capital in the 42nd year. "},{"name":"SOLDIERA04224","text":"That's all I can think of for now, but I'll let you know if anything else occurs to me."},{"name":"Q1","text":"What information will you convey?"},{"name":"A1","text":"Your conversation with Hawisia."},{"name":"A1","text":"Your conversation with Willelm."},{"name":"A1","text":"Your conversation with the soldier."},{"name":"A1","text":"None."},{"name":"SOLDIERA04224","text":"It's only four letters─ How many possible combinations is that?"},{"name":"SOLDIERA04224","text":"It belonged to the IIIrd Legion? Hmm... Finding someone associated with them might lead us to the answer."},{"name":"SOLDIERA04224","text":"Anniversary? Not a bad idea, but this sodding thing doesn't have any buttons for numbers, only letters."},{"name":"SOLDIERA04224","text":"I think you might be onto something there. The IIIrd was formed in the first year, and assigned to the capital in the 42nd... Trouble is, I've no way of entering numbers at all."},{"name":"SOLDIERA04224","text":"If this belonged to the IIIrd Legion, they'd be the ones to pick the password. Most likely make it easy to remember."},{"name":"SOLDIERA04224","text":"That information we got about the history of the legion might be a lead worth following, but we've no way of entering numbers, only letters."},{"name":"SOLDIERA04224","text":"Wait─that's it! Garlean numerals! Let's see... If “3” is written as “III,” then..."},{"name":"SOLDIERA04224","text":"...If I take 42... Hold on... “XLII”? Is that right? Worth a try, I suppose."},{"name":"SOLDIERA04224","text":"It worked! Ha ha! Now to inspect our treasure!"},{"name":"SOLDIERA04224","text":"What the bloody hells is this? A flag!? Why would they bother keeping a thing like this locked away?"},{"name":"SOLDIERA04224","text":"Well, I'll not pretend I understand their ways. Let's just assume they have a good reason for treating a bit of cloth with such reverence. Hmm... Probably best to leave it here undisturbed, as I've no intention of offending anyone."},{"name":"SOLDIERA04224","text":"Could I ask you to pass on word of what we've found? Oh, and thanks for your help!"},{"name":"SOLDIERA04224","text":"Although the prize was obviously quite disappointing, finally breaking the code gave me a real sense of achievement. I couldn't have done it without you!"},{"name":"AMBAGHAI","text":"So, has the investigation finally reached its conclusion?"},{"name":"AMBAGHAI","text":"A Garlean flag... We'd be wise to treat it with respect. The chain it bears represents the unity between the people of the Empire, a unity that is all but lost."},{"name":"AMBAGHAI","text":"To think that this banner would be locked away rather than raised proudly...a relic of Garlemald's past. Though they have long been our enemies, to see its people brought so low... I..."},{"name":"AMBAGHAI","text":"Forgive me, I have spoken overmuch. Though the search did not uncover any resources to speak of, at least the mystery of the locked container can be laid to rest. You have our thanks."}],"reward":{"gil":815},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69923]}},"partials":[{"type":"npc","id":"1037729","obj":{"i":1037729,"n":"Ambaghai","l":3710,"q":2}},{"type":"quest","id":"69923","obj":{"i":69923,"n":"A Way Forward","g":11,"l":"Garlemald","s":541}}]}