{"quest":{"name":"With Folded Hands","location":"Garlemald","id":69762,"patch":6.0,"sort":1610,"eventIcon":71221,"issuer":1039399,"target":1039399,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>A magitek engineer is tinkering with things of a rather dangerous nature."],"objectives":["Capture a weakened automated roader with the cermet chain.","Deliver the captured automated roader to the retired engineer."],"dialogue":[{"name":"ENGINEER04226","text":"You there. Yes, you. You can't hide those hands from me. I can tell they've seen their fair share of hard work. So, what say you to doing an old engineer a good turn, hm?"},{"name":"ENGINEER04226","text":"Little doubt you've noticed the terror these mindless magitek drones inspire among the people here? All that indiscriminate killing and whatnot will do that, I suppose. I mean to fiddle with those nasties' innards, repurpose them to our ends in some manner."},{"name":"ENGINEER04226","text":"Which is where you come in, my new friend. Capture for me an automated magna roader."},{"name":"ENGINEER04226","text":"A cermet chain ought to be enough to tame the machina menace...provided you have brought the murderous thing to heel first. Go on with you. Let us see if you've grit enough to bring me what I ask."},{"name":"ENGINEER04226","text":"What are you waiting for? Off with you. Break that wretched thing's automated spirits and capture it with the cermet chain. I look forward to seeing how you fare..."},{"name":"ENGINEER04226","text":"Oh, you've returned, and a great deal sooner than I'd assumed. Well? Have you captured for me what I asked?"},{"name":"ENGINEER04226","text":"Yes, this is it! It is a most impressive specimen, would you not agree? Crafted in Gyr Abania, it moves as if wrought from flesh and bone─not of metal and screws. 'Tis a monument to Garlean ingenuity and innovation."},{"name":"ENGINEER04226","text":"And I should know─I had a hand in its inception. Alas, it was to be my swan song. Once Ala Mhigo fell, I returned to Garlemald to languish in retirement until the end of my days. I thought that would be the end of my story..."},{"name":"ENGINEER04226","text":"But my life has been granted a new chapter in the form of an acquaintance newly made. A flaxen-haired man taught me all manner of ancient Allagan technologies. And it is through this newfound wisdom I shall craft magitek capable of independent thought─equipped with cognition to rival mankind's!"},{"name":"ENGINEER04226","text":"Though the Empire is in ruins, <span class=\"emphasis\">I</span> shall not go quietly into that dying light. I've the luxury of time─no ticking clock to war against. I will take all the hours afforded to me to craft a machine of such magnificence, my genius cannot be gainsaid!"},{"name":"ENGINEER04226","text":"Heh. Heh heh... Machines with thoughts and emotions to call their own! I am beside myself with excitement. Oh, what a brave new world we are soon to set foot into, my friend. How lucky you are to know you aided in its nativity! I was right to turn to you. You've my most sincere gratitude."}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69929]}},"partials":[{"type":"npc","id":"1039399","obj":{"i":1039399,"n":"Retired Magitek Engineer","l":3710,"q":1}},{"type":"quest","id":"69929","obj":{"i":69929,"n":"Strange Bedfellows","g":11,"l":"Garlemald","s":547}}]}