{"quest":{"name":"Mama, She Is in Rubble Deep","location":"Garlemald","id":69769,"patch":6.0,"sort":1680,"eventIcon":71221,"issuer":1037722,"target":1037722,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Storm Sergeant Makago Nokago looks at you beseechingly as he winces against a child's shrill sobbing."],"objectives":["/soothe the little girl.","Speak with the girl, follow her lead, and save the trapped woman.","Speak with Makago Nokago."],"dialogue":[{"name":"MAKAGONAKAGO","text":"Please, a moment of your time!"},{"name":"MAKAGONAKAGO","text":"This poor girl, she has come all the way from the seat of the Empire. Alone, it would seem. I meant to ask what troubled her, but she can't catch her breath for all her tears, let alone speak."},{"name":"MAKAGONAKAGO","text":"I'm not accustomed to children and their handling─I can never say the right thing. But perhaps you will have more success in calming her than I. Could you try to <span class=\"highlight\">soothe</span> whatever sorrow plagues her?"},{"name":"MAKAGONAKAGO","text":"I meant only to ask what troubled that poor girl, but she can hardly string two words together for her bawling. Perhaps if you were to <span class=\"highlight\">soothe</span> her in some manner, she would tell us?"},{"name":"GARLEANGIRL04233","text":"&lt;sniffle&gt; M-My mother! Sh-She...! &lt;sob&gt;"},{"name":"GARLEANGIRL04233","text":"&lt;sniffle&gt; Th-Thank you. I feel a bit better now."},{"name":"GARLEANGIRL04233","text":"What am I doing here? Well, Mum said we might find some food at your camp."},{"name":"GARLEANGIRL04233","text":"But on our way here, one of the buildings started to crumble and a big bit of the wall hit my mum─ And she's still trapped under it! I tried to pull her out, but I...I... Please, she needs help!"},{"name":"MAKAGONAKAGO","text":"My word! You needn't worry, little one. Help is on the way."},{"name":"MAKAGONAKAGO","text":"<span class=\"highlight\">Forename</span>, follow her to her mother, see if there is aught to be done. I will round up a few soldiers to assist you, just in case."},{"name":"MAKAGONAKAGO","text":"Though I hate to put this out into the world, I fear the worst for that girl's mother. Who knows how long she has been caught under that debris? But we mustn't lose hope. There may still be a chance of saving her, if you hurry."},{"name":"GARLEANGIRL04233","text":"Y-You mean it? You're really going help me? She's just over this way! Quickly!"},{"name":"GARLEANGIRL04233","text":"Follow the little girl and try not to fall behind."},{"name":"GARLEANGIRL04233","text":"If you fall too far behind, speak with her again."},{"name":"GARLEANGIRL04233","text":"Please! Help my mother!"},{"name":"GARLEANMOTHER04233","text":"Such strength... Was that some sort of...magic?"},{"name":"GARLEANMOTHER04233","text":"Forgive me, I had begun to panic, thinking I'd be trapped forever. Thanks to you, I can walk away with my life intact."},{"name":"GARLEANMOTHER04233","text":"I'm so proud of you, my little soldier. How brave you were to seek help as you did. You must have been so scared."},{"name":"GARLEANGIRL04233","text":"I was, but that's when I met this real little soldier─littler than me, even! And he asked this nice <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span> to help us."},{"name":"GARLEANMOTHER04233","text":"So that's what happened..."},{"name":"GARLEANMOTHER04233","text":"We were at the station when they announced the truce, so I know that we're no longer at odds, but even so...I imagine it's difficult for some of you to see us as anything more than the enemy. Your contingent is kind indeed to take us in as you have."},{"name":"GARLEANMOTHER04233","text":"It is more than I expected, to be sure. I was prepared for something of a fight, in fact. But so long as my sweet one depends on me, nothing shall stop me from making sure she's safe. We are survivors, come what may."},{"name":"GARLEANMOTHER04233","text":"We'll set out for your camp once more. Farewell, <span class=\"alternative-container\"><span class=\"alternative\">ma'am</span><span class=\"alternative\">sir</span></span>. You've my most heartfelt gratitude. And, before I go, do give my thanks to that warrior my daughter spoke of, should you see him again."},{"name":"MAKAGONAKAGO","text":"My men report that they found both the mother and the child making their way here and have provided them the shelter and aid they require."},{"name":"MAKAGONAKAGO","text":"I confess I was more than a bit surprised when the woman told me of your success in lifting the rubble. It sounded too tall a tale to be real, even. But then I remembered who we are dealing with, and felt foolish for doubting her."},{"name":"MAKAGONAKAGO","text":"At any rate, they are safe and in our care now, all thanks to you."}],"reward":{"gil":815,"items":[{"id":35685}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69929]}},"partials":[{"type":"npc","id":"1037722","obj":{"i":1037722,"n":"Makago Nokago","l":3710,"q":1}},{"type":"item","id":"35685","obj":{"i":35685,"n":"Pewter Ring Coffer (IL 525)","l":1,"c":26567,"t":61}},{"type":"quest","id":"69929","obj":{"i":69929,"n":"Strange Bedfellows","g":11,"l":"Garlemald","s":547}}]}