{"quest":{"name":"And Then a Hero Comes Along","location":"Garlemald","id":69761,"patch":6.0,"sort":1601,"eventIcon":71221,"issuer":1037767,"target":1037767,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The state of affairs in this corner of the world has left many sick and hungry, Amanieu and his daughter not least among them."],"objectives":["Obtain the buckwheat seeds from a container in the marketplace.","Deliver the buckwheat seeds to Amanieu."],"dialogue":[{"name":"AMANIEU","text":"A moment, good <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">sir</span></span>, if you've one to spare. My daughter has taken ill with a menace of a cold. She can hardly keep even a bite of food down, though I know that a simple bowl of kasha will be easy on the stomach, and be enough to sustain her."},{"name":"AMANIEU","text":"Unfortunately, I lack the buckwheat seeds the recipe calls for. The abandoned market ought to have what I require, but...I do not fancy my chances in a place so dangerous."},{"name":"AMANIEU","text":"Besides, I dare not leave my girl alone for an extended period. This illness of hers waxes and wanes from moment to moment, and the last thing I want is to be away when her fever spikes or a coughing fit assails her. Please, could you help?"},{"name":"AMANIEU","text":"You will? Oh, you are a merciful, kind soul! Here, I shall mark on your map where the seeds are like to be found. Giving the containers a thorough once-over should soon yield results."},{"name":"AMANIEU","text":"Though the market is not the only place to find the seeds I need to make kasha, I would recommend inspecting the containers there first before expanding your search."},{"name":"SYSTEM","text":"You are met with a congeries of seeds. Some are too soft, some too hard, but these seem <span class=\"emphasis\">just</span> right."},{"name":"SYSTEM","text":"Alack, there appears to be no sign of the seeds, but you did come across a box of medical supplies."},{"name":"Q1","text":"Would you like to bring these supplies back to the man and his sick daughter?"},{"name":"SYSTEM","text":"There is no sign of any seeds in the area. However, during your search, you stumble upon a stuffed toy bear."},{"name":"Q2","text":"Would you like to bring the toy back to Amanieu and his sick daughter?"},{"name":"AMANIEU","text":"There you are! And none the worse for wear. Oh, that look on your face─I take it to mean you've found the seeds, then?"},{"name":"AMANIEU","text":"You have! How wonderful! This ought to brighten my daughter's spirits─and hopefully entice her to put a bit of food in her belly."},{"name":"AMANIEU","text":"Why, look at all you have brought. Medicine? A toy bear? But I did not even ask, and yet... Goodness, I'm so touched. You are too kind, truly."},{"name":"AMANIEU","text":"My life lately─if one can even call it that─has been consumed by concern. Concern for my daughter's safety, where our next meal will come from... But your good deed today was a bright spot in these bleak times."},{"name":"AMANIEU","text":"What is this? Medical supplies? And it even contains a simple cold remedy. This is too wonderful to be believed!"},{"name":"AMANIEU","text":"What have we here? A toy bear? This will do wonders to buoy my daughter's flagging spirits. How considerate you are to think of her so."},{"name":"AMANIEU","text":"To tell the truth, you are not the first to show us unexpected compassion. Being from the provinces, I feared the Garleans here would turn us away, but they offered us food and shelter. If it weren't for them, we may not be alive today."},{"name":"AMANIEU","text":"And now we owe a debt of gratitude to you and your contingent. Thanks to you, my daughter will grow strong again, of this I'm sure. While I can't offer much, I want you to have this. And I will not take no for an answer!"}],"reward":{"gil":735,"items":[{"num":2,"id":36041}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69929]}},"partials":[{"type":"npc","id":"1037767","obj":{"i":1037767,"n":"Amanieu","l":3710,"q":1}},{"type":"item","id":"36041","obj":{"i":36041,"n":"King Crab Cake","l":530,"c":24329,"t":46}},{"type":"quest","id":"69929","obj":{"i":69929,"n":"Strange Bedfellows","g":11,"l":"Garlemald","s":547}}]}