{"quest":{"name":"A Light That Never Goes Out","location":"Garlemald","id":69763,"patch":6.0,"sort":1620,"eventIcon":71221,"issuer":1037782,"target":1037782,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Spurius is in the mood to brighten this dreary place up, though he lacks the materials necessary to do so."],"objectives":["Obtain the glassware.","Deliver the glassware to Spurius."],"dialogue":[{"name":"SPURIUS","text":"There's something about the darkness that just deflates the spirits, wouldn't you say? We have plenty of lights, yes, but they use the same fuel as the heaters. And “not freezing to death” places somewhat higher on the agenda than “making the place look nice.”"},{"name":"SPURIUS","text":"As such, I've taken it upon myself to craft lanterns that use other sorts of fuel! I was, once upon a time, a technician in the imperial army, so provided I have the glassware, I'm more than capable of the task."},{"name":"SPURIUS","text":"That's where the trouble lies, though. Such items are in short supply, and while I know where in the city we might scrounge up some, I wouldn't dare march into that sea of magitek weaponry. Perhaps you could go in my stead?"},{"name":"SPURIUS","text":"Just northwest of the station you'll find a tavern and a perfumery─or what's left of them, anyway. Somewhere among the ruins you should be able to find wares suitable for our lanterns."},{"name":"SPURIUS","text":"Unfortunately, the whole place is crawling with mechanical monstrosities, but you look like you can handle yourself. There should be a few good pieces of glassware remaining somewhere among all that rubble, surely."},{"name":"SPURIUS","text":"Ah, good to see you returned─and unharmed, at that! How did your search go? Well, I hope."},{"name":"SPURIUS","text":"Let us see here. Ah, an old bottle of spirits, though not a drop left to drink. A pity, that. Anyhow, the size is perfect for my purposes."},{"name":"SPURIUS","text":"Now, what do we have here? Ah, a perfume bottle. A touch on the small side, no getting around that, but usable in its own way. Oh, smell that? It's managed to retain some of its scent. Imagine the aroma it will produce once we've added heat!"},{"name":"SPURIUS","text":"As you know, for the Garleans, the flame is all. It is said that when our ancestors first arrived in this blighted, frigid land, they lived long in darkness, unable to breathe fire into their world."},{"name":"SPURIUS","text":"What they lacked in magic, though, they made up for in guile. They took what fat and oils they could from the animals of these wilds and chased away their shadows. Until, of course, they at last learned to extract ceruleum from Cerulea Ingens."},{"name":"SPURIUS","text":"But like those first settlers before me, I will carve out a bright spot of hope in this darkness with these lanterns. Thank you for all that you've done, truly."},{"name":"ENGINEER04227","text":"（★未使用／削除予定★）"},{"name":"ENGINEER04227","text":"（★未使用／削除予定★）"},{"name":"ENGINEER04227","text":"（★未使用／削除予定★）"},{"name":"ENGINEER04227","text":"（★未使用／削除予定★）"},{"name":"ENGINEER04227","text":"（★未使用／削除予定★）"},{"name":"ENGINEER04227","text":"（★未使用／削除予定★）"},{"name":"ENGINEER04227","text":"（★未使用／削除予定★）"},{"name":"ENGINEER04227","text":"（★未使用／削除予定★）"},{"name":"ENGINEER04227","text":"（★未使用／削除予定★）"},{"name":"ENGINEER04227","text":"（★未使用／削除予定★）"},{"name":"ENGINEER04227","text":"（★未使用／削除予定★）"}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69929]}},"partials":[{"type":"npc","id":"1037782","obj":{"i":1037782,"n":"Spurius","l":3710,"q":1}},{"type":"quest","id":"69929","obj":{"i":69929,"n":"Strange Bedfellows","g":11,"l":"Garlemald","s":547}}]}