{"quest":{"name":"A Strange New Moon","location":"Mare Lamentorum","id":69778,"patch":6.0,"sort":1820,"eventIcon":71221,"issuer":1037807,"target":1037807,"genre":124,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Recordingway needs to gather more data."],"objectives":["Slay a thinker and obtain a fungal filament.","Deliver the fungal filament to Recordingway."],"dialogue":[{"name":"RECORDINGWAY","text":"Curses! Insufficient data, even after everything I've done."},{"name":"RECORDINGWAY","text":"You! Livingway told me about you. Would you mind lending me a hand?"},{"name":"RECORDINGWAY","text":"As you know, we Loporrits only awakened recently. While we were sleeping, Mare Lamentorum has undergone a number of bewildering changes, one of those being the appearance of strange walking fungi─thinkers, we call them."},{"name":"RECORDINGWAY","text":"An Allagan vessel crashed here many years ago, you see, and some part of it pierced through the wall of our underground bioplant. I believe the spores from within eventually made their way to the surface of the moon, where they went on to mutate and evolve in our absence."},{"name":"RECORDINGWAY","text":"I mean to study these curious new life-forms, but I need more data before I can draw any real conclusions. Would you be willing to retrieve a sample of fungal filaments for me? Yes, a single sample would more than suffice."},{"name":"RECORDINGWAY","text":"If I remember my culture studies correctly, you will expect some form of payment in exchange for services rendered, yes? Bring me that filament, and I will see you are duly compensated."},{"name":"RECORDINGWAY","text":"A single sample of fungal filament is all I need to begin my work."},{"name":"RECORDINGWAY","text":"I was starting to wonder if the thinkers had done you in. Were you able to retrieve a sample?"},{"name":"RECORDINGWAY","text":"Excellent! I'll get to work analyzing it right away."},{"name":"RECORDINGWAY","text":"...Hm? Why, the structure of this filament is altogether different from the fungi growing in the bioplant."},{"name":"RECORDINGWAY","text":"Mayhap the spores mixed with substances leaked from the Allagan ship. Chimera incubation fluid, perhaps? In any case, this isn't good. Any and all potential threats must be eliminated if we are to make the moon fit for inhabitation."},{"name":"RECORDINGWAY","text":"You have helped with a most important discovery, and for that, you have my thanks. Here─your reward, as promised."}],"reward":{"gil":655,"items":[{"id":35695}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69939]}},"partials":[{"type":"npc","id":"1037807","obj":{"i":1037807,"n":"Recordingway","l":3711,"q":1}},{"type":"item","id":"35695","obj":{"i":35695,"n":"Phrygian Ring Coffer (IL 533)","l":1,"c":26567,"t":61}},{"type":"quest","id":"69939","obj":{"i":69939,"n":"Styled a Hero","g":11,"l":"Mare Lamentorum","s":557}}]}