{"quest":{"name":"The Hero Never Bombs","location":"Garlemald","id":69771,"patch":6.0,"sort":1701,"eventIcon":71221,"issuer":1037751,"target":1037751,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Iliette has for you a rather explosive assignment."],"objectives":["Speak with the 1st Legion magitek engineer.","Speak with the 1st Legion magitek engineer again.","Destroy the debris impeding your progress with the explosives.","Speak with the 1st Legion magitek engineer.","Speak with Iliette."],"dialogue":[{"name":"ILIETTE","text":"Aha! You do have a way of appearing at the most opportune times, don't you. I was only just thinking to myself, “If only <span class=\"highlight\">Forename</span> were here...” So, to business!"},{"name":"ILIETTE","text":"In light of our work to aid the people of Garlemald, the Ist Legion put to us an offer: their service machina is ours should we want it. Though, as we've all recently learned, nothing is ever so easy, as the magitek in question still lies within the city limits."},{"name":"ILIETTE","text":"The selfsame engineer who gifted us with this information has offered to escort you to the site. That's right, you─mentioned you by name, even. I would never force you to attend to a task so perilous, but it would be a great boon for our cause were we to wrangle that machina to our purposes."},{"name":"ILIETTE","text":"The area in question is sadly littered with detritus of all manner, making exploration difficult, if not impossible. To that end, here. These ought to blast, bomb, and demolish any barrier foolish enough to stand between our hero and <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> cause."},{"name":"ILIETTE","text":"The engineer awaits you outside the encampment's limits. Find him when you are ready to brave the perils of the city."},{"name":"ILIETTE","text":"The magitek engineer belonging to the Ist Legion awaits you beyond the limits of our encampment. Join him and recover the machina he has offered us. Only if you wish to, that is!"},{"name":"GARLEANSOLDIER04235","text":"You came. I half expected you might not, given the dangers. Then again, you are Eorzea's champion, and what sort of hero balks in the face of a challenge, eh? Forgive my excitement. I've been wanting to make your acquaintance for some time now."},{"name":"GARLEANSOLDIER04235","text":"Yes, well, anyway...shall we be off, then? Find me at Regio Urbanissima, and I shall escort you from there. Far easier that way, trust me."},{"name":"GARLEANSOLDIER04235","text":"Well, this is a bother. The magitek I've my eye on doesn't seem to be quite as accessible as I hoped. There's just so much accursed wreckage in the way, we won't be able to drag the thing out... Hmmm, a pickle indeed. Hate to ask, but have you any brilliant ideas up that sleeve of yours?"},{"name":"GARLEANSOLDIER04235","text":"You've some explosives on you? That will do the trick, certainly. "},{"name":"GARLEANSOLDIER04235","text":"Alas, I'm not at all skilled in Eorzean technologies, which means there's a distinct possibility I'll blow my hands clean off if I try to tinker with such a device. Perhaps I could leave the blasting of objects to you?"},{"name":"GARLEANSOLDIER04235","text":"I'll take care of the magitek once you've dealt with the debris. After all, I'm sure you're a deal more handy with those explosives than I ever could be."},{"name":"GARLEANSOLDIER04235","text":"Ah, you've made us a path. Very good, very good. Now my machina can finally get its day in the sun."},{"name":"GARLEANSOLDIER04235","text":"The poor boy was originally meant to be used against the IIIrd Legion to rain death and destruction upon them. But I lied to my superior officer, told them this machina was too far beyond repair to repurpose for any practical military use."},{"name":"GARLEANSOLDIER04235","text":"Now it gets a second, far more peaceful chance at life...and I am spared the grief of knowing I had a hand in spilling my countrymen's blood. When I was told to what ends it would be used, I couldn't believe my ears. This was not the Empire I knew─the Empire I believed in."},{"name":"GARLEANSOLDIER04235","text":"I had been taught that our country's cornerstone was peace, one founded upon the ways of science and machine. How can we make such a claim when internecine strife lays waste to our lands, kills our people?"},{"name":"GARLEANSOLDIER04235","text":"You may be Eorzean, but I see that your heart is true. So I know that you will answer me honestly when I ask... Do you find the Empire cruel and barbarous?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Those you've invaded no doubt do."},{"name":"A1","text":"All that separates our two sides is creed."},{"name":"A1","text":"..."},{"name":"GARLEANSOLDIER04235","text":"Yes... Yes, of course."},{"name":"GARLEANSOLDIER04235","text":"You're kind to say so."},{"name":"GARLEANSOLDIER04235","text":"No, it was a strange question. Forgive me. You needn't answer."},{"name":"GARLEANSOLDIER04235","text":"It's the victors who write history, and I fear that Garlemald will be penned with no kind hand. We've seen to that ourselves. Even so, I still wholeheartedly believe in our founding principle: unification under the banner of peace."},{"name":"GARLEANSOLDIER04235","text":"Which is why I plan to put this war machine to better use, like rebuilding our city, for one. His days on the battlefield will be behind him once my tools have done their work."},{"name":"GARLEANSOLDIER04235","text":"Thank you for allowing me this chance to talk so frankly. And for all of the pyrotechnics and whatnot, of course."},{"name":"GARLEANSOLDIER04235","text":"Well then, shall we be heading back? I'm sure your comrade Iliette is in want of a report about now."},{"name":"ILIETTE","text":"There you are, <span class=\"highlight\">Forename</span>. I've already received word from our friend the engineer. He was rather fulsome in his praise of you, I must say. You are a credit to the cause."},{"name":"ILIETTE","text":"There was a lightness about him, one I hadn't seen when first he spoke to me. It was as if a weight had fallen clean off his shoulders."},{"name":"ILIETTE","text":"As a member of the imperial army, he is no doubt conflicted about this state of affairs. Perhaps speaking with you helped him gain a bit of perspective on the whole thing. Who knows? At any rate, allow me to thank you for your work today. We couldn't have done it without you."}],"reward":{"gil":975},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69929]}},"partials":[{"type":"npc","id":"1037751","obj":{"i":1037751,"n":"Iliette","l":3710,"q":2}},{"type":"quest","id":"69929","obj":{"i":69929,"n":"Strange Bedfellows","g":11,"l":"Garlemald","s":547}}]}