{"quest":{"name":"Ordnance Cleanup Committee","location":"Garlemald","id":69773,"patch":6.0,"sort":1720,"eventIcon":71221,"issuer":1037747,"target":1037747,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Many in the Ilsabard contingent have been complaining of imperials discarding perfectly good weaponry throughout the city."],"objectives":["Obtain the discarded weaponry.","Deliver the discarded weaponry to Kochacha."],"dialogue":[{"name":"KOCHACHA","text":"<span class=\"highlight\">Forename</span>. May I bother you a moment? I trust word has already reached you regarding the reclamation of the discarded weaponry."},{"name":"KOCHACHA","text":"No? Truly? Then it is good you've found me. As you are well aware, in accordance with the truce, the Ist Legion has laid down its arms. Unfortunately, its soldiers laid down those arms wherever they pleased, and now they're scattered all over the city."},{"name":"KOCHACHA","text":"Should you stumble upon─or more likely, <span class=\"emphasis\">trip</span> upon─any of this aforementioned imperial weaponry, we ask that you reclaim it and return it to us posthaste."},{"name":"KOCHACHA","text":"Please gather up anything even vaguely useful-looking, though you can probably draw the line at “a plank with a nail through it.” We already have enough of those."},{"name":"KOCHACHA","text":"No doubt the city streets are a treasure trove of violent odds and ends. This was a war zone, let us not forget."},{"name":"KOCHACHA","text":"Have you any discarded weaponry on your person?"},{"name":"KOCHACHA","text":"Yes, that's just what we're looking for. Thank you for bringing it to us."},{"name":"KOCHACHA","text":"It is said that each legion has its own unique weaponry, but, to my eye, it is all much of a muchness. I suppose their similarities are owed to the fact that they were mass-produced in the Enceladeum."},{"name":"KOCHACHA","text":"Perhaps when Garlemald still thought itself a republic and they first started employing Roegadyn mercenaries, they sought to diversify their armaments in the same way as their troops."},{"name":"KOCHACHA","text":"Of course, later advances in technology made it possible to churn out all sorts of weaponry at an alarming rate. I wonder─ If they had never discovered machina, what would the Empire look like today? Makes one think, doesn't it?"}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69929]}},"partials":[{"type":"npc","id":"1037747","obj":{"i":1037747,"n":"Kochacha","l":3710,"q":1}},{"type":"quest","id":"69929","obj":{"i":69929,"n":"Strange Bedfellows","g":11,"l":"Garlemald","s":547}}]}