{"quest":{"name":"A Place of Greater Safety","location":"Garlemald","id":69774,"patch":6.0,"sort":1730,"eventIcon":71221,"issuer":1037755,"target":1037755,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Talon has received word from a comrade in dire straits somewhere in the city."],"objectives":["Use the proffered tincture on the injured soldier.","Speak with Talon."],"dialogue":[{"name":"TALON","text":"<span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>. We've received a rather urgent call for assistance only moments ago. One of our finest located a civilian and meant to lead them to safety, but was waylaid."},{"name":"TALON","text":"Magitek ordnance set upon them, and our comrade was wounded in the barrage."},{"name":"TALON","text":"I shouldn't prattle on any longer. This is their most desperate hour and are in need of urgent help. The city streets can be treacherous to the inexperienced, which is why I would ask that you undertake this task. Can they count on your assistance?"},{"name":"Q1","text":"Can your assistance be counted on?"},{"name":"TALON","text":"Excellent. Seek out our man in Regio Urbanissima and provide him with this tincture. That ought to set him on his feet again and, with any luck, grant him strength enough to get both himself and the civilian back here."},{"name":"TALON","text":"Of course. You are a busy <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>. I should not have presumed overmuch. I will seek assistance from another─someone attending to less pressing matters."},{"name":"TALON","text":"Do hurry. From what we can tell, he is in grave danger."},{"name":"GARLEANCITIZEN04238","text":"Forgive me. This is all my fault. If only I had noticed them sooner...!"},{"name":"ILSABARDSOLDIER04238","text":"I cannot thank you enough... I would surely have succumbed to my injuries had you not come along. You see, a nightmare of a warmachina set upon us out of nowhere, and my medical supplies were destroyed in the opening volley."},{"name":"ILSABARDSOLDIER04238","text":"I took a rather nasty hit myself, but it would've been a lot worse if this kind lady had not noticed the enemy approaching. I owe her my life."},{"name":"GARLEANCITIZEN04238","text":"It was nothing compared to the bravery you showed in rescuing me. If not for you, I... No, I shan't speak of it. It's too grisly a thought to put into words."},{"name":"ILSABARDSOLDIER04238","text":"You've nothing to worry about now, I assure you. Please, allow me to escort you to Camp Broken Glass. Food and succor await."},{"name":"ILSABARDSOLDIER04238","text":"Join us, will you, <span class=\"highlight\">Forename</span>? The soldier who sent you here must be eager to hear of your exploits."},{"name":"ILSABARDSOLDIER04238","text":"I cannot thank you enough. We would not have made it back without you."},{"name":"GARLEANCITIZEN04238","text":"We owe you our lives, truly."},{"name":"TALON","text":"It is good to see you among us again. Though I admit you're a little banged up from the escapade, you seem in better health than I had expected. When I first heard of your distress call, I feared we had lost you."},{"name":"ILSABARDSOLDIER04238","text":"And you would have, if it weren't for this woman's bravery and keen eyes. She warned me of the coming attack, granting me the wherewithal to avoid any fatal injuries."},{"name":"GARLEANCITIZEN04238","text":"I hardly did anything. I merely noticed something large moving about in the shadows of some debris. It must've been because of this third eye of mine..."},{"name":"TALON","text":"So it's true what they say─the Garleans really do have heightened awareness! "},{"name":"TALON","text":"But where are my manners? You've had quite the trying day. Let us find you some food and a place where you might be able to relax."},{"name":"TALON","text":"Ah, before you go. I would like to extend my gratitude to you as well, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>. Your expediency proved to be their saving grace this day."}],"reward":{"gil":735,"items":[{"num":2,"id":36045}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69929]}},"partials":[{"type":"npc","id":"1037755","obj":{"i":1037755,"n":"Talon","l":3710,"q":2}},{"type":"item","id":"36045","obj":{"i":36045,"n":"Glory Be Soup","l":533,"c":24106,"t":46}},{"type":"quest","id":"69929","obj":{"i":69929,"n":"Strange Bedfellows","g":11,"l":"Garlemald","s":547}}]}