{"quest":{"name":"In the Skies above Garlemald","location":"Garlemald","id":69775,"patch":6.0,"sort":1740,"eventIcon":71221,"issuer":1040662,"target":1040662,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>A member of the contingent's reconnaissance force is looking for an intrepid soul willing to sit astride magitek armor."],"objectives":["Speak with the magitek pilot.","Speak with the magitek pilot again.","Speak with the contingent scout."],"dialogue":[{"name":"ILSABARDSCOUT04239","text":"Salutations, <span class=\"highlight\">Forename</span>. Forgive the abrupt nature of my question, but...have you ever sat astride magitek armor? "},{"name":"ILSABARDSCOUT04239","text":"Fantastic. If anyone were to have such experience, I knew it would be you. The reason for my asking is simple: we wish to get an aerial view of the city to assess damages."},{"name":"ILSABARDSCOUT04239","text":"A magitek pilot belonging to the Ist Legion was kind enough to suggest we use one of their flying units to conduct our survey."},{"name":"ILSABARDSCOUT04239","text":"Alas, the person we initially requested for this assignment has been injured and rendered unable to board the armor. Fortunately, I have found you! Or rather, you have found me, as it were."},{"name":"ILSABARDSCOUT04239","text":"This magitek pilot I spoke of awaits you at Liminal Station IV. You'll find him performing maintenance on the armor you will be using. He will get you set up."},{"name":"ILSABARDSCOUT04239","text":"I'm somewhat jealous you get to experience such a sight. Not every day one strolls through the clouds above enemy territory, after all. Anyhow, when you're ready, you'll find the pilot I spoke of performing maintenance on the vehicle at Liminal Station IV."},{"name":"GARLEANCAVALRY04239","text":"Well, well, well... Eorzea's very own hero <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> is to be our pilot? Then again, accomplished aviators such as yourself are thin on the ground these days. I suppose they had to turn to you."},{"name":"GARLEANCAVALRY04239","text":"I've heard some fascinating stories about you, you know? Is it true you rode an ancient Allagan warmachina into battle against the VIIth Legion? Seemed far-fetched, but now that I've gotten a good look at you, I can see there may be some truth to the tale."},{"name":"GARLEANCAVALRY04239","text":"But let us turn to the business at hand... The Ilsabard contingent has requested that we ascertain the level of damage the city has sustained. And the only real way to get a proper handle on the situation is from above."},{"name":"GARLEANCAVALRY04239","text":"However, there are still hosts of autonomous machines lurking the streets, and they won't hesitate to shoot down an unidentified craft. Which is where the Ist Legion's magitek comes in. So long as we remain inside this armor, we needn't fear attack from the ground."},{"name":"GARLEANCAVALRY04239","text":"When your loins are sufficiently girded for your trip among the clouds, just say the word."},{"name":"GARLEANCAVALRY04239","text":"Not to scare you off, as this mission is of great importance to us, but I hope you've some idea of what you are about to embark upon. You will be wheeling through the sky in what is essentially a metal bucket. If that hasn't unnerved you, I'm ready when you are."},{"name":"Q1","text":"Are you ready to board the flying magitek armor?"},{"name":"GARLEANCAVALRY04239","text":"Then let us be on our way."},{"name":"GARLEANCAVALRY04239","text":"I will be here when you are ready."},{"name":"GARLEANCAVALRY04239","text":"We shall start our survey from the north. A word of warning, though: from above, the extent of the damage will seem much greater than what you expected. It may come as something of a shock."},{"name":"GARLEANCAVALRY04239","text":"See that overpass there? It looks like it might collapse at any moment. A single chocobo feather could see it crumble to dust, I reckon. We shall cordon it off, and ensure that none of ours attempts to enter the area."},{"name":"GARLEANCAVALRY04239","text":"This is Palatium Novum. Though it is in a sorry state now, its towers were once symbols of our Empire─symbols of the progress we could achieve through the application of our sciences."},{"name":"GARLEANCAVALRY04239","text":"I am inclined to enter the structure proper to examine the extent of the devastation from within. Sadly, we are still too few in number for such an undertaking. It will have to wait."},{"name":"GARLEANCAVALRY04239","text":"Look there. This looks largely intact, which is little wonder. The building, which dates back to the era of the republic, is said to be constructed from materials meant to ward against all manner of offensive magicks."},{"name":"GARLEANCAVALRY04239","text":"Clearly, not all our buildings were erected with such a design philosophy. We had foolishly assumed that the warmachina defending us would make up for less-than-ideal structural integrity. You can see what cutting corners cost us."},{"name":"GARLEANCAVALRY04239","text":"With that, I would say we hit all the key areas of the city for the most part. Let's return to Camp Broken Glass, shall we?"},{"name":"GARLEANCAVALRY04239","text":"Thank you for joining me in the skies today, <span class=\"highlight\">Forename</span>."},{"name":"GARLEANCAVALRY04239","text":"I confess I have been on my guard around you Eorzean lot. It has been beaten into my skull that you are─and will always be─my enemy. Spending time with you today, however, has made me realize that you truly are here to help us─not harm us."},{"name":"GARLEANCAVALRY04239","text":"To be honest, your contingent's support has been a bright spot in this gloom. It is easy to fall prey to hopelessness, but we've a responsibility to fight on, do we not? We are all of us living on this star, and who else can see it brought back from the brink of ruin?"},{"name":"GARLEANCAVALRY04239","text":"Many of us have lost families, friends, loved ones. Grief hangs heavy on the Empire. We need time to lick our wounds, but that does not mean we are without the fire of determination. We wish to see our home restored to its former glory."},{"name":"GARLEANCAVALRY04239","text":"That is part of the reason why I decided to undertake this task, actually. I wanted to better understand not only the road ahead for the Empire, but to see for myself the stuff you Eorzeans are made of."},{"name":"GARLEANCAVALRY04239","text":"Enough sentimentality, though. There's still much to be done here, and this armor won't repair itself. Would you mind reporting back to the reconnaissance officer who assigned you to this task and tell him of our findings?"},{"name":"GARLEANCAVALRY04239","text":"I will remain here, and see to this machina's maintenance. We cannot have it rusting on us, now can we?"},{"name":"ILSABARDSCOUT04239","text":"You've flown through the skies above Garlemald and live to tell the tale!"},{"name":"ILSABARDSCOUT04239","text":"How was the imperial pilot? I can't imagine how difficult it must be to look down on such wreckage and know that it was once your home, but I'm sure your presence was a comfort to him."},{"name":"ILSABARDSCOUT04239","text":"It will take a great deal of hard work and elbow grease to see this city restored, but I've all the faith in the world that we can see it done. I only hope that our efforts here can bring about an alliance between our realms."}],"reward":{"gil":815,"items":[{"num":2,"id":36041}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69929]}},"partials":[{"type":"npc","id":"1040662","obj":{"i":1040662,"n":"Contingent Scout","l":3710,"q":1}},{"type":"item","id":"36041","obj":{"i":36041,"n":"King Crab Cake","l":530,"c":24329,"t":46}},{"type":"quest","id":"69929","obj":{"i":69929,"n":"Strange Bedfellows","g":11,"l":"Garlemald","s":547}}]}