{"quest":{"name":"True Carrot Crimes","location":"Mare Lamentorum","id":69776,"patch":6.0,"sort":1801,"unlocksFunction":1,"eventIcon":71341,"issuer":1037867,"target":1037867,"genre":124,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Watchingway has a mystery in want of solving."],"objectives":["Search for the iron carrots.","Report to Watchingway."],"dialogue":[{"name":"WATCHINGWAY","text":"Excuse me, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>─have you by chance seen any thieves prowling about with ill-gotten iron carrots? They're crimson, tender, surprisingly heavy...the carrots, that is, not the thieves."},{"name":"WATCHINGWAY","text":"If you haven't seen them yet, I'm sure you will! We've been told that you “adventurers” are quite good at solving crimes that no one else can be bothered with."},{"name":"WATCHINGWAY","text":"Wonderful! I'm relying on you to solve our carrot caper. Honestly, what manner of fiend would deny a Loporrit their dinner..."},{"name":"WATCHINGWAY","text":"Ahem. Anyway, our culprit─or culprits─took four carrots in all. Those are <span class=\"emphasis\">not</span> easy to carry about, so I daresay they can't have gotten far!"},{"name":"WATCHINGWAY","text":"There must be a clue around here somewhere..."},{"name":"SYSTEM","text":"This scrumptious-looking iron carrot has been tragically abandoned in its prime."},{"name":"SUPPORTER04240","text":"&lt;blip&gt; &lt;blip&gt; Insufficient stock of iron carrots... Iron carrot detected. Initiating iron carrot procurement!"},{"name":"SYSTEM","text":"Based on the primer you but recently received, you can say with relative certainty that iron carrots are not blue..."},{"name":"LOPORRITS04240","text":"&lt;munch&gt; &lt;munch&gt;...&lt;gulp&gt; Mmm! These philosopher's carrots really hit the spot! Just a few more... Wha─!?"},{"name":"LOPORRITS04240","text":"What? No, of course I'm not stealing! These are mine. Is it so wrong to enjoy an early dinner?"},{"name":"SYSTEM","text":"The muttering Loporrit stomps off in search of a place to eat in peace. You suspect this is not your carrot culprit."},{"name":"WATCHINGWAY","text":"You're back! Please tell me you found the carrots."},{"name":"WATCHINGWAY","text":"The supporter? I never would have suspected... It's supposed to help us farm carrots, not eat them!"},{"name":"WATCHINGWAY","text":"Hmm... I recall the technicians said something about enhancing its code with a love for carrots to increase work efficiency. But to go so far as to steal carrots for itself, I fear it may now love them a little <span class=\"emphasis\">too</span> much..."},{"name":"WATCHINGWAY","text":"Alas, those poor carrots! But at least we know what became of them, and how to prevent this happening again. Thank you for your assistance!"}],"reward":{"gil":655,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69939]}},"partials":[{"type":"npc","id":"1037867","obj":{"i":1037867,"n":"Watchingway","l":3711,"q":1}},{"type":"quest","id":"69939","obj":{"i":69939,"n":"Styled a Hero","g":11,"l":"Mare Lamentorum","s":557}}]}