{"quest":{"name":"Put Your Plasma Where Your Mouth Is","location":"Garlemald","id":69770,"patch":6.0,"sort":1690,"eventIcon":71221,"issuer":1039358,"target":1037729,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>A member of the Immortal Flames is looking for a hero brave enough to wield a mighty weapon and fell a colossus."],"objectives":["Speak to the Immortal Flame delegate near the station.","Wait at the specified location and stop the colossi with the magitek weapon.","Speak with the Immortal Flame delegate.","Report to Ambaghai."],"dialogue":[{"name":"FLAMESOLDIER04234","text":"If it isn't <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>. Your timing is fortuitous. There is a request I would make of you, one on the more perilous side."},{"name":"FLAMESOLDIER04234","text":"As you know, we are working day and night to escort this city's residents to safety. Unfortunately, some magitek colossi seek to undermine our efforts, but to directly engage them would result in catastrophic collateral damage."},{"name":"FLAMESOLDIER04234","text":"Luckily, it need not come to that. Garlond Ironworks has a product known as a magitek plasma cannon. That means nothing to me, I confess, but word is this creation of theirs is capable of stopping a warmachina dead in its tracks."},{"name":"FLAMESOLDIER04234","text":"Sounds too good to be true, I know. Well, here's the rub: this silver bullet is a damned costly thing to develop, and they don't want just anyone handling it. Cid put your name forward, though. He thought you would acquit yourself well of this task."},{"name":"FLAMESOLDIER04234","text":"I know it is a deal to ask, but should you decide to aid us in our efforts, we will be waiting near the station."},{"name":"FLAMESOLDIER04234","text":"Your assistance is greatly appreciated, <span class=\"alternative-container\"><span class=\"alternative\">ma'am</span><span class=\"alternative\">sir</span></span>. I will distract the colossi, allowing you ample time to take aim with your newly appointed weapon."},{"name":"FLAMESOLDIER04234","text":"If the engineers are to be believed, scoring a direct hit will send a powerful current through the giant's systems and ultimately disable it."},{"name":"FLAMESOLDIER04234","text":"I will draw those menacing machines toward me. While they are distracted, use this new weapon of yours and make them regret interfering with our cause."},{"name":"SYSTEM","text":"Search your surroundings for the magitek colossi. You may move the camera as well as zoom in and out. Target the machina and disable it with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"SYSTEM","text":"The colossi approach! Be warned that should the Immortal Flame delegate retreat, your mission will be judged a failure."},{"name":"SYSTEM","text":"Strike three magitek colossi with your new weapon to silence them for good."},{"name":"FLAMESOLDIER04234","text":"Excellent shooting, <span class=\"highlight\">Forename</span>! Now those wretched machina have been dispatched, we will be able to deliver the citizens to safety."},{"name":"FLAMESOLDIER04234","text":"Before I return to the station to join the escort, I shall send word to Camp Broken Glass of your success. My superior officer Ambaghai will await you with your reward, I'll make sure of it."},{"name":"AMBAGHAI","text":"Good to have you among us again, <span class=\"highlight\">Forename</span>. I've heard of your triumph in taking down those behemoth warmachina, and have prepared you a reward commensurate with your efforts."},{"name":"AMBAGHAI","text":"That piece of artillery proved as effective as Garlond Ironworks intimated. But such is to be expected. Their craftsmanship is well-renowned, and their latest efforts redound to their credit."},{"name":"AMBAGHAI","text":"Alas, we were told not to expect more of its type─at least any time soon. According to a letter we received, its crafting was only made possible through the work of a rather ambitious employee...and a mountain of gil. Production of it on a large scale will prove impossible."},{"name":"AMBAGHAI","text":"Expenses notwithstanding, you were able to wield this foreign ordnance with great aplomb. Though it is but a trifle compared to the valor shown, I offer you this as a show of gratitude."}],"reward":{"gil":995,"items":[{"num":2,"id":36042}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69929]}},"partials":[{"type":"npc","id":"1039358","obj":{"i":1039358,"n":"Immortal Flame Delegate","l":3710,"q":1}},{"type":"npc","id":"1037729","obj":{"i":1037729,"n":"Ambaghai","l":3710,"q":2}},{"type":"item","id":"36042","obj":{"i":36042,"n":"Ukha","l":530,"c":24109,"t":46}},{"type":"quest","id":"69929","obj":{"i":69929,"n":"Strange Bedfellows","g":11,"l":"Garlemald","s":547}}]}