{"quest":{"name":"Beasts of the Imperial Wild","location":"Garlemald","id":69772,"patch":6.0,"sort":1710,"eventIcon":71221,"issuer":1037741,"target":1037741,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Berthellemy in Camp Broken Glass is having a devil of a time trying to keep the stores pest-free."],"objectives":["Speak with the imperial hunter.","Speak with the imperial hunter again.","Wait in the designated location for the almasty, use the spirits on it, defeat it, and obtain a hunk of meat from it.","Deliver the meat to the imperial hunter.","Report to Berthellemy."],"dialogue":[{"name":"BERTHELLEMY","text":"Blast it all. Overgrown bastard got away again... If only there were someone we could turn to, but who?"},{"name":"BERTHELLEMY","text":"Oh, excuse me. Didn't see you there. Pardon my mumbling... Hold a moment. Let me have a look at you. Those eyes, that steady-set jaw... Yes, you're a doughty sort, aren't you? Perfect. You are <span class=\"emphasis\">just</span> the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I was in the market for."},{"name":"BERTHELLEMY","text":"Our camp's stores are being pillaged, plundered, and altogether despoiled, which is troublesome indeed, as we've so little in the way of provisions as it is. Fortunately, the thieves left tracks, which the Garlean hunters of the area tell us belong to a variety of yeti known as almasty."},{"name":"BERTHELLEMY","text":"The wretches are so wily, that once they've found a source of food, they come in droves, telling all their other accursed friends! So that leaves us with only one recourse: swift and bloody retribution."},{"name":"BERTHELLEMY","text":"I was told to find the assistance of a master <span class=\"alternative-container\"><span class=\"alternative\">huntswoman</span><span class=\"alternative\">huntsman</span></span>, but you certainly can't find one of those just lying about. I was fretting over whom to ask, when you fell straight into my lap. And you seem as good a hunter as any, right?"},{"name":"BERTHELLEMY","text":"If you're willing to cooperate─and I am sure that you are─speak with the imperial hunter just outside camp. He'll set you on the right path."},{"name":"BERTHELLEMY","text":"If you're willing to help us curb the depredations of our supplies and teach the almasty a lesson, then speak with the imperial hunter beyond the camp's borders."},{"name":"GARLEANHUNTER04236","text":"Hold a moment... I know you. Yes, you're one of the Eorzeans who was brought to the station, aren't you!"},{"name":"GARLEANHUNTER04236","text":"I was told that I would receive assistance from one involved in the contingent's decision-making processes, but I must say...seeing you here comes as a shock. You seem the sort of person as to be above the sniping of vermin. Sure you've the time to spend on such menial tasks?"},{"name":"GARLEANHUNTER04236","text":"Very well. I won't press the subject any longer. Your assistance will prove invaluable, I'm certain. Now then, time is wasting. Let's reconvene in the Eblan Rime─the almasties' territory─where we'll set the trap."},{"name":"GARLEANHUNTER04236","text":"This here is the almasties' land, and considering how prolific the things are, we shouldn't have to wait long before one comes lumbering by."},{"name":"GARLEANHUNTER04236","text":"Ah, but I forget myself. Before we go a-hunting... Here, specialty spirits."},{"name":"GARLEANHUNTER04236","text":"Not for you, of course. For them─the almasties. Drown them in this stuff and they'll be three sheets to the wind before you know it. There's no easier quarry to catch than a drunk fool, am I right? Also, once you've felled one, don't forget to collect a bloody chunk from it."},{"name":"GARLEANHUNTER04236","text":"You can't deny that a drunk quarry is much easier to catch than one with its wits about it. That's a lesson I've learned many times over in the taverns I frequent."},{"name":"GARLEANHUNTER04236","text":"Have you the bloody chunk I requested? I should hope you kept it in a bottle, for I would rather not have gore dripping all over the both of us..."},{"name":"GARLEANHUNTER04236","text":"Good work. I must say, you've quite the mettle to face such beasts without so much as batting an eyelid. Though, it was silly of me to expect aught else from the selfsame <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who set foot into Tertium, knowing full well it was a trap."},{"name":"GARLEANHUNTER04236","text":"You must be wondering why the blood. Well, the almasties are clever creatures─they won't willingly wander into dangerous lands, especially ones that smell of death. So, sprinkling a copious amount of their fellows' gore about the encampment ought to ensure they give us a wide berth."},{"name":"GARLEANHUNTER04236","text":"Let's head back to Camp Broken Glass. There, you can tell the soldier who sent you to me that he was right to put you on the job."},{"name":"BERTHELLEMY","text":"The hunter has delivered word to me already of his plans to deal with our yeti troubles. How clever a stratagem he's hit upon. If only the method weren't quite so...macabre, shall we say?"},{"name":"BERTHELLEMY","text":"Almost surreal to consider that our whilom foes now aid us in our survival."},{"name":"BERTHELLEMY","text":"Today has proven to me that we really can bridge the divide that once separated us from them. And all it takes is for us simply to reach out and offer a hand in friendship. I should like very much were this newfound partnership to continue."}],"reward":{"gil":975},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69929]}},"partials":[{"type":"npc","id":"1037741","obj":{"i":1037741,"n":"Berthellemy","l":3710,"q":1}},{"type":"quest","id":"69929","obj":{"i":69929,"n":"Strange Bedfellows","g":11,"l":"Garlemald","s":547}}]}