{"quest":{"name":"Lone Loporrit","location":"Mare Lamentorum","id":69788,"patch":6.0,"sort":1920,"eventIcon":71221,"issuer":1041822,"target":1041822,"genre":124,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The bashful Loporrit has a secret to tell you."],"objectives":["Speak with the bashful Loporrit.","With the chat mode in <span class=\"highlight\">Say</span>, enter “going my way” to call the Loporrit out.","Speak with Goingmyway.","Speak with the bashful Loporrit."],"dialogue":[{"name":"FIDGETLOPORRIT04252","text":"Oh! Um, excuse me. You're the visitor from Etheirys, right? If it's all right, I'd like to have a word with you. In private."},{"name":"FIDGETLOPORRIT04252","text":"It's, well... I can't talk about it here. Might we step outside of Bestways Burrow? I'll be waiting for you around the northern end of Mare Lamentorum."},{"name":"FIDGETLOPORRIT04252","text":"You really came! Good, good. So, you see... The thing is, I, uh... There's someone I want you to meet."},{"name":"FIDGETLOPORRIT04252","text":"He's not like the other Loporrits, which I guess is why he lives so far removed from everyone. He very much enjoys his privacy, and will only show up if you speak his password first."},{"name":"FIDGETLOPORRIT04252","text":"The password is, um... “Going my way.” Think you can remember it?"},{"name":"FIDGETLOPORRIT04252","text":"He won't come out without the password─“going my way.”"},{"name":"SAYTODO","text":"going my way"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase containing the words “going my way” to call out the Loporrit."},{"name":"GOINGMYWAY","text":"(-???-)Hm...? Those thunderous footfalls and sonorous tone aren't at all like a Loporrit. Who goes there?"},{"name":"FIDGETLOPORRIT04252","text":"Um... I-It's me! I brought someone I'd really like for you to meet."},{"name":"GOINGMYWAY","text":"(-???-)...Very well. You may enter."},{"name":"FIDGETLOPORRIT04252","text":"Go on, talk to him. He doesn't allow just anyone here, you know."},{"name":"GOINGMYWAY","text":"A pleasure to meet you. My name is Goingmyway."},{"name":"GOINGMYWAY","text":"“A rather odd name,” you might say, but I can think of nothing more apt to describe the way I choose─nay, the way I was <span class=\"emphasis\">born</span> to live!"},{"name":"GOINGMYWAY","text":"Ever since the one thousand two hundred and forty-first inspection, I have longed to be free. So I stopped using the hibernation chambers and came here to live in secret and solitude."},{"name":"FIDGETLOPORRIT04252","text":"I found him here by accident one day when out searching for supplies. I promised to keep his secret and we've been friends ever since."},{"name":"FIDGETLOPORRIT04252","text":"I made an exception for you because, well... He likes rare and unusual things, and you're by far the most rare and unusual thing I've ever seen. I-I mean that in the best possible way, of course."},{"name":"GOINGMYWAY","text":"A visitor from Etheirys, at long last... I bid you welcome to the moon!"},{"name":"GOINGMYWAY","text":"My friend here tells me you're an adventurer. Ah, what a life that must be. I too yearn to journey in search of the unknown, and to that end I have labored to build a ship that may one day take me to explore the other side of the moon."},{"name":"FIDGETLOPORRIT04252","text":"And I hope he makes it there soon! Ah, speaking of which, I'm sure he was busy at work before we barged in here. We should probably let him get back to it."},{"name":"GOINGMYWAY","text":"You're more than welcome to visit again, and to join me on my voyage once my vessel is complete!"},{"name":"FIDGETLOPORRIT04252","text":"Thank you for, um...for meeting my friend. He thinks outside of the carrot patch, so it's nice to spend time with him from time to time."},{"name":"FIDGETLOPORRIT04252","text":"B-But please don't tell anyone. It has to be our little secret!"}],"reward":{"gil":815},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69942]}},"partials":[{"type":"npc","id":"1041822","obj":{"i":1041822,"n":"Bashful Loporrit","l":3711,"q":1}},{"type":"quest","id":"69942","obj":{"i":69942,"n":"Setting Things Straight","g":11,"l":"Mare Lamentorum","s":560}}]}