{"quest":{"name":"For a Greater Garden","location":"Mare Lamentorum","id":69787,"patch":6.0,"sort":1910,"eventIcon":71221,"issuer":1041820,"target":1041820,"genre":124,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The bouncy Loporrit would ask you to lend them an ear."],"objectives":["Speak with the bouncy Loporrit.","Choose a flower.","Speak with the bouncy Loporrit."],"dialogue":[{"name":"HAPPYLOPORRIT04251","text":"Just the person I was hoping to see! I'd like your thoughts on something, if you have a moment."},{"name":"HAPPYLOPORRIT04251","text":"As you might have noticed, this park is rather drab as it is now, which is why I plan to plant flowers to liven things up a little."},{"name":"HAPPYLOPORRIT04251","text":"Of course, there's no guarantee my tastes are in line with those of your people. We have a most wondrous assortment of plants at Lovingway's Darlings, and it would mean the moon to me if you picked which flowers we use here in the park."},{"name":"HAPPYLOPORRIT04251","text":"Hooray! To the gardens, then! You're going to love them, I know it."},{"name":"HAPPYLOPORRIT04251","text":"Well? What do you think? In my readings I found that even a single species of flower can bloom in a number of colors, which is what makes them so appealing. Though it took a little work, these three specimens are capable of the same."},{"name":"HAPPYLOPORRIT04251","text":"They're all charming in their own way, but I couldn't possibly decide which is best for the park."},{"name":"HAPPYLOPORRIT04251","text":"Which do you like best? Don't worry about giving a right or wrong answer─I trust your discerning eye!"},{"name":"HAPPYLOPORRIT04251","text":"Any of these would look wonderful in the park, but which one do you like?"},{"name":"HAPPYLOPORRIT04251","text":"Oh, this one's cute! I like how the flowers are all bunched together."},{"name":"HAPPYLOPORRIT04251","text":"Good choice! It's so sparkly and pretty!"},{"name":"HAPPYLOPORRIT04251","text":"Oooh, I like these, too! They're sure to make an impression with park visitors."},{"name":"SYSTEM","text":"Choose this flower?"},{"name":"HAPPYLOPORRIT04251","text":"No need to rush in choosing, though I'd be lying if I said I'm not eager to hear your favorite."},{"name":"HAPPYLOPORRIT04251","text":"A fine choice! Now, let's take a few back to the park, shall we? Do be careful not to drop any on the way!"},{"name":"HAPPYLOPORRIT04251","text":"The flowers, if you please."},{"name":"HAPPYLOPORRIT04251","text":"I'm told the people of Etheirys love nature, and flowers are held in particularly high regard. I realize they're not quite the same, but I sure hope these blooms make the moon feel a little more like home."},{"name":"HAPPYLOPORRIT04251","text":"First thing's first─I need to plant as many of these flowers as I can! By the time I'm done, our gardens will be a place of joy and wonderment for all, you wait and see."}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69942]}},"partials":[{"type":"npc","id":"1041820","obj":{"i":1041820,"n":"Bouncy Loporrit","l":3711,"q":1}},{"type":"quest","id":"69942","obj":{"i":69942,"n":"Setting Things Straight","g":11,"l":"Mare Lamentorum","s":560}}]}