{"quest":{"name":"Over the Rainbow Crystal","location":"Mare Lamentorum","id":69780,"patch":6.0,"sort":1840,"eventIcon":71221,"issuer":1041795,"target":1041795,"genre":124,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The sparkling-eyed Loporrit has rainbows on their mind."],"objectives":["Obtain a lightning-aspected crystal from its sparkling supply station.","Obtain a wind-aspected crystal from its sparkling supply station.","Deliver the lightning-aspected crystal to the shine supervisor.","Deliver the wind-aspected crystal to Hoppingway.","Speak with the sparkling-eyed Loporrit."],"dialogue":[{"name":"LOPORRITSA04244","text":"Goodness! My apologies, I was rather preoccupied thinking about the rainbow crystals. Beautiful, aren't they?"},{"name":"LOPORRITSA04244","text":"Their elemental energies are what make it possible for people to survive here on the moon. From the air we're breathing, to the gravity that keeps us from haphazardly floating about─it's all thanks to those crystals."},{"name":"LOPORRITSA04244","text":"They require regular maintenance to maintain equilibrium, though, and that's where I come in! If you've a mind to see how it's done, I could use an extra set of paws. Or...hands, as your kind seems to insist on calling them."},{"name":"LOPORRITSA04244","text":"My friends will take care of the more delicate work, so all you need to do is bring us a few aspected crystals. How about it?"},{"name":"LOPORRITSA04244","text":"It's so nice to know people from Etheirys take an interest in their own ability to breathe!"},{"name":"LOPORRITSA04244","text":"Now, what we need to get started are lightning- and wind-aspected crystals─one each. You can find them at their respective sparkling supply stations."},{"name":"LOPORRITSA04244","text":"Once you have them, you'll want to deliver the lightning-aspected crystal to the shine supervisor to the north─they're in charge of shininess, you know."},{"name":"LOPORRITSA04244","text":"The wind-aspected crystal should go to Hoppingway, near the entrance."},{"name":"LOPORRITSA04244","text":"I'll handle the fire- and water-aspected crystals, so you need simply report to me once your crystals are distributed."},{"name":"LOPORRITSB04244","text":"Oh, hello there! I don't suppose you've come to deliver a lightning-aspected crystal?"},{"name":"LOPORRITSB04244","text":"You have! Well then, stand back─I'll have those rainbow crystals sparkling like new in no time at all."},{"name":"LOPORRITSB04244","text":"It means a lot to know you're willing to help with the moon's upkeep! Now please, step away from the control panel."},{"name":"HOPPINGWAY","text":"It's you! You're here! Which can only mean you have a crystal for me!"},{"name":"HOPPINGWAY","text":"Yes, that's the one I need! Thank you!"},{"name":"HOPPINGWAY","text":"The rainbow crystals will be like new in two shakes of a rabbit's tail! Aren't you thrilled!?"},{"name":"LOPORRITSA04244","text":"You're back! I take it everything went according to plan?"},{"name":"LOPORRITSA04244","text":"Then Mare Lamentorum is safe for another day! This part of it, anyway. Though there is one thing I still wish the crystals could provide for us..."},{"name":"LOPORRITSA04244","text":"Rain! Oh, how I long to see the shimmering raindrops that fall so freely on Etheirys..."},{"name":"LOPORRITSA04244","text":"It's my dream to one day expand the capabilities of the rainbow crystals so we can do just that. Who knows─perhaps you'll need a parasol the next time you visit!"},{"name":"LOPORRITSA04244","text":"Ah, but until then, I promise we'll keep the moon in tip-top condition. We do live here, after all..."}],"reward":{"gil":655,"items":[{"id":35692}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69939]}},"partials":[{"type":"npc","id":"1041795","obj":{"i":1041795,"n":"Sparkling-eyed Loporrit","l":3711,"q":1}},{"type":"item","id":"35692","obj":{"i":35692,"n":"Phrygian Earring Coffer (IL 533)","l":1,"c":26564,"t":61}},{"type":"quest","id":"69939","obj":{"i":69939,"n":"Styled a Hero","g":11,"l":"Mare Lamentorum","s":557}}]}