{"quest":{"name":"Clothes Maketh the Man","location":"Mare Lamentorum","id":69782,"patch":6.0,"sort":1860,"eventIcon":71221,"issuer":1041799,"target":1041799,"genre":124,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The vacillating Loporrit is in need of help."],"objectives":["Speak with the Loporrit tailor.","/pose for the Loporrit tailor.","Assume your /battlestance for the Loporrit tailor.","Speak with the vacillating Loporrit."],"dialogue":[{"name":"LOPORRITSA04246","text":"Oh! It's you! Uh... If it's not too much trouble, I could really use your help!"},{"name":"LOPORRITSA04246","text":"We've been making clothes for your people, but after speaking with Livingway, I realized we've made a grave mistake!"},{"name":"LOPORRITSA04246","text":"Considerable alterations must be made to our plans, and I was hoping you might join me to speak with the Loporrit in charge of garment adjustments."},{"name":"LOPORRITSA04246","text":"Thank you! They're not going to be happy about this..."},{"name":"LOPORRITSA04246","text":"I'm telling you, we're doing it all wrong! We have to fix these clothes before it's too late!"},{"name":"LOPORRITSB04246","text":"How are we supposed to resize everything when we don't even know what to base the alterations on?"},{"name":"LOPORRITSB04246","text":"Oh! You must be the model, then. I see... You really are like a baby carrot."},{"name":"LOPORRITSA04246","text":"Perhaps an explanation is in order... You see, we'd like you to help us redefine the style of the clothing we create."},{"name":"LOPORRITSA04246","text":"We believe comfort and familiarity are key to accommodating the people of Etheirys...which is why we thought masks and all-purpose robes would suffice."},{"name":"LOPORRITSA04246","text":"When Livingway claimed the fashion trends of Etheirys are far removed from what we were anticipating, I was incredulous, but meeting you made everything painfully clear!"},{"name":"LOPORRITSB04246","text":"Indeed. I see now that our plans won't do. Your garments are so vibrant and...unique."},{"name":"LOPORRITSB04246","text":"We still need to decide what adjustments to make, so would you please stay a while?"},{"name":"LOPORRITSB04246","text":"Thank you. Now, be a dear and strike a <span class=\"highlight\">pose</span> for me, will you? I want to get an idea of how the fabric moves with you."},{"name":"LOPORRITSA04246","text":"If you could <span class=\"highlight\">pose</span> for me, that would be a great help."},{"name":"LOPORRITSB04246","text":"No need to be shy. There's no one watching but the two of us. Go ahead and give us a <span class=\"highlight\">pose</span>."},{"name":"SYSTEM","text":"The Loporrit tailor watches you intently. Strike a <span class=\"highlight\">pose</span> to show off your garb."},{"name":"LOPORRITSB04246","text":"Yes, just like that! Hmm... I see. May I ask why you chose to wear this outfit?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I like how it looks."},{"name":"A1","text":"It's practical."},{"name":"A1","text":"Not sure <span class=\"emphasis\">what</span> I was thinking, to be honest."},{"name":"LOPORRITSB04246","text":"So people find designs like this aesthetically pleasing? I'll have to bear that in mind when I redesign our concepts..."},{"name":"LOPORRITSB04246","text":"Ah, so it's not only form that appeals to you, but function as well! A practical choice, I suppose, if you're to take to the battlefield..."},{"name":"LOPORRITSB04246","text":"What, did you choose it with your eyes closed? Ugh... Well, I suppose it just goes to show how very routine clothing is to you."},{"name":"LOPORRITSB04246","text":"Might I see your <span class=\"highlight\">battle stance</span> next? If the people of Etheirys have need to fight, I'd like to be certain their clothes strike fear in the hearts of their enemies."},{"name":"LOPORRITSA04246","text":"I'm fairly sure that if I were to wander onto a battlefield, I'd be turned into a pelt in no time..."},{"name":"LOPORRITSB04246","text":"Would you show me your most valiant <span class=\"highlight\">battle stance</span>? Your clothes must be stylish, but they must also strike fear into the hearts of your enemies! ...People enjoy that, yes?"},{"name":"SYSTEM","text":"The Loporrit tailor watches you intently. Assume a <span class=\"highlight\">battle stance</span> to show off your garb."},{"name":"LOPORRITSB04246","text":"Yes... I believe I have a solid grasp of what our designs were lacking before."},{"name":"LOPORRITSA04246","text":"Truly, I never realized that one's choice of attire could make such an impression!"},{"name":"LOPORRITSB04246","text":"And that ensemble quite befits your personality, I must say."},{"name":"LOPORRITSB04246","text":"...Which means we can't just throw the same garb on everyone. What is that saying you have? Ah, yes─“variety is the spice of life”!"},{"name":"LOPORRITSB04246","text":"You have given me so many new ideas, I can hardly wait to get started! In fact, I cannot wait at all!"},{"name":"LOPORRITSA04246","text":"Er... Right, then. Would you care to follow me back to my station?"},{"name":"LOPORRITSA04246","text":"I do believe that we have a much better idea of what we should be making now, and the necessary alterations should prove little trouble."},{"name":"LOPORRITSA04246","text":"Just you wait─someday soon, the people of Etheirys will be clamoring for the latest fashions from Bestways Burrow!"},{"name":"LOPORRITSA04246","text":"...Assuming I get back to work, that is. Thank you for your help!"}],"reward":{"gil":735,"items":[{"id":35693}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69939]}},"partials":[{"type":"npc","id":"1041799","obj":{"i":1041799,"n":"Vacillating Loporrit","l":3711,"q":1}},{"type":"item","id":"35693","obj":{"i":35693,"n":"Phrygian Necklace Coffer (IL 533)","l":1,"c":26565,"t":61}},{"type":"quest","id":"69939","obj":{"i":69939,"n":"Styled a Hero","g":11,"l":"Mare Lamentorum","s":557}}]}