{"quest":{"name":"All Fun and Games","location":"Mare Lamentorum","id":69781,"patch":6.0,"sort":1850,"eventIcon":71221,"issuer":1041797,"target":1041797,"genre":124,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The playful Loporrit has a new game to play."],"objectives":["Speak with the playful Loporrit.","Count the Loporrits at the designated location.","Report to the playful Loporrit.","Speak with the playful Loporrit."],"dialogue":[{"name":"LOPORRITSA04245","text":"Greetings! I'm the Loporrit in charge of the children's romping grounds. I expect it will be quite the challenge keeping the children of Etheirys entertained with limited space and supplies...but I daresay I'm up to it!"},{"name":"LOPORRITSA04245","text":"In fact, I but recently came up with a new game that requires no props nor preparation. I call it “The Loporrits Never Stoporrit (Name Pending Livingway's Approval).” Care to give it a go?"},{"name":"LOPORRITSA04245","text":"I knew you would! Now, the game is very simple─you need only count the Loporrits hopping this way and that way...or possibly no way...before time is up."},{"name":"LOPORRITSA04245","text":"I have the perfect place picked out to play─follow me to the Carrotorium!"},{"name":"LOPORRITSA04245","text":"Do you see the carrot creation station there? When you're ready, see if you can count how many Loporrits are sneaking about it."},{"name":"SYSTEM","text":"Inspect the designated location to begin counting Loporrits."},{"name":"SYSTEM","text":"You will have thirty seconds to complete the task, after which you may give your answer to the playful Loporrit."},{"name":"LOPORRITSA04245","text":"See if you can count the number of Loporrits there at the carrot creation station. It's not as easy as it looks! ...Assuming it looks easy. Does it?"},{"name":"SYSTEM","text":"Try counting the Loporrits again?"},{"name":"LOPORRITSA04245","text":"So, do you think you counted them right? How many Loporrits did you see?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Three."},{"name":"A1","text":"Four."},{"name":"A1","text":"Five."},{"name":"LOPORRITSA04245","text":"Oooh, so close! How about giving it one more try?"},{"name":"LOPORRITSA04245","text":"We have a winner! Hm? Too easy, you say? Well, it's no fun if it's too hard!"},{"name":"LOPORRITSA04245","text":"And you <span class=\"emphasis\">did</span> have fun, didn't you!? Wait, hold that thought─our time here is nearly up, and structure is important for productive play. You can tell me all about the fun you had after we've returned to Bestways Burrow instead."},{"name":"LOPORRITSA04245","text":"Now, tell me what you think. Was it a good game? Do you think the other children will like it, too?"},{"name":"LOPORRITSA04245","text":"You're an <span class=\"emphasis\">adult</span>? Goodness, I'm so sorry! It's just, I was told that the people of Etheirys are at least twice our height, and you're so... Ahem. Well, as for the matter at hand..."},{"name":"LOPORRITSA04245","text":"Now, tell me what you think. I'm confident the children will like it, and it cuts back on equipment costs as well. I see no downsides! So..."},{"name":"LOPORRITSA04245","text":"I want to hear your honest opinion. How was it?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I had a great time!"},{"name":"A2","text":"Boooring."},{"name":"A2","text":"I've actually played this before."},{"name":"LOPORRITSA04245","text":"Wonderful! I knew I came up with a terrific game, but hearing it from you is all the more reassuring!"},{"name":"LOPORRITSA04245","text":"Oh, I see... Well, I appreciate your honesty. Looks like it's back to the drawing board with me."},{"name":"LOPORRITSA04245","text":"What!? And here I thought I had come up with a new and exciting idea! I'll have to improve on it to make something truly unique..."},{"name":"LOPORRITSA04245","text":"Thank you for taking the time to play with me. If I come up with a new game, I'll be sure to seek your expert opinion!"}],"reward":{"gil":815},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69939]}},"partials":[{"type":"npc","id":"1041797","obj":{"i":1041797,"n":"Playful Loporrit","l":3711,"q":1}},{"type":"quest","id":"69939","obj":{"i":69939,"n":"Styled a Hero","g":11,"l":"Mare Lamentorum","s":557}}]}