{"quest":{"name":"Dangerous Work","location":"Mare Lamentorum","id":69785,"patch":6.0,"sort":1890,"eventIcon":71221,"issuer":1041809,"target":1041809,"genre":124,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The sprightly Loporrit has lost track of their friends, and could use a helping hand."],"objectives":["Search for and aid wayward Loporrits.","Search for more wayward Loporrits.","Speak with the reeling Loporrit.","Report to the sprightly Loporrit."],"dialogue":[{"name":"BRISKLYLOPORRIT04249","text":"You're that visitor everyone's been talking about. I don't suppose you have time to assist me in a matter of life and death?"},{"name":"BRISKLYLOPORRIT04249","text":"Four of my friends went out to patrol the moon and mine for ore. They should be back by now, but... Well, I'm worried something happened!"},{"name":"BRISKLYLOPORRIT04249","text":"I can't say I'm too keen on the idea of coming face-to-facelike-growth with one of those roving fungi by myself, though. Could you come along? Please come along..."},{"name":"BRISKLYLOPORRIT04249","text":"Thank you! Let's hop to it, then. My friends were headed toward the Chlorophosgrot."},{"name":"BRISKLYLOPORRIT04249","text":"Sweet Mother Hydaelyn! I hope they're all right..."},{"name":"DIZZYLOPORRIT04249","text":"...Guh? Wha? Why are you...?"},{"name":"DIZZYLOPORRIT04249","text":"I-I'm not slacking! I, erm...passed out after a weeper ambushed me. Yes, that's definitely what happened."},{"name":"DIZZYLOPORRIT04249","text":"If you're looking for the others, they went ahead to survey the Chlorophosgrot and the area around the Cradle of Darkness. I'd get them myself, but I'm much too laz─er, that is, exhausted from my encounter with the weeper."},{"name":"DIZZYLOPORRIT04249","text":"The others are either there in the Chlorophosgrot or near the Cradle of Darkness... I'm sure they're fine, though. They're nowhere near as, uh...exhausted...as I am."},{"name":"BRISKLYLOPORRIT04249","text":"...Do you hear intermittent snoring?"},{"name":"PLUMPLOPORRIT04249","text":"This hole sure is deep. Drop a rock in there, and you'll never hear it hit the bottom..."},{"name":"PLUMPLOPORRIT04249","text":"Oh, it's you! Is something the matter?"},{"name":"PLUMPLOPORRIT04249","text":"Eep! Sorry for the bother─I didn't realize I'd been gone so long. I'll head back right away."},{"name":"PLUMPLOPORRIT04249","text":"Mining makes me so...so sleepy. Must...stay...awake..."},{"name":"PLUMPLOPORRIT04249","text":"...Hmmm? Oh, is it time to go back already? I hardly got anything done. Oh well!"},{"name":"NUMBLOPORRIT04249","text":"I'm sure this plant wasn't here last time... Well, would you look at that, it's made my paw all tingly. Numb, even... Surely there's some use for this!"},{"name":"NUMBLOPORRIT04249","text":"Goodness me! Time to head back, is it? I was so focused, I completely lost track of time."},{"name":"PLUMPLOPORRIT04249","text":"How far down could that hole go, I wonder?"},{"name":"PLUMPLOPORRIT04249","text":"&lt;yawn&gt; Maybe I'll get some proper mining done next time."},{"name":"NUMBLOPORRIT04249","text":"I can't feel my arm now. But it still moves, so it's fine, right? ...Right?"},{"name":"DIZZYLOPORRIT04249","text":"I feel much better after that brief and totally regulation-compliant break. Let's head back and sift through the spoils of our expedition!"},{"name":"BRISKLYLOPORRIT04249","text":"I hope they don't think you're impressed by their shenanigans... &lt;sigh&gt; Honestly!"},{"name":"BRISKLYLOPORRIT04249","text":"Thanks again for helping me round everyone up. I'm glad no one was hurt..."},{"name":"BRISKLYLOPORRIT04249","text":"They were lucky this time, but with those fungi and other odd creatures out there, I think we'll have to reconsider our patrol routes from now on. For a mercy, there are plenty of places to mine for ore nearby."},{"name":"BRISKLYLOPORRIT04249","text":"Before you go, I'd like you to have this. Don't be a stranger!"}],"reward":{"gil":815},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69942]}},"partials":[{"type":"npc","id":"1041809","obj":{"i":1041809,"n":"Sprightly Loporrit","l":3711,"q":1}},{"type":"quest","id":"69942","obj":{"i":69942,"n":"Setting Things Straight","g":11,"l":"Mare Lamentorum","s":560}}]}