{"quest":{"name":"Material Woes","location":"Mare Lamentorum","id":69786,"patch":6.0,"sort":1901,"eventIcon":71221,"issuer":1037817,"target":1037817,"genre":124,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Guidingway has a request that only an adventurer such as yourself could fulfill."],"objectives":["Defeat a daphnia and obtain its remains.","Deliver the daphnia's remains to Guidingway."],"dialogue":[{"name":"GUIDINGWAY","text":"Ah, there you are. Do you have a moment? While going over the resources sent by our collaborators, I stumbled upon a rather curious morsel of information that wants for verification."},{"name":"GUIDINGWAY","text":"Is it true that you procure crafting materials from other living creatures, and thereafter use them to craft <span class=\"emphasis\">without</span> using creation magicks?"},{"name":"GUIDINGWAY","text":"Incredible! I'd like to try my hand at it, but first I'll require materials to craft with..."},{"name":"GUIDINGWAY","text":"Considering what resources are here in Mare Lamentorum, I thought a daphnia would be the perfect specimen to harvest material from, but I am hardly a hunter."},{"name":"GUIDINGWAY","text":"But that's where you come in! Being Hydaelyn's champion and all, I have no doubt you can handle a daphnia or two. Might I trouble you to bring one back for study?"},{"name":"GUIDINGWAY","text":"Wonderful! The daphnia inhabit the area around Lovingway's Darlings, if you're looking for a place to start. Happy hunting!"},{"name":"GUIDINGWAY","text":"You should have no trouble finding a daphnia near Lovingway's Darlings."},{"name":"GUIDINGWAY","text":"Welcome back. I take it you have a daphnia for me? Or what's left of one, I suppose."},{"name":"GUIDINGWAY","text":"Oh, goodness! Apologies, I've never seen one this close before."},{"name":"GUIDINGWAY","text":"Yes... As I thought, the skin is quite elastic."},{"name":"GUIDINGWAY","text":"With this, it should prove no trouble at all to produce clothing for people of all sizes!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Sounds quite comfortable!"},{"name":"A1","text":"Wouldn't clothes from that be a little too...translucent?"},{"name":"A1","text":"Are you sure clothes made from that are a good idea?"},{"name":"GUIDINGWAY","text":"I had hoped you would approve! We'll make the finest garb for you and your kind."},{"name":"GUIDINGWAY","text":"Now that you mention it... We'll have to come up with a rigorous dye treatment to ensure the cloth isn't too revealing."},{"name":"GUIDINGWAY","text":"What's the matter? The resulting garments will be highly practical, not to mention comfortable."},{"name":"GUIDINGWAY","text":"In any case, you've been a great help. It's not much, but I'd like you to have this."}],"reward":{"gil":655},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69942]}},"partials":[{"type":"npc","id":"1037817","obj":{"i":1037817,"n":"Guidingway","l":3711,"q":1}},{"type":"quest","id":"69942","obj":{"i":69942,"n":"Setting Things Straight","g":11,"l":"Mare Lamentorum","s":560}}]}