{"quest":{"name":"Radiant Patrol","location":"Thavnair","id":69795,"patch":6.0,"sort":2020,"unlocksFunction":1,"eventIcon":71341,"issuer":1040669,"target":1040669,"genre":122,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The Radiant Host captain seeks someone to help her in her duties."],"objectives":["Speak with the Radiant Host captain.","Investigate the area to the south of Palaka's Stand.","Report to the Radiant Host captain.","Deliver the Manusya statuette to the Radiant Host captain."],"dialogue":[{"name":"CAPTAIN04259","text":"I know we are beset by monsters, beasts, and worse, but if you have even an onze of strength to give, I would ask for your aid. I am in need of a brave soul to help patrol the area in search of any lost refugees. "},{"name":"CAPTAIN04259","text":"I would ask my brothers and sisters of the Radiant Host, but our numbers have been greatly diminished. It is all we can do to keep the darkness from swallowing this settlement whole."},{"name":"CAPTAIN04259","text":"Very good, it shall be heartening to have another warrior by my side. Let us commence at once."},{"name":"CAPTAIN04259","text":"We should begin our patrol by heading south, a route through which many refugees from Yedlihmad pass."},{"name":"CAPTAIN04259","text":"We will cover more ground if we split into two groups. If you should find anyone in need, go to their aid, and if you discover any discarded effects, collect them for safekeeping."},{"name":"CAPTAIN04259","text":"Ah, and if you should encounter one of those terrible beasts, slay it where it stands. Once we've made a thorough search of the area, let us rendezvous back here. Godsspeed."},{"name":"SYSTEM","text":"You see a strange statuette lying on the ground, depicting a woman wearing a beastly mask. It may be best to collect it."},{"name":"SYSTEM","text":"You survey the area, but detect nothing out of the ordinary."},{"name":"RESIDENTS04259","text":"Oh, is it gone? Thank the gods...I would have surely died without your help. What are you doing out here?"},{"name":"RESIDENTS04259","text":"I see. So the Radiant Host looks over us yet─for that I'm grateful. Well, I suppose if I follow the path you took to get here, I should be safe on my way back. You didn't leave anything alive, did you?"},{"name":"RESIDENTS04259","text":"If the Radiant Host is watching over us, then there is naught to fear."},{"name":"CAPTAIN04259","text":"Welcome back. I've heard all about your noble deed. Allow me to thank you for protecting those we cannot."},{"name":"RESIDENTS04259","text":"I'll add my thanks to hers. If not for you, I'd be nothing but food for the beasts."},{"name":"CAPTAIN04259","text":"You've more than earned a reward for your time. Speak with me again at Palaka's Stand and I'll ensure that you get it."},{"name":"CAPTAIN04259","text":"The work ahead of us is vast, and any lives we can save are precious indeed. All I came across in my patrol was discarded belongings and scattered luggage. Did you find anything else of note?"},{"name":"CAPTAIN04259","text":"Hmm, I recognize this figure. Doubtless you are curious as to what it depicts."},{"name":"CAPTAIN04259","text":"There is a legend that tells of a Manusya goddess who sought the strength of the Mrga, wresting her own head from her body and replacing it with the bestial pate of the Mrga."},{"name":"CAPTAIN04259","text":"In pursuit of wisdom did a Mrga do the same, replacing his own head with that of a Manusya. Thus were born divine beings gifted with both strength and wisdom, heralding an age of untold peace."},{"name":"CAPTAIN04259","text":"One of the refugees must have dropped this in their flight. This figure is a reminder that the most insurmountable hardships can be overcome by looking beyond the bounds of tribe for help."},{"name":"CAPTAIN04259","text":"A figure so fine was likely beloved by its owner. I shall do what I can to see it returned to them. Thank you for your help today, traveler."}],"reward":{"gil":815,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69952]}},"partials":[{"type":"npc","id":"1040669","obj":{"i":1040669,"n":"Radiant Host Captain","l":3709,"q":1}},{"type":"quest","id":"69952","obj":{"i":69952,"n":"Simple Pleasures","g":11,"l":"Thavnair","s":570}}]}