{"quest":{"name":"Flowers for the Family","location":"Thavnair","id":69799,"patch":6.0,"sort":2030,"eventIcon":71221,"issuer":1040857,"target":1040857,"genre":122,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The man is desperately searching for something on the horizon."],"objectives":["Search for the lost girl and have her accompany you.","Obtain the flowers while accompanied by the lost girl.","Rendezvous with the troubled father at Purusa while accompanied by the lost girl.","Place the Mrga flower at the designated location.","Speak with the troubled father."],"dialogue":[{"name":"FATHER04263","text":"Oh, you're the one who saved Mehvan's child! Might you help a father in need? My daughter is nowhere to be found, and I fear she's gone off into the woods by her lonesome."},{"name":"FATHER04263","text":"Others from the village have joined in the search, but our numbers are few. We've yet to even reach Purusa. If you could add your eyes to the search, I would be ever so grateful!"},{"name":"FATHER04263","text":"My daughter was wearing a red coat when last I saw her. I will make my way to Purusa, so please bring her there if you find her. May the gods grant you insight!"},{"name":"DAUGHTER04263","text":"Oh... Who are you?"},{"name":"DAUGHTER04263","text":"My father? Oh, I'm such a fool... I wanted to pick some flowers before visiting Purusa, but I never wanted to cause worry."},{"name":"DAUGHTER04263","text":"Still, since you're already here, could you help me? You can't visit Purusa without one each for the Manusya and the Mrga─let's find those and then we can be on our way."},{"name":"SYSTEM","text":"The lost girl is now accompanying you. Keep her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave the lost girl behind by entering a different area, or by speaking with her and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have the lost girl join you again, return and speak with her at the original location."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Speak with the girl."},{"name":"A1","text":"Part ways with the girl."},{"name":"A1","text":"Nothing."},{"name":"DAUGHTER04263","text":"We can't go to the shrine without something to offer the Manusya and the Mrga─everyone knows that!"},{"name":"Q2","text":"Are you sure you wish to part ways with the lost girl?"},{"name":"DAUGHTER04263","text":"Oh, are you too busy to look for flowers? Well, it may take me a while yet to find them... If you feel like helping again, I'll probably still be here."},{"name":"DAUGHTER04263","text":"Ah, you've returned. Well then, let's find those flowers, yes?"},{"name":"SYSTEM","text":"This must be the flower you are looking for. Return with the lost girl to be sure."},{"name":"SYSTEM","text":"You must be accompanied by the lost girl and have her at your side in order to proceed with quest objectives."},{"name":"DAUGHTER04263","text":"The divine Manusya love these flowers, much like we do."},{"name":"DAUGHTER04263","text":"Mother said that the red petals symbolize life, and remind the divinities of the lifeblood that's the source of their power."},{"name":"DAUGHTER04263","text":"Mother told me these orange flowers are favored by the gods of Mrga."},{"name":"DAUGHTER04263","text":"Doesn't the color of their petals remind you of the rising sun? Its nourishing rays are a source of power for the Mrga, and they cherish these flowers above all others."},{"name":"SYSTEM","text":"The lost girl has yet to arrive. Be sure she is at your side before attempting to continue."},{"name":"FATHER04263","text":"I haven't seen hide nor hair of her. Please tell me you've had better luck?"},{"name":"SYSTEM","text":"The lost girl has yet to arrive. Be sure she is at your side before attempting to continue."},{"name":"FATHER04263","text":"Oh, thank the gods. I'm so glad she's safe."},{"name":"DAUGHTER04263","text":"I apologize for troubling you, but I really want to see Mother again. I couldn't imagine visiting Purusa without these flowers in hand."},{"name":"DAUGHTER04263","text":"If I offer these to the gods, surely they'll allow Mother to return to us... Right?"},{"name":"DAUGHTER04263","text":"Will you come with us? Here, you offer this flower to the Mrga, and I'll offer this one to the Manusya. The gods will be so happy to receive them!"},{"name":"DAUGHTER04263","text":"Let's offer them these flowers together!"},{"name":"FATHER04263","text":"Her mother was taken by one of those unholy beasts..."},{"name":"DAUGHTER04263","text":"Thank you, thank you! I can't wait to see Mother again!"},{"name":"FATHER04263","text":"Yes, yes... Me too. Why don't we return home? We can prepare the soup she liked so much."},{"name":"FATHER04263","text":"Thank you, traveler, for all you've done. Meet me again at the village, and I'll see that you are rewarded for your kindness."},{"name":"FATHER04263","text":"Welcome. My daughter is safe and sound, and in high spirits."},{"name":"FATHER04263","text":"Purusa is said to be a place where we can commune with the spirits of our ancestors. Doubtless she believes that her little expedition will bring her lost mother back..."},{"name":"FATHER04263","text":"Regardless, I will see that she doesn't wander off by herself again. You've proven yourself worthy of your reputation today."}],"reward":{"gil":895},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69952]}},"partials":[{"type":"npc","id":"1040857","obj":{"i":1040857,"n":"Troubled Father","l":3709,"q":1}},{"type":"quest","id":"69952","obj":{"i":69952,"n":"Simple Pleasures","g":11,"l":"Thavnair","s":570}}]}