{"quest":{"name":"Troubled Waters","location":"Mare Lamentorum","id":69791,"patch":6.0,"sort":1950,"eventIcon":71221,"issuer":1037856,"target":1037856,"genre":124,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Something goes bump in Greatest Endsvale, and it has Mopingway concerned."],"objectives":["Inspect the water regulators.","Report to Mopingway."],"dialogue":[{"name":"MOPINGWAY","text":"Oh dear... Oh my, oh dear, this is terrible!"},{"name":"MOPINGWAY","text":"Thank goodness you're here! There's a strange sound coming from the waterway. I think there might be something wrong with the water regulation system."},{"name":"MOPINGWAY","text":"What if the water starts to flow backwards? Or worse! Everything must be inspected from top to bottom, but time is of the essence, and I can't possibly hope to do it all on my own... Not as quickly as I'd like, at any rate. Please say you will help."},{"name":"MOPINGWAY","text":"Oh, thank goodness. Look for the water towers to the north and you'll find the regulators."},{"name":"MOPINGWAY","text":"If you can take care of that, I will see to the rest. We can reconvene here when you've finished."},{"name":"MOPINGWAY","text":"Inspect the water towers to the north and I will see to the rest."},{"name":"SYSTEM","text":"You hear nothing out of the ordinary."},{"name":"SYSTEM","text":"You hear an odd bubbling murmur. This machine seems to be malfunctioning."},{"name":"MOPINGWAY","text":"How did everything look on your side?"},{"name":"MOPINGWAY","text":"A murmur by the northeast regulator? Hmmm... I think I know what the problem is."},{"name":"MOPINGWAY","text":"We released fish into the river so that our guests could go fishing, but they're likely attracted to the heat of the regulators."},{"name":"MOPINGWAY","text":"Not to worry! This is but one little bump on the road to building a fantastic recreational facility, and thanks to you, the path forward can be made smoother."},{"name":"MOPINGWAY","text":"When our work is finished, I hope you'll visit again and make the most of what we have to offer."}],"reward":{"gil":655},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69942]}},"partials":[{"type":"npc","id":"1037856","obj":{"i":1037856,"n":"Mopingway","l":3711,"q":1}},{"type":"quest","id":"69942","obj":{"i":69942,"n":"Setting Things Straight","g":11,"l":"Mare Lamentorum","s":560}}]}