{"quest":{"name":"The Guardian's Shield","location":"Thavnair","id":69792,"patch":6.0,"sort":2001,"eventIcon":71221,"issuer":1039517,"target":1039517,"genre":122,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Viraban is wringing her hands nervously."],"objectives":["Retrieve the worn charm from a hanuman langur.","Deliver the worn charm to Viraban."],"dialogue":[{"name":"VIRABAN","text":"Egads, my knees... My years are catching up to me..."},{"name":"VIRABAN","text":"You there, traveler, might you have some time to spare for an old maid? As I fled from the chaos that erupted, I took a terrible spill and dropped a charm that is very important to me."},{"name":"VIRABAN","text":"And can you believe it? One of those flea-infested hanuman langurs scooped it up off the ground and scurried off into the woods."},{"name":"VIRABAN","text":"Would that I still had my youth─I'd skewer that fiend at the end of my spear! Alas, my vigor isn't what it once was, and I'm still aching from that fall besides..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You'll have your charm back, don't worry."},{"name":"A1","text":"You should get your wounds treated first."},{"name":"VIRABAN","text":"Really? You'd do that for me?"},{"name":"VIRABAN","text":"If I wait for my wounds to heal, who knows where that monster will get to. I must have that charm back. Please, will you lend me your stout arm?"},{"name":"VIRABAN","text":"The animal ran off toward the Font of Maya. Fell it quickly and return my charm to me, please. How else am I to defend myself from fate's cruel machinations?"},{"name":"VIRABAN","text":"Go to the Font of Maya and retrieve my charm. Please be quick─I can already feel my luck souring."},{"name":"VIRABAN","text":"You are returned at last, and none too soon─I feel that something terrible is soon to happen. Were you able to slay that monster?"},{"name":"VIRABAN","text":"Yes, this is it! This is it! I can already feel my vitality returning, such as it is. Death shall have to wait for many years yet! Thank you, traveler."},{"name":"VIRABAN","text":"I received this charm in my youth, when I was handed my spear and deemed a warrior true. It was passed down through our order, and I keep it still to remember my halcyon days."},{"name":"VIRABAN","text":"Although my fighting days are long behind me, I would be happy to impart some small measure of my knowledge to the stewards of the future. In time, I shall give this charm away, just as it was given to me."},{"name":"VIRABAN","text":"When I relinquish it, I shall tell its recipient of your bravery this day, that your deeds might echo into the future. Please, take this as a reward. It's the least I can give."}],"reward":{"gil":735,"items":[{"num":2,"id":36044}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69952]}},"partials":[{"type":"npc","id":"1039517","obj":{"i":1039517,"n":"Viraban","l":3709,"q":1}},{"type":"item","id":"36044","obj":{"i":36044,"n":"Wine-dark Soup","l":533,"c":24123,"t":46}},{"type":"quest","id":"69952","obj":{"i":69952,"n":"Simple Pleasures","g":11,"l":"Thavnair","s":570}}]}