{"quest":{"name":"Quick Heels","location":"Thavnair","id":69794,"patch":6.0,"sort":2060,"eventIcon":71221,"issuer":1037707,"target":1037707,"genre":122,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Utpala would help the healers do their duty."],"objectives":["Speak with the Palaka healer.","Rendezvous with the healer's assistant. ","Pick up the crate of medicine.","Deliver the crate of medicine to the Palaka healer.","Report to Utpala."],"dialogue":[{"name":"UTPALA","text":"Might you have a few moments to spare? Our healers are overwhelmed with the number of injured and sick, and even a single pair of hands will go a long way toward easing their burden."},{"name":"UTPALA","text":"Some of their duties require them to venture into the jungle─a dangerous prospect at the best of times, but a death sentence under current conditions. Perhaps you could lend them your aid?"},{"name":"UTPALA","text":"If you would offer your capable arm to their aid, please do so─they will be all too glad to accept it, I'm sure."},{"name":"UTPALA","text":"The healers are doing their best to administer to the sick and wounded, but they are stretched to their breaking point. Offer your aid and I'm sure they'll put you to work straightaway."},{"name":"DOCTOR04258","text":"What? You're here to help? Of course, I am glad for any assistance afforded to me. I have just the task for one such as you, in fact."},{"name":"DOCTOR04258","text":"In troubled times such as these, it is ever the medicine which first runs dry. I've sent an assistant to procure a resupply from the Great Work, but apparently she's run into a bit of trouble on her way back."},{"name":"DOCTOR04258","text":"It seems something is preventing her from completing the delivery, although she was scarce on the details. Unfortunately, circumstances being what they are, we haven't been able to spare a single person to send to her aid."},{"name":"DOCTOR04258","text":"Until now, that is! Travel to the Wakeful Torana, where my assistant awaits, and see if you can't solve this little conundrum she's encountered."},{"name":"DOCTOR04258","text":"She is stuck near the Wakeful Torana for some reason that yet eludes me. Please, go there and see if you can't get that medicine into the right hands."},{"name":"ASSISTANT04258","text":"Are you here to help? Thank the gods. Apologies for the imposition, but I just can't carry these supplies any further. I'm afraid my constitution doesn't allow for such strenuous labor."},{"name":"ASSISTANT04258","text":"You look to have a stout pair of legs under you─could you deliver the medicine in my stead? I must rest... Yes, just a bit of a lie down."},{"name":"ASSISTANT04258","text":"It's all in this crate here. Please hurry─the people of Palaka's Stand are in dire need. Would that I had more strength to give..."},{"name":"SYSTEM","text":"Deliver the medicine crate to the healer awaiting you at Palaka's Stand."},{"name":"SYSTEM","text":"You will have four minutes to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"SYSTEM","text":"Be wary of attacks from enemies, which will sap your strength."},{"name":"ASSISTANT04258","text":"Please, hurry. The sooner the medicine is delivered, the sooner the sick and wounded can be treated."},{"name":"DOCTOR04258","text":"Oh, you're back. The medicine appears nowhere to be seen, however..."},{"name":"DOCTOR04258","text":"Thank you for picking up the slack, so to speak. I must remember that not all of my assistants are fit for such demanding labor."},{"name":"DOCTOR04258","text":"I will administer this medicine to those in need as soon as I can. It was Utpala who entreated you to help me, yes? Pray inform her that all is well, and give her my gratitude."},{"name":"DOCTOR04258","text":"It was Utpala who entreated you to help me, yes? Pray inform her that all is well, and give her my gratitude."},{"name":"UTPALA","text":"You've been out for quite a while. I trust the healer has kept you busy?"},{"name":"UTPALA","text":"Oh, she knows who I am!? Well...all I did was pass information along. But if she sends her thanks, then who am I to deny them?"},{"name":"UTPALA","text":"The healers have barely had a wink of sleep as of late. I'm no fighter, nor do I have a mind for healing, but I'm happy to help where I can. Here, take this for your kind service."}],"reward":{"gil":895},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69953]}},"partials":[{"type":"npc","id":"1037707","obj":{"i":1037707,"n":"Utpala","l":3709,"q":1}},{"type":"quest","id":"69953","obj":{"i":69953,"n":"Under His Wing","g":11,"l":"Thavnair","s":571}}]}