{"quest":{"name":"Overexcited Admirer","location":"Mare Lamentorum","id":69790,"patch":6.0,"sort":1940,"eventIcon":71221,"issuer":1041826,"target":1041826,"genre":124,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Something has ruffled the fur of this Loporrit."],"objectives":["Speak with the agitated Loporrit.","Defeat a lunatender and obtain a crystal flower.","Deliver the crystal flower to the agitated Loporrit.","Speak with the agitated Loporrit."],"dialogue":[{"name":"LOPORRIT04254","text":"Pardon me! Could you spare a moment?"},{"name":"LOPORRIT04254","text":"A friend and I planned to go and meet you shortly after we woke from hibernation, you see. But they're the excitable sort, and well... After much shouting and hopping, they somehow ran themself straight into a wall. They're yet to awake."},{"name":"LOPORRIT04254","text":"On one paw, I understand their enthusiasm─we were all ecstatic that our very first visitors had arrived from Etheirys. On the other...they ran into a <span class=\"emphasis\">wall</span>."},{"name":"LOPORRIT04254","text":"Still, I do feel bad for them, so I want to get them a surprise. Something to cheer them up when they wake. I dare not venture out alone, though, so I was hoping you would come with me!"},{"name":"LOPORRIT04254","text":"Meet me in southern Mare Lamentorum, and we'll see if we can't find something nice."},{"name":"LOPORRIT04254","text":"We saw flowers here once when out on patrol. Gorgeous, crystalline flowers that grow on the heads of lunatenders..."},{"name":"LOPORRIT04254","text":"If you were to gift them one when they awake, they'd be over the star! Er...that's “over the moon,” in your parlance."},{"name":"LOPORRIT04254","text":"I have to go and deliver our patrol records for Moonsail to the Watcher's Palace, but in the meantime, can I trust you to get a flower from one of the lunatenders?"},{"name":"LOPORRIT04254","text":"Perfect! Meet me up by the Striking Brand when you have it."},{"name":"LOPORRIT04254","text":"Were you able to get a flower?"},{"name":"LOPORRIT04254","text":"Oh, it's beautiful! They've wanted one of these ever since they learned how special flowers are in your culture."},{"name":"LOPORRIT04254","text":"Now that I think about it, if they were to receive it from you personally, they might run themself into a wall again...or worse."},{"name":"LOPORRIT04254","text":"I think I had better give it to them─with your regards, of course. I'll meet you back at the burrow!"},{"name":"LOPORRIT04254","text":"As it happens, it's a good thing that you didn't go with me to give them that flower. Just hearing it was from you nearly made them faint dead away! Perhaps I should have waited a bit longer after they woke up..."},{"name":"LOPORRIT04254","text":"In any case, I hope you'll visit us again! If we can ever break their cycle of excitement and self-injury, I'm sure they'd be delighted to meet you."}],"reward":{"gil":815},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69942]}},"partials":[{"type":"npc","id":"1041826","obj":{"i":1041826,"n":"Agitated Loporrit","l":3711,"q":1}},{"type":"quest","id":"69942","obj":{"i":69942,"n":"Setting Things Straight","g":11,"l":"Mare Lamentorum","s":560}}]}