{"quest":{"name":"Curry for the Watch","location":"Thavnair","id":69797,"patch":6.0,"sort":2120,"eventIcon":71221,"issuer":1037627,"target":1037627,"genre":122,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Jubkhal has a pair of metal containers in his hands, and they appear to be piping hot."],"objectives":["Deliver the metal containers to the lookouts.","Speak with Jubkhal."],"dialogue":[{"name":"JUBKHAL","text":"You're the traveler who rescued the child of Mehvan and Qerasaf, yes? Do you have a moment to spare for the brave souls that watch over our village?"},{"name":"JUBKHAL","text":"With the Radiant Host shorthanded, the courageous among us have volunteered to climb those treacherous cliffs and keep lookout for any approaching beasts."},{"name":"JUBKHAL","text":"I would make their long days easier with a home-cooked meal, but I cannot reach the summit on my own. Every mount that might carry me there is otherwise indisposed, but I don't believe that will prove a problem to one so resourceful as you. "},{"name":"JUBKHAL","text":"If you would be so kind, please deliver these meals to the lookouts at the summit. I'll pay you for your troubles, if that will help speed things along."},{"name":"JUBKHAL","text":"Sheer mountain cliffs are no obstacle to one such as you, I'm sure. Please deliver these meals to the lookouts above─doubtless they're hungry by now."},{"name":"LOOKOUTA04261","text":"That smell's set my stomach rumblin' something fierce. Pray tell me you've brought enough to share."},{"name":"LOOKOUTA04261","text":"It's <span class=\"emphasis\">all</span> for me!? Why, thank you! I was beginning to dread the rest of my watch. There's nothin' like a spiced curry to keep hunger away. "},{"name":"LOOKOUTA04261","text":"Hmm, I've never seen a container quite like this before. Not a drop of curry was spilled in your flight, and it's still pipin' hot! Thank you, friend!"},{"name":"LOOKOUTA04261","text":"There's nothin' like a curry to get you through an uneventful watch. Thanks for bringin' it all this way, friend!"},{"name":"LOOKOUTB04261","text":"The sounds of my stomach would drown out the alarum... Say, you didn't bring anything to eat, did you?"},{"name":"LOOKOUTB04261","text":"Ah, I knew I recognized that heavenly scent! Spices to fortify the spirits and tea to sharpen the senses. This will tide me over until my replacement arrives."},{"name":"LOOKOUTB04261","text":"Thanks to you, the rest of my watch should go by in a flash. I'll toast to your generosity when I'm done!"},{"name":"JUBKHAL","text":"I can see you've delivered the meals. If you had eaten them, I would be able to smell your guilt. I am grateful, as I'm sure the lookouts are as well."},{"name":"JUBKHAL","text":"Long ago we would post soldiers upon those cliffs, that we might see invaders approaching by sea. To think something much worse would eventually cross the ocean..."},{"name":"JUBKHAL","text":"Regardless, we are blessed that nature has provided us a way to watch for danger. I hope to keep our lookouts fed for as long as I can."}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"questsType":"all","quests":[69953,69800]}},"partials":[{"type":"npc","id":"1037627","obj":{"i":1037627,"n":"Jubkhal","l":3709,"q":1}},{"type":"quest","id":"69953","obj":{"i":69953,"n":"Under His Wing","g":11,"l":"Thavnair","s":571}},{"type":"quest","id":"69800","obj":{"i":69800,"n":"My Father My Fisher","g":122,"l":"Thavnair","s":2040}}]}