{"quest":{"name":"Treasure Hunters","location":"Thavnair","id":69796,"patch":6.0,"sort":2110,"eventIcon":71221,"issuer":1040851,"target":1040851,"genre":122,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The Auri dancer is squinting his eyes at a parchment in his hands. "],"objectives":["Speak with the Auri dancer.","Search for the object hinted at in the mysterious parchment.","Speak with the Auri dancer.","Speak with the Auri dancer again."],"dialogue":[{"name":"DANCER04260","text":"Say, how are you at solving riddles? I've been staring at this parchment for bells, and all I've achieved is a terrible headache. If you could spare a moment, might you take a look?"},{"name":"DANCER04260","text":"These words were written by a kindly old Arkasodara who helped me flee from the beasts. Unfortunately, he was struck in our escape, and the healers were unable to save him."},{"name":"DANCER04260","text":"For the compassion he showed me, I would like nothing more than to unravel the meaning of his message. Alas, I fear it's quite beyond me..."},{"name":"DANCER04260","text":"(-Mysterious Parchment-)<span class=\"emphasis\">As the waning sun casts light upon the stone trunk,<br>At its end you shall find a treasure most profound.<br>Wrest the key from crossed hands and open the way to riches.</span>"},{"name":"DANCER04260","text":"Now, I know most of these words, but in this order they seem to lose all meaning. I'm having particular trouble with the phrase “stone trunk.” What could it be referring to?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Does he write of the Matanga?"},{"name":"A1","text":"Some statue with a prodigious nose?"},{"name":"A1","text":"My head is beginning to hurt as well..."},{"name":"DANCER04260","text":"Ah, indeed. When you put it that way, the link becomes quite clear! And the sun would look quite striking near the Font of Maya, where indeed such a statue towers over its surroundings!"},{"name":"DANCER04260","text":"If a famed hero can't even figure it out, I fear for our prospects... Perhaps we should focus on one word at a time... Stone...stone... Trunk...trunk... Ah, I know! Could it be the statue that towers over the Font of Maya?"},{"name":"DANCER04260","text":"That must be it. It's worth a look, at any rate. I think I'll go there now, in fact. Are you coming along? Surely you'd like to know if we've cracked this riddle."},{"name":"DANCER04260","text":"Good, good! It's always better to have a companion at your side. Well then, let's make haste to the Font of Maya─first one there gets pick of the treasure!"},{"name":"DANCER04260","text":"There you are! Just so you know, I was joking about that “first pick of the treasure” thing. We shall be equal partners, yes? Now, looking at the parchment, there are two locations we should investigate."},{"name":"DANCER04260","text":"The treasure this trunk is supposed to lead us toward, and the hand which holds the key. For expediency's sake, I say we split up."},{"name":"DANCER04260","text":"If this key is located where I think it is, it may be difficult to find without some method of traversing the air. You <span class=\"emphasis\">do</span> appear to be quite strapping, however. Either way, you can choose which one you'd like to investigate."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'll search for the treasure most profound."},{"name":"A1","text":"I think I'll retrieve the key from crossed hands, whatever those are."},{"name":"DANCER04260","text":"Excellent choice! Well then, I'll leave the parchment with you. I've read it so many times, I've quite memorized it."},{"name":"DANCER04260","text":"If you become lost in the maze of your own thoughts, simply consult it and it <span class=\"emphasis\">should</span> set you on the right path. Let's commence the hunt, shall we?"},{"name":"SYSTEM","text":"(-Mysterious Parchment-)<span class=\"emphasis\">As the waning sun casts light upon the stone trunk,<br>At its end you shall find a treasure most profound.<br>Wrest the key from crossed hands and open the way to riches.</span>"},{"name":"SYSTEM","text":"Search for the “treasure most profound.”"},{"name":"SYSTEM","text":"Search for the “crossed hands” and wrest the key from them."},{"name":"DANCER04260","text":"Perfect timing! I've just completed my task. I assume you've done the same?"},{"name":"DANCER04260","text":"You truly have the spirit of a treasure hunter. I know we're both burning with curiosity, but let's wait to open this box until we return to Palaka's Stand. Mysteries can so rarely be savored!"},{"name":"DANCER04260","text":"Finally, you've arrived! Now, the key goes into the lock..."},{"name":"DANCER04260","text":"Curious. This jewel appears quite ancient. Judging from the symbols etched into it, it once belonged to an Arkasodara practitioner of magic."},{"name":"DANCER04260","text":"Not surprising, I suppose. The place we found it was once used by their mages for various rituals and such."},{"name":"DANCER04260","text":"They moved deeper into the jungle during recent years, but my savior likely knew of the temple's history. This may have been his way of thanking me for rescuing him, although my efforts were for naught."},{"name":"DANCER04260","text":"I feel ill deserving of such a prize. I shall use this to help the refugees, to rebuild their shattered homes. As for you, well, I did promise you a share, yes? Not exactly half, but I hope it pleases."}],"reward":{"gil":815},"reqs":{"jobs":[{"lvl":80,"id":34}],"questsType":"all","quests":[69953,69800]}},"partials":[{"type":"npc","id":"1040851","obj":{"i":1040851,"n":"Auri Dancer","l":3709,"q":1}},{"type":"quest","id":"69953","obj":{"i":69953,"n":"Under His Wing","g":11,"l":"Thavnair","s":571}},{"type":"quest","id":"69800","obj":{"i":69800,"n":"My Father My Fisher","g":122,"l":"Thavnair","s":2040}}]}