{"quest":{"name":"In Agama's Footsteps","location":"Thavnair","id":69793,"patch":6.0,"sort":2010,"unlocksFunction":1,"eventIcon":71341,"issuer":1040864,"target":1040864,"genre":122,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The weary Radiant seeks someone willing to brave the wilderness."],"objectives":["Search for refugees near Agama Temple.","Protect the unfortunate straggler and guide him to the entrance of Palaka's Stand.","Speak with the weary Radiant."],"dialogue":[{"name":"SOLDIER04257","text":"Ah, what luck. You look capable of braving the jungles unscathed. Would you help me search for a group of refugees I became separated from?"},{"name":"SOLDIER04257","text":"As the chaos unfolded around us, I fled in the direction of Agama Temple along with a few others. There, one of those terrible beasts fell upon us, and I lost track of my group in the chaos."},{"name":"SOLDIER04257","text":"While I was able to make my way here, none of the others have, and I worry for their safety. I would like nothing more than to search myself, but all hands are required to defend this place."},{"name":"SOLDIER04257","text":"Agama Temple is to the west. Please, journey there and guide anyone you can find back here. I only hope that some managed to survive the madness."},{"name":"SOLDIER04257","text":"We were hiding near Agama Temple, to the west. If you find anyone alive, please guide them here so they can be better protected. May the gods watch over you."},{"name":"RESIDENTS04257","text":"Who...who are you? Are you here to save me?"},{"name":"RESIDENTS04257","text":"Of course, I knew she wouldn't forget about us! The beast prowled the area for some time, but I managed to find refuge among these rocks."},{"name":"RESIDENTS04257","text":"However, I've been too frightened to set foot from their shelter for fear of drawing the attention of some hungry animal. But with you here, I believe I can find the courage. Will you accompany me to Palaka's Stand?"},{"name":"RESIDENTS04257","text":"Thank you! Now, let us tread carefully."},{"name":"SYSTEM","text":"Escort the unfortunate straggler safely to Palaka's Stand. Should you fail to defend him, or move too far away, he will return to the vicinity of Agama Temple, where you may rendezvous with him before trying again."},{"name":"BALLOON","text":"As if the jungle wasn't dangerous enough already..."},{"name":"BALLOON","text":"No... You were supposed to be..."},{"name":"RESIDENTS04257","text":"We're going to Palaka's Stand, yes? Lead the way!"},{"name":"SYSTEM","text":"You have failed to successfully escort the unfortunate straggler to Palaka's Stand. Return to the vicinity of Agama Temple and speak with him to begin once more."},{"name":"SYSTEM","text":"You have lost sight of the unfortunate straggler. Retrace your steps to find them, then escort them safely to Palaka's Stand."},{"name":"RESIDENTS04257","text":"I don't know how to thank you! You've saved my life!"},{"name":"RESIDENTS04257","text":"Please tell that brave woman from the Radiant Host that I've arrived safe and sound. I must think of a way to repay your bravery."},{"name":"SOLDIER04257","text":"I watched your arrival. I recognized that man from the group I was with, and I am overjoyed to see him safe."},{"name":"SOLDIER04257","text":"Thank you for escorting him here. Truly you are worthy of the reputation you've earned─I daresay even Agama would be awed by your bravery."},{"name":"SOLDIER04257","text":"He was a storied mendicant of the Arkasodara. When the Hyurs landed ashore this island and war broke out, he spared no effort to save the lives of all who were injured in the conflict. He saw no tribes, only those in need."},{"name":"SOLDIER04257","text":"He is not so different from you, who throws <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> into the maw of danger to save someone they've never met. If Agama's spirit lives on today, it is through your selfless deeds!"},{"name":"SOLDIER04257","text":"Take this as a reward, although I have no doubt you would deny it if I let you. Once my watch has ended, I shall patrol the woods in search of any more hiding amongst the trees."}],"reward":{"gil":815,"aetherCurrent":1,"items":[{"num":2,"id":36051}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69952]}},"partials":[{"type":"npc","id":"1040864","obj":{"i":1040864,"n":"Weary Radiant","l":3709,"q":1}},{"type":"item","id":"36051","obj":{"i":36051,"n":"Lentil Curry","l":539,"c":24035,"t":46}},{"type":"quest","id":"69952","obj":{"i":69952,"n":"Simple Pleasures","g":11,"l":"Thavnair","s":570}}]}