{"quest":{"name":"A Gift of Flowers","location":"Radz-at-Han","id":69806,"patch":6.0,"sort":2150,"eventIcon":71221,"issuer":1037469,"target":1037469,"genre":120,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mihreen is humming a little tune."],"objectives":["Speak with the Auri boy.","Choose a flower, then speak with the Auri boy once more.","Speak with Mihreen."],"dialogue":[{"name":"MIHREEN","text":"Wait...could it be? Yes...you're one of the heroes that helped fend off the beasts for us! Oh, what an honor it is to actually speak with you!"},{"name":"MIHREEN","text":"Do you remember me? Perhaps not, but I was one of those you saved from the ravening horde. I cannot begin to express my gratitude."},{"name":"MIHREEN","text":"You'll be happy to know that the little ones you helped to rescue are safe as well. So enamored are they with you and your friends that they've decided to put together a few gifts for you. Might you take the time to visit them over on Paksa's Path? They'd be even more thrilled to meet you than I!"},{"name":"MIHREEN","text":"Those children over on Paksa's Path have been chattering on about you and your friends ever since the battle. I'm happy that they're enjoying themselves, even though they seem to have forgotten the time..."},{"name":"LAZAHANAURAGIRL","text":"You look lost, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>."},{"name":"LAZAHANAURABOY","text":"Pssst, Mihreen told us not to talk to strangers!"},{"name":"LAZAHANAURABOY","text":"...Really? Well, I'm Miss Y'shtola's friend, too! She saw I was in trouble and fought off monsters with her magic, just to protect me! She's the most powerful mage in the whole wide world! "},{"name":"LAZAHANAURAGIRL","text":"Nu-uh! Mister Thancred is the best! He's strong and brave and gentle! I was so scared, but he saved me and carried me all the way back to my mama! Just like a princess!"},{"name":"LAZAHANAURABOY","text":"Fine, they're <span class=\"emphasis\">both</span> the best.<br>...Wait, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>, maybe you can help us! Do you think you could pick out what kind of flowers they like?"},{"name":"LAZAHANAURABOY","text":"We're making flower crowns! We want them to be really, really happy here and stay for a while. Will you help us? Pretty please?"},{"name":"LAZAHANAURABOY","text":"I'm gonna make a crown fit for a queen! So pick one that will make her look even more powerful!"},{"name":"LAZAHANAURAGIRL","text":"Pick a flower that matches his dashing white coat! And his gentle eyes! And his strong arms!"},{"name":"Q1","text":"What will you choose?"},{"name":"A1","text":"The vibrancy of the petals reminds you of Y'shtola's ardent determination."},{"name":"A1","text":"The red hue reminds you of the aetherspark when Thancred pulls the trigger."},{"name":"A1","text":"It doesn't seem to suit either of them."},{"name":"SYSTEM","text":"You choose a flower that seems to suit Y'shtola."},{"name":"SYSTEM","text":"You choose a flower that seems to suit Thancred."},{"name":"SYSTEM","text":"You've already chosen this flower. Take a look at the others for good measure?"},{"name":"Q4","text":"Choose this flower instead?"},{"name":"LAZAHANAURAGIRL","text":"Still haven't decided? We want to finish the crowns before supper!"},{"name":"LAZAHANAURABOY","text":"Well, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>? Did you find flowers suitable for Miss Y'shtola?"},{"name":"SYSTEM","text":"You've yet to choose flowers for both Y'shtola and Thancred. Examine the flowerpots and decide which blossoms would best suit your friends."},{"name":"LAZAHANAURABOY","text":"I liked the bright red color, too! It's like a warning to the beasts that she's not to be trifled with!"},{"name":"LAZAHANAURABOY","text":"This pink color is perfect! It will look good with her pretty black dress!"},{"name":"LAZAHANAURABOY","text":"This one smells so pretty! It reminds me of the pretty smell when she came to our rescue with her magic!"},{"name":"LAZAHANAURAGIRL","text":"My turn! My turn! Which flower did you pick for Mister Thancred?"},{"name":"LAZAHANAURAGIRL","text":"The little red flower? Why, it reminds me of the flash of his blade when he drove the monsters away! Bam, bam, bam! Like fireworks at a festival!"},{"name":"LAZAHANAURAGIRL","text":"You chose the pink one! I think that would look nice on him, too! It's like what princes wear in Mama's stories!"},{"name":"LAZAHANAURAGIRL","text":"You chose the one that smells pretty! Yes, the color and scent are so grown-up! I'm sure it'll suit a gentleman like him."},{"name":"LAZAHANAURABOY","text":"Thank you so much, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>! We're going to have so much fun making crowns for them!"},{"name":"LAZAHANAURAGIRL","text":"There's lots to do, so we will see you around! ...Oh! Can you tell Mihreen that we'll be a little late? We were supposed to be back a bell ago."},{"name":"MIHREEN","text":"...You don't say? It sounds as if you were of great help to the children. To think that such a hero would be so kind as to assist in our daily affairs."},{"name":"MIHREEN","text":"I cannot bear to think what would have happened to them were you not there to save them. Because of you, they have been given another chance at life."},{"name":"MIHREEN","text":"Flowers may be a small token, but this really means a lot to them. I am sure your friends will understand that. And this is from me, to thank you for all you have done."}],"reward":{"gil":895,"items":[{"id":16616,"one":1},{"id":16617,"one":1},{"id":16618,"one":1},{"id":16620,"one":1},{"id":16621,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69954]}},"partials":[{"type":"npc","id":"1037469","obj":{"i":1037469,"n":"Mihreen","l":3707,"q":1}},{"type":"item","id":"16616","obj":{"i":16616,"n":"Red Viola Corsage","l":1,"c":54235,"t":34}},{"type":"item","id":"16617","obj":{"i":16617,"n":"Blue Viola Corsage","l":1,"c":54236,"t":34}},{"type":"item","id":"16618","obj":{"i":16618,"n":"Yellow Viola Corsage","l":1,"c":54237,"t":34}},{"type":"item","id":"16620","obj":{"i":16620,"n":"Orange Viola Corsage","l":1,"c":54239,"t":34}},{"type":"item","id":"16621","obj":{"i":16621,"n":"Purple Viola Corsage","l":1,"c":54240,"t":34}},{"type":"quest","id":"69954","obj":{"i":69954,"n":"At World's End","g":11,"l":"Radz-at-Han","s":572}}]}