{"quest":{"name":"Dreams of Venom","location":"Thavnair","id":69803,"patch":6.0,"sort":2100,"eventIcon":71221,"issuer":1040649,"target":1040649,"genre":122,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The seasoned hunter seeks a seasoned partner."],"objectives":["Speak with the seasoned hunter.","Use the sack to gather the sleeping bhujamga and slay any enemies that appear.","Deliver the captured bhujamga and the slain bhujamga to the seasoned hunter.","Speak with the seasoned hunter at Palaka's Stand."],"dialogue":[{"name":"HUNTER04267","text":"Hmm. The stories paint you as ferocity incarnate, and by the sight of you I don't reckon they're too far from the truth. You mind lendin' me an onze of that ferocity to catch some prey?"},{"name":"HUNTER04267","text":"The healers from the village have tasked me with huntin' down a beast possessin' a right deadly venom. I'm at a loss as how to go about it─but with two strappin' hunters, I'm sure we'll find a way. So, are you with me?"},{"name":"HUNTER04267","text":"I look forward to seein' what you can do! Well then, our mark is to the north. I trust you'll keep up with me."},{"name":"HUNTER04267","text":"You came. Good. I thought there was a slim possibility you'd lose heart and slink off, but I'm glad to be proven wrong."},{"name":"HUNTER04267","text":"I've set up three traps around the perimeter. Pieces of fresh meat mixed with medicine that'll dull the senses of any beast greedy enough to eat them. If they worked like I think they should, all you should have to do is scoop the bhujamga up in this sack."},{"name":"HUNTER04267","text":"Now, animals aren't known for sharin', so there's a chance one might try to take our prize. If one does, slay it and bring it to me. I'm sure I'll think of a way to use it."},{"name":"HUNTER04267","text":"I think I can leave the rest in your hands. I'm off to hunt a different prey─one with too many legs and an altogether unpleasant disposition. When we're both done with our tasks, let's meet back here. Best of luck."},{"name":"HUNTER04267","text":"You've got a healthy look about you─I take it that means you avoided any run-ins with the venom, eh? Let me see what you caught."},{"name":"HUNTER04267","text":"...By the Twelve! You managed to <span class=\"emphasis\">kill</span> one!? It takes three of us days of plannin' to achieve such a feat, yet you did it with nary a bead of sweat on your brow. The stories were true, indeed!"},{"name":"HUNTER04267","text":"I'll take this to the healers straightaway. Find me again in the village and you'll have your well-deserved reward."},{"name":"HUNTER04267","text":"It's good to see you returned, friend. The healers were impressed with our work, but I made sure they knew it was <span class=\"emphasis\">you</span> who single-handedly slew that bhujamga."},{"name":"HUNTER04267","text":"The healers use their venom to make a salve that numbs the skin─useful for when they need to cut the rot out or administer some other ghastly treatment. Anyroad, good work today─may the hunt be prosperous!"}],"reward":{"gil":815},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69953]}},"partials":[{"type":"npc","id":"1040649","obj":{"i":1040649,"n":"Seasoned Hunter","l":3709,"q":1}},{"type":"quest","id":"69953","obj":{"i":69953,"n":"Under His Wing","g":11,"l":"Thavnair","s":571}}]}