{"quest":{"name":"Tidings from Afar","location":"Radz-at-Han","id":69807,"patch":6.0,"sort":2160,"eventIcon":71221,"issuer":1041155,"target":1041155,"genre":120,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The anxious adventurer is fumbling with letters bearing the Ul'dahn seal."],"objectives":["Deliver the letters.","Speak with the anxious adventurer."],"dialogue":[{"name":"INTROUBLEADVENTURER","text":"Praise the Twelve, another adventurer! I've been wandering around this godsdamned city for hours!"},{"name":"INTROUBLEADVENTURER","text":"I was hired for some <span class=\"emphasis\">simple</span> express deliveries in Ul'dah before realizing the destination was...bloody Radz-at-Han. Simple, my arse. After coming all this way, I still don't know where I'm supposed to go!"},{"name":"INTROUBLEADVENTURER","text":"I'm at my wit's end and running out of time! These letters have a tight deadline and if I don't deliver them, I won't merely lose my job─I'll lose my head!"},{"name":"INTROUBLEADVENTURER","text":"Could I ask you to take these two missives to the High Crucible and House Balyk, respectively? I can manage the third one on my own. Return and meet me here when the job's done, and I'll see you're duly compensated for your efforts."},{"name":"ISU","text":"Welcome to the High Crucible of Al-Kimiya, friend! How might I be of service?"},{"name":"ISU","text":"What's that? You've a letter addressed to us? Why, this is from Master Jalzahn! Last I heard, he was doing field research in Eorzea. I do hope all's well..."},{"name":"ISU","text":"...Why, I can scarce believe it! Word of our plight reached him from across the sea, and he's arranged for a shipment of vital supplies to be shipped from Rowena's House of Splendors!"},{"name":"ISU","text":"That he would be thinking of us in these trying times, even as he doubtless is facing his own fair share of hardships. Truly, he is a great man. But forgive me...I must make arrangements to have the shipment picked up in Yedlihmad at once!"},{"name":"ISU","text":"Master Jalzahn is truly our savior, and a paragon for alchemists everywhere. I cannot thank you enough for delivering his message to us."},{"name":"BARIKSISTER","text":"What business have you with the esteemed House Balyk?"},{"name":"BARIKSISTER","text":"An urgent letter? Let me see... Why, it's from dear Ardashir! At least we now know he is not out begging on the streets!"},{"name":"BARIKSISTER","text":"Ardashir is the youngest son of our House. Father was upset he forsook blood and nation to tinker with soot-stained alembics, and thus he never wrote."},{"name":"BARIKSISTER","text":"He never even told us how we might contact him, so we've naturally been worried sick. Now he writes...that he's found a new trading associate for Father? Some merchant named Rowena. He says she can help us in our plight."},{"name":"BARIKSISTER","text":"What a peculiar topic for him to write about. He was always so recalcitrant about the family business. Perhaps he is homesick and trying to make amends?"},{"name":"BARIKSISTER","text":"Nevertheless, we are delighted to hear from him. It is true that our country is in a precarious position. But I am elated to know my brother is safe and happy in Eorzea."},{"name":"BARIKSISTER","text":"Thank you for delivering this letter. I will share it with my sisters at once."},{"name":"INTROUBLEADVENTURER","text":"&lt;huff&gt; &lt;huff&gt; ...Just delivered the last one!"},{"name":"INTROUBLEADVENTURER","text":"I've heard horrible rumors of Rowena's punishments if you fail your task. Like scrubbing grime from warehouse tiles with a paintbrush! In plate! You really saved my skin, friend!"},{"name":"INTROUBLEADVENTURER","text":"I wanted to become an adventurer so badly, and she tempted me with this beautiful set of armor. Said I could put it on credit and work off my debt."},{"name":"INTROUBLEADVENTURER","text":"Before I knew it, I found myself playing errand girl to the House of Splendors! Oh, I don't fault her for it─an adventurer needs armor, after all. But my word if she isn't a shrewd one!"},{"name":"INTROUBLEADVENTURER","text":"Anyroad, thank you for your help. Here, I'll give you half of the House's commission for the job. Take it, you've earned it!"}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69954]}},"partials":[{"type":"npc","id":"1041155","obj":{"i":1041155,"n":"Anxious Adventurer","l":3707,"q":1}},{"type":"quest","id":"69954","obj":{"i":69954,"n":"At World's End","g":11,"l":"Radz-at-Han","s":572}}]}