{"quest":{"name":"My Father My Fisher","location":"Thavnair","id":69800,"patch":6.0,"sort":2040,"eventIcon":71221,"issuer":1040647,"target":1040647,"genre":122,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The fretful Arkasodara seeks someone to brave the wilderness."],"objectives":["Search for the wizened Arkasodara to the north of Palaka's Stand.","Speak with the wizened Arkasodara.","Collect the fish.","Deliver the fish to the wizened Arkasodara.","Speak with the fretful Arkasodara."],"dialogue":[{"name":"RESIDENTSA04264","text":"I've heard about all the good you've done for our village, and we're all thankful for it. I hate to impose upon your generosity further, but if you have a moment to spare, could you lend me your stout arm?"},{"name":"RESIDENTSA04264","text":"I would ask you to search for my father. I haven't seen him for bells, and after asking around it seems he may have left the village and ventured north."},{"name":"RESIDENTSA04264","text":"The divinities only know why he went alone, but if I were to follow him I'd likely end up at the bottom of some beast's belly within a malm. Please, find him and return him safely to our home."},{"name":"RESIDENTSA04264","text":"Please, bring my father back. He's even less of a fighter than I am!"},{"name":"RESIDENTSB04264","text":"Oh, thank the heavens! I had resigned myself to becoming food for those dreadful things!"},{"name":"RESIDENTSB04264","text":"What's that? My daughter sent you to find me? I thought no one saw me leave the village, but I suppose I am not so sly as I thought. And now I've caused her, and you, no end of worry."},{"name":"RESIDENTSB04264","text":"The number of people fleeing to our village increases by the day, and although I would never begrudge them protection, it does put a strain on our food supplies. I took up my old fishing equipment hoping I could make some small contribution."},{"name":"RESIDENTSB04264","text":"Children need hearty meals to grow, after all. Filling our stores is the least I can do to ease us through these troubled times. Think you could help this old fool on his errand?"},{"name":"RESIDENTSB04264","text":"Your generosity is much appreciated. I've already set up several cages near the water. All you have to do is check them and bring me anything they've caught."},{"name":"RESIDENTSB04264","text":"I've set up cages around the river. See if they've caught anything, and if so, bring it here."},{"name":"RESIDENTSB04264","text":"I trust the river wasn't too cold for you. So, what'd you find? I hope my fishing skills haven't gone rusty in my old age."},{"name":"RESIDENTSB04264","text":"Ah, that's what I like to see. Plump and juicy, just what we need. This'll keep the refugees fed for another day, I reckon."},{"name":"RESIDENTSB04264","text":"And that's how we have to get through this: one day at a time. All right, let's return to my daughter. I'm sure she's had her fill of worry on my account."},{"name":"RESIDENTSA04264","text":"I've been waiting for you! My father returned and told me about all you did for him and for our village. It seems I owe you thanks for two good deeds today."},{"name":"RESIDENTSA04264","text":"Palaka's Stand has long been a place where the stewards of the shrines and tombs resided. That's to say, we've been focused mainly on meeting the needs of the departed, not the living."},{"name":"RESIDENTSA04264","text":"As such, I understand my father's desire to see our food stores bolstered, but if he gets himself killed, we'll all be worse off for it."},{"name":"RESIDENTSA04264","text":"Thankfully, we needn't worry about that. For today, at least. Take this as a gesture of gratitude from both Father and I."}],"reward":{"gil":895},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69952]},"next":[69796,69797]},"partials":[{"type":"npc","id":"1040647","obj":{"i":1040647,"n":"Fretful Arkasodara","l":3709,"q":1}},{"type":"quest","id":"69952","obj":{"i":69952,"n":"Simple Pleasures","g":11,"l":"Thavnair","s":570}},{"type":"quest","id":"69796","obj":{"i":69796,"n":"Treasure Hunters","g":122,"l":"Thavnair","s":2110}},{"type":"quest","id":"69797","obj":{"i":69797,"n":"Curry for the Watch","g":122,"l":"Thavnair","s":2120}}]}