{"quest":{"name":"Tea Foretell","location":"Thavnair","id":69802,"patch":6.0,"sort":2090,"eventIcon":71221,"issuer":1039518,"target":1039518,"genre":122,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mihsaja wishes to read the fate of a brave adventurer."],"objectives":["Gather spices to make chai tea.","Speak with Mihsaja."],"dialogue":[{"name":"MIHSAJA","text":"You have a look in your eyes I am well familiar with. You wish to see the threads of fate which guide you, yes? What if I told you they could be illuminated through the fine art of reading chai tea? "},{"name":"MIHSAJA","text":"Yes, the last remnant of a cup of tea can show your fate, the leaves and spices in the cup spelling out a message for those who can read it. This art has been perfected over generations in Thavnair, and I am willing to share it with you. Are you willing to take my gift?"},{"name":"MIHSAJA","text":"Splendid! Before we begin, however, you must gather the spices we will use with your own hands. It's the only way to attune the tea to your destiny."},{"name":"MIHSAJA","text":"I have marked on your map a location where you can harvest three different spices. You will choose two of these, and do not make this choice lightly─it may very well decide the course of your future."},{"name":"SYSTEM","text":"The fortune-teller wrote that the Thavnairian bay leaf improves the workings of the stomach, preventing discomfort and embarrassing irregularities in the gut."},{"name":"Q1","text":"Pick the Thavnairian bay leaf?"},{"name":"SYSTEM","text":"The fortune-teller wrote that the root of the singabera raises body temperature to expel toxins and other harmful substances from the body."},{"name":"Q2","text":"Pick the singabera root?"},{"name":"SYSTEM","text":"The fortune-teller wrote that the talisman needleleaf dispels negative thoughts, bringing a sense of calm to those who consume them."},{"name":"Q3","text":"Pick the talisman needleleaf?"},{"name":"MIHSAJA","text":"You have returned with the spices, I see. You hold your future in your hands. Now, give them to me, and I shall brew a tea you are not soon to forget."},{"name":"MIHSAJA","text":"And here you are. This tea will decide your destiny, but that doesn't mean it cannot be delicious as well. I hope I don't have to convince you to drink until the final drop."},{"name":"MIHSAJA","text":"See? Delicious, yes? Now, pass the cup to me, and I will read your fate."},{"name":"MIHSAJA","text":"Ah, most curious. Fascinating..."},{"name":"MIHSAJA","text":"There is a great revelation ahead of you. A revelation that involves the gods themselves. What will you learn? How will it change you? The tea does not say."},{"name":"MIHSAJA","text":"Oh, you will have an unexpected reunion with someone from your past. Will it be a lover, friend, family, or an erstwhile comrade-in-arms? The tea does not say, but it shall surely become a pivot on which your destiny turns."},{"name":"MIHSAJA","text":"Oh hoho, there is great wealth in store for you, but only if you make the right choices. Lay down your weapons and pick up a map and tools─the trade will be well worth it. "},{"name":"MIHSAJA","text":"Well, how does it feel? A glimpse of foresight is often an enlightening experience, and I hope that my humble skills can dispel doubt in the days ahead. Thank you for giving me the chance to hone my craft further."}],"reward":{"gil":735,"items":[{"num":2,"id":36049}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69953]}},"partials":[{"type":"npc","id":"1039518","obj":{"i":1039518,"n":"Mihsaja","l":3709,"q":1}},{"type":"item","id":"36049","obj":{"i":36049,"n":"Karniyarik","l":539,"c":24162,"t":46}},{"type":"quest","id":"69953","obj":{"i":69953,"n":"Under His Wing","g":11,"l":"Thavnair","s":571}}]}