{"quest":{"name":"Silks for a Babe","location":"Radz-at-Han","id":69809,"patch":6.0,"sort":2180,"eventIcon":71221,"issuer":1041146,"target":1041146,"genre":120,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The Arkasodara youth furrows his brow, pondering something deeply."],"objectives":["Speak with the Arkasodara youth.","Inspect the three silks, and choose one.","Speak with the Arkasodara youth."],"dialogue":[{"name":"ARKASODARAMAN04273","text":"You... You're a friend of that redheaded Miqo'te lad, aren't you? I remember how bravely you fought for us. Might I ask you a small favor?"},{"name":"ARKASODARAMAN04273","text":"Oh, thank you! You see, my wife and I will soon be blessed with a child."},{"name":"ARKASODARAMAN04273","text":"It is custom for the father to swaddle the newborn in festive silk, but... Having been to market twice, I find myself at a loss for which would be the ideal choice."},{"name":"ARKASODARAMAN04273","text":"I am loath to impose, but...I would be ever so honored if you could make the choice for us─and sooner rather than later, as she is due any day now. Would you accompany me to Ruveydah Fibers?"},{"name":"ARKASODARAMAN04273","text":"According to our tradition, the silk swaddling's color expresses the parents' wishes for how their child might grow. I have narrowed it down to three, but your insight would be greatly appreciated."},{"name":"ARKASODARAMAN04273","text":"This lush green fabric represents a wish for a prosperous life. Fulfilling not only in wealth, that is, but feasts and festivities and companionship as well. Who wouldn't want a life as rich as that?"},{"name":"ARKASODARAMAN04273","text":"The bright yellow swaddling symbolizes a wish for wisdom. Intellect is prized among our people, and is said to be the color of Cinduruva. Our child may become a respected advisor or alchemist!"},{"name":"ARKASODARAMAN04273","text":"And yet, look at this vibrant red silk! It would express a wish for talent in the arts. Why, wouldn't it be lovely if our child were to grow up to be a master artisan or performer?"},{"name":"ARKASODARAMAN04273","text":"...Hence my dilemma. I would want my child to be all of these, but I can only choose one color. What say you? Which do you feel would be the ideal choice?"},{"name":"ARKASODARAMAN04273","text":"Who would think picking out a swaddling would be such a difficult decision for a father?"},{"name":"Q1","text":"Which fabric will you choose?"},{"name":"A1","text":"A wealthy child could see their parents live in comfort."},{"name":"A1","text":"A clever child could help solve the tribe's problems."},{"name":"A1","text":"A creative child could brighten the lives of those around them."},{"name":"ARKASODARAMAN04273","text":"The green silk, then! It would be nice indeed to have a merchant in the family."},{"name":"ARKASODARAMAN04273","text":"Yellow for wisdom! I will have to ensure they receive the best education, that they might one day be a brilliant alchemist!"},{"name":"ARKASODARAMAN04273","text":"Red it is! I hope our child can someday bring joy to the village with their art."},{"name":"ARKASODARAMAN04273","text":"I thank you, friend. I feel much more confident in the decision for having consulted with you. I will bring the silk home to my wife today."},{"name":"ARKASODARAMAN04273","text":"I plan to visit Paksa's Path once I finish up here. Would you be so kind as to meet me there later, that I might repay you for your kindness?"},{"name":"ARKASODARAMAN04273","text":"My wife was most pleased with the swaddling we chose. And I daresay it is even more auspicious that such a valiant hero as you helped us choose our child's future path."},{"name":"ARKASODARAMAN04273","text":"I was devastated when my wife was separated from me during the struggle. But your Miqo'te friend saved her, in her delicate condition no less. His actions gave my wife the strength to overcome her despair and return home to me...to us."},{"name":"ARKASODARAMAN04273","text":"Your friend spoke of a hero with the power to weave our strands of hope into a brighter future."},{"name":"ARKASODARAMAN04273","text":"That hero was you, was it not? We shall treasure the swaddling you chose for us as a family heirloom, now and forever. My most sincere thanks for all you have given us!"}],"reward":{"gil":815},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69954]}},"partials":[{"type":"npc","id":"1041146","obj":{"i":1041146,"n":"Arkasodara Youth","l":3707,"q":1}},{"type":"quest","id":"69954","obj":{"i":69954,"n":"At World's End","g":11,"l":"Radz-at-Han","s":572}}]}