{"quest":{"name":"A Bond Eternal","location":"Radz-at-Han","id":69805,"patch":6.0,"sort":2140,"eventIcon":71221,"issuer":1037381,"target":1037381,"genre":120,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mehryde glances sorrowfully at a bright woven strap on the counter."],"objectives":["Search for the alchemist at the High Crucible.","Speak with Mehryde."],"dialogue":[{"name":"MEHRYDE","text":"Such a precious trinket, yet its owner makes no effort to come and retrieve it. I do hope this doesn't mean..."},{"name":"MEHRYDE","text":"Well, if it isn't the brave soul who protected us from the beasts─and perfect timing, no less! Might I ask you a small favor? I'm looking for the owner of a missing item, you see."},{"name":"MEHRYDE","text":"I was just cleaning up the shop when I found this unraveled woven band under the counter. A husband and wife visited here the other day, and I am quite certain it belongs to them."},{"name":"MEHRYDE","text":"I was hoping to return it to its rightful owner, but they've not stopped by since. I fear the worst, but am holding out hope that they are well. I would search for them myself, but I cannot leave the shop unattended. Might you be so kind as to go in my stead?"},{"name":"MEHRYDE","text":"I believe the wife mentioned she was an alchemist at the High Crucible. For the life of me, I cannot remember her name, though I do recall that she had long and striking red hair."},{"name":"MEHRYDE","text":"Pray seek out a redheaded alchemist at the High Crucible. I am sorry that I cannot offer more helpful information than that."},{"name":"ALKIMIYAALCHEMIST00203","text":"I fear you must be mistaken, for I know of no band. That said...I, too, have loved ones I have not seen since that horrible day. I do hope your friend is safe."},{"name":"ALKIMIYAALCHEMIST00203","text":"But I fear I have no time for chatter. All I can do is focus on saving who I can, and pray that I will see my friends again. Now, if you will excuse me..."},{"name":"NUHASHIR","text":"A band, you say? It isn't mine, that's for certain. We were nowhere near Mehryde's at the time."},{"name":"NUHASHIR","text":"Fortunately, my loved ones and I all escaped harm...I can only hope the same is true for the person you seek."},{"name":"NUHASHIR","text":"I can only hope that the owner of your band has not come to harm. Many here have not been so fortunate..."},{"name":"ALKIMIYAALCHEMIST00208","text":"Yes, we were at Mehryde's when the Final Days came, but what of it? Forgive me, I still find it hard to remember that day..."},{"name":"ALKIMIYAALCHEMIST00208","text":"My band! I was wondering where it had gone. My husband gave me this, and...now, it is all I have to remember him by."},{"name":"ALKIMIYAALCHEMIST00208","text":"Stubborn to the end, that one. He distracted the beast so that I was able to flee, then went off to save the others. The Radiant Host found me later. They told me he was gone...with not even a corpse left to bury."},{"name":"ALKIMIYAALCHEMIST00208","text":"To tell the truth, I have been at a loss ever since. How do I carry on knowing that he gave his life for mine? We had so many plans... What our home would look like... What our children's names would be..."},{"name":"ALKIMIYAALCHEMIST00208","text":"And now...nothing. Just a circle of woven thread he once slipped on my wrist, and the memory of how happy we were to share our lives with each other. So I go on living─because anything else would tarnish that memory."},{"name":"ALKIMIYAALCHEMIST00208","text":"...Forgive me my outburst. It has just...all been so much. At least the Crucible has been keeping me busy─I think that's what I need right now."},{"name":"MEHRYDE","text":"Welcome back. Were you able to track down the couple? I do hope they are safe..."},{"name":"MEHRYDE","text":"Oh dear...I am terribly sorry to hear that. At least we were able to return the band as a memento for the woman, as small a solace as that may be..."},{"name":"MEHRYDE","text":"That woven bracelet is a talisman of sorts─it creates a bond between gods and mortals. The tighter the braiding, the stronger protection it offers from a fate most dreadful."},{"name":"MEHRYDE","text":"In Radz–at–Han, it is a tradition to present one to your lover. To beseech the gods to offer divine protection to one for whom you care deeply. It would seem her husband's prayer was heard, though tragically at the cost of his own life..."},{"name":"MEHRYDE","text":"I imagine she will need time to heal, but I hope that she will visit again, that I might offer her what comfort and kindness I may. At any rate, I thank you for attending to this task for me."}],"reward":{"gil":735,"items":[{"num":2,"id":36048}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69954]}},"partials":[{"type":"npc","id":"1037381","obj":{"i":1037381,"n":"Mehryde","l":3707,"q":1}},{"type":"item","id":"36048","obj":{"i":36048,"n":"Hamsa Curry","l":539,"c":24040,"t":46}},{"type":"quest","id":"69954","obj":{"i":69954,"n":"At World's End","g":11,"l":"Radz-at-Han","s":572}}]}