{"quest":{"name":"An Unexpected Guide","location":"Thavnair","id":69804,"patch":6.0,"sort":2050,"eventIcon":71221,"issuer":1040654,"target":1040658,"genre":122,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The hanuman langur is beckoning to you with uncertain intent."],"objectives":["Speak with the strange hanuman langur and follow behind it.","Aid the Auri woman.","Speak with the Auri woman."],"dialogue":[{"name":"HANUMAN04268","text":"&lt;chitter&gt; &lt;chitter&gt; Heee!"},{"name":"HANUMAN04268","text":"&lt;chitter&gt; &lt;chitter&gt; Heeeheee!"},{"name":"SYSTEM","text":"It appears this creature wants you to follow it. What harm could come from doing so?"},{"name":"HANUMAN04268","text":"&lt;chitter&gt; &lt;chitter&gt; Heeehooo!"},{"name":"SYSTEM","text":"The creature appears to want you to follow it deeper into the jungle."},{"name":"SYSTEM","text":"Follow the hanuman langur and try not to fall behind."},{"name":"HANUMAN04268","text":"&lt;chitter&gt; &lt;chitter&gt; Hee! Heeehaaa!"},{"name":"SYSTEM","text":"The creature has guided you to this elderly Auri woman, but you have yet to discern why. However, it is plain that she requires aid."},{"name":"SYSTEM","text":"You come upon an elderly Auri woman, bent over in pain and breathing haggardly. Provide what treatment to her that you can."},{"name":"WOMAN","text":"Thank...thank you. I feel much better now."},{"name":"WOMAN","text":"A terrible beast fell upon me, and I fled, quickly losing my bearings in the thick woods. This kindly creature guided me to safety, but my wounds pained me."},{"name":"WOMAN","text":"How long ago was that? Bells ago? Days ago? I cannot say..."},{"name":"HANUMAN04268","text":"&lt;chitter&gt; &lt;chitter&gt; Heee!"},{"name":"WOMAN","text":"Of course, little friend. Thank you for delivering this kind soul to me. I owe you my life."},{"name":"HANUMAN04268","text":"&lt;chitter&gt; &lt;chitter&gt; Heee! Heeeheee!"},{"name":"WOMAN","text":"We shouldn't stay here, for nowhere outside the village gates is safe. I believe I can return safely on my own. Seek me out, and I shall see you are rewarded for what you've done."},{"name":"WOMAN","text":"Ah, my savior arrives at last! I feel right as rain now, and all thanks to your ministrations."},{"name":"WOMAN","text":"And that creature, of course. I haven't seen it since returning here..."},{"name":"WOMAN","text":"The legends of this island say the hanuman langurs are servants of the divinities, appearing when they deign to show an interest in worldly affairs. I think there may be some truth to those tales."},{"name":"WOMAN","text":"I must remember to make an offering when I am able. As for <span class=\"emphasis\">your</span> reward, however, please take this, and know that I shall never forget the goodwill you showed me."}],"reward":{"gil":815},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69952]}},"partials":[{"type":"npc","id":"1040654","obj":{"i":1040654,"n":"Strange Hanuman Langur","l":3709,"q":1}},{"type":"npc","id":"1040658","obj":{"i":1040658,"n":"Auri Woman","l":3709,"q":1}},{"type":"quest","id":"69952","obj":{"i":69952,"n":"Simple Pleasures","g":11,"l":"Thavnair","s":570}}]}