{"quest":{"name":"The Pangs of Hunger","location":"Radz-at-Han","id":69808,"patch":6.0,"sort":2170,"eventIcon":71221,"issuer":1041144,"target":1041145,"genre":120,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The esurient Arkasodara is groaning weakly."],"objectives":["Deliver the leather coinpurse to Mehryde at Mehryde's Meyhane.","Inspect the crate of apples.","Carry the crate of apples to the designated location.","Speak with the esurient Arkasodara.","Give the leather coinpurse to Khufiye.","Hand over the egg-filled sack and the leather coinpurse to the esurient Arkasodara."],"dialogue":[{"name":"OOGUIZOU","text":"Y-You there... Please... T-Take my coinpurse to Mehryde's Meyhane... Buy all the apples you can... So...hungry..."},{"name":"OOGUIZOU","text":"I have no strength left... Auuugggh... My stomach... To Mehryde's Meyhane... Hurry..."},{"name":"OOGUIZOU","text":"Be still my growling stomach... Help is on the way..."},{"name":"MEHRYDE","text":"Welcome to Mehryde's Meyhane! What can I─er...is something amiss?"},{"name":"MEHRYDE","text":"Food for the hungry? Worry not─he has more than enough coin for a crateful of apples. Bring it to him with my blessing."},{"name":"MEHRYDE","text":"I'll take what I am owed and leave the rest. Pray return the remainder to him. You'll find the crate of apples in front of the meyhane."},{"name":"MEHRYDE","text":"I am unsure what has sapped your friend's strength so, but perhaps it would be best for you to bring him his apples with haste."},{"name":"SYSTEM","text":"Carry the apple crate to the designated location before the time runs out."},{"name":"SYSTEM","text":"You will have 120 seconds to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"SYSTEM","text":"You successfully carried the crate to the designated location!"},{"name":"SYSTEM","text":"The crate crashes to the ground, sending the apples scattering. Sadly, they're unfit for eating now. Return to Mehryde's Meyhane to obtain a fresh batch."},{"name":"OOGUIZOU","text":"Uuungh... My stomach burns with a thousand fires... Have you the apples?"},{"name":"OOGUIZOU","text":"The people of Radz-at-Han are so kind. So kind! Many thanks, friend."},{"name":"OOGUIZOU","text":"You brought me so many apples, but... I'm afraid I'm still too weak to move. My body craves more... More..."},{"name":"OOGUIZOU","text":"If I could trouble you again... To bring me some hamsa eggs from Nilopala Nourishments... Take my coinpurse... I promise...I will make it up to you..."},{"name":"OOGUIZOU","text":"Urgh... I'm sorry, friend. I am still too weak to move..."},{"name":"MEHRYDE","text":"...The apples were not enough? But that crate could feed an entire family for days!"},{"name":"KHUFIYE","text":"Welcome to Nilopala Nourishments. What can I do for you?"},{"name":"KHUFIYE","text":"As many eggs as the coin in this purse can buy? Well, you're in luck. I have quite a surplus today. I shall give you the extras so they won't go to waste."},{"name":"KHUFIYE","text":"Here you go! ...And here's a share of your friend's coin back. It would seem he's greatly overestimated the cost of eggs these days."},{"name":"KHUFIYE","text":"It sounds like your friend is in dire straits. By all means, pray deliver his eggs before he collapses from hunger."},{"name":"OOGUIZOU","text":"You're back! Did you...ungggh...find the eggs?"},{"name":"OOGUIZOU","text":"Ahhh... My favorite... The yolks just melt in your mouth. My stomach calms, and I feel my stamina return. Thank you so much, friend."},{"name":"OOGUIZOU","text":"I had been attacked by a strange monster high up in the mountains. I descended as fast as I could, tumbling through brush and tree boughs."},{"name":"OOGUIZOU","text":"Finally I returned home, but I was so exhausted. I collapsed, only to wake again to the pangs of my empty stomach. But I found I was too weak to get up!"},{"name":"OOGUIZOU","text":"Such is the curse of being so large. We Arkasodara have great strength at our disposal, but once that strength is spent, it requires a veritable feast to replenish."},{"name":"OOGUIZOU","text":"You may have whatever coin is left in my purse as a token of my gratitude. You have done me a great service today."},{"name":"HAMSAFARMWOMEN00420","text":"Here you are. Your friend still has plenty of coin left over after your purchase. So I will just hand this back to you."}],"reward":{"gil":975},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69954]}},"partials":[{"type":"npc","id":"1041144","obj":{"i":1041144,"n":"Esurient Arkasodara","l":3707,"q":1}},{"type":"npc","id":"1041145","obj":{"i":1041145,"n":"Esurient Arkasodara","l":3707,"q":1}},{"type":"quest","id":"69954","obj":{"i":69954,"n":"At World's End","g":11,"l":"Radz-at-Han","s":572}}]}