{"quest":{"name":"Digestive Problems","location":"Elpis","id":69814,"patch":6.0,"sort":3120,"eventIcon":71221,"issuer":1037939,"target":1037939,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Zeuxis needs a helping hand of steel."],"objectives":["Gather noxious fruit.","Deliver the noxious fruit to Zeuxis."],"dialogue":[{"name":"ZEUXIS","text":"Hm, I don't know whose familiar you are, but won't you lend me a hand?"},{"name":"ZEUXIS","text":"A plant creation has recently dropped its fruit, and I'd be grateful if you could gather a few samples for me. You should find some along the northern edge of this isle. Large as they are, you won't mistake them."},{"name":"ZEUXIS","text":"Be warned, however, that the fruit are covered in an acidic secretion. Before you handle any, you'll want to apply this steelskin balm on your hands."},{"name":"ZEUXIS","text":"Remember, the fruits are covered in an acidic secretion. Before you handle any, you'll want to apply the steelskin balm on your hand."},{"name":"SYSTEM","text":"You liberally apply the steelskin balm to your hands."},{"name":"SYSTEM","text":"Creations lie prone near the fruit, alive but insensate..."},{"name":"ZEUXIS","text":"Ah, you're back. Were you able to get the fruit?"},{"name":"ZEUXIS","text":"Oho, such marvelous specimens! My thanks!"},{"name":"ZEUXIS","text":"You appear none the worse for the wear either, so you must have used the balm like I suggested. Very good, very good."},{"name":"ZEUXIS","text":"You may be wondering why the fruit is covered in acid. One day, each fruit will become a carnivorous plant that preys on herbivores, keeping their population in check."},{"name":"ZEUXIS","text":"But until it matures, it needs protection from those selfsame herbivores. To that end, we tried giving the mother plant the impulse to spray its fruit with its digestive secretion."},{"name":"ZEUXIS","text":"The fruit you brought, we will examine to determine its resistance to the acid, and make adjustments as necessary. My thanks for your help!"},{"name":"ZEUXIS","text":"...Hm? You're looking a bit unwell. You must've gotten the secretion on you, you poor thing. We'd best treat you at once."},{"name":"ZEUXIS","text":"There, you'll be fine now. You did well to endure the pain, but you should've used the balm. Remember to do so next time, all right?"}],"reward":{"gil":655,"items":[{"id":35702}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69959]}},"partials":[{"type":"npc","id":"1037939","obj":{"i":1037939,"n":"Zeuxis","l":3713,"q":1}},{"type":"item","id":"35702","obj":{"i":35702,"n":"Ironwood Earring Coffer (IL 539)","l":1,"c":26564,"t":61}},{"type":"quest","id":"69959","obj":{"i":69959,"n":"Ponder, Warrant, Cherish, Welcome","g":11,"l":"Elpis","s":577}}]}