{"quest":{"name":"Operation Ring Retrieval","location":"Radz-at-Han","id":69811,"patch":6.0,"sort":2200,"eventIcon":71221,"issuer":1040884,"target":1040885,"genre":120,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The Radiant Host captain is hoping cooler heads will prevail."],"objectives":["Speak with the Radiant Host captain.","Speak with the Radiant Host captain and follow the antagonistic Au Ra.","Speak with the Radiant Host guard."],"dialogue":[{"name":"WILDAURA04275","text":"What're you lookin' at!? This ain't none o' your business."},{"name":"MILDAURA04275","text":"I beg of you...please give me back the ring!"},{"name":"TOWNGARD04275","text":"Settle down! Settle down, I say!"},{"name":"TOWNGARDLEADER04275","text":"You're the adventurer who fought off the blasphemies with us, yes? Oh, you couldn't have come along at a better time. Please just do me one favor: just act as if nothing is the matter."},{"name":"WILDAURA04275","text":"If yer goin' to make these wild accusations of me, ye best have some damn proof. I told ye, I've never seen yer damn ring. Now, I'll be on my way..."},{"name":"MILDAURA04275","text":"How can you speak such lies!? That ring was my most precious keepsake! Oh, whatever shall I do...?"},{"name":"TOWNGARDLEADER04275","text":"Yes, that should do. Thank you...<span class=\"highlight\">Forename</span>, was it? If it wouldn't be too much of a bother, could I trouble you to assist us in an investigation of sorts?"},{"name":"TOWNGARDLEADER04275","text":"As you may have observed, that young woman believes that her ring was stolen by that─er, uncouth young man who just walked away. She has no physical evidence...and yet, I cannot help but believe that she is telling the truth."},{"name":"TOWNGARDLEADER04275","text":"And so I hatched a plan: I would make a show of defusing the argument and allow the man to walk freely away. Then, I would have him followed, that we might glean some insight as to whether or not he committed the crime."},{"name":"TOWNGARDLEADER04275","text":"That said, it would be far too conspicuous if I were to tail the man all by myself. What say I pretend that I am showing you─a visitor to our fair city─around the area? That way, I do believe we could approach him without arousing too much suspicion."},{"name":"TOWNGARDLEADER04275","text":"Splendid! I cannot thank you enough. Let us follow that rather unpleasant fellow─I believe I saw him heading in the general direction of Yuj."},{"name":"TOWNGARD04275","text":"The captain has asked me to keep the young lady safe until this matter is resolved. If she truly has been the target of a crime, she may very well be in danger still."},{"name":"MILDAURA04275","text":"I have no evidence, but...it was that man, I swear to you on my life!"},{"name":"TOWNGARDLEADER04275","text":"Very well, then. Again, all I ask is that you act as natural and inconspicuous as possible. Let us see what happens."},{"name":"WILDAURA04275","text":"Heh, so much for the vaunted Radiant Host! Didn't suspect a thing, did she? What with everyone skitterin' about like frightened little rats, these are fine times for those in my line of work! Ahahaha!"},{"name":"TOWNGARDLEADER04275","text":"Did you see that object he was examining? It certainly appeared to be the stolen ring to me. But let us not reveal ourselves quite yet─with any luck, he will unwittingly lead us to his hideout."},{"name":"TOWNGARDLEADER04275","text":"Here is the plan: I will pretend as if I'm giving you, a mere traveler, a tour of the city. Then, we follow him. Without getting <span class=\"emphasis\">too</span> close, of course─the last thing we want is to blow our cover."},{"name":"SYSTEM","text":"Follow the antagonistic Au Ra from a safe distance. The objective will end in failure if you are noticed, or if you fall too far behind."},{"name":"SYSTEM","text":"Should you fail to complete the objective, you may try again by speaking to the Radiant Host captain."},{"name":"Q1","text":"Attempt to follow the antagonistic Au Ra?"},{"name":"TOWNGARDLEADER04275","text":"Are you all right back there? Worry not, our man is still in sight. Take a moment to catch your breath, and let us resume the chase."},{"name":"MOUNTAINEER04275","text":"(-Mirthful Miner-)Oho! It's been a while since I've seen a ring of this make. And inlaid with exotic jadeite, no less! Yes, this should sell for good coin..."},{"name":"TOWNGARDLEADER04275","text":"Just as I suspected─he had the ring all along. Well, I daresay it's time we interrupted this little transaction. Might I trouble you to summon my subordinate for good measure? I will keep watch here to ensure that neither the man nor his accomplice escapes."},{"name":"TOWNGARDLEADER04275","text":"Pray go to Dharma and summon my subordinate as quickly as you can. Worry not─I will see to it that our man does not escape."},{"name":"TOWNGARD04275","text":"How fares the investigation, friend?"},{"name":"TOWNGARD04275","text":"A rare jadeite ring, you say? That matches this young woman's testimony exactly. It would seem you've caught the culprit red-handed."},{"name":"TOWNGARD04275","text":"At any rate, I will make for the scene of the crime at once. And do not worry─we will not trouble you for any further aid. I assure you the Radiant Host can more than handle a couple of common ruffians."},{"name":"TOWNGARD04275","text":"Above all, it is because of your efforts that this dear woman will be united with her precious keepsake before long. In my captain's stead, allow me to reward you for your kind deeds. And with that, I must be off!"}],"reward":{"gil":815},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69954]}},"partials":[{"type":"npc","id":"1040884","obj":{"i":1040884,"n":"Radiant Host Captain","l":3707,"q":1}},{"type":"npc","id":"1040885","obj":{"i":1040885,"n":"Radiant Host Guard","l":3707,"q":1}},{"type":"quest","id":"69954","obj":{"i":69954,"n":"At World's End","g":11,"l":"Radz-at-Han","s":572}}]}