{"quest":{"name":"Nothing to Sneeze At","location":"Elpis","id":69815,"patch":6.0,"sort":3130,"eventIcon":71221,"issuer":1037959,"target":1037959,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>There's nothing quite like a good sneeze, as Pheidias will attest."],"objectives":["Speak with the Anagnorisis beastkeeper.","Ride the ampelos to the designated locations and have it sneeze.","Speak with the Anagnorisis beastkeeper.","Speak with Pheidias."],"dialogue":[{"name":"PHEIDIAS","text":"A familiar come to observe us observers, are you? By what are you called?"},{"name":"PHEIDIAS","text":"<span class=\"highlight\">Forename</span>, you say? 'Tis a fine name. I am Pheidias, a researcher here at Anagnorisis."},{"name":"PHEIDIAS","text":"We are currently preparing a section of this isle for a new creation. For this, we need to expel those creatures that inhabit said area, that they'll not interfere with our tests."},{"name":"PHEIDIAS","text":"The simplest way to do so is to have the ampelos sneeze─the explosive noise <span class=\"emphasis\">never</span> fails to send nearby critters fleeing."},{"name":"PHEIDIAS","text":"We are just about to tend to this task...but seeing as you are here, how would you like to give it a try?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Yes, please!"},{"name":"A1","text":"Thanks, but no thanks."},{"name":"PHEIDIAS","text":"Heh heh, I knew you would be keen. To look at you, 'tis plain you are an inquisitive sort of familiar."},{"name":"PHEIDIAS","text":"Come now, there is no need to be shy. 'Tis actually quite fun, and I do so like to share the enjoyment."},{"name":"PHEIDIAS","text":"Now then, my beastkeeper colleague is already on site to the northeast of here. Seek him out, and he will tell you what to do."},{"name":"PHEIDIAS","text":"My beastkeeper colleague is already on site to the northeast of here. Seek him out, and he will tell you what to do."},{"name":"MOUNTOBSERVER04279","text":"Hm, he's supposed to be here by now... But who might you be?"},{"name":"MOUNTOBSERVER04279","text":"Oh, you're clearing the site in Pheidias's stead? How very kind of you."},{"name":"MOUNTOBSERVER04279","text":"Come then, let's get you on the ampelos. Once you're securely mounted, ride it yonder and have it sneeze at the bushes. The noise will scare away whatever creatures may be hiding. "},{"name":"MOUNTOBSERVER04279","text":"The ampelos came ambling back just now─you fell off the fellow, I assume? Don't worry, it happens. Let's get you back on it."},{"name":"MOUNTOBSERVER04279","text":"Comfortable up there, I trust? Go on now, ride it yonder and have it sneeze at the bushes. The noise will scare away whatever creatures may be hiding."},{"name":"PHEIDIAS","text":"How goes it? Were you able to get the ampelos to sneeze up a storm?"},{"name":"SYSTEM","text":"Listening closely, you hear rustling noises coming from the bush. This seems a suitable place to have the ampelos sneeze."},{"name":"SYSTEM","text":"The ampelos's mighty sneeze sends the creatures in the bush scattering in panic!"},{"name":"MOUNTOBSERVER04279","text":"The creatures came running all the way here. Frightened as they looked, I daresay they'll keep away from the site for a good while."},{"name":"MOUNTOBSERVER04279","text":"For its hard work, I shall treat the ampelos to a spot of sunbathing. Meanwhile, you should return to Pheidias. I am certain he will have a reward for you too!"},{"name":"PHEIDIAS","text":"Welcome back, <span class=\"highlight\">Forename</span>! Thanks to you, the site has been nicely cleared, and we can release our new creation."},{"name":"PHEIDIAS","text":"It's a species of ambulatory plant, lest you wonder. While these have been popular of late, this one dwarfs the rest─a veritable tree that can use its branches like hands to catch prey."},{"name":"PHEIDIAS","text":"Heh heh, it sets my heart aflutter just thinking about it. My thanks again, and if there are any other exciting tasks, I will be certain to let you know!"}],"reward":{"gil":815},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69961]}},"partials":[{"type":"npc","id":"1037959","obj":{"i":1037959,"n":"Pheidias","l":3713,"q":1}},{"type":"quest","id":"69961","obj":{"i":69961,"n":"Their Greatest Contribution","g":11,"l":"Elpis","s":579}}]}