{"quest":{"name":"Kick Some Asp","location":"Elpis","id":69818,"patch":6.0,"sort":3160,"eventIcon":71221,"issuer":1037945,"target":1037945,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Paramonos spies an opportunity to foist a perilous task upon an unsuspecting visitor."],"objectives":["Use the extra-thick aetheric rope on weakened ophions.","Deliver the captured ophions to Paramonos."],"dialogue":[{"name":"PARAMONOS","text":"How curious... A familiar bearing armaments? You must be special indeed."},{"name":"PARAMONOS","text":"As it happens, I may have a use for you. Would you care to assist me by capturing a few ophions? In exchange for a reward of sorts, naturally."},{"name":"PARAMONOS","text":"I should warn you, however, they tend to be rather uncooperative. Aggressively so, in fact. The familiars previously recruited for this task all met with most unfortunate ends. A terrible waste, but let us not dwell on such things."},{"name":"PARAMONOS","text":"Here, take this aetherially imbued rope, and use it to restrain the ophions. Remember, I require living samples. They are <span class=\"emphasis\">extremely</span> valuable, so if you must choose between their lives and your own...do the honorable thing and let them kill you."},{"name":"PARAMONOS","text":"Just to be perfectly clear, failure <span class=\"emphasis\">is</span> an option, provided you're prepared for the rather messy consequences."},{"name":"PARAMONOS","text":"Have you brought the specimens I requested?"},{"name":"PARAMONOS","text":"Well, well. To overcome such ferocious creatures and live to tell the tale... Your maker certainly placed great importance in durability."},{"name":"PARAMONOS","text":"As for the ophions you've brought me, they will be delivered to the Akadaemia Anyder."},{"name":"PARAMONOS","text":"Like the other creatures in Elpis, they are currently under observation, that we may determine their suitability for existence beyond these confines."},{"name":"PARAMONOS","text":"Samples are carefully selected and sent for further study. If they are found worthy, they will receive official approval."},{"name":"PARAMONOS","text":"Only then can they be submitted to the Bureau of the Architect."},{"name":"PARAMONOS","text":"As even you can imagine, the evaluation process is particularly strict for voracious predators such as ophions. It would reflect rather poorly on those involved if they were to wreak havoc when unleashed into the wider world."},{"name":"PARAMONOS","text":"Not that it is any concern of yours. Here is your reward. Now, run along, would you?"}],"reward":{"gil":655,"items":[{"num":2,"id":36049}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69959]}},"partials":[{"type":"npc","id":"1037945","obj":{"i":1037945,"n":"Paramonos","l":3713,"q":1}},{"type":"item","id":"36049","obj":{"i":36049,"n":"Karniyarik","l":539,"c":24162,"t":46}},{"type":"quest","id":"69959","obj":{"i":69959,"n":"Ponder, Warrant, Cherish, Welcome","g":11,"l":"Elpis","s":577}}]}