{"quest":{"name":"The Ore the Merrier","location":"Elpis","id":69812,"patch":6.0,"sort":3101,"eventIcon":71221,"issuer":1037942,"target":1037942,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Eukleides eyes you curiously."],"objectives":["Speak with the graceful observer.","Use the Hypnos potions on oreiai and capture them.","Deliver the oreiai to the graceful observer.","Deliver the oreiai to Eukleides."],"dialogue":[{"name":"EUKLEIDES","text":"Hm? A visitor touring our facility, are you? If you wish, you can assist us with one of our latest arrivals─the oreias."},{"name":"EUKLEIDES","text":"The creatures are identifiable by their long ears, which they use to detect danger. They're also keenly attuned to minerals, and can find deposits even in pitch darkness."},{"name":"EUKLEIDES","text":"Now, we were just testing the effect of minerals on them when they reacted acutely to manastone. Becoming visibly agitated, they each grabbed a stone and scurried off."},{"name":"EUKLEIDES","text":"We need to round them up again, and could use a helping hand. If you are up for it, please seek out my colleague who is out searching. She should be somewhere between here and First Bloom, and can give you instructions."},{"name":"EUKLEIDES","text":"If you wish to help us round up the oreiai, please seek out my colleague who is out searching."},{"name":"EUKLEIDES","text":"She should be somewhere between here and First Bloom, and can give you instructions."},{"name":"ELPISOBSERVER04276","text":"Come to help us find the oreiai, you say? We're much obliged."},{"name":"ELPISOBSERVER04276","text":"Three of the critters have been sighted yonder."},{"name":"ELPISOBSERVER04276","text":"When you find one, use this Hypnos potion on it. It should put it to sleep and allow you to easily capture it."},{"name":"ELPISOBSERVER04276","text":"Should the potion fail to work, as it occasionally does, you can simply exhaust the creature into submission."},{"name":"ELPISOBSERVER04276","text":"When you find an oreias, use the Hypnos potion on it. It should put it to sleep and allow you to easily capture it."},{"name":"SYSTEM","text":"You should use the Hypnos potion on the oreias before you attempt to capture it."},{"name":"SYSTEM","text":"The oreias quickly falls asleep."},{"name":"SYSTEM","text":"The oreias tries to fight the potion, but eventually succumbs."},{"name":"SYSTEM","text":"The oreias is too agitated─the potion has no effect!"},{"name":"EUKLEIDES","text":"How are you faring with the oreiai?"},{"name":"ELPISOBSERVER04276","text":"Ah, there you are. Were you able to catch the oreiai?"},{"name":"ELPISOBSERVER04276","text":"Thank you! Now only two of the critters remain at large."},{"name":"ELPISOBSERVER04276","text":"I've received word that they've been sighted in another area, so I will hurry there at once."},{"name":"ELPISOBSERVER04276","text":"In the meantime, I'd be grateful if you could take the three fellows you caught back to Eukleides."},{"name":"EUKLEIDES","text":"Oh, 'tis you again. How did you fare with the oreiai?"},{"name":"EUKLEIDES","text":"Well now, that you should bring the creatures yourself... I hope they didn't give you too much trouble."},{"name":"EUKLEIDES","text":"Their abnormal behavior was most certainly caused by the power harbored in manastone."},{"name":"EUKLEIDES","text":"Still, we have the highest hopes for the oreias. In their digging for minerals, they prime the earth for plant life."},{"name":"EUKLEIDES","text":"If we suppress their sensitivity to magical influence, theirs will surely be a beneficial existence to the star. And you, my friend, can be proud in having helped to bring them forth."}],"reward":{"gil":815,"items":[{"id":35705}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69959]}},"partials":[{"type":"npc","id":"1037942","obj":{"i":1037942,"n":"Eukleides","l":3713,"q":1}},{"type":"item","id":"35705","obj":{"i":35705,"n":"Ironwood Ring Coffer (IL 539)","l":1,"c":26567,"t":61}},{"type":"quest","id":"69959","obj":{"i":69959,"n":"Ponder, Warrant, Cherish, Welcome","g":11,"l":"Elpis","s":577}}]}