{"quest":{"name":"Breaking the Eyes","location":"Elpis","id":69817,"patch":6.0,"sort":3150,"eventIcon":71221,"issuer":1041518,"target":1041518,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>You are just the thing the vivacious observer needs."],"objectives":["Speak with the vivacious observer.","/dance for Notos 666.","Speak with the vivacious observer.","Obtain the bowl of fruit.","Deliver the bowl of fruit to the vivacious observer."],"dialogue":[{"name":"SUPPLEOBSERVER04281","text":"&lt;gasp&gt; You, my dear familiar, are precisely what I need! Pray help me with my research!"},{"name":"SUPPLEOBSERVER04281","text":"One of our new creations has an extremely wary disposition. Try as I might to go near it for observation, it senses my aether and flees."},{"name":"SUPPLEOBSERVER04281","text":"As a familiar, your aether is thinner than mine, yet you seem more intelligent than your fellows. That being the case, I believe you may succeed where I have failed. Come with me behind the building─I will take you to the creation!"},{"name":"SYSTEM","text":"A creature bearing a strong resemblance to a paissa stares unflinchingly at a bowl of fruit on the ground."},{"name":"SUPPLEOBSERVER04281","text":"There it is─Notos 666. New as it is to Elpis, the creature has yet to be given a proper name."},{"name":"SUPPLEOBSERVER04281","text":"As I mentioned, I cannot go near it. Indeed, this is the closest I can be. I want you to approach it, and then do something to show that you are a friend. What do you think will work?"},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Return its gaze."},{"name":"A1","text":"Perform a dance for it."},{"name":"SUPPLEOBSERVER04281","text":"Uhhh, I strongly recommend against doing so, lest you become forever lost in its bottomless gaze... Instead, perhaps you could try gesturing to it. Something whimsical...like as a dance! Yes, I daresay that will encourage it to lower its guard!"},{"name":"SUPPLEOBSERVER04281","text":"Ah, an excellent idea! If it sees you moving in a whimsical fashion, it may well lower its guard!"},{"name":"SUPPLEOBSERVER04281","text":"So go on, try to perform a dance for Notos 666. I shall watch from here. Best of luck to you!"},{"name":"SUPPLEOBSERVER04281","text":"Go on, approach Notos 666 and perform a dance for it. I shall watch from a distance. Best of luck to you!"},{"name":"SYSTEM","text":"Notos 666, which bears a strong resemblance to a paissa, stares unflinchingly at a bowl of fruit on the ground. Try performing a <span class=\"highlight\">dance</span> for it to show that you are a friend."},{"name":"PAISSA04281","text":"..."},{"name":"SYSTEM","text":"Notos 666 scurries off, leaving behind the bowl of fruit."},{"name":"SUPPLEOBSERVER04281","text":"Heh heh, I witnessed it all. You did very well, my dear familiar."},{"name":"SUPPLEOBSERVER04281","text":"Notos 666 is designed to facilitate the proliferation of fruiting trees by bearing their seeds to faraway places."},{"name":"SUPPLEOBSERVER04281","text":"While their young are still unable to forage for themselves, 'tis the duty of male creatures to bring them food."},{"name":"SUPPLEOBSERVER04281","text":"In leaving you the fruit, it appears to have taken you for one of its own. I wasn't sure how it would respond to your overtures, but I wasn't expecting <span class=\"emphasis\">that</span>!"},{"name":"SUPPLEOBSERVER04281","text":"Go on and take your gift, and let us return to Anagnorisis. You deserve a reward for your troubles."},{"name":"SUPPLEOBSERVER04281","text":"Thanks to your invaluable cooperation, I was able to acquire some very insightful data."},{"name":"SUPPLEOBSERVER04281","text":"Oh, the fruit. They are rightly yours to enjoy, so go on─enjoy them!"},{"name":"SYSTEM","text":"The fruit looked good, but it tastes even better, each bite a small piece of heaven in your mouth!"},{"name":"SUPPLEOBSERVER04281","text":"Heh heh, judging by your expression, 'twould seem Notos 666 saves the choicest fruit for its young."},{"name":"SUPPLEOBSERVER04281","text":"Though it has but come to us, I have a good feeling for the creature. When the time comes, we shall have to think up a suitably fine name for it."},{"name":"SUPPLEOBSERVER04281","text":"Here is the reward I promised. Thanks again, my dear familiar!"}],"reward":{"gil":895},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69959]}},"partials":[{"type":"npc","id":"1041518","obj":{"i":1041518,"n":"Vivacious Observer","l":3713,"q":1}},{"type":"quest","id":"69959","obj":{"i":69959,"n":"Ponder, Warrant, Cherish, Welcome","g":11,"l":"Elpis","s":577}}]}