{"quest":{"name":"Sweet Temptations","location":"Elpis","id":69816,"patch":6.0,"sort":3140,"eventIcon":71221,"issuer":1041530,"target":1041530,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The earnest observer casts his gaze hither and yon, as if searching for something."],"objectives":["Use aetheric rope on agavoides young to capture them.","Deliver the agavoides young to the earnest observer."],"dialogue":[{"name":"GALLANTOBSERVER04280","text":"Bah, where in the world could the rest have gotten to...?"},{"name":"GALLANTOBSERVER04280","text":"Ah, friend familiar! If you have a moment, I require help rounding up our agavoides young."},{"name":"GALLANTOBSERVER04280","text":"Six remain unaccounted for, and I would be most grateful if you could search for them with me."},{"name":"GALLANTOBSERVER04280","text":"The creatures secrete nectar from their tails, which attracts insects; where they swarm, you are like to find an agavoides. And when you do, use this aetheric rope to catch it."},{"name":"GALLANTOBSERVER04280","text":"Small as they are, I don't believe they will be too far away. Let us endeavor to find three each and then reconvene here."},{"name":"SYSTEM","text":"The agavoides young lies unmoving─attempting to lure butterflies, it would seem."},{"name":"GALLANTOBSERVER04280","text":"Ah, you are returned as well. I managed to find three. How about yourself?"},{"name":"GALLANTOBSERVER04280","text":"Wonderful, this accounts for all of them! We can finally release the creatures."},{"name":"GALLANTOBSERVER04280","text":"Lest you wonder, the agavoides were created to curb the insect population. They have passed the first phase of determination, and thus will be provisionally sent out into the wider world."},{"name":"GALLANTOBSERVER04280","text":"Though a few steps remain before they can fully take their place in nature, I've no doubt but that they will make our star a better place."},{"name":"GALLANTOBSERVER04280","text":"This isn't much, but please accept it by way of my gratitude for your assistance."}],"reward":{"gil":655,"items":[{"id":35703}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69959]}},"partials":[{"type":"npc","id":"1041530","obj":{"i":1041530,"n":"Earnest Observer","l":3713,"q":1}},{"type":"item","id":"35703","obj":{"i":35703,"n":"Ironwood Necklace Coffer (IL 539)","l":1,"c":26565,"t":61}},{"type":"quest","id":"69959","obj":{"i":69959,"n":"Ponder, Warrant, Cherish, Welcome","g":11,"l":"Elpis","s":577}}]}