{"quest":{"name":"Clutch Devastation","location":"Elpis","id":69819,"patch":6.0,"sort":3170,"eventIcon":71221,"issuer":1037950,"target":1037950,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Kallias is <span class=\"emphasis\">supposed</span> to be keeping an eye on the creations."],"objectives":["Search the daidalion nests for eggs.","Deliver the daidalion egg to Kallias."],"dialogue":[{"name":"KALLIAS","text":"Oh... So much to do, so little time!"},{"name":"KALLIAS","text":"Ah! A volunteer! How would you like to earn the respect and gratitude of Elpis's most gifted researcher? I require assistance in gathering eggs, a simple task, really."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Egg gathering? The very reason I came here!"},{"name":"A1","text":"If it's so simple, why don't you do it yourself?"},{"name":"KALLIAS","text":"Excellent! Why, I sense your social standing rising even as we speak!"},{"name":"KALLIAS","text":"My word! I wasn't expecting such impertinence from a mere familiar! But being the forgiving and generous soul that I am, I shall accept you into my service regardless."},{"name":"KALLIAS","text":"Ahem. To business, then. I seek daidalion eggs, that I may ascertain their ability to produce and raise offspring."},{"name":"KALLIAS","text":"One somewhat disconcerting trait of these winged wonders is their proclivity for laying eggs here, there, and everywhere. That is the reason why I'm finding it rather difficult to keep track of the damnable things."},{"name":"KALLIAS","text":"I've neither the time nor inclination to go chasing after them myself, but I'm sure you don't mind. If the parents take offense at you pinching their eggs, you have my permission to slay them if need be."},{"name":"KALLIAS","text":"If I don't see you again, I shall assume you've fallen <span class=\"emphasis\">fowl</span> of an angry bird. Haha!"},{"name":"SYSTEM","text":"You have discovered a daidalion egg. Deliver it to Kallias to free yourself from his service."},{"name":"SYSTEM","text":"There are no eggs to be found here..."},{"name":"KALLIAS","text":"I assume you haven't returned empty-handed?"},{"name":"KALLIAS","text":"Splendid! I now have ample evidence that the daidalion are breeding as expected."},{"name":"KALLIAS","text":"Then, all we need do is wait for the concept to be officially approved."},{"name":"KALLIAS","text":"But wait! If even a mediocre familiar such as you can steal their eggs, how are they supposed to propagate in the wild?"},{"name":"KALLIAS","text":"No, no, this will never do. We shall have to find a way to improve their natural defenses against such threats. Two heads, perhaps? Fire-breath? Cover their eggs in spikes? Hmm... That might make them rather tricky to lay..."},{"name":"KALLIAS","text":"Well, it's certainly given me food for thought. I shall have to discuss this with the others."},{"name":"KALLIAS","text":"Oh, are you still here? I suppose a word of thanks is in order.<br>Thanks.<br>...There, satisfied?"}],"reward":{"gil":655},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69959]}},"partials":[{"type":"npc","id":"1037950","obj":{"i":1037950,"n":"Kallias","l":3713,"q":1}},{"type":"quest","id":"69959","obj":{"i":69959,"n":"Ponder, Warrant, Cherish, Welcome","g":11,"l":"Elpis","s":577}}]}