{"quest":{"name":"A Colorful Concept","location":"Elpis","id":69813,"patch":6.0,"sort":3110,"eventIcon":71221,"issuer":1040639,"target":1041877,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The impatient observer appears to be waiting for someone."],"objectives":["Speak with the blue-haired observer.","Speak with the avian observer.","Deliver the bird of Elpis feathers to the blue-haired observer."],"dialogue":[{"name":"WORKINGOBSERVER04277","text":"Ah, you there! Yes, you, the familiar. I need you to do me a favor."},{"name":"WORKINGOBSERVER04277","text":"A colleague and I are supposed to conduct some tests at the Thalassai, but said colleague is late to arrive."},{"name":"WORKINGOBSERVER04277","text":"I would go and find him myself, but I have preparations to finalize. Could you head over to First Bloom and tell him to hurry up? He is an observer with blue hair."},{"name":"WORKINGOBSERVER04277","text":"Please, head over to First Bloom and tell my colleague to hurry up. He is an observer with blue hair."},{"name":"BLUEHAIROBSERVER04277","text":"Well now, there's a familiar I'm not familiar with.<br>...Ahem. Apologies, I couldn't help myself. So, is there something I can do for you?"},{"name":"BLUEHAIROBSERVER04277","text":"Gah, the tests! So deep was I in thought, I completely lost track of time!"},{"name":"BLUEHAIROBSERVER04277","text":"In my defense, it was these very tests I had been pondering. Lest you wonder, they are for a species of fish that purifies the sea by devouring carcasses."},{"name":"BLUEHAIROBSERVER04277","text":"Small as they are, they are easy targets for larger fish. Thus did we imbue them with poison as a defense mechanism."},{"name":"BLUEHAIROBSERVER04277","text":"Not wanting the poison to outright kill, we kept it weak. Even so, it gradually accumulates within the predator's body, and testing has determined that it will lead to mass death."},{"name":"BLUEHAIROBSERVER04277","text":"Though we wish to avoid this outcome, the concept for this fish is truly marvelous, and it would be a shame to abandon it. But what to do...?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You could give it warning colors."},{"name":"A1","text":"You could warn predators that it's poisonous."},{"name":"BLUEHAIROBSERVER04277","text":"But of course! In so doing, it would reduce the likelihood that they will be preyed upon!"},{"name":"BLUEHAIROBSERVER04277","text":"Yes, I believe we have our solution, and it's all thanks to you, my brilliant familiar! I'll go and join my colleague at once─we have a test to perform!"},{"name":"BLUEHAIROBSERVER04277","text":"Ah, do you suppose you could fetch something for me? For the test I have in mind, we'll be needing some bird of Elpis feathers."},{"name":"BLUEHAIROBSERVER04277","text":"These can be had from a colleague of ours who specializes in avians. The man should be somewhere back on the main isle. My thanks again, and see you shortly."},{"name":"WORKINGOBSERVER04277","text":"'Tis well he's finally here, but apparently we still need something for the tests?"},{"name":"BLUEHAIROBSERVER04277","text":"Were you able to find our avian-watching colleague? He should be able to provide us with the feathers we need."},{"name":"BIRDOBSERVER04277","text":"Whose familiar might you be? And what is it you require?"},{"name":"BIRDOBSERVER04277","text":"Bird of Elpis feathers, you say? I assume they are for your master. Here you go, then, and run along."},{"name":"BIRDOBSERVER04277","text":"You mustn't keep your master waiting. Run along and deliver the feathers."},{"name":"BLUEHAIROBSERVER04277","text":"There you are, my clever familiar. You have the feathers, I trust?"},{"name":"BLUEHAIROBSERVER04277","text":"Yes, these colors are perfect! We shall grant our fish the same to warn would-be predators of its poison!"},{"name":"WORKINGOBSERVER04277","text":"I say, was it the familiar who conceived of this idea?"},{"name":"BLUEHAIROBSERVER04277","text":"It was! Thanks to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>, we won't need to revert our fish to aether."},{"name":"WORKINGOBSERVER04277","text":"So not only did you find my colleague, you thought of a solution to our problem <span class=\"emphasis\">and</span> fetched the feathers..."},{"name":"WORKINGOBSERVER04277","text":"You've been very busy on our behalf, and we're grateful. Here is a little something for your troubles."}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69959]}},"partials":[{"type":"npc","id":"1040639","obj":{"i":1040639,"n":"Impatient Observer","l":3713,"q":1}},{"type":"npc","id":"1041877","obj":{"i":1041877,"n":"Blue-haired Observer","l":3713,"q":1}},{"type":"quest","id":"69959","obj":{"i":69959,"n":"Ponder, Warrant, Cherish, Welcome","g":11,"l":"Elpis","s":577}}]}