{"quest":{"name":"Beg Pardon?","location":"Elpis","id":69826,"patch":6.0,"sort":4140,"eventIcon":71221,"issuer":1037972,"target":1037972,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Gryllos is cursing up a storm."],"objectives":["Speak with Gryllos's assistant.","Speak with the slippery mandragora.","Speak with Gryllos's assistant.","While transfigured, speak with the slippery mandragora.","Speak with Gryllos's assistant.","Report to Gryllos."],"dialogue":[{"name":"GRYLLOS","text":"Crows take that little sod! Where's it gone n─ Oh! I was unaware we had a visitor."},{"name":"GRYLLOS","text":"Pardon my language─I should hate to give a poor impression of Elpis with my unprofessional behavior. Alas, I am quite at my wits' end with this new cultivar. You are fortunate not to have overheard worse."},{"name":"GRYLLOS","text":"Its restorative properties are superlative, that much is true. Yet what possessed its creator to give it such nimble little legs, I shall never understand. I really must impress upon those fools at the Words of Halmarut that not <span class=\"emphasis\">everything</span> need be ambulatory!"},{"name":"GRYLLOS","text":"I have tried leashing it, fencing it in, staring at it with all my might...each to no avail. Its resourcefulness is far beyond what one could─and I daresay <span class=\"emphasis\">should</span>─wish of a vegetable."},{"name":"GRYLLOS","text":"Given that it shows such signs of sentience, however...perhaps it is possible for another intelligent creation to commune with it. Are you willing to make the attempt?"},{"name":"GRYLLOS","text":"When it embarked upon its most recent bid for freedom, I sent my assistant after it. His own legs have grown quite powerful by this point, so with any luck, you will find them not too far to the west."},{"name":"GRYLLOS","text":"At this rate, we will certainly succeed at filling this star with life─but at what cost?"},{"name":"MANDRAGORA04290","text":"○♪××□○◆?<br>◎◎#!!!"},{"name":"ASSISTANT04290","text":"Gryllos sent you to “commune” with the mandragora? Er...best of luck."},{"name":"ASSISTANT04290","text":"I assure you that it will respond if you speak to it. I cannot promise you will enjoy the experience, however..."},{"name":"MANDRAGORA04290","text":"○♪××□○◆?<br>◎◎#!!!"},{"name":"SYSTEM","text":"The mandragora emits a screech not unlike the sound of a magitek airship's hull rending in twain, but it is unclear what this is meant to convey."},{"name":"ASSISTANT04290","text":"Did that...help?"},{"name":"ASSISTANT04290","text":"So even its fellow creations cannot understand it─what a pity. Granted, I did suspect its vocal organ was...unique."},{"name":"ASSISTANT04290","text":"Aha! If you took the same form, that may be less of an obstacle."},{"name":"ASSISTANT04290","text":"Though I am admittedly unversed in the original design specifications, I should have little difficulty transforming you into its mirror. Shall we have a go?"},{"name":"ASSISTANT04290","text":"Wonderful! Now, stand still..."},{"name":"SYSTEM","text":"In order to proceed further in the quest, you must be under the transfigured status."},{"name":"SYSTEM","text":"Should you accidentally remove your transfiguration, speak to Gryllos's assistant to be transfigured once more."},{"name":"ASSISTANT04290","text":"Yes, it is quite flattering on you. Now please, commune with the mandragora."},{"name":"ASSISTANT04290","text":"Odd... I would not have expected the magic to dispel so soon. Never you mind, though─there is more than enough where that came from."},{"name":"MANDRAGORA04290","text":"○♪××□○◆?<br>◎◎#!!!"},{"name":"SYSTEM","text":"The mandragora emits a screech not unlike the sound of a magitek airship's hull rending in twain, but it is unclear what this is meant to convey."},{"name":"MANDRAGORA04290","text":"◎■■■♭×!"},{"name":"SYSTEM","text":"If anything, you understand even less than you did before."},{"name":"ASSISTANT04290","text":"How was that? ...Ah, one moment please."},{"name":"ASSISTANT04290","text":"Pardon me─I had not the slightest idea what you were saying. Would you mind repeating that?"},{"name":"ASSISTANT04290","text":"Foiled again! Nevertheless, we have gained valuable data."},{"name":"MANDRAGORA04290","text":"■×□○○◎△◎!<br>○▲♭♭!!!"},{"name":"ASSISTANT04290","text":"Alas. Please inform Gryllos that it may be some time before I return..."},{"name":"GRYLLOS","text":"Did you locate the mandragora?"},{"name":"GRYLLOS","text":"Seemingly incapable of comprehensible communication, is it? Perhaps its degree of intelligence bears further scrutiny."},{"name":"GRYLLOS","text":"Of course, if upon further observation it <span class=\"emphasis\">is</span> deemed sentient, it will be subject to even greater scrutiny to ensure that it can be safely set loose."},{"name":"GRYLLOS","text":"To understand each creation in all its aspects, and conclusively prove it beneficial or detrimental to the star─such is our duty and burden as researchers..."},{"name":"GRYLLOS","text":"...At least we can say with certainty that its legs work."}],"reward":{"gil":655},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69963]}},"partials":[{"type":"npc","id":"1037972","obj":{"i":1037972,"n":"Gryllos","l":3713,"q":1}},{"type":"quest","id":"69963","obj":{"i":69963,"n":"A Sentimental Gift","g":11,"l":"Elpis","s":581}}]}