{"quest":{"name":"Sing, O Mews","location":"Elpis","id":69825,"patch":6.0,"sort":4130,"eventIcon":71221,"issuer":1037969,"target":1037969,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Hippothoe wishes to conduct another test of the ailouroi's capacity─and yours."],"objectives":["Speak with researchers at the Twelve Wonders.","Speak with Hippothoe."],"dialogue":[{"name":"HIPPOTHOE","text":"I am so pleased that you're willing to join us in further research."},{"name":"HIPPOTHOE","text":"Thus far, you have noted this ailouros's response to stimuli."},{"name":"HIPPOTHOE","text":"However, the ailouroi have one more <span class=\"emphasis\">very</span> special capability. Aren't you curious?"},{"name":"HIPPOTHOE","text":"You will be pleased to know that I have dispatched one additional ailouros to fly about the Twelve Wonders, then. If she is working as designed, the phenomenon should be clearly observable."},{"name":"HIPPOTHOE","text":"I expect that you will be able to collect evidence of it from my fellow researchers...say, Oloros, Deukalion, and Chloris? Do present your conclusions to me when you've finished!"},{"name":"GEALCAT04289","text":"Mrrrp!"},{"name":"HIPPOTHOE","text":"What fun would it be if I told you in advance? Better that you reach your own conclusions."},{"name":"OLOROS","text":"Isn't this the most darling familiar you have ever seen?"},{"name":"OLOROS","text":"Behold its soft and fluffy fur, its pudgy belly, its charming little bell! Its eyes that gaze imploringly into the very depths of your soul!"},{"name":"OLOROS","text":"It makes you want to dismantle it and gobble its adorable aether right up, does it not?"},{"name":"OLOROS","text":"I dare not, of course─whoever it belongs to would be quite cross indeed. Yet even to gaze upon it stokes within me a creative passion the likes of which I've never known!"},{"name":"GEALCAT04289","text":"(-Ailouros-)M-Meeew..."},{"name":"OLOROS","text":"Alas, my muse! Perhaps I need create my own familiar of surpassing cuteness after all..."},{"name":"DEUKALION","text":"A tiny winged creature? Do you refer to Hippothoe's familiar, perchance? I did see it not long ago."},{"name":"DEUKALION","text":"I know not where it's gone off to, I regret to say. I would assist in your search, but I must put brush to parchment before I forget what I meant to write."},{"name":"DEUKALION","text":"Outside of my observational duties, I have been laboring over a treatise on aquatic flora, you see. Yet rereading my work a moment ago, I was suddenly struck with how trite my conclusion sounds."},{"name":"DEUKALION","text":"I believe I know precisely how to strengthen it, however. I daresay even Halmarut shall be impressed by my insight!"},{"name":"CHLORIS","text":"I would advise you to keep your head down─I saw some manner of creature darting about in the air just now. If it carries on like that, it's only a matter of time before it collides with someone's skull."},{"name":"CHLORIS","text":"It startled me so badly that I accidentally created a winged fish─of all things!─which itself escaped to the skies ere I knew it..."},{"name":"CHLORIS","text":"Though, now that I have a moment to reflect on its speedy departure, perhaps the ability to fly is not so wasted upon aquatic creatures as I believed. Surely such a boon would give them heretofore unknown capacity to evade predation..."},{"name":"CHLORIS","text":"The recent fashion for flying concepts may have something to it after all. I really must pay visit to the Bureau of the Architect next I'm in Amaurot─I doubt anyone has registered a <span class=\"emphasis\">winged fish</span> yet."},{"name":"OLOROS","text":"Soft fur...wide eyes... Hmm, what else should I add?"},{"name":"DEUKALION","text":"Halmarut may even appoint me to a research position at the Akadaemia Anyder... At last, my time has arrived!"},{"name":"CHLORIS","text":"We were fortunate that it was a <span class=\"emphasis\">happy</span> accident this time, of course. You know how it is─someone yells, “surprise!” and suddenly you've created a stunted serpent with yellow stripes or some nonsense. We can't have that."},{"name":"GEALCAT04289","text":"Mew, mew!"},{"name":"HIPPOTHOE","text":"I see you have spoken to everyone. And what are your findings?"},{"name":"HIPPOTHOE","text":"Exactly right! The ailouroi bless those they meet with inspiration."},{"name":"HIPPOTHOE","text":"After all, we are at our best─and our brightest─when our hearts are at ease. With clarity of thought and faith in ourselves, we can do anything."},{"name":"HIPPOTHOE","text":"And what could possibly quell inner turmoil so well as a lovable creature like this?"},{"name":"GEALCAT04289","text":"Mew, mew! Mrowr..."},{"name":"HIPPOTHOE","text":"Ah, it seems duty calls─she senses another irregularity. Off you go then, dear girl!"},{"name":"HIPPOTHOE","text":"With today's results, the ailouros concept will be approved in no time. I am truly fortunate to have such wonderful familiars to work with─yourself included, of course!"}],"reward":{"gil":735,"items":[{"id":35705}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"questsType":"all","quests":[69963,69824]}},"partials":[{"type":"npc","id":"1037969","obj":{"i":1037969,"n":"Hippothoe","l":3713,"q":2}},{"type":"item","id":"35705","obj":{"i":35705,"n":"Ironwood Ring Coffer (IL 539)","l":1,"c":26567,"t":61}},{"type":"quest","id":"69963","obj":{"i":69963,"n":"A Sentimental Gift","g":11,"l":"Elpis","s":581}},{"type":"quest","id":"69824","obj":{"i":69824,"n":"You and the Ailouros","g":125,"l":"Elpis","s":4120,"f":1}}]}