{"quest":{"name":"We'll Meet Again","location":"Elpis","id":69823,"patch":6.0,"sort":4110,"eventIcon":71221,"issuer":1037962,"target":1037962,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Blaste's fraught expression is in stark contrast to the tranquil surroundings."],"objectives":["Search for a chestnut-haired lady.","Speak with Blaste."],"dialogue":[{"name":"BLASTE","text":"Ah, we meet again. The familiar who was with Charmion, yes? My apologies if I seem a little distracted, but I am actually in the midst of searching for someone."},{"name":"BLASTE","text":"Oh, I don't believe we've met. As much as I would like to engage in more meaningful conversation, I am actually in the midst of searching for someone."},{"name":"BLASTE","text":"It's my mentor, who taught me practically everything I know. Now, she has relinquished her role and is ready to make her final journey. But before she does, there is an important matter I must convey to her."},{"name":"BLASTE","text":"The last concept in her care─a beautiful, winged creature─has been approved for life on Etheirys!"},{"name":"BLASTE","text":"Please, will you help me look for her? There is a strong chance you will find her at Philomythes Notos. Her most distinguishing feature is her chestnut-colored hair, tied into a single, flowing lock, much like a monoceros's tail."},{"name":"BLASTE","text":"I have sent a familiar of my own to the north to look for my mentor. I would be very grateful if you could search elsewhere, starting with Philomythes Notos."},{"name":"BROWNHAIRWOMAN04287","text":"You wish to speak with me?"},{"name":"BROWNHAIRWOMAN04287","text":"Ah, yes. I had a feeling she might say that. As I have told her, my decision has been made."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"But what about that winged creature? It was a success!"},{"name":"A1","text":"Well, she can't say I didn't try."},{"name":"BROWNHAIRWOMAN04287","text":"Glad tidings, to be certain, but my work is done. This news was more than sufficient, and I thank you for it."},{"name":"BROWNHAIRWOMAN04287","text":"Nothing can deter me from my chosen course, and I must join my predecessors in the hereafter. Tell Blaste to name the creature as she pleases... And that I wish her every happiness."},{"name":"BROWNHAIRWOMAN04287","text":"Now, our brief encounter has reached its end. Farewell."},{"name":"BLASTE","text":"She's not with you...did you at least find her?"},{"name":"BLASTE","text":"I should've known nothing would sway her. All I can do is hope she finds blessed respite in the aetherial sea...and that we may one day be reunited in another life."},{"name":"BLASTE","text":"Until then, I will carry on her legacy, beginning with the naming of the creature she cared for so dearly. I think I shall name it after her. That way, she will live on through her work...forever."}],"reward":{"gil":655},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69961]}},"partials":[{"type":"npc","id":"1037962","obj":{"i":1037962,"n":"Blaste","l":3713,"q":1}},{"type":"quest","id":"69961","obj":{"i":69961,"n":"Their Greatest Contribution","g":11,"l":"Elpis","s":579}}]}