{"quest":{"name":"I Order You to Relax","location":"Elpis","id":69822,"patch":6.0,"sort":4101,"eventIcon":71221,"issuer":1041538,"target":1041538,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>A rather serene observer looks at you with more than a hint of concern."],"objectives":["Speak with the carefree observer.","Do a nice, big /stretch near the carefree observer.","Speak with the serene observer."],"dialogue":[{"name":"CLAMOBSERVER04286","text":"A familiar, and all alone, I see. And look at how thin you are!"},{"name":"CLAMOBSERVER04286","text":"If your remaining aether were to be exhausted, you'd simply fade from existence, and we wouldn't want that, now would we? I suggest you visit the Mourning Dew. You'll find the winds blowing in from Lethe most invigorating!"},{"name":"CLAMOBSERVER04286","text":"Perhaps while you're there, you might seek out a friend of mine, and invite him to share a meal with me. If it's not too much to ask, that is."},{"name":"CLAMOBSERVER04286","text":"The Mourning Dew may sound a rather morbid place, but it's quite pleasant, I assure you."},{"name":"CLAMOBSERVER04286","text":"My friend often goes there only to be lost in a peaceful, dreamlike state. I do wish he'd remember to eat more often, though."},{"name":"BREAKOBSERVER04286","text":"Hmm? What brings you here, O friendly familiar?"},{"name":"BREAKOBSERVER04286","text":"Time for a meal, eh? Ah, yes. Quite right. Thank you for reminding me."},{"name":"BREAKOBSERVER04286","text":"Still, a few more moments here can't hurt, surely?"},{"name":"BREAKOBSERVER04286","text":"I daresay you've noticed how refreshing it is to even stand in this idyllic place. The air itself is permeated with rich aether, and the fine droplets from Lethe ease the aches from a hard day's work. Try a nice, big <span class=\"highlight\">stretch</span>─you won't regret it!"},{"name":"BREAKOBSERVER04286","text":"The best way to experience the healing atmosphere is to take a deep breath and <span class=\"highlight\">stretch</span>!"},{"name":"SYSTEM","text":"The observer looks at you as if to say, “That's a funny-looking <span class=\"highlight\">stretch</span>!”"},{"name":"BREAKOBSERVER04286","text":"See what I mean? The wind through the leaves, the waterfall's soothing spray─there's nothing quite like it!"},{"name":"BREAKOBSERVER04286","text":"In our busy, day-to-day lives, it's all too easy to forget to look after ourselves. Naturally, that includes familiars."},{"name":"BREAKOBSERVER04286","text":"Speaking of which, I'd best get something to eat, as you so kindly came here to tell me. As you seem new to these parts, my friend will probably be wondering whether you've lost your way. Go and put his mind at ease, would you?"},{"name":"CLAMOBSERVER04286","text":"Here to report on the successful completion of the favor I asked of you? How very dutiful of you!"},{"name":"CLAMOBSERVER04286","text":"Would I be correct in guessing your little jaunt has paid dividends? Ha, no need to tell me, I can see you're practically bursting with vim and vigor."},{"name":"CLAMOBSERVER04286","text":"Why, even I feel better just looking at you, and I've done nothing but stand here the entire time!"}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69961]}},"partials":[{"type":"npc","id":"1041538","obj":{"i":1041538,"n":"Serene Observer","l":3713,"q":1}},{"type":"quest","id":"69961","obj":{"i":69961,"n":"Their Greatest Contribution","g":11,"l":"Elpis","s":579}}]}