{"quest":{"name":"Wonder-full","location":"Elpis","id":69829,"patch":6.0,"sort":4170,"eventIcon":71221,"issuer":1037978,"target":1037978,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Despite appearances, Alkmene has a lot on her mind."],"objectives":["Survey flower beds and obtain aetherial masses.","Speak with Alkmene."],"dialogue":[{"name":"ALKMENE","text":"Awww! Awen't you just <span class=\"emphasis\">adowable</span>? Yes, yes you are!"},{"name":"Q1","text":"What will you say?"},{"name":"Q1","text":"Hewwo!"},{"name":"Q1","text":"Can I help you?"},{"name":"Q1","text":"......"},{"name":"ALKMENE","text":"Hee hee! That's what I love about familiars─so whimsical! I have a task that is perfectly suited to one such as yourself."},{"name":"ALKMENE","text":"Hee hee! My apologies, dear─your whimsically diminutive stature misled me. Fortunately, I have a task perfectly suited to an oh-so-grown-up familiar such as yourself."},{"name":"ALKMENE","text":"I would like you to inspect the flower beds north of here. I suspect they will have accumulated some aetherial masses."},{"name":"ALKMENE","text":"Should you find any, please bring them to me. Do look carefully, now─if I needed someone to wander off with the task half-finished, I would have asked one of the other researchers."},{"name":"ALKMENE","text":"Even if you see no aetherial masses at first glance, you must scrutinize the flower beds to make sure. I'm certain you can do it!"},{"name":"SYSTEM","text":"Though you examine the flower bed closely, there are no aetherial masses to be found."},{"name":"SYSTEM","text":"An aetherial mass floats over the flower bed, ripe for the picking. Probably."},{"name":"ALKMENE","text":"Did you scrutinize every corner of the beds?"},{"name":"ALKMENE","text":"As I suspected─masses of earthen aspect."},{"name":"ALKMENE","text":"The gardens of the Twelve Wonders reflect the balance of dynamic and stagnant aether of all six aspects. An excess of activity in a single aspect leads to this type of agglomeration."},{"name":"ALKMENE","text":"'Tis these flowers' way of bearing fruit, so to speak."},{"name":"ALKMENE","text":"Beautiful as that may sound, aetherial masses indicate that we must adjust the aetherial balance in Elpis to maintain an ideal environment."},{"name":"ALKMENE","text":"There's naught for you to worry your dear little head about, of course. Such magic is as simple as breathing for us. Run along, now!"}],"reward":{"gil":655},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69963]}},"partials":[{"type":"npc","id":"1037978","obj":{"i":1037978,"n":"Alkmene","l":3713,"q":1}},{"type":"quest","id":"69963","obj":{"i":69963,"n":"A Sentimental Gift","g":11,"l":"Elpis","s":581}}]}