{"quest":{"name":"Background Research","location":"Elpis","id":69830,"patch":6.0,"sort":4180,"eventIcon":71221,"issuer":1041543,"target":1041543,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The isle designer believes that a little learning is a dangerous thing─though perhaps not for the commonly accepted reasons."],"objectives":["Gather information on poisonous species.","Report to the isle designer."],"dialogue":[{"name":"ELPISCREATOR04294","text":"Fortified enclosures? That would be dreadfully dull for all involved! Oh, if only there were someone who..."},{"name":"ELPISCREATOR04294","text":"Aha! You have impeccable timing, my friend. I am in need of a bit of assistance, you see..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Do you even have any money?"},{"name":"A1","text":"If you insist..."},{"name":"ELPISCREATOR04294","text":"Why, of course I do! Are not all creative minds well compensated for their work?"},{"name":"ELPISCREATOR04294","text":"I assure you that I do."},{"name":"ELPISCREATOR04294","text":"Now listen─we have been asked to design a new island for the purposes of containing and monitoring poisonous specimens. Alas, we know little of such concepts...and last I attempted “a bit of research,” I woke up three days later with far too much information about grypes."},{"name":"ELPISCREATOR04294","text":"You, however, have the look of a familiar that could not possibly care less about this subject. Thus do I require your services─you need only ask the researchers at Anagnorisis for a brief introduction to poisonous creatures, and steadfastly ignore any niggling curiosity in favor of reporting back here."},{"name":"ELPISCREATOR04294","text":"A great <span class=\"emphasis\">bowl</span>, with lips from which to observe? Have you gone mad!? The specimens will roll about like so many olives!"},{"name":"ELPISCREATOR04294","text":"Ahem. Yes, please do make your way to Anagnorisis at your earliest convenience."},{"name":"NIKIAS","text":"Poisonous creatures? Why, there's one right here."},{"name":"NIKIAS","text":"As you can see, its skin is translucent. The body within is, shall we say...<span class=\"emphasis\">squishy</span>."},{"name":"NIKIAS","text":"Fortunately for it, those beautiful, sleeve-like appendages conceal countless minute stinging darts. Most other creatures cannot so much as touch it, let alone devour it."},{"name":"NIKIAS","text":"It would be fascinating to see how it fares against non-aquatic concepts. Oooh, perhaps it could even fly, should a light enough gas be incorporated into the membrane..."},{"name":"SYSTEM","text":"You have learned a disturbing fact about stinging invertebrates!"},{"name":"PARAMONOS","text":"You are soliciting ideas for an isle of poisonous concepts?"},{"name":"PARAMONOS","text":"In that case, you might ask after the new cultivar from the Cthonic Horns. I am told it bears poison fruit."},{"name":"SYSTEM","text":"You learned of a deadly new cultivar!"},{"name":"EUKLEIDES","text":"The quintessential example of a poisonous specimen is the morbol marquis, of course. Never was there a creation so foul, so pungent─hence the name. Indeed, the concept has lately been adjusted to prevent any further...accidents."},{"name":"EUKLEIDES","text":"But the marquis! Oh, the marquis. It blinds the eyes and paralyzes the body, even as the mind desires nothing so much as to vomit continually to purge its stench..."},{"name":"EUKLEIDES","text":"...Why did they ever make that thing?"},{"name":"SYSTEM","text":"You have learned the odoriferous origin of morbols!"},{"name":"NIKIAS","text":"Why so reticent? It's almost as if you don't <span class=\"emphasis\">want</span> to see it thrive outside aquatic environs..."},{"name":"PARAMONOS","text":"Those at the Horns would doubtless be glad to see their work put to good use. That is what we live for, is it not?"},{"name":"EUKLEIDES","text":"I can still smell it..."},{"name":"ELPISCREATOR04294","text":"There you are! I had begun to worry you'd become mired in the minutiae."},{"name":"ELPISCREATOR04294","text":"Three notes─enough to see our options, yet not so many as to lead us into the weeds. Well done!"},{"name":"ELPISCREATOR04294","text":"My, this “marquis” is fascinating, isn't it? How might one contain such a specimen, that it not befoul its environs beyond repair..."},{"name":"ELPISCREATOR04294","text":"I simply must know! Excuse us─we are off to see a man about a morbol."}],"reward":{"gil":655},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69963]}},"partials":[{"type":"npc","id":"1041543","obj":{"i":1041543,"n":"Isle Designer","l":3713,"q":1}},{"type":"quest","id":"69963","obj":{"i":69963,"n":"A Sentimental Gift","g":11,"l":"Elpis","s":581}}]}