{"quest":{"name":"Familiar vs. Familiar","location":"Elpis","id":69836,"patch":6.0,"sort":5140,"eventIcon":71221,"issuer":1041103,"target":1041103,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Erinna is hoping to conduct a test."],"objectives":["Search for and obtain the gamelia bloom using the guiding crystal.","Deliver the gamelia bloom to Erinna."],"dialogue":[{"name":"SYSTEM","text":"Should you choose to undertake this quest, know that guidance from the journal, duty list, and map will be limited. You will need to read the text carefully and decipher the clues to determine your course of action."},{"name":"ERINNA","text":"Can you spare a moment, familiar? I'd like to gauge my own familiar's capabilities against yours."},{"name":"ERINNA","text":"See this one's big, blue eyes? They're especially sensitive to aetherial emissions."},{"name":"ERINNA","text":"As part of my testing, I propose a race between the two of you. I've imbued a gamelia bloom with a unique trace of aether─whoever finds it first is the winner."},{"name":"ERINNA","text":"I suppose it won't be much of a contest unless you can see the aether as well, so I'll lend you a crystal which will allow you to detect its presence."},{"name":"ERINNA","text":"If the flower is nearby when you use it, the crystal will emit a brilliant light. The further you are from your prize, the less dazzling this glow will be."},{"name":"ERINNA","text":"Let me know if you require further instruction. Now, let the competition begin!"},{"name":"SYSTEM","text":"The destination for this objective will not be displayed."},{"name":"SYSTEM","text":"Use your guiding crystal to pinpoint the location of the gamelia bloom."},{"name":"ERINNA","text":"The guiding crystal will react more strongly the closer you are to the flower. Use it as many times as you need to hone in on the bloom's location."},{"name":"SYSTEM","text":"The crystal shines brilliantly. The flower must be nearby."},{"name":"SYSTEM","text":"The crystal glimmers warmly. The flower isn't here, but you may be on the right track."},{"name":"SYSTEM","text":"The crystal twinkles only faintly. Where could that flower be?"},{"name":"SYSTEM","text":"The crystal remains inert. The flower must be elsewhere."},{"name":"SYSTEM","text":"This looks to be the right flower. Bring it back to Erinna."},{"name":"ERINNA","text":"That was certainly quick. Did you really find the bloom already?"},{"name":"ERINNA","text":"Incredible! I've never seen such a talented familiar. Speaking of which, mine seems to have been distracted."},{"name":"ERINNA","text":"I suppose that's only natural, considering its feline traits. But it honestly seems more like a pet than a proper familiar at times..."},{"name":"ERINNA","text":"Well, then, I believe you deserve a reward for your victory─and for your assistance with my testing. Please be sure to convey my gratitude to your master as well. "}],"reward":{"gil":655},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69969]}},"partials":[{"type":"npc","id":"1041103","obj":{"i":1041103,"n":"Erinna","l":3713,"q":1}},{"type":"quest","id":"69969","obj":{"i":69969,"n":"A Flower upon Your Return","g":11,"l":"Elpis","s":587}}]}