{"quest":{"name":"Small Size Advantage","location":"Elpis","id":69832,"patch":6.0,"sort":5101,"eventIcon":71221,"issuer":1042135,"target":1042135,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The combat concept observer has a test to run."],"objectives":["Speak with the combat concept observer.","Defeat the stray lotis.","Speak with the combat concept observer.","Speak with the combat concept observer once more."],"dialogue":[{"name":"OBSERVER04296","text":"You're a familiar, aren't you? Have you any prowess in battle?"},{"name":"OBSERVER04296","text":"Good. I could use your help with something."},{"name":"OBSERVER04296","text":"You see, I was asked to assess a one-eyed giant created as a facility guard, and so pit it against a lotis to test its fighting skills."},{"name":"OBSERVER04296","text":"Not only did the giant fall to a single blow, the lotis went into a frenzy and escaped..."},{"name":"OBSERVER04296","text":"In my opinion, compact familiars like you are far more effective than these overly large brutes, and this is my chance to prove it. Do you think you can handle our runaway combatant?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"So long as there's something in it for me."},{"name":"A1","text":"Fine, I'll help."},{"name":"OBSERVER04296","text":"Of course you'll be well rewarded for your efforts. Our experiment was conducted to the east, so that's as good a place as any to start looking for the lotis."},{"name":"OBSERVER04296","text":"There it is! It would seem the escaped lotis came back of its own accord."},{"name":"OBSERVER04296","text":"They usually feed off their foes to revitalize themselves, and I imagine it hungers after running amok like that."},{"name":"OBSERVER04296","text":"I'll take care of the situation here. The lotis is all yours."},{"name":"OBSERVER04296","text":"Don't worry about me. Just make sure that lotis doesn't cause any more trouble."},{"name":"OBSERVER04296","text":"You certainly made quick work of that lotis. I had a feeling I could count on you."},{"name":"OBSERVER04296","text":"As for the giant, it's far too heavy for us to move. I'll arrange for some broad-backed creations to haul it away after we return to Poieten Oikos."},{"name":"OBSERVER04296","text":"As I suspected, a smaller, more agile concept has far more facility for adapting to combat situations. Thank you for proving my theory."},{"name":"OBSERVER04296","text":"I'll be sure to keep your performance in mind the next time I design a familiar. Your reward, as promised."}],"reward":{"gil":815,"items":[{"num":2,"id":36062}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69966]}},"partials":[{"type":"npc","id":"1042135","obj":{"i":1042135,"n":"Combat Concept Observer","l":3713,"q":1}},{"type":"item","id":"36062","obj":{"i":36062,"n":"Elpis Deipnon","l":560,"c":24356,"t":46}},{"type":"quest","id":"69966","obj":{"i":69966,"n":"A Past, Not Yet Come to Pass","g":11,"l":"Elpis","s":584}}]}