{"quest":{"name":"Searching for Eidos","location":"Elpis","id":69839,"patch":6.0,"sort":5170,"eventIcon":71221,"issuer":1037993,"target":1037993,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Glaukon is concerned about your aether levels."],"objectives":["Use the dispelling concept on suspicious creations to reveal an eidos, then slay it to obtain its slime.","Deliver the glob of slime to Glaukon."],"dialogue":[{"name":"GLAUKON","text":"Those are some low levels of aether you have there... Even for a familiar, that must be awfully inconvenient! What say you assist me with an experiment that could help increase your reserves?"},{"name":"GLAUKON","text":"I need one more ingredient before I can get started. If you could get your hands on a bit of slime from an eidos in the forest, that would be a great help."},{"name":"GLAUKON","text":"They use illusory magicks to mimic the shape of nearby creatures, so it'll be tricky to find one, but not impossible. Keep your eyes peeled for anything acting out of place."},{"name":"GLAUKON","text":"Once you think you've located an eidos, use this crystallized concept to dispel the illusion. It should then be a relatively simple task to defeat the creature and obtain a nice heaping handful of gunk."},{"name":"GLAUKON","text":"Oh, but be warned: if you use the crystal on anything else, it tends to react...violently. Should you make a mistake, there is no shame in beating a hasty retreat."},{"name":"GLAUKON","text":"You still have the crystal, yes? Use it to expose an eidos, and then bring me a healthy dollop of its slime."},{"name":"ANIMALA04303","text":"&lt;gloop&gt; ..."},{"name":"ANIMALB04303","text":"&lt;snort&gt; Hyeee!"},{"name":"ANIMALB04303","text":"Hrnnng... Graaah!"},{"name":"GLAUKON","text":"Back so soon? And with the slime, I hope...?"},{"name":"GLAUKON","text":"If only every familiar were as useful as you! With this, I can make a potion to increase your aether production."},{"name":"GLAUKON","text":"All the other ingredients are in order: hippogryph brain, a monoceros horn, and ophion entrails."},{"name":"GLAUKON","text":"The concoction will supplement any natural deficiencies, relying on the chameleonic properties of the slime to generate aether compatible with your existing aetheric signature. Clever, yes?"},{"name":"GLAUKON","text":"Once this has brewed for a bit, it'll be ready to drink. Oh, this is so exciting! I can hardly wait to see just how <span class=\"emphasis\">explosive</span> the increase to your aether will be."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I just remembered I have something very important to do...very far away!"},{"name":"A1","text":"I think I hear my master calling!"},{"name":"GLAUKON","text":"Oh... I meant to be of service, but it seems I've kept you from your other duties instead. My deepest apologies."},{"name":"GLAUKON","text":"Perhaps you can come back for the potion, but in the meantime, take this for your troubles."}],"reward":{"gil":655},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69969]}},"partials":[{"type":"npc","id":"1037993","obj":{"i":1037993,"n":"Glaukon","l":3713,"q":1}},{"type":"quest","id":"69969","obj":{"i":69969,"n":"A Flower upon Your Return","g":11,"l":"Elpis","s":587}}]}