{"quest":{"name":"What's in a Name?","location":"Elpis","id":69837,"patch":6.0,"sort":5150,"eventIcon":71221,"issuer":1041100,"target":1041100,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Meleagros has a request for you."],"objectives":["Speak with the Akadaemia researchers and obtain the approved concepts.","Deliver the approved concepts to Meleagros."],"dialogue":[{"name":"MELEAGROS","text":"You're a familiar, aren't you? Perfect timing! A pair of researchers are scheduled to arrive today from Amaurot, and I need you to collect their concepts from them."},{"name":"MELEAGROS","text":"We've completed assessments for their creations, you see, and must make preparations to officially register the designs with the Bureau of the Architect."},{"name":"MELEAGROS","text":"Please make sure to also ask for any provisional names they might have for their works."},{"name":"MELEAGROS","text":"I need you to fetch those concepts from the researchers, along with their creations' working names."},{"name":"RESEARCHERA04301","text":"And who might you be?"},{"name":"RESEARCHERA04301","text":"Ah, you're here for my concept. Well, here it is in the flesh!"},{"name":"RESEARCHERA04301","text":"I call it the stone mole. It secretes a fluid that eats through solid rock, giving it the ability to burrow into even the hardest terrain."},{"name":"RESEARCHERA04301","text":"It can also toughen its skin by ingesting the rock it has liquefied. Based upon those traits, I humbly request that it be given a good, strong name."},{"name":"RESEARCHERB04301","text":"Can I help you?"},{"name":"RESEARCHERB04301","text":"Of course, you wish to collect my concept. It's this creature I have with me."},{"name":"RESEARCHERB04301","text":"It doesn't have a proper name, as such. From what I hear, the observers have been calling it Notos-642, a nod to the island it resided on. Right, well I'll trust you to put this in Meleagros's hands."},{"name":"MELEAGROS","text":"You've brought the concepts I asked for?"},{"name":"MELEAGROS","text":"Very good. And did you ask for the provisional names?"},{"name":"MELEAGROS","text":"Hm... The “stone mole” and “Notos-642.” And the mole's creator requested that it have a powerful-sounding name? Some researchers do become quite attached to their creations, don't they?"},{"name":"MELEAGROS","text":"It may seem inconsequential, but the appropriate naming of concepts is of the utmost importance. Allow to me to explain."},{"name":"MELEAGROS","text":"Once it has been determined that a creation is beneficial to the star, we can proceed with registering the creator's design with the Bureau of the Architect."},{"name":"MELEAGROS","text":"First, however, the approved concepts must receive their official names. And as a taxonomist, it is my task to bestow them."},{"name":"MELEAGROS","text":"When naming, one must strive for elegance and simplicity, all the while taking care to adhere to existing conventions and avoid repetition. The more creations we name, the more difficult it becomes to maintain this high standard."},{"name":"MELEAGROS","text":"It is a demanding job, to be certain, but one which I am proud to do. For as long as this purpose guides me, I will fill this world with the most marvelous appellations I can imagine."},{"name":"MELEAGROS","text":"Please, take this in exchange for completing your errand."}],"reward":{"gil":655,"items":[{"num":2,"id":5744,"one":1},{"num":2,"id":5754,"one":1},{"num":2,"id":5761,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69966]}},"partials":[{"type":"npc","id":"1041100","obj":{"i":1041100,"n":"Meleagros","l":3713,"q":1}},{"type":"item","id":"5744","obj":{"i":5744,"n":"Sunset Orange Dye","l":30,"c":22809,"t":55}},{"type":"item","id":"5754","obj":{"i":5754,"n":"Pumpkin Orange Dye","l":30,"c":22809,"t":55}},{"type":"item","id":"5761","obj":{"i":5761,"n":"Loam Brown Dye","l":30,"c":22809,"t":55}},{"type":"quest","id":"69966","obj":{"i":69966,"n":"A Past, Not Yet Come to Pass","g":11,"l":"Elpis","s":584}}]}