{"quest":{"name":"Coming to Gryps","location":"Elpis","id":69831,"patch":6.0,"sort":4190,"eventIcon":71221,"issuer":1041544,"target":1041544,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The mount researcher requires some assistance in testing the gryps's capabilities."],"objectives":["Speak with the mount researcher.","Speak with the mount researcher again."],"dialogue":[{"name":"MOUNTOVSERVER04295","text":"Wh─ Where did you come from!? Get back, quickly!"},{"name":"MOUNTOVSERVER04295","text":"...How odd. Generally speaking, this gryps would sooner gore you than look at you. Did your creator imbue you with a special talent for soothing savage beasts, perchance?"},{"name":"MOUNTOVSERVER04295","text":"Curious indeed... I daresay this calls for further experimentation. I don't suppose you would be willing to attempt a flight on its back?"},{"name":"MOUNTOVSERVER04295","text":"I hope that the gryps will find use as a mount, you see─but its aggression toward unfamiliar faces has precluded any real trials thus far. Please, consider it."},{"name":"MOUNTOVSERVER04295","text":"You are willing to ride the gryps? Splendid! We can begin immediately─assuming you have your preferred riding trousers on."},{"name":"Q1","text":"Are you─and your trousers─ready to ride the gryps?"},{"name":"MOUNTOVSERVER04295","text":"The both of you have wonderfully relaxed riding postures. What say you to a little tour of Elpis?"},{"name":"MOUNTOVSERVER04295","text":"Noetophoreon's beauty is ever striking. Note the blossoms, which change according to Elpis's seasons and aetherial balance. A true masterwork."},{"name":"MOUNTOVSERVER04295","text":"The gryps seems quite content. A result of the flowers' sweet perfume and your masterful handling, no doubt."},{"name":"MOUNTOVSERVER04295","text":"These beacons are crucial to our operations here in Elpis─and make convenient lodestars for flying specimens under observation. Successful concepts sight them from a distance, and can approach without hesitation."},{"name":"MOUNTOVSERVER04295","text":"The gryps has passed that test with flying colors, so let us return to solid ground."},{"name":"MOUNTOVSERVER04295","text":"An elegant landing! Another mark in favor of the gryps's utility as a mount."},{"name":"MOUNTOVSERVER04295","text":"I believe I have the data I need. Thank you for your cooperation."},{"name":"MOUNTOVSERVER04295","text":"I'm sure you are curious as to what today's trial means for our friend here. If you like, we can speak further back at the Wonders."},{"name":"MOUNTOVSERVER04295","text":"Welcome back. You will be pleased to know that based on these results, I am confident the gryps can be trained to become the perfect mount. It scorns unfamiliar or clumsy hands, yes, but so long as it trusts its rider, it serves <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> incomparably."},{"name":"MOUNTOVSERVER04295","text":"Given Hermes's own expertise, flying creatures are always subject to immense scrutiny before approval. Even so, I have no doubt that our proud friend will pass muster."}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69963]}},"partials":[{"type":"npc","id":"1041544","obj":{"i":1041544,"n":"Mount Researcher","l":3713,"q":1}},{"type":"quest","id":"69963","obj":{"i":69963,"n":"A Sentimental Gift","g":11,"l":"Elpis","s":581}}]}