{"quest":{"name":"Siren Flower","location":"Elpis","id":69838,"patch":6.0,"sort":5160,"eventIcon":71221,"issuer":1040867,"target":1040867,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>A familiar aficionado at Poieten Oikos is most interested in meeting you."],"objectives":["Speak with the familiar aficionado.","Touch the undersized Orpheus songflower.","Touch the Orpheus songflower.","Touch the overgrown Orpheus songflower.","Speak with the familiar aficionado.","Speak with the familiar aficionado again."],"dialogue":[{"name":"LOVER04302","text":"A rather unusual familiar, aren't you?"},{"name":"LOVER04302","text":"I haven't seen your concept on file at the Bureau of the Architect, and I've never come across anything like you in all my years of research."},{"name":"LOVER04302","text":"You're Azem's familiar? Well, that certainly explains it! <span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> creations are truly something else."},{"name":"LOVER04302","text":"I'm even more intrigued now. Would you mind if I observed you for a time? I'll make it worth your while, of course."},{"name":"LOVER04302","text":"Fantastic! I can hardly wait to get started...but not here."},{"name":"LOVER04302","text":"The study I'd like to conduct requires we relocate to the west a ways. Please come and join me when you're ready!"},{"name":"LOVER04302","text":"Thank you so much for coming. Now, let's get straight to business."},{"name":"LOVER04302","text":"All you need to do is reach out and touch some Orpheus songflowers. They're pretty blooms, light blue in color, and they emit these, well, “bubbles” which enthrall any overly curious creatures. Think of it as a defensive mechanism."},{"name":"LOVER04302","text":"It has no effect on sapient beings such as myself, but I'm fascinated to know how it will affect you."},{"name":"LOVER04302","text":"Fear not─I will be sure to intervene should you begin to fall under its spell! I would never leave a familiar to such a fate, and especially not a familiar created by Azem!"},{"name":"LOVER04302","text":"Now, I've created three flowers of varying sizes and potencies. We'll begin with the smallest and weakest."},{"name":"LOVER04302","text":"Oh, I may be able to protect you from the flower itself, but if any nearby beasts are already under its influence, I'm afraid you'll have to be the one to protect me. Fighting was never my forte..."},{"name":"SYSTEM","text":"Escort the familiar aficionado to the flower. Should you fail to defend him, or move too far away, he will return to the starting position, where you may rendezvous with him before trying again."},{"name":"BALLOON","text":"Let's be off!"},{"name":"BALLOON","text":"Urgh..."},{"name":"LOVER04302","text":"There you are! Shall we be off to the flower, then?"},{"name":"SYSTEM","text":"You have failed to successfully escort the familiar aficionado to the flower. Return to the starting point and speak with him to begin once more."},{"name":"SYSTEM","text":"You have lost sight of the familiar aficionado. Retrace your steps to find them, then escort them safely to the flower."},{"name":"SYSTEM","text":"You touch the flower. It doesn't seem to affect you."},{"name":"FLOWERA04302","text":"(-Familiar Aficionado-)Hm. No reaction. Interesting. Let's try a more powerful one, shall we?"},{"name":"SYSTEM","text":"You touch the flower. You don't feel any different."},{"name":"FLOWERB04302","text":"(-Familiar Aficionado-)Still nothing? Well, let's see how you fare against an exceptionally large one."},{"name":"SYSTEM","text":"You touch the flower. Nothing happens."},{"name":"LOVER04302","text":"Incredible. Even a flower this size has no effect on you whatsoever. I thought for sure you would be enthralled."},{"name":"LOVER04302","text":"Considering the sparse nature of your aether, it simply doesn't make sense. Azem must possess some mastery which eludes me."},{"name":"LOVER04302","text":"In any case, that ends our experiment. I'll dissolve these blooms and meet you back at Poieten Oikos."},{"name":"LOVER04302","text":"Thank you for lending me your time. It was most enlightening."},{"name":"LOVER04302","text":"Not to mention perplexing. You have so little aether, yet something keeps you resistant to outside influence. Your physical constitution, perhaps? It's something to consider when creating familiars in the future, at least."},{"name":"LOVER04302","text":"I promised you a reward, didn't I? Here you go. Now if you'll excuse me, I have some data analysis and concept planning to do."}],"reward":{"gil":975},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69969]}},"partials":[{"type":"npc","id":"1040867","obj":{"i":1040867,"n":"Familiar Aficionado","l":3713,"q":1}},{"type":"quest","id":"69969","obj":{"i":69969,"n":"A Flower upon Your Return","g":11,"l":"Elpis","s":587}}]}