{"quest":{"name":"Take to the Skies","location":"Elpis","id":69833,"patch":6.0,"sort":5110,"eventIcon":71221,"issuer":1041545,"target":1041545,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The eccentric creator has a request for Azem's familiar."],"objectives":["Use fine aetheric rope to capture restless plants.","Deliver the bound plants to the eccentric creator."],"dialogue":[{"name":"STAFF04297","text":"You must be Azem's familiar. I had a favor to ask of the observers here, but seeing as they all seem awfully preoccupied, perhaps I can ask you instead."},{"name":"STAFF04297","text":"I'm experimenting with crossbreeding different types of plants. I was thrilled when I finally produced a whole new species...right up until the point where they rose up and floated away."},{"name":"STAFF04297","text":"Last I saw of them, they were headed toward the eastern side of the island. I managed to wrangle a goodly number, but there are still eight or so missing. Could you help me recapture them?"},{"name":"STAFF04297","text":"Thank you. Here, use this aetheric rope to capture say, four of them, and I can hopefully handle the rest."},{"name":"STAFF04297","text":"Did you catch the plants?"},{"name":"STAFF04297","text":"Thank goodness for that, though I'd expect no less from Azem's familiar. I rounded up my half as well, which means they're all back safe and sound."},{"name":"STAFF04297","text":"They're part yggdreant, you see. It's no surprise they inherited the eyes, but having them wander off on their own was rather unexpected."},{"name":"STAFF04297","text":"To tell the truth, I never really had a specific use in mind for them. I suppose I'd best start thinking about that... The Bureau of the Architect won't be impressed with my new creation unless it serves a purpose."},{"name":"STAFF04297","text":"With that in mind, I believe there's research to be done. Thank you for your help, and do pass on my regards to Azem."}],"reward":{"gil":655,"items":[{"num":2,"id":36052}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69969]}},"partials":[{"type":"npc","id":"1041545","obj":{"i":1041545,"n":"Eccentric Creator","l":3713,"q":1}},{"type":"item","id":"36052","obj":{"i":36052,"n":"Skyr","l":539,"c":25056,"t":46}},{"type":"quest","id":"69969","obj":{"i":69969,"n":"A Flower upon Your Return","g":11,"l":"Elpis","s":587}}]}