{"quest":{"name":"To Name a Tale","location":"Elpis","id":69840,"patch":6.0,"sort":5180,"eventIcon":71221,"issuer":1041833,"target":1041833,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>A troubled taxonomist is having second thoughts."],"objectives":["Show the yellow pansy concept to people around Poieten Oikos and ask their opinions.","Deliver the Ktisis Hyperboreia guidebook and the yellow pansy concept to the troubled taxonomist."],"dialogue":[{"name":"NAMER04304","text":"Perfect timing, familiar. I have a favor to ask of you."},{"name":"NAMER04304","text":"It's my job to name the creations brought to us, but I can't seem to decide on one for this particular concept."},{"name":"NAMER04304","text":"It may be because...I'm the one who designed it. It's a species of plant which I intended as a gift for my love. A clear conflict of interest, unfortunately."},{"name":"NAMER04304","text":"My names are always fair and logical and perfectly suited to the creation. But this time, I'm not so sure. I do have a name for it, but what if it's...not suitable? What if it's too personal?"},{"name":"NAMER04304","text":"I thought of discussing the matter with my associates, but my dilemma is far too embarrassing. Would you ask if they think the name is appropriate in my stead? Don't worry─I wouldn't expect you to work without recompense."},{"name":"NAMER04304","text":"This is the creation. A yellow pansy. And the name I have in mind is “mythos.” "},{"name":"NAMER04304","text":"Please ask around and see what people think of the name of my new flower."},{"name":"LAMPITO","text":"Yes, what is it?"},{"name":"LAMPITO","text":"My, what a pretty flower. And you said it was called “mythos”? A fine name."},{"name":"LAMPITO","text":"Many flowers are named with a special feeling in mind, so going by what you've told me, this one is in good company."},{"name":"GLAPHYRA","text":"A familiar? Do you need something?"},{"name":"GLAPHYRA","text":"A flower? It's beautiful! And it smells so lovely. Is it for me?"},{"name":"GLAPHYRA","text":"...Oh. You just want to know if the name is suitable, do you?"},{"name":"GLAPHYRA","text":"Have you tried asking at Ktisis Hyperboreia? No one knows as much about naming as them."},{"name":"GLAPHYRA","text":"Here's a guidebook on the subject. Take it with you, and let your master decide what to do from there."},{"name":"LAMPITO","text":"That flower was clearly named with love. I think it's wonderful."},{"name":"GLAPHYRA","text":"Take that guidebook to your master and see if they want to confer with one of the experts at Ktisis."},{"name":"NAMER04304","text":"How did it go? What did everyone think of the name?"},{"name":"NAMER04304","text":"I see... Well, that is good to know. I won't be needing this guidebook, of course, as I can't very well ask myself for my thoughts."},{"name":"NAMER04304","text":"Or perhaps I should. It wouldn't hurt to have some confidence in the work I do, after all."},{"name":"NAMER04304","text":"As I created this flower, I thought of my beloved, an artist, and the stories she seeks to tell through her plays."},{"name":"NAMER04304","text":"My hope is that, much like a myth or legend, her work is told and retold down through the ages. Hence, “mythos.”"},{"name":"NAMER04304","text":"I've decided. I'll keep the name and submit it to the Bureau of the Architect. Thank you for your help."}],"reward":{"gil":655},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69966]}},"partials":[{"type":"npc","id":"1041833","obj":{"i":1041833,"n":"Troubled Taxonomist","l":3713,"q":1}},{"type":"quest","id":"69966","obj":{"i":69966,"n":"A Past, Not Yet Come to Pass","g":11,"l":"Elpis","s":584}}]}