{"quest":{"name":"A Most Succulent Name","location":"Elpis","id":69848,"patch":6.0,"sort":6160,"eventIcon":71221,"issuer":1041841,"target":1041841,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The priggish taxonomist is desperately hoping for inspiration to strike."],"objectives":["Speak with the priggish taxonomist at the base of the large tree to the south.","/think at the base of the large tree.","Speak with the priggish taxonomist at a waterfall to the west.","/think with Euros 310.","Speak with the priggish taxonomist."],"dialogue":[{"name":"EUROS310","text":"!!!"},{"name":"SYSTEM","text":"A creature bearing an uncanny resemblance to a cactuar appears to be in fine spirits."},{"name":"DENOMINATOR04312","text":"A name, a name... I need a name for it─one that will stand the test of time as it passes through generation after generation! When you break it down, what's in a name, really? "},{"name":"DENOMINATOR04312","text":"Oh, hello. I didn't see you there. You're a familiar, I take it? Very good. But whose, I wonder...? Well, that's not important right now. You've ears enough to listen to my plight."},{"name":"DENOMINATOR04312","text":"I'm tasked with a job of great import: nomenclature. Currently, I find myself facing down a sort of creative blockage in regards to this fellow's name."},{"name":"DENOMINATOR04312","text":"This is a creature who has not only survived the vicious wilds of the Hungering Gardens, but has thrived in them thanks to its ossified spines. Thus it deserves a name befitting its rugged tenacity."},{"name":"DENOMINATOR04312","text":"Despite its singularly unique physical properties, its creator never bothered to refer to it as anything besides its designation: Euros 310. I cannot abide so uninspired a name for a creation as remarkable as this."},{"name":"DENOMINATOR04312","text":"But therein lies the rub─for all its captivating qualities, I've yet to hit upon a captivating name. I was just on my way to take a turn about the grounds to stimulate the creative juices, so to speak, but seeing you, I realize two heads may be better than one. "},{"name":"DENOMINATOR04312","text":"So, what do you say? Would you care to join me in my walk?"},{"name":"Q1","text":"Will you join the taxonomist?"},{"name":"A1","text":"Sure."},{"name":"A1","text":"No, thank you."},{"name":"DENOMINATOR04312","text":"Excellent. You, my quick-witted familiar friend, will be a boon indeed to my imagination. What say we take a quiet moment to cogitate beneath that large tree to the south of here?"},{"name":"DENOMINATOR04312","text":"That is a pity indeed. Well, should you change your mind, do speak to me again, won't you? I reckon I shall be laboring over this conundrum for quite some time."},{"name":"EUROS310","text":"...!"},{"name":"DENOMINATOR04312","text":"Is not the sun-dappled forest floor a stunning sight? Is not the breeze so bracing as to lift the spirits? Is not the susurrus of the melanioi's whiskers so pleasant as to induce great thoughts?"},{"name":"DENOMINATOR04312","text":"Surely, with all the inspiration that surrounds us, you have been stirred into contemplation, too. Tell me, what is it you now focus so squarely upon?  "},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"The innumerable tasks that sit waiting to be done."},{"name":"A2","text":"Nothing that I can tell you about, I'm afraid."},{"name":"DENOMINATOR04312","text":"So, even familiars have their fair share of woes. Might I suggest you take this moment to relax, then? Simply let the winds wash over you, the rustle of the leaves play in your ears, and just...<span class=\"highlight\">think</span>."},{"name":"DENOMINATOR04312","text":"Unburden yourself of the troubles that seem to be weighing you down. Allow yourself to just be for a moment─to just <span class=\"highlight\">think</span>."},{"name":"EUROS310","text":"...!?"},{"name":"SYSTEM","text":"Euros 310 does as the taxonomist does, and falls into what appears to be deep, meditative thought."},{"name":"SYSTEM","text":"Beneath the canopy of rustling leaves, time moves as if caught in treacle, providing you the perfect location to <span class=\"highlight\">think</span> great thoughts. "},{"name":"SYSTEM","text":"For a time, all you can hear is the breeze, like a calming whisper in your ears... All of a sudden, a groan invades your peace of mind."},{"name":"DENOMINATOR04312","text":"Hmmm... <span class=\"emphasis\">Hmmmmmm</span>... Created to survive in extreme weather conditions, whose adaptability is second to none... What would be a name suitable for such a creature?"},{"name":"DENOMINATOR04312","text":"I can practically feel genius on the tip of my tongue, and yet...nothing comes. Oh bother, this won't do, now will it? I hate to ask, but would you accompany me awhile longer? Come, let's away to a westerly waterfall."},{"name":"EUROS310","text":"!!!"},{"name":"SYSTEM","text":"Euros 310 seems to be enjoying the misty spray from the falls."},{"name":"DENOMINATOR04312","text":"Ah, listen close. Can you hear it? A waterfall whose stream is at once ferocious and tender, whose spray kisses its surroundings in an affectionate pitter-patter? Inspiring indeed, and like to give rise to brilliance!"},{"name":"DENOMINATOR04312","text":"Yes, there is no place more perfect for the cogitation of this creature's name. Come. Stand with me and let us <span class=\"highlight\">think</span> on it."},{"name":"DENOMINATOR04312","text":"Is this not an inspiring location? I'm certain we shall arrive at a befitting name for little Euros 310 here. Now let us take a moment or two to <span class=\"highlight\">think</span> so that we might draw inspiration from our surroundings."},{"name":"EUROS310","text":"!"},{"name":"SYSTEM","text":"Water droplets gleam like sun-kissed jewels on Euros 310's well-hydrated skin. You wager that were you to <span class=\"highlight\">think</span> about it now, you might be able to come up with a name."},{"name":"EUROS310","text":"...!"},{"name":"SYSTEM","text":"Euros 310's beady eyes appear to scan its surroundings."},{"name":"DENOMINATOR04312","text":"It is a creature that bears a strong resemblance to a plant... So, perhaps, Planticus? Hm, it's also a deal similar to a succulent... A<span class=\"emphasis\">ha</span>! I've got it! Succulem! ...Oh goodness gracious, no. That's just foul."},{"name":"DENOMINATOR04312","text":"I am afraid I am quite at a loss for names beyond the paltry few I've offered. Perhaps you could provide a fresh perspective? What is it you find most endearing about this creation?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Its sleek green skin."},{"name":"A3","text":"Its beady eyes."},{"name":"A3","text":"Its spiky head."},{"name":"DENOMINATOR04312","text":"&lt;gasp&gt; Oh, that did the trick. Your astute observational skills have stirred my imagination, for I've come up with a very worthy name!"},{"name":"DENOMINATOR04312","text":"I must return to Poieten Oikos at once, and ensure that no other creation shares this nomenclature. You will not be too far behind, yes? You are due a suitable gift for the help you've provided, after all."},{"name":"EUROS310","text":"...!!!"},{"name":"DENOMINATOR04312","text":"I must say I greatly enjoyed our time together. I believe nothing cultivates creativity quite like the sharing of ideas. So often I am forced to work alone, and though it pains me to admit this, it's not much fun to ponder in the silence of one's own company. "},{"name":"DENOMINATOR04312","text":"In fact, I credit you for the name I devised. All that remains now is to go to Peripeteia Krystalline, ensure there is no record of any similarly named creation, and appoint Euros 310 with its official name."},{"name":"DENOMINATOR04312","text":"And should I hit another metaphorical roadblock, I shall remember to always ponder while perambulating! Thank you again for your help in this matter. It was most appreciated."}],"reward":{"gil":895},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69967]}},"partials":[{"type":"npc","id":"1041841","obj":{"i":1041841,"n":"Priggish Taxonomist","l":3713,"q":1}},{"type":"quest","id":"69967","obj":{"i":69967,"n":"Witness to the Spectacle","g":11,"l":"Elpis","s":585}}]}