{"quest":{"name":"Meaningful Measurements","location":"Elpis","id":69841,"patch":6.0,"sort":5190,"eventIcon":71221,"issuer":1041834,"target":1041834,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>An isle surveyor is searching for an assistant."],"objectives":["Speak with the isle surveyor.","Use the destructive magick concept on the rocky outcrop.","Retrieve the ore fragments.","Deliver the ore fragments to the isle surveyor.","Speak with the isle surveyor."],"dialogue":[{"name":"TECHNICIAN04305","text":"Would you assist me, familiar?"},{"name":"TECHNICIAN04305","text":"As I'm sure you are aware, the floating islands of Elpis were created to provide suitable habitats for our various creations."},{"name":"TECHNICIAN04305","text":"In order to maintain their respective environments, however, surveyors such as myself must make regular assessments of their aetherial composition."},{"name":"TECHNICIAN04305","text":"To that end, I was planning to take samples from the melanion habitat with my partner, but it seems he had an urgent engagement. Something about an unscheduled meeting with a member of the Convocation of Fourteen..."},{"name":"TECHNICIAN04305","text":"Though I'm now faced with handling this rather grueling task alone, waiting until he returns is simply not an option. As I said, it's important to gather data at regular, specific intervals."},{"name":"TECHNICIAN04305","text":"And thus am I requesting your help. So, what say you? Would you be willing to accompany me in place of my partner?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Certainly."},{"name":"A1","text":"I don't know..."},{"name":"TECHNICIAN04305","text":"Many thanks! I'll be sure to reward you for your efforts."},{"name":"TECHNICIAN04305","text":"Please! I'll make it worth your while. The samples <span class=\"emphasis\">must</span> be taken at the right time! "},{"name":"TECHNICIAN04305","text":"Right, let's hurry along, then. We'll need to make our way to the south."},{"name":"TECHNICIAN04305","text":"The rocks in this area contain ores that can tell us about the environmental aether. We'll have to break them apart with destructive magicks to collect the necessary samples."},{"name":"TECHNICIAN04305","text":"You may find that difficult with your inherent...limitations, but I have a little something to help with that."},{"name":"TECHNICIAN04305","text":"Here, use this concept crystal to shatter an outcrop of rock, then bring any ore fragments back to me."},{"name":"TECHNICIAN04305","text":"Start in the east, if you would. I'll start working elsewhere, and we can meet back here."},{"name":"TECHNICIAN04305","text":"How did you fare?"},{"name":"TECHNICIAN04305","text":"Excellent. This should give me all the information I need. Let's head back, shall we?"},{"name":"TECHNICIAN04305","text":"Thank you. Without your aid, I wouldn't have been able to properly observe how the introduction of melanioi has affected their habitat's aether."},{"name":"TECHNICIAN04305","text":"It's important to keep careful track of the environments here to make any necessary adjustments."},{"name":"TECHNICIAN04305","text":"The terrain, the flora, everything that makes up the habitat must be meticulously controlled to fit each subject under observation."},{"name":"TECHNICIAN04305","text":"Though I applaud my partner's enthusiasm for learning at the foot of a Convocation member, we cannot neglect these fundamental─albeit tedious─facets of our work."}],"reward":{"gil":895},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69966]}},"partials":[{"type":"npc","id":"1041834","obj":{"i":1041834,"n":"Isle Surveyor","l":3713,"q":1}},{"type":"quest","id":"69966","obj":{"i":69966,"n":"A Past, Not Yet Come to Pass","g":11,"l":"Elpis","s":584}}]}