{"quest":{"name":"Very Familiar Carrots","location":"Elpis","id":69846,"patch":6.0,"sort":6140,"eventIcon":71221,"issuer":1037999,"target":1037999,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Rhodopis is harboring a great deal of worry for a colleague who has wandered off."],"objectives":["Find the long-haired observer and slay any creations attacking him.","Rescue the long-haired observer.","Render aid to the rabbit familiar.","Collect the dazzling carrot.","Deliver the dazzling carrot to the long-haired observer.","Report to Rhodopis."],"dialogue":[{"name":"RHODOPIS","text":"Oh dear, I'm starting to worry some. It's my colleague, you see. We heard this horrid screech from a melanion, and he went rushing off to check what all the fuss was about. I was thinking of following after him, but... Well, just look at me."},{"name":"RHODOPIS","text":"You, however, appear well versed in combat and all such sanguinary escapades. Perhaps you might see if aught is amiss and ensure my coworker hasn't come to any harm?"},{"name":"RHODOPIS","text":"That's very kind of you to agree to such a request. The last I saw of him, he was racing for the southern end of Kallimelios Zephyros. Do promise to hurry. I'm half-afraid he has wound up on the wrong side of some nasty fiends' fangs."},{"name":"RHODOPIS","text":"I'm sure you've pressing matters to attend to, but if you could locate my missing colleague, I would be most grateful. I only pray that you find him in one piece!"},{"name":"BUNNY04310","text":"&lt;squeak&gt; &lt;squeak&gt;"},{"name":"LONGHAIROBSERVER04310","text":"&lt;sigh&gt; ...That was much too close for my liking. Your timing was truly immaculate. I was quite trapped and would have been gobbled up if not for your timely interference! "},{"name":"LONGHAIROBSERVER04310","text":"It was the agitated cries of the melanion which brought me here. When I arrived to see what inspired such howling, I discovered this fellow being set upon by that raging creature. I didn't hesitate to insert myself into the fray, of course."},{"name":"LONGHAIROBSERVER04310","text":"I should be fine, but it's the familiar for whom I'm most concerned. Could you make sure it's unharmed?"},{"name":"LONGHAIROBSERVER04310","text":"Your intervention was a most welcome one, I assure you. I would be halfway digested by now if not for your help! Though I hate to ask, perhaps you might examine that familiar? I worry it's injured."},{"name":"BUNNY04310","text":"&lt;sniff&gt; &lt;squeak&gt;♪"},{"name":"SYSTEM","text":"The familiar appears free of any injuries, scrapes, or bruises, and has left behind a dazzling carrot, as if to say thank you. Deliver the carrot to the long-haired observer."},{"name":"LONGHAIROBSERVER04310","text":"How is the familiar? Are they unharmed?"},{"name":"LONGHAIROBSERVER04310","text":"A relief to know they are not too severely injured. Oh my─ What is that?"},{"name":"LONGHAIROBSERVER04310","text":"You say the creature left it behind?"},{"name":"LONGHAIROBSERVER04310","text":"A striking color for a carrot, wouldn't you say? Perhaps this was its way of showing its gratitude. What a thoughtful creature..."},{"name":"LONGHAIROBSERVER04310","text":"...And one I've never seen before. Whose familiar could it be, I wonder? I will perform an investigation upon my return."},{"name":"LONGHAIROBSERVER04310","text":"Now then, shall we head back to Poieten Oikos? I'm in a rather sorry state and would like to get cleaned up as soon as possible."},{"name":"RHODOPIS","text":"How very good it is to see you again. My friend─the one whom you plucked from the jaws of death itself─is seeking treatment for his wounds as we speak."},{"name":"RHODOPIS","text":"I heard the entire tale─how a rabbit familiar was on the scene. Mistress Venat was said to be researching one such familiar, or that's the story, anyway. Perhaps the one you came across is related to that business?"},{"name":"RHODOPIS","text":"Well, regardless of its origins, it sounded like a rather polite creature, as I was told it left behind a sort of gift."},{"name":"RHODOPIS","text":"Yet I shan't be outdone by a bunny, charming though it surely is. Here you are: a present. It's nothing special, but I hope it proves as scrumptious as the carrot our mysterious familiar bestowed upon you and my colleague."}],"reward":{"gil":895,"items":[{"num":2,"id":36058}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69967]}},"partials":[{"type":"npc","id":"1037999","obj":{"i":1037999,"n":"Rhodopis","l":3713,"q":1}},{"type":"item","id":"36058","obj":{"i":36058,"n":"The Noodles of Elpis","l":545,"c":24019,"t":46}},{"type":"quest","id":"69967","obj":{"i":69967,"n":"Witness to the Spectacle","g":11,"l":"Elpis","s":585}}]}