{"quest":{"name":"Flight of the Charybdis","location":"Elpis","id":69847,"patch":6.0,"sort":6150,"eventIcon":71221,"issuer":1041839,"target":1041839,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The frazzled researcher seeks help in chasing down a missing creature."],"objectives":["Capture the charybdis at Peripeteia Krystalline.","Deliver the captured charybdis to the frazzled researcher."],"dialogue":[{"name":"HURRYOBSERVER04311","text":"You there! Please, it is most urgent. A colleague of mine in Philomythes Notos has just sent word of a most disturbing nature."},{"name":"HURRYOBSERVER04311","text":"A blue charybdis was practicing its flying, but became separated from its fellows. From what I gathered, based on my friend's manic message, it was last seen taking wing to Peripeteia Krystalline."},{"name":"HURRYOBSERVER04311","text":"We are all of us searching far and wide, but could you look in the direction of Peripeteia Krystalline? Your help will not go unrewarded, I can assure you of that."},{"name":"HURRYOBSERVER04311","text":"Oh, thank you! Between us, we ought to be able to locate this lost creature."},{"name":"HURRYOBSERVER04311","text":"You should know that charybdises have a penchant for heights, so I will scan the skies around here. I leave the upper floors of Peripeteia Krystalline to you."},{"name":"HURRYOBSERVER04311","text":"If you do happen to find the creature I spoke of, use this aetheric rope to bind it. Ah, not to worry: the bindings cause no injury or pain. Good luck, and I shall see you soon."},{"name":"SYSTEM","text":"There is no sign of the charybdis."},{"name":"SYSTEM","text":"The charybdis is nowhere to be seen..."},{"name":"SYSTEM","text":"Now that you've captured the injured charybdis, return to Poieten Oikos and deliver your winged captive to the frazzled researcher."},{"name":"HURRYOBSERVER04311","text":"I saw that you were on your way back, and hastened to return as well. So, what news? Have you found that blue charybdis?"},{"name":"HURRYOBSERVER04311","text":"Oh, a great relief indeed! It's rather impressive it hasn't suffered any truly grievous injuries...and more impressive still that it was able to fly as far as Peripeteia Krystalline."},{"name":"HURRYOBSERVER04311","text":"It had only begun to practice the art of flight recently, as I understand it. Who would have thought it could cross such a distance with wings still so inexperienced? No doubt credit for this ought go to Emet-Selch and his helpful instruction."},{"name":"HURRYOBSERVER04311","text":"Well, I for one cannot wait to see the charybdis take to the skies from its perch. "},{"name":"HURRYOBSERVER04311","text":"At any rate, I will see this creature returned to Anagnorisis at once. Though it isn't much, considering the services you've rendered, I hope it's not too lowly a prize for you."}],"reward":{"gil":655},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69969]}},"partials":[{"type":"npc","id":"1041839","obj":{"i":1041839,"n":"Frazzled Researcher","l":3713,"q":1}},{"type":"quest","id":"69969","obj":{"i":69969,"n":"A Flower upon Your Return","g":11,"l":"Elpis","s":587}}]}