{"quest":{"name":"Rolling Bryons Gather No Moss","location":"Elpis","id":69845,"patch":6.0,"sort":6130,"eventIcon":71221,"issuer":1037990,"target":1037990,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Euaion is fretting over a runaway creation."],"objectives":["Use the drying agent on the overgrown bryon, subdue it, and capture it with the lengthy aetheric rope.","Deliver the captured bryon to Euaion."],"dialogue":[{"name":"EUAION","text":"Excuse me, but have you a moment? I'm in search of a runaway creation, and need an extra set of hands to assist in its apprehension."},{"name":"EUAION","text":"I had been keeping such a close watch on the thing and it had been so well-behaved, I thought I could rest my eyes for a second. When I looked up, though─ <span class=\"emphasis\">Poof</span>. Gone. Just like that. Please, won't you help me find it? I'll make it worth your while, I promise."},{"name":"EUAION","text":"Oh, thank you! I'll continue to search in this vicinity, though it's likely the creature scampered off farther afield. While I scour the area here, might you explore the eastern end of Rumination's Ramble?"},{"name":"EUAION","text":"Oh, yes─ I should probably tell you about the creature we're looking for. We call it a bryon, a seedkin that bears a passing resemblance to a moss bloom. It will wither and perish without water...or become an overgrown monstrosity with too much! Keeping it hydrated is a delicate balancing act."},{"name":"EUAION","text":"If the creature has fallen into a river, it will be─suffice to say─too big to carry on one's own. Should you find it submerged in a body of water, try to remove as much moisture as you can. That ought to shrink it somewhat."},{"name":"EUAION","text":"Use this drying agent on it to drain the sodden sop. If it begins to rave at you or act in any way rampageous, subdue it and capture it with this aetheric rope."},{"name":"EUAION","text":"Let's hope that you won't have to use the drying agent, but to be perfectly frank, the creature is rather fond of water. Like as not, the bryon has thrown itself straight into a river or pond... Best be prepared for a fight."},{"name":"SYSTEM","text":"You've spotted an overgrown creation resembling a korpokkur, and is likely the bryon you are in search of. Use the drying agent to remove some of its excess moisture."},{"name":"POPMESSAGE","text":"The creation has begun to rave and reel!"},{"name":"EUAION","text":"Nothing in my neck of the woods, I'm sorry to report. Did you have any luck?"},{"name":"EUAION","text":"You've found it! And just as I suspected, thrashing about in Rumination's Ramble. Naughty thing. So you had to subdue it, I take it? Goodness, it certainly put you through the mill. At least you do not seem <span class=\"emphasis\">too</span> badly wounded─and nor does it."},{"name":"EUAION","text":"The bryon has the remarkable ability to predict precipitation and rainfall─if you see it shaking its leaves, you know the rain's on its way. It's why we created it in the first place, to provide those in the wetlands a method by which they might prepare for sudden storms."},{"name":"EUAION","text":"Unfortunately, as we have discovered, it becomes absolutely enormous when exposed to liquid in large quantities, rendering them rather dangerous in humid areas. Oh well, back to the drawing board."},{"name":"EUAION","text":"At any rate, thank you for locating this little rascal─or rather, <span class=\"emphasis\">large</span> rascal as the case may be. I know not whose familiar you are, but you were a tremendous help. Here, for your pains."}],"reward":{"gil":655},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69969]}},"partials":[{"type":"npc","id":"1037990","obj":{"i":1037990,"n":"Euaion","l":3713,"q":1}},{"type":"quest","id":"69969","obj":{"i":69969,"n":"A Flower upon Your Return","g":11,"l":"Elpis","s":587}}]}