{"quest":{"name":"The Abyss Stares Back","location":"Elpis","id":69844,"patch":6.0,"sort":6120,"eventIcon":71221,"issuer":1041101,"target":1041101,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Perikles is in need of a temporary research assistant."],"objectives":["Speak with the avian specialist.","/pet the abyssus.","/poke the abyssus.","/hug the abyssus.","Speak with Perikles."],"dialogue":[{"name":"PERIKLES","text":"Hm. Still no reaction... What exactly are we supposed to try now?"},{"name":"PERIKLES","text":"Ah, perfect. A familiar. I'm on the observation team for a new kind of bird, and it's giving us some trouble."},{"name":"PERIKLES","text":"It won't move or react at all no matter what anyone does to it. Could <span class=\"emphasis\">you</span> maybe give it a try?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I bet I can get a reaction."},{"name":"A1","text":"I'd rather not..."},{"name":"PERIKLES","text":"I certainly hope so! And I've got something for you if you succeed."},{"name":"PERIKLES","text":"Is something the matter? I'll throw in a reward, so please, just do your best."},{"name":"PERIKLES","text":"We have a specialist in avian species working with the creation in question, and he can help you with the particulars. You'll find them by the towering structure northeast of our settlement here."},{"name":"PERIKLES","text":"Please, go and speak with the avian specialist by the northeast tower. Surely that bird will react to <span class=\"emphasis\">someone</span>..."},{"name":"SYSTEM","text":"The bird bears an uncanny resemblance to a shoebill. It doesn't acknowledge your existence."},{"name":"BIRDWATCHER04308","text":"You were sent to help us get this fellow's attention, yes? Then let's get you two acquainted."},{"name":"BIRDWATCHER04308","text":"This here is an abyssus─so named for the way it seems to just...stare off into the abyss. One of our colleagues found it perched on a melanion's antler, and brought it in for closer study."},{"name":"BIRDWATCHER04308","text":"And that's everything we know. We have no idea where it came from, who made it, or even <span class=\"emphasis\">what</span> it really is."},{"name":"BIRDWATCHER04308","text":"We'll be taking it to Ktisis Hyperboreia eventually, but we want to get some notes on it first. Namely, on how it reacts to external stimuli."},{"name":"BIRDWATCHER04308","text":"The abyssus has yet to acknowledge any of us, but maybe you can get a reaction out of it, seeing as you're a familiar."},{"name":"BIRDWATCHER04308","text":"Why don't you try giving it a <span class=\"highlight\">pet</span> to start with?"},{"name":"BIRDWATCHER04308","text":"Go ahead and try <span class=\"highlight\">petting</span> the abyssus."},{"name":"SYSTEM","text":"The bird stares blankly ahead, unmoving. See what happens if you <span class=\"highlight\">pet</span> it."},{"name":"SYSTEM","text":"The abyssus doesn't seem to notice you touching it and continues to stare into the distance."},{"name":"BIRDWATCHER04308","text":"Nothing. Like some great thinker, lost in a meditative trance... Hm. How about giving it a <span class=\"highlight\">poke</span>?"},{"name":"BIRDWATCHER04308","text":"No reaction. How about a <span class=\"highlight\">poke</span> next?"},{"name":"SYSTEM","text":"The bird remains immobile. It stares unseeing, as if into some distant past. Maybe a <span class=\"highlight\">poke</span> will elicit a reaction."},{"name":"SYSTEM","text":"The abyssus doesn't acknowledge your prodding."},{"name":"BIRDWATCHER04308","text":"No good? I'm all out of ideas. Unless...unless you want to try giving it a <span class=\"highlight\">hug</span>?"},{"name":"BIRDWATCHER04308","text":"The only other thing I can think to try is a <span class=\"highlight\">hug</span>."},{"name":"SYSTEM","text":"The bird's gaze remains unchanged─fixed, perhaps, on some point in the far future. Maybe all it needs is a <span class=\"highlight\">hug</span>."},{"name":"SYSTEM","text":"For a brief moment, you could have sworn the abyssus glanced at you, eyes narrowed in irritation..."},{"name":"BIRDWATCHER04308","text":"Still nothing. Too bad, really."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Actually, I think it moved."},{"name":"A2","text":"I wouldn't call that “nothing.”"},{"name":"BIRDWATCHER04308","text":"What did it do? I can't believe I missed it!"},{"name":"BIRDWATCHER04308","text":"Perhaps the abyssus only responds to signs of affection. As such, I'll need you to help us experiment a bit more. We'll run dozens of tests, each with a different expression of love!"},{"name":"BIRDWATCHER04308","text":"...No? Well, I suppose you have other duties to attend to. Still, I'm thrilled we got a reaction out of him. Thank you, and please give Perikles my regards when you go to collect your reward."},{"name":"BIRDWATCHER04308","text":"Perikles should have something to give you as thanks for your help."},{"name":"SYSTEM","text":"The abyssus stands perfectly still, gazing intently forward."},{"name":"PERIKLES","text":"My associate said you were incredibly helpful. You have his thanks, as well as mine."},{"name":"PERIKLES","text":"What did you think of the abyssus? Strangely enthralling, isn't it? With those penetrating eyes that seem to stare right into your very core."},{"name":"PERIKLES","text":"It almost feels like it's studying us as much as we're studying it. I have to wonder who made it, and for what purpose..."},{"name":"PERIKLES","text":"I'll have to consult with Venat─if anyone would know aught of this creation, it is her. Oh, and before I forget, here is your reward for today's work."}],"reward":{"gil":895},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69969]}},"partials":[{"type":"npc","id":"1041101","obj":{"i":1041101,"n":"Perikles","l":3713,"q":1}},{"type":"quest","id":"69969","obj":{"i":69969,"n":"A Flower upon Your Return","g":11,"l":"Elpis","s":587}}]}