{"quest":{"name":"Woken by the Familiar","location":"Elpis","id":69843,"patch":6.0,"sort":6110,"eventIcon":71221,"issuer":1037991,"target":1037991,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Worry weighs on Epiphron's mind."],"objectives":["/poke the hardworking observer.","Speak with Epiphron."],"dialogue":[{"name":"EPIPHRON","text":"I hope she's all right... Oh, I want to go after her, but what if she comes back while I'm away?"},{"name":"EPIPHRON","text":"Hm? You must be a familiar. Can you help me deliver a message?"},{"name":"EPIPHRON","text":"I have an associate who works much too hard. I want to tell her to take a break and join me for a nice, relaxing meal."},{"name":"EPIPHRON","text":"I sent another familiar already, but it's failed to return... As an experimental entity, it is too simple to handle more than one order at a time, so it might be stuck attempting to fulfill my request."},{"name":"EPIPHRON","text":"Would you mind checking on them both for me? I can give you a little something if you're willing help out...?"},{"name":"EPIPHRON","text":"Wonderful. Knowing my associate, she's probably dozing off somewhere around the trees to the north. This wouldn't happen if she'd get a good night's rest for once..."},{"name":"EPIPHRON","text":"You might need to give her a <span class=\"highlight\">poke</span> to wake her up."},{"name":"EPIPHRON","text":"If my associate is nodding off, try giving her a <span class=\"highlight\">poke</span> to wake her up."},{"name":"SYSTEM","text":"The observer is fast asleep, completely unresponsive to the familiar fussing over her. A good <span class=\"highlight\">poke</span> might wake her up."},{"name":"ELDER04307","text":"Hmmhuh? &lt;yawn&gt; ...How long was I asleep?"},{"name":"ELDER04307","text":"Epiphron sent you? Just to invite me to eat? Why send a familiar for something so trivial?"},{"name":"ELDER04307","text":"Although, come to think of it, I <span class=\"emphasis\">could</span> use a meal. Please let him know I'll be along soon."},{"name":"ELDER04307","text":"...Wait, are you a familiar as well? I thought you were one of us for a moment! Anyway, thank you for waking me."},{"name":"ELDER04307","text":"I suppose we'll be eating at our usual place. A nice cup of tea to start with sounds lovely... Well? Do you not also need to report to Epiphron?"},{"name":"EPIPHRON","text":"Thank you for your help. My familiar says my associate has accepted my invitation. That is what happened, yes?"},{"name":"EPIPHRON","text":"Good. That means it can carry out its duties on a basic level, at least."},{"name":"EPIPHRON","text":"I designed it to convey ideas through information-laden aether rather than words, so I'm happy to see the communication was successful."},{"name":"EPIPHRON","text":"It does seem, however, that this method is ineffective when the recipient of the message is asleep... I'll get to work on fixing that."},{"name":"EPIPHRON","text":"But not now. Enjoying some time with my associate is the priority at the moment. Thank you again for your help."}],"reward":{"gil":655},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69967]}},"partials":[{"type":"npc","id":"1037991","obj":{"i":1037991,"n":"Epiphron","l":3713,"q":1}},{"type":"quest","id":"69967","obj":{"i":69967,"n":"Witness to the Spectacle","g":11,"l":"Elpis","s":585}}]}