{"quest":{"name":"The Perks of Being a Lost Flower ","location":"Elpis","id":69849,"patch":6.0,"sort":6170,"unlocksFunction":1,"eventIcon":71341,"issuer":1041847,"target":1041847,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The Akadaemia student wears an expression of concern as she scans the horizon."],"objectives":["Speak with the blue-haired student and have her accompany you.","Accompany the blue-haired student to the designated location and then speak with her.","Speak with the Akadaemia student."],"dialogue":[{"name":"GRADUATESTUDENT04313","text":"You're a visitor, too, aren't you? Perhaps you might be willing to help me, then. Did you happen to see a blue-haired woman in the area? She wouldn't have been wearing a mask."},{"name":"GRADUATESTUDENT04313","text":"I see. She and I are students of Akadaemia Anyder, and we had intended to spend our downtime visiting Elpis together."},{"name":"GRADUATESTUDENT04313","text":"We were just on our way when she realized she forgot something back in Anagnorisis, so she ran back...and that was the last I saw of her. She can be a bit─how shall I put it?─scatterbrained, so she may well have simply got lost on her way back."},{"name":"GRADUATESTUDENT04313","text":"I would rather not search for her myself, for what if she comes back while I'm away? So, if it isn't too much trouble, perhaps you would be so kind as to look for her?"},{"name":"GRADUATESTUDENT04313","text":"Like us, she won't be wearing a mask, and so should stand out a touch. You'll find her in the area of Philomythes Notos in all likelihood. If you do come across her, could you help her out a bit? See she makes it back?"},{"name":"GRADUATESTUDENT04313","text":"This blue-haired friend of mine can be, well...a little addled, to put it bluntly. If you happen to see her, please bring her back to me, would you?"},{"name":"FOREIGNER04313","text":"Yes, can I help you? Oh, wait. Do you need directions somewhere? Not to be rude, but I beg of you─ask someone else. I happen to be lost myself."},{"name":"FOREIGNER04313","text":"What was that? A woman asked you to come and find me? That would be my friend, no doubt. How embarrassing. I had hoped to keep this hopelessly directionless side of myself under wraps."},{"name":"FOREIGNER04313","text":"I feel terrible leaving her like that, but I'd clean forgotten a task from one of my professors. I rushed back to collect the item I was asked for─which I found, thankfully─but got rather turned around when attempting to return."},{"name":"FOREIGNER04313","text":"But don't you worry about me. I'll be just fine on my own. Now, if I'm right, then following this road east will lead me to a teleporter...I think─I mean!─I <span class=\"emphasis\">know</span>."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Are you sure you'll be all right on your own?"},{"name":"A2","text":"I've business with your friend, anyway. I can escort you."},{"name":"FOREIGNER04313","text":"Oh bother, maybe not. Well, I could probably find my way eventually, but there's no sense in trying to go it alone, I suppose. Would you be so kind as to guide me back to my friend?"},{"name":"FOREIGNER04313","text":"Y-You mean it? Truly? Well, that is...I mean, if you're heading in that direction anyway, I don't see why I shouldn't tag along. Oh no, please, after <span class=\"emphasis\">you</span>."},{"name":"FOREIGNER04313","text":"If I'm able to get as far as the teleporter that connects to Poieten Oikos, I should be able to make the remainder of the trip on my own. Now then, um...would you mind?"},{"name":"SYSTEM","text":"The blue-haired student is now accompanying you. Keep her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You may leave this lost student behind by entering a different area, or by speaking with her and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have the blue-haired student join you again, return and speak with her at the original location."},{"name":"Q2","text":"What will you do?"},{"name":"A1","text":"Talk."},{"name":"A2","text":"Part ways."},{"name":"A3","text":"Nothing."},{"name":"FOREIGNER04313","text":"I confess I don't know up from down, or left from right. Every path, hill, and clump of trees looks just like the last. But if I can just get to the teleporter that connects to Poieten Oikos, I ought to be okay."},{"name":"Q3","text":"Are you sure you wish to part ways with your companion?"},{"name":"FOREIGNER04313","text":"O-Oh, you've pressing business elsewhere? Very well. I suppose I'll just...wander back to where you first found me in Philomythes Notos. You will come back, though, right? I fear I may be stuck there for quite some time without your help."},{"name":"FOREIGNER04313","text":"Ah, you've come back! Thank heavens. Now then, shall we make for that teleporter? My friend must be terribly worried by now."},{"name":"FOREIGNER04313","text":"What a relief it is to see a familiar sight! I should be all right without you now. After all, it's just a straight shot from here to Poieten Oikos."},{"name":"FOREIGNER04313","text":"Goodness, the earful I'm going to get from my friend... I've kept her waiting for far too long. Well, I really should hurry─she is owed an explanation and a heartfelt apology. Do come see us, though. I would like to thank you properly."},{"name":"FOREIGNER04313","text":"I should have been upfront with my friend, and simply told her why I went back. My blasted pride so often gets in the way..."},{"name":"FOREIGNER04313","text":"Thank you for your help. Truth be told, when my friend first dashed off, I had assumed it was because she forgot an assignment from Mitron. Lo and behold, I was right."},{"name":"FOREIGNER04313","text":"We are studying at the Words of Mitron in Akadaemia Anyder, learning all we can about the engendering of aquatic life from that selfsame master."},{"name":"FOREIGNER04313","text":"Honestly though, I've no idea why Mitron would ask me to procure a flower of all things─and one that's still undergoing testing in Elpis. It's very beautiful, yes, but what has it to do with ichthyology?"},{"name":"FOREIGNER04313","text":"Well, nothing...but that's the point, surely. It must be intended as a present─one meant for Loghrif. Mitron is hopelessly enamored, as we all well know!"},{"name":"FOREIGNER04313","text":"We do? This is certainly news to me! Though now that you mention it, I suppose I have seen sparks between them... I wonder why I never noticed before?"},{"name":"FOREIGNER04313","text":"That settles it. We need to hurry back and begin an in-depth observation of their romantic entanglements! I can't believe I've wasted all this valuable research time lost amongst the trees... And I would have wasted even more if not for you, good <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">sir</span></span>."},{"name":"FOREIGNER04313","text":"Now that my friend and I are together again, we can get back to the Akadaemia and deliver the flower to Mitron before it wilts! Ah, but before we rush off─a reward. You certainly deserve it."}],"reward":{"gil":735,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69969]}},"partials":[{"type":"npc","id":"1041847","obj":{"i":1041847,"n":"Akadaemia Student","l":3713,"q":1}},{"type":"quest","id":"69969","obj":{"i":69969,"n":"A Flower upon Your Return","g":11,"l":"Elpis","s":587}}]}