{"quest":{"name":"A Job for a Loporrit","location":"Labyrinthos","id":69857,"patch":6.0,"sort":8202,"eventIcon":71221,"issuer":1041315,"target":1041315,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The wandering Loporrit is looking for “work.”"],"objectives":["Speak with the hamlet resident.","Place the bags of beast repellent at the designated locations.","Speak with the hamlet resident.","Speak with the wandering Loporrit."],"dialogue":[{"name":"LOPORRIT04321","text":"Haven't we met before? You're...one of Urianger's friends, yes?"},{"name":"LOPORRIT04321","text":"Ah, I thought so! I'm here wandering around Labyrinthos, hoping to find some “work” to do. It sounds like such fun!"},{"name":"LOPORRIT04321","text":"But I don't even know where to start or how to ask for it. Can you help me?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Of course!"},{"name":"A1","text":"I suppose..."},{"name":"LOPORRIT04321","text":"Well then, what are we waiting for!? Let's find someone with “work” for me!"},{"name":"LOPORRIT04321","text":"Perhaps this person can help us!"},{"name":"RESEARCHER04321","text":"Is there something I can help you and your...uh...friend with?"},{"name":"RESEARCHER04321","text":"Hm, I'd heard Loporrits were interested in learning about our culture. And you're saying this one is looking for a job...?"},{"name":"LOPORRIT04321","text":"Yes, I would like to “work” at a “job”! Do you know of one I could do?"},{"name":"RESEARCHER04321","text":"Well, most people here work at Aporia or Thaumazein, but we would need to submit documents to request the proper level of clearance and─ Oh! I have an idea!"},{"name":"RESEARCHER04321","text":"As you've seen, the man-made habitats hereabouts are populated by a variety of experimental subjects. Some of the bolder beasts, however, have been known to cause unfortunate incidents in and around the elemental reactors."},{"name":"RESEARCHER04321","text":"In order to encourage these creatures to keep their distance, we've put together some bags of noxious-smelling repellent. I'd appreciate it if you could place a few of them by the reactors themselves."},{"name":"RESEARCHER04321","text":"For now, I need you to ward two such facilities: the one to the south, and the one to the west of Logistikon Beta. Here, there's an armful for each of you so you can split the work."},{"name":"LOPORRIT04321","text":"Oh. I'm sorry for making you “work,” too. But that means we can share the payment as well!"},{"name":"LOPORRIT04321","text":"Right! I'll go to the south reactor, and you take the one in the west. Work, work, work..."},{"name":"RESEARCHER04321","text":"Go ahead and place a few of those bags by the reactor west of Logistikon Beta."},{"name":"LOPORRIT04321","text":"I'm all done! Would you mind making a report to our employer?"},{"name":"RESEARCHER04321","text":"Thank you both for your cooperation. I'll hand the payment to our lunar friend here so that she might have the full “job” experience."},{"name":"RESEARCHER04321","text":"Oh, and I'll throw in some apples from Meryall Agronomics, too. Enjoy!"},{"name":"LOPORRIT04321","text":"Oh, a new food to try! Let's head back up the stairs and eat them together!"},{"name":"LOPORRIT04321","text":"Time to munch on these “apples”! They look delicious, don't they?"},{"name":"LOPORRIT04321","text":"Oh my... They don't just look delicious, they <span class=\"emphasis\">are</span> delicious! They might be even better than carrots..."},{"name":"LOPORRIT04321","text":"I thought this place would be just like Mare Lamentorum since it's all artificial, but I'm glad I was wrong."},{"name":"LOPORRIT04321","text":"I was wrong about a lot, even after everything Urianger told me to expect. And I learned so much at my “job”! I think I want to try another one."},{"name":"LOPORRIT04321","text":"Oh, before I forget, here's your share of our payment. Thank you for all your help!"}],"reward":{"gil":735,"items":[{"id":35712}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69982]}},"partials":[{"type":"npc","id":"1041315","obj":{"i":1041315,"n":"Wandering Loporrit","l":3708,"q":1}},{"type":"item","id":"35712","obj":{"i":35712,"n":"Chondrite Earring Coffer (IL 545)","l":1,"c":26564,"t":61}},{"type":"quest","id":"69982","obj":{"i":69982,"n":"Hither and Yarns","g":11,"l":"Labyrinthos","s":600}}]}