{"quest":{"name":"Taking the Minutes: Ktisis Hyperboreia","location":"Elpis","id":69850,"patch":6.0,"sort":6180,"eventIcon":71221,"issuer":1041851,"target":1041852,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The forbearing visitor seems to be eyeing you up."],"objectives":["Speak with the scrivener.","Deliver the forum minutes to the forbearing visitor.","Speak with the forbearing visitor."],"dialogue":[{"name":"FOREIGNER04314","text":"Aren't you a sweet-looking familiar. Tell me: to whom do you belong?"},{"name":"FOREIGNER04314","text":"Oh, you're Azem's, are you? <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> is a goodly sort, wouldn't you say? Always appearing in times of trouble to extend a hand to those in need...and, given that I am one such, I'm sure <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> wouldn't mind if I borrowed you for a bit."},{"name":"FOREIGNER04314","text":"A lengthy debate was held in Ktisis Hyperboreia regarding the evaluation of creations. Meticulous minutes were taken during said forum, which I would like you to fetch for me."},{"name":"FOREIGNER04314","text":"A dear friend in Amaurot asked for them, you see, and I plain forgot all about it. Now, if you would be so kind?"},{"name":"FOREIGNER04314","text":"I will send word to the scrivener in charge and ask them to await your coming in front of Peripeteia Krystalline, where the documents are being held. Once you've the notes, return to me here."},{"name":"FOREIGNER04314","text":"I will send word ahead of you and inform the scrivener to expect you in front of Peripeteia Krystalline. Well, best be off with you, yes?"},{"name":"REGISTRAR04314","text":"You're the familiar, then? Very good. Here are the records of the forum. Careful now─it's a sizable stack of volumes. Try not to drop any on your way back."},{"name":"SYSTEM","text":"Carry the forum minutes to the forbearing visitor awaiting you at Poieten Oikos before your arms give out."},{"name":"SYSTEM","text":"You will have two minutes to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"SYSTEM","text":"Be wary of attacks from enemies, which will sap your strength."},{"name":"REGISTRAR04314","text":"Don't tell me─ You dropped the documents. Fortunately for us both, my familiar has already scooped up your fallen folios. Now, let's try this again, shall we? Only this time, do be more careful."},{"name":"FOREIGNER04314","text":"Ah, you have returned...and without the documents I asked for. Please, I really do need them. The scrivener I mentioned should be holding them for you in front of Peripeteia Krystalline. Now, would you mind?"},{"name":"FOREIGNER04314","text":"These are the documents I requested? My word, they must have been terribly heavy..."},{"name":"FOREIGNER04314","text":"The friend I spoke of is involved in the operation of Anamnesis Anyder, a facility which houses myriad concepts, cogitations, and ideas."},{"name":"FOREIGNER04314","text":"He felt that certain procedures─especially the ones concerning living creations─were lacking in information. Thus he sought detailed records that he might fill in the blanks, so to speak."},{"name":"FOREIGNER04314","text":"Hmmm, I believe you're owed a little reward for your help. I'll think over what to offer you while I pack my belongings for the journey ahead of me. Come see me at the entrance to Poieten Oikos─I'm sure I'll have made up my mind by then."},{"name":"FOREIGNER04314","text":"There you are. I've finished my packing, and as it so happens, have hit upon a most commensurate gift."},{"name":"FOREIGNER04314","text":"My favorite food, and freshly made, too. Try it─I'm sure you will love it. Farewell, familiar. Give my regards to Azem."}],"reward":{"gil":735,"items":[{"num":2,"id":36050}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69967]}},"partials":[{"type":"npc","id":"1041851","obj":{"i":1041851,"n":"Forbearing Visitor","l":3713,"q":1}},{"type":"npc","id":"1041852","obj":{"i":1041852,"n":"Forbearing Visitor","l":3713,"q":1}},{"type":"item","id":"36050","obj":{"i":36050,"n":"Spicy Shakshouka","l":539,"c":24262,"t":46}},{"type":"quest","id":"69967","obj":{"i":69967,"n":"Witness to the Spectacle","g":11,"l":"Elpis","s":585}}]}