{"quest":{"name":"Gleaner's Wish","location":"Labyrinthos","id":69856,"patch":6.0,"sort":8201,"unlocksFunction":1,"eventIcon":71341,"issuer":1041313,"target":1041313,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The Viera gleaner is watching you with interest."],"objectives":["Speak with the elemental reactor operator.","/pray before the lantern crystal.","Deliver the lantern crystal to the Viera gleaner."],"dialogue":[{"name":"GLEANER04320","text":"You're a visitor to Sharlayan, aren't you? You do have a worldly look about you..."},{"name":"GLEANER04320","text":"As a gleaner, I, too, have journeyed far and wide. Tell me, where is the farthest you have ventured?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"The Far East."},{"name":"A1","text":"Another world."},{"name":"A1","text":"I cannot say."},{"name":"GLEANER04320","text":"The Far East, the literal edge of the world... That is quite far indeed."},{"name":"GLEANER04320","text":"Is that meant to be in jest? The look on your face tells me you're serious..."},{"name":"GLEANER04320","text":"Oh? Is it someplace secret? I understand. I am sworn to secrecy in some of the Forum's matters, as well."},{"name":"GLEANER04320","text":"Aye, you should do nicely."},{"name":"GLEANER04320","text":"You see, I need a more experienced traveler to say a prayer for me before I leave for Gyr Abania."},{"name":"GLEANER04320","text":"If you would do me the honor, the reactor operator by the tower to the south should have a lantern crystal prepared for the purpose."},{"name":"GLEANER04320","text":"Please speak with the reactor operator, and he will furnish you with a lantern crystal."},{"name":"RESEARCHER04320","text":"Are you here for the crystal? I hope it does some good for that gleaner; those folks need all the luck they can get."},{"name":"RESEARCHER04320","text":"Lanterns light the way through the darkness─a tool which can mean the difference between life and death. They are synonymous with safe passage, and as such, it has become custom in recent days to imbue the crystals inside with the prayers of a more seasoned traveler."},{"name":"RESEARCHER04320","text":"And today, that traveler is you. Simply face the crystal, and <span class=\"highlight\">pray</span> for the safety of the traveler-to-be, if you will."},{"name":"RESEARCHER04320","text":"Gaze into the crystal, and <span class=\"highlight\">pray</span> for the traveler who sent you."},{"name":"SYSTEM","text":"The crystal glitters inside the box. Kneel before it and <span class=\"highlight\">pray</span> for the gleaner's safe passage."},{"name":"RESEARCHER04320","text":"A colleague recently told me about the power of akasa─a concept taught in Radz–at–Han─and how it reacts to strong emotion."},{"name":"RESEARCHER04320","text":"I wonder if this method of praying to a crystal is a manifestation of that power..."},{"name":"RESEARCHER04320","text":"Well, that should about do it. With luck, your prayers will help guide the gleaner safely through the perils of his journey."},{"name":"RESEARCHER04320","text":"The crystal is ready. You can take it to the gleaner who asked for it now."},{"name":"GLEANER04320","text":"Do you have a lantern crystal for me?"},{"name":"GLEANER04320","text":"You have my thanks. With your prayer fueling its light, I have faith that it will keep me safe until my return."},{"name":"GLEANER04320","text":"And now, I depart for Gyr Abania. I hope your travels are successful, as well as mine."}],"reward":{"gil":735,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69982]}},"partials":[{"type":"npc","id":"1041313","obj":{"i":1041313,"n":"Viera Gleaner","l":3708,"q":1}},{"type":"quest","id":"69982","obj":{"i":69982,"n":"Hither and Yarns","g":11,"l":"Labyrinthos","s":600}}]}