{"quest":{"name":"Gift for a Fan","location":"Labyrinthos","id":69858,"patch":6.0,"sort":8203,"eventIcon":71221,"issuer":1037564,"target":1037564,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Cweilsaem has a favor to ask."],"objectives":["Deliver the small package to W'sondidi.","Drink the golden syrup near W'sondidi.","Speak with Cweilsaem."],"dialogue":[{"name":"CWEILSAEM","text":"It's <span class=\"highlight\">Forename</span>, isn't it? I was about to head to Kokkol's Forge to drop something off, but I think you'd be more welcome than I."},{"name":"CWEILSAEM","text":"As it turns out, the recipient is something of an admirer of yours. I'm sure she'd be thrilled to have you make the delivery."},{"name":"CWEILSAEM","text":"Thank you! Here's the package, all set to be delivered to W'sondidi."},{"name":"CWEILSAEM","text":"W'sondidi is waiting for her delivery at Kokkol's Forge. I wish I could see the look on her face when she realizes it's you!"},{"name":"WSONDIDI","text":"Hello th─<span class=\"emphasis\">eep</span>! It's you! The one and only <span class=\"highlight\">Forename</span>! Am I dreaming?"},{"name":"WSONDIDI","text":"A delivery for me? But why would someone as famous and important as you be delivering my package? "},{"name":"WSONDIDI","text":"Oh, now I'm just being rude. I must thank you properly! If only I had known you'd be coming, I could have prepared something for you..."},{"name":"WSONDIDI","text":"Silly me, there's something for you right here! This package contains a bottle of golden syrup. It's yours if you want it."},{"name":"WSONDIDI","text":"It's an alchemical medicine to rejuvenate the wearied body. You must need something like that after running around and saving the <span class=\"emphasis\">entire world</span>."},{"name":"WSONDIDI","text":"I won't hear “no” for an answer, so drink it down! You deserve it far more than I do!"},{"name":"WSONDIDI","text":"Please drink the syrup before you go. I'd never forgive myself if this delivery contributed to your exhaustion."},{"name":"SYSTEM","text":"W'sondidi will be disappointed if you do not drink the medicine where she can see you."},{"name":"SYSTEM","text":"The medicine is much sweeter than you were expecting."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It's delicious!"},{"name":"A1","text":"The taste is a bit...much."},{"name":"WSONDIDI","text":"I'm glad! I hope it nourishes your body along with pleasing your palate."},{"name":"WSONDIDI","text":"It <span class=\"emphasis\">is</span> medicine, after all. Regardless of the flavor, I hope it does your body some good."},{"name":"WSONDIDI","text":"That reminds me, I had your comrade G'raha try some as well."},{"name":"WSONDIDI","text":"He seemed to quite enjoy it─said it was like drinking sweet ambrosia. I couldn't help but wonder what sort of medicine he had been forced to drink before..."},{"name":"WSONDIDI","text":"Anyway, I'm afraid that's all I have to offer you. I swear, if Cweilsaem doesn't compensate you properly I just might─ Well, never mind that! Please take proper care of yourself out there."},{"name":"WSONDIDI","text":"Make sure Cweilsaem pays you properly!"},{"name":"CWEILSAEM","text":"All finished, then? She works herself too hard, that W'sondidi. The medicine I sent should be good for her."},{"name":"CWEILSAEM","text":"Though I must say, you're looking rather more chipper than when you left."},{"name":"CWEILSAEM","text":"Now that I look at you, you don't look too well yourself. Are you feeling all right?"},{"name":"CWEILSAEM","text":"What? She gave the syrup to you? Well, if that cheered her up, I suppose that's as good as any medicine. In any case, here's a little something as thanks for your help."}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69982]}},"partials":[{"type":"npc","id":"1037564","obj":{"i":1037564,"n":"Cweilsaem","l":3708,"q":1}},{"type":"quest","id":"69982","obj":{"i":69982,"n":"Hither and Yarns","g":11,"l":"Labyrinthos","s":600}}]}