{"quest":{"name":"For the Love of Pudding","location":"Old Sharlayan","id":69852,"patch":6.0,"sort":7101,"eventIcon":71221,"issuer":1041301,"target":1041301,"genre":119,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The Last Stand employee is having pudding problems."],"objectives":["Speak with Puddingway and have him accompany you.","Obtain items while Puddingway is accompanying you.","Deliver items to the Last Stand employee while Puddingway is accompanying you."],"dialogue":[{"name":"CAFESTAFF04316","text":"Ah! You're with the Students of Baldesion, aren't you? Please, I need your help!"},{"name":"CAFESTAFF04316","text":"As you may recall, some cute, chatty little rabbits were here with your people the other day."},{"name":"CAFESTAFF04316","text":"Well, one of them, a fellow named Puddingway, later came asking for─ahem─pudding. Unfortunately, he didn't have the money for it."},{"name":"CAFESTAFF04316","text":"Instead of paying, the boss suggested having him help around the place. The problem is, he doesn't seem to understand how things work. It must be very different where they come from..."},{"name":"CAFESTAFF04316","text":"Anyway, if you have a moment, do you think could you accompany Puddingway on his errand? It's nothing complicated─just collecting the items on this list. While I can't offer much, there'll be a little something in it for your troubles."},{"name":"CAFESTAFF04316","text":"If you have a moment, please accompany Puddingway on his errand. It's nothing complicated─just collecting the items on the list I gave you."},{"name":"PUDDINGWAY","text":"Oh, if it isn't <span class=\"highlight\">Forename</span>! You've come at the perfect time to lend an ear to my woes!"},{"name":"PUDDINGWAY","text":"Ever since Urianger told me about it, it has been my dream to taste the pudding of this star. Alas, that dream has been dashed, my quest for gastronomic pleasure thwarted. And by what? Something silly called “gil”!"},{"name":"PUDDINGWAY","text":"I had heard about this “gil” before coming here, but who would've thought I'd need it to eat pudding? And so my heart's desire must forever go unfulfilled... &lt;sigh&gt;"},{"name":"PUDDINGWAY","text":"T-Truly!? I get to eat pudding...and all I need to do is fetch these things with you!?"},{"name":"PUDDINGWAY","text":"I'll do it! For the love of Hydaelyn, I'll do it! That's a metal mold, some Dellemont fellow's cookbook, and a bottle of yakow milk that we need, yes? Let's hop to it!"},{"name":"SYSTEM","text":"Puddingway is now accompanying you. Keep him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Puddingway behind by entering a different area, or by speaking with him and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Puddingway accompany you again, return and speak with him at the original location."},{"name":"DADAPU","text":"Did you need something?"},{"name":"HARLISSAND","text":"Hm? You got business with me?"},{"name":"CAFESTAFF04316","text":"Oh? Is Puddingway not with you?"},{"name":"SYSTEM","text":"You must be accompanied by Puddingway and have him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You have left Puddingway behind. Return to his side to continue the quest."},{"name":"SYSTEM","text":"Puddingway has yet to arrive. Be sure he is at your side before attempting to continue."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Talk."},{"name":"A1","text":"Part ways."},{"name":"A1","text":"Cancel."},{"name":"PUDDINGWAY","text":"You want to review what we need? Then I'll read the list back to you. Let's see here..."},{"name":"PUDDINGWAY","text":"A metal mold from the Agora, some Dellemont fellow's cookbook from Noumenon..."},{"name":"PUDDINGWAY","text":"And a bottle of yakow milk from Harlissand at the peristyle. That's everything."},{"name":"SYSTEM","text":"Are you sure you wish to part ways with Puddingway?"},{"name":"PUDDINGWAY","text":"Oh, is there somewhere else you need to be? I suppose I can wait a bit longer for my pudding... I'll be out behind the Last Stand when you're ready."},{"name":"PUDDINGWAY","text":"Ready to continue our errand? Then let's get going!"},{"name":"DADAPU","text":"What can I help you and your little bunny friend with?"},{"name":"PUDDINGWAY","text":"We need a metal mold─something suitable for the making of delicious pudding. Do you have any?"},{"name":"DADAPU","text":"I do, as a matter of fact. This is for the Last Stand, I take it? I'll go ahead and put it on your account. Thanks for your custom!"},{"name":"PUDDINGWAY","text":"Ah, I think this is the cookbook we're looking for!"},{"name":"PUDDINGWAY","text":"The note says it's already checked out for us, so all we need to do is grab it and bring it back!"},{"name":"HARLISSAND","text":"From the Last Stand, are you? I heard they'd be sending someone. Here's the yakow milk."},{"name":"PUDDINGWAY","text":"Thank you! I can't wait for it to become delicious pudding!"},{"name":"HARLISSAND","text":"Ah, so that's what it's for. The milk's freshly squeezed, so I daresay it'll make a fine treat."},{"name":"CAFESTAFF04316","text":"How did it go? Were you able to obtain everything?"},{"name":"CAFESTAFF04316","text":"Wonderful! I'll set about making pudding at once!"},{"name":"CAFESTAFF04316","text":"Not just any pudding either, but the famous rainbow pudding, born of the brilliant culinary mind of the legendary Master Dellemont!"},{"name":"CAFESTAFF04316","text":"This little one has wanted to try pudding so badly, it's only right that we serve him the very best."},{"name":"CAFESTAFF04316","text":"As for your good self─this isn't much, but please accept this as payment for your troubles."},{"name":"PUDDINGWAY","text":"At long last, the pudding of this star! Mmmmmm, I can already taste it... So much better than Urianger's lackluster offerings..."},{"name":"PUDDINGWAY","text":"Thank you ever so much! Because of you, not only do I get to eat pudding─I've learned a thing or two about their making to boot."},{"name":"PUDDINGWAY","text":"As surely as my name is Puddingway, I'll endeavor to learn as much about this toothsome treat as I can!"}],"reward":{"gil":735,"items":[{"num":2,"id":36063}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69976]}},"partials":[{"type":"npc","id":"1041301","obj":{"i":1041301,"n":"Last Stand Employee","l":3706,"q":1}},{"type":"item","id":"36063","obj":{"i":36063,"n":"Baked Alien Soup","l":560,"c":24116,"t":46}},{"type":"quest","id":"69976","obj":{"i":69976,"n":"Outside Help","g":11,"l":"Garlemald","s":594}}]}