{"quest":{"name":"Leveilleur Philanthropy","location":"Old Sharlayan","id":69854,"patch":6.0,"sort":7120,"eventIcon":71221,"issuer":1041303,"target":1041303,"genre":119,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The House Leveilleur servant is working to beautify the city."],"objectives":["Plant the flower bulbs at the designated locations.","Speak with the House Leveilleur servant."],"dialogue":[{"name":"SERVANT04318","text":"Ah, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span> <span class=\"highlight\">Forename</span>, what good fortune that you should grace us now. We are planting flowers, if you would perchance care to join us."},{"name":"SERVANT04318","text":"'Tis part of Lady Ameliance's efforts to beautify our fair city, you see, which, in turn, is part of her wider civic contributions."},{"name":"SERVANT04318","text":"Were you to help with a plant or two, my mistress would surely be delighted."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'd be glad to assist."},{"name":"A1","text":"Is now the time to be planting flowers?"},{"name":"SERVANT04318","text":"Marvelous, marvelous. Though the world has become an uncertain place, it is in such times most of all that the people have need of cheer, would you not agree?"},{"name":"SERVANT04318","text":"A fair question, and you are not the first to ask it. The world has become an uncertain place, 'tis true, but it is in such times most of all that the people have need of cheer, would you not agree?"},{"name":"SERVANT04318","text":"With that settled, permit me to furnish you with some bulbs. As you go about planting them, you may notice other helpers here and there. Do feel free to have a chat with them."},{"name":"SERVANT04318","text":"As you go about the planting, you may notice other helpers here and there. Do feel free to have a chat with them."},{"name":"MAIDA04318","text":"Wait... You're <span class=\"emphasis\"><span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span></span>!"},{"name":"MAIDB04318","text":"I can't wait for the flowers to bloom!"},{"name":"LALAFELLSTUDENT04318","text":"Planting flowers for Lady Ameliance too, are you?"},{"name":"HROTHGARSTUDENT04318","text":"&lt;gasp&gt; I...I know you!"},{"name":"MAIDA04318","text":"Begging your pardon, but you're <span class=\"highlight\">Forename Surname</span>, yes? I've heard all about you!"},{"name":"MAIDA04318","text":"Saying that we're all family, Lady Ameliance shares the contents of her children's letters, you see."},{"name":"MAIDA04318","text":"And how they write about you! I've never had the pleasure before, but this feels like meeting an old friend."},{"name":"MAIDB04318","text":"To not only meet you at last, but have you plant flowers with us besides... It's truly an honor!"},{"name":"MAIDB04318","text":"On behalf of my fellow servants, allow me to thank you for being such a great friend to Master Alphinaud and Mistress Alisaie!"},{"name":"HROTHGARSTUDENT04318","text":"Y-You're one of the Scions of the Seventh Dawn, are you not!? Aye, I've seen you at the Baldesion Annex!"},{"name":"LALAFELLSTUDENT04318","text":"Well now, what a great honor it is to meet you! We're students at the Studium you see, and the Leveilleur twins were our seniors."},{"name":"LALAFELLSTUDENT04318","text":"And that despite being years younger than us─than everyone. To be admitted at the tender age of eleven, they're prodigies of the rarest sort."},{"name":"HROTHGARSTUDENT04318","text":"Their graduation theses and deeds in the world are an inspiration to us all, and to meet one of their legendary comrades in the flesh... It's moving beyond words!"},{"name":"LALAFELLSTUDENT04318","text":"We often hear tales about the Scions. Like your fellows, we hope to leave our little island one day and do great things."},{"name":"HROTHGARSTUDENT04318","text":"When that day comes, perhaps we'll see you again, somewhere out there!"},{"name":"MAIDA04318","text":"Thank you for being such a great friend to Master Alphinaud and Mistress Alisaie!"},{"name":"MAIDB04318","text":"To not only meet you at last, but have you plant flowers with us besides... It's truly an honor!"},{"name":"LALAFELLSTUDENT04318","text":"Like your fellow Scions, we hope to leave our little island one day and do great things."},{"name":"HROTHGARSTUDENT04318","text":"We hope to see you again, somewhere out there!"},{"name":"SERVANT04318","text":"Ah, finished planting the bulbs? Wonderful. In time, they will grow into beautiful Nymeia lilies─a symbol of safe travels."},{"name":"SERVANT04318","text":"Upon learning of this in her children's letters, Lady Ameliance took to planting the lilies in the hope that no harm would befall them and their beloved comrades."},{"name":"SERVANT04318","text":"We humble servants share in that hope. Wherever your path may take you, know that you are ever in our thoughts."}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69984]}},"partials":[{"type":"npc","id":"1041303","obj":{"i":1041303,"n":"House Leveilleur Servant","l":3706,"q":1}},{"type":"quest","id":"69984","obj":{"i":69984,"n":"Bonds of Adamant(ite)","g":11,"l":"Labyrinthos","s":602}}]}