{"quest":{"name":"Wayward Carbuncle","location":"Labyrinthos","id":69859,"patch":6.0,"sort":8204,"eventIcon":71221,"issuer":1041316,"target":1041316,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The Studium researcher looks in need of assistance."],"objectives":["Search for the wayward Carbuncle using the guiding crystal.","/soothe the wayward Carbuncle.","Deliver the wayward Carbuncle to the researcher."],"dialogue":[{"name":"SYSTEM","text":"Should you choose to undertake this quest, you will receive no guidance from the journal or the duty list. You will need to read the text carefully and decipher the clues to determine your next course of action."},{"name":"RESEARCHER04323","text":"Excuse me, you there. You look capable. Could you find a missing Carbuncle for me?"},{"name":"RESEARCHER04323","text":"Ordinarily, a Carbuncle would never be without an arcanist, but this one was found alone, roaming the wilds of La Noscea... And so I had it sent here for research purposes."},{"name":"RESEARCHER04323","text":"I swear I took my eye off it for barely even a moment, and it scampered off somewhere outside the hamlet!"},{"name":"RESEARCHER04323","text":"Seeing as it's far too dangerous out there for someone of my disposition, I was hoping you could look for it in my stead...?"},{"name":"RESEARCHER04323","text":"You have my thanks. I don't think it could have made it out of the Central Circuit, but that still leaves a wide area to search."},{"name":"RESEARCHER04323","text":"This guiding crystal should make the job a bit easier. It will react when the Carbuncle is near, glowing more brightly the closer you are to your quarry."},{"name":"RESEARCHER04323","text":"Once you've secured the entity, please bring it back here to me. I wish you fortune in your hunt!"},{"name":"SYSTEM","text":"The destination for this objective will not be displayed."},{"name":"SYSTEM","text":"Use your guiding crystal to pinpoint the location of the wayward Carbuncle."},{"name":"RESEARCHER04323","text":"That guiding crystal should help you track down the Carbuncle. Be safe and good luck!"},{"name":"SYSTEM","text":"The crystal remains inert. The Carbuncle must be elsewhere."},{"name":"SYSTEM","text":"The crystal twinkles only faintly. Where could that Carbuncle be?"},{"name":"SYSTEM","text":"The crystal glimmers warmly. The Carbuncle isn't here, but you may be on the right track."},{"name":"SYSTEM","text":"The crystal shines brilliantly. The Carbuncle must be nearby."},{"name":"SYSTEM","text":"The Carbuncle peers at you anxiously, not letting its guard down."},{"name":"SYSTEM","text":"Perhaps it would let you pick it up if you <span class=\"highlight\">soothe</span> it first."},{"name":"SYSTEM","text":"The Carbuncle may let you pick it up if you <span class=\"highlight\">soothe</span> it first."},{"name":"SYSTEM","text":"The Carbuncle visibly calms, allowing you to cradle it in your arms!"},{"name":"RESEARCHER04323","text":"Did you find the Carbuncle?"},{"name":"RESEARCHER04323","text":"Thank goodness! Or rather, thank you!"},{"name":"RESEARCHER04323","text":"As I said, they found the poor thing alone in the countryside─wandering the mountains of northern La Noscea, I believe. It should have vanished as soon as its master dismissed it, although it's possible the command was never given."},{"name":"RESEARCHER04323","text":"In which case, it should theoretically persist until the aether that forms it is consumed. But for that reserve to last long enough for the entity to grow wild..."},{"name":"RESEARCHER04323","text":"An immensely talented arcanist must have summoned it. What I wouldn't give to meet someone that powerful!"},{"name":"RESEARCHER04323","text":"Researching this little creature should net me some fascinating data, indeed. Thank you again for retrieving it for me!"}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69982]}},"partials":[{"type":"npc","id":"1041316","obj":{"i":1041316,"n":"Studium Researcher","l":3708,"q":1}},{"type":"quest","id":"69982","obj":{"i":69982,"n":"Hither and Yarns","g":11,"l":"Labyrinthos","s":600}}]}