{"quest":{"name":"Secret in the Box","location":"Old Sharlayan","id":69853,"patch":6.0,"sort":7110,"eventIcon":71221,"issuer":1041296,"genre":119,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The mysterious maiden regards you with interest."],"objectives":["Examine the letter.","Solve the riddles in the letter to obtain keys.","Examine the box."],"dialogue":[{"name":"MYSTERYWOMAN04317","text":"You are <span class=\"highlight\">Forename Surname</span>, are you not? I've been looking for you."},{"name":"MYSTERYWOMAN04317","text":"I'm an adventurer too, and I've been tasked with delivering this letter and box to you. Though I can't say who sent them, rest assured that my client means you no ill."},{"name":"MYSTERYWOMAN04317","text":"My work is done, so I'll leave you to it, but I suggest you start by reading the letter."},{"name":"SYSTEM","text":"Should you choose to undertake this quest, know that guidance from the journal, duty list, and map will be limited. You will need to read the text carefully and decipher the clues to determine your course of action."},{"name":"SYSTEM","text":"The box is locked tight."},{"name":"MYSTERYLETTER04317","text":"(-Unsigned Letter-)Dear <span class=\"highlight\">Forename</span>,<br>There is a gift for you in the box─if you can open it."},{"name":"MYSTERYLETTER04317","text":"(-Unsigned Letter-)To do so, you must acquire three keys, the keepers of which are somewhere in Sharlayan."},{"name":"MYSTERYLETTER04317","text":"(-Unsigned Letter-)Solve the following riddles to find them. And do try to have fun. This is a game, after all."},{"name":"MYSTERYLETTER04317","text":"(-Unsigned Letter-)Towards wisdom aspiring, a keeper doth gaze,<br>By young minds inquiring and new trails blazed.<br>Yet the mind is a muscle, in rest it doth grow,<br>So let all embrace slumber, the better to know."},{"name":"MYSTERYLETTER04317","text":"(-Unsigned Letter-)By life ever-flowing, a keeper doth wait,<br>Clutching a prize, his hunger to sate.<br>Yet no prize is so coveted as one golden-hued,<br>The mention of which is never thought rude."},{"name":"MYSTERYLETTER04317","text":"(-Unsigned Letter-)Blessed by the nymphai, a keeper doth stand,<br>Enthralled in a tale, a book in his hand.<br>Yet evocative as letters on parchment may be,<br>'Tis words said and heard which impel destiny."},{"name":"SYSTEM","text":"Find the three keepers by using the hints in the letter. You may review the letter in your inventory."},{"name":"SYSTEM","text":"You cannot open the box without all three keys."},{"name":"MYSTERYSTUDENT04317","text":"&lt;yawn&gt; I worked on a report all night, and it's all I can do not to doze off in class... I thought the fresh air might help to wake me up."},{"name":"MYSTERYSTUDENT04317","text":"I've been waiting for you, <span class=\"highlight\">Forename</span>. Here, my master bade me give you this key."},{"name":"MYSTERYSTUDENT04317","text":"To go so far as to disguise himself as a woman... It shows how much he wanted to meet you in person."},{"name":"MYSTERYSTUDENT04317","text":"Anyway, I've played my part, so I'll return to my training. Enjoy the rest of the game."},{"name":"SAYTODO","text":"golden acorn"},{"name":"MYSTERYBOY04317","text":"Well done, my friend! From the tales I heard about you, I expected you'd find me in short order─and you did."},{"name":"MYSTERYBOY04317","text":"Heard from who, you ask? Oh, just a man I admire. It was due to his influence that I decided to train under the same master. What joy to see him again after all these years!"},{"name":"MYSTERYBOY04317","text":"My disguise, I chose because I felt it'd be a good match for him. Quite convincing, don't you think?"},{"name":"MYSTERYBOY04317","text":"Ah, but before I forget─here's your key. I'll let you get back to the game, but when you have a moment, I'd love to hear some of your tales!"},{"name":"SYSTEM","text":"Could this nutkin be one of the keepers? Perhaps you should review the letter..."},{"name":"IZUMI","text":"Greetings, <span class=\"highlight\">Forename</span>. That you've sought me out means you've read the letter─and solved the riddle besides."},{"name":"IZUMI","text":"Of all our master's pupils, your comrade is the least poetic by far. But that's never stopped him from trying to woo the ladies with song. He truly is hopeless."},{"name":"IZUMI","text":"Still, it's good to see him hale and whole. From what Master tells us, he's been through a lot."},{"name":"IZUMI","text":"The next time you see him, do pass along my regards. And here, of course, is your key."},{"name":"SYSTEM","text":"The keys unlock the box, which you open to reveal your gift─along with another letter."},{"name":"MYSTERYLETTER04317","text":"(-Enclosed Letter-)Dear <span class=\"highlight\">Forename</span>,<br>Allow me to congratulate you for solving the riddles. As promised, the gift is yours to take."},{"name":"MYSTERYLETTER04317","text":"(-Enclosed Letter-)A long time ago, Master Louisoix left a little troublemaker in my care. At his behest, I taught the boy everything I knew in the ways of survival and infiltration."},{"name":"MYSTERYLETTER04317","text":"(-Enclosed Letter-)After years away from these shores, the boy has returned a man. By the set of his face alone, 'tis plain he has matured greatly."},{"name":"MYSTERYLETTER04317","text":"(-Enclosed Letter-)A product of his time with the Scions, I do not doubt. I thank you for being there for him, and ask that you continue to do so."},{"name":"MYSTERYLETTER04317","text":"(-Enclosed Letter-)Lastly, I ask that you forgive me for not saying this directly. In spite of myself, I've never been good at expressing heartfelt sentiments in person, hence this letter. The manner of its delivery, at the very least, I wished to make interesting, and I hope you derived some enjoyment from it."}],"reward":{"gil":735,"items":[{"id":35715}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69976]}},"partials":[{"type":"npc","id":"1041296","obj":{"i":1041296,"n":"Mysterious Maiden","l":3706,"q":1}},{"type":"item","id":"35715","obj":{"i":35715,"n":"Chondrite Ring Coffer (IL 545)","l":1,"c":26567,"t":61}},{"type":"quest","id":"69976","obj":{"i":69976,"n":"Outside Help","g":11,"l":"Garlemald","s":594}}]}