{"quest":{"name":"Terror on Two Legs","location":"Elpis","id":69851,"patch":6.0,"sort":6190,"eventIcon":71221,"issuer":1038000,"target":1038000,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Glaphyra is buried deep under a mountain of work and is seeking outside assistance."],"objectives":["Find the red-haired researcher.","Use the blowgun to shoot the rampaging creature at the designated location.","Capture the sleeping creature.","Deliver the sleeping creature to the red-haired researcher.","Speak with Glaphyra."],"dialogue":[{"name":"GLAPHYRA","text":"You're a familiar, aren't you? Then perhaps you might be able to help me. I received an appeal for assistance from a colleague of mine, but I'm up to my eyeballs in work as it is. Might you step in where I cannot?"},{"name":"GLAPHYRA","text":"Your benevolence does you credit. The researcher I spoke of has striking red hair and is likely lingering on the south side of Kallimelios Zephyros. "},{"name":"GLAPHYRA","text":"You're very good to offer your help in matters you know not what, and for that I thank you. Now, I would give you more specifics, but alas, my red-haired colleague failed to provide them."},{"name":"OBSERVER04315","text":"O-Oh, you're a familiar, aren't you? One sent by Glaphyra, no doubt. Well, thank goodness you're here. I confess I'm still in somewhat of a daze, but with you here I at least feel safe enough to stop and catch my breath."},{"name":"OBSERVER04315","text":"Something came over the specimen I was examining, though I'm not entirely sure what. I'd never seen it behave so erratically before! At any rate, it managed to slip my grasp and escape. I tried to chase after it, but...I'm not half so fleet-footed."},{"name":"OBSERVER04315","text":"To complicate matters, the thing has a very nervous temperament, and will flee if anyone so much as approaches it. I considered imbuing some sort of sleeping spell into a dart which one might shoot from a height, but...who has such impeccable aim? Not I, to be sure─do <span class=\"emphasis\">you</span>?"},{"name":"OBSERVER04315","text":"Y-You do? I admit that proposal was made somewhat in jest, but this works out perfectly. So it's settled: you shall put our skittish beast to bed!"},{"name":"OBSERVER04315","text":"Find yourself a vantage point from a rise southeast of here, and with this blow dart, bring the frenzied fiend under control again. Me? Oh, I will stay here and take a moment to collect myself..."},{"name":"OBSERVER04315","text":"I'm still exhausted from my first attempts at apprehending the creature, so you will have to go it alone. It shouldn't be too hard, though, and you've experience enough by the sounds of it."},{"name":"SYSTEM","text":"Search for the rampaging creature. You may move the camera, as well as zoom in and out. Target the creation and use the blowgun with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"OBSERVER04315","text":"Wha─ You were able to hit it? It slumbers as we speak? <span class=\"emphasis\">Truly</span>? Goodness, and here I thought I set you an impossible task. More the fool me, I suppose! Well, I've regained enough of my strength to walk without too much trouble."},{"name":"OBSERVER04315","text":"How dexterous you must be to hit a moving target with so small an object. Most impressive. Well, allow me to take that dozing specimen off your hands."},{"name":"OBSERVER04315","text":"Why, what a precious sight our little beast makes when it's not running amok. A shame it can't be this adorable all the time..."},{"name":"OBSERVER04315","text":"This was, in fact, one amateur creator's answer to the walking shark that recently gained approval. A somewhat hasty and ill-advised attempt, if you ask me."},{"name":"OBSERVER04315","text":"Credit where credit is due, though. The specimen <span class=\"emphasis\">is</span> bipedal despite its base being that of a quadrupedal beast. Its predilection for being an excitable nuisance, however, means it cannot be of any real use to our star."},{"name":"OBSERVER04315","text":"What it needs is a healthy dose of intellect. I will write a report stating as much. While I do that, return to Glaphyra and tell her of the assistance you rendered. Oh, and offer her my gratitude, too, would you? "},{"name":"GLAPHYRA","text":"There you are. Thank you for tidying up that bit of mess for me. Speaking of which, what <span class=\"emphasis\">was</span> the mess, exactly?"},{"name":"GLAPHYRA","text":"A thrilling game of “chase the creation,” was it? That conjures up a sorry image indeed... It sounds like the researcher was able to glean some valuable information, so all's well that ends well, I suppose."},{"name":"GLAPHYRA","text":"If all goes according to the reports made─and sufficient intellect can be cultivated─then the specimen should prove a valuable contribution to our world. Thank you again for your assistance."}],"reward":{"gil":895},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69967]}},"partials":[{"type":"npc","id":"1038000","obj":{"i":1038000,"n":"Glaphyra","l":3713,"q":1}},{"type":"quest","id":"69967","obj":{"i":69967,"n":"Witness to the Spectacle","g":11,"l":"Elpis","s":585}}]}