{"quest":{"name":"Herbicidal Tendencies","location":"Labyrinthos","id":69864,"patch":6.0,"sort":8103,"eventIcon":71221,"issuer":1037567,"target":1037567,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Charmont's eyes have a faraway look about them, as if he is thinking great thoughts."],"objectives":["Wait at the specified location, use the herbicidal tincture on the massive berkanan, then slay it.","Speak with Charmont."],"dialogue":[{"name":"CHARMONT","text":"What luck! You are just the gallant sort I was in search of."},{"name":"CHARMONT","text":"You see, I've whipped up an experimental new tincture, one that brings low a certain type of fiend. I had hoped a brave adventurer might test its efficacy for me in the field."},{"name":"CHARMONT","text":"And since you're here, perhaps <span class=\"emphasis\">you</span> could fill that role? Good. Now then, about this solution of mine! With the help of some gleaners, I've crafted a concoction that can intenerate even the hardest of seedkin's casings, allowing one to make quick work of the beasts."},{"name":"CHARMONT","text":"Or so my hypothesis goes, anyway. Alas, my genius remains untested and thus unproven─which is where you come in. One so well versed in the ways of war should have no trouble at all verifying the tincture's efficacy, I should think."},{"name":"CHARMONT","text":"Based on the information I have ascertained, an oversized berkanan can be found wandering about to the west of Logistikon Beta. Douse that sadistic seedkin in my newest nostrum and bash it into a bloody pulp for me, would you?"},{"name":"CHARMONT","text":"What wonders I'm capable of confecting. Well, I suppose we don't know as of yet whether this particular experiment of mine is a wonder...though I can hardly imagine it is anything but!"},{"name":"CHARMONT","text":"Why, not a scratch on you. I take this to mean my serum did its job, then?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It most certainly did."},{"name":"A1","text":"I didn't bother using it."},{"name":"CHARMONT","text":"Is that so? Goodness, my genius is rather startling, isn't it? That was a tincture most hastily thrown together─nary a thought was put into it."},{"name":"CHARMONT","text":"What? This is most disappointing. You have rendered this whole exercise utterly meaningless. Still, it is impressive that you were able to bring the beast to its bark-covered knees when so many others have failed before you."},{"name":"CHARMONT","text":"At any rate, I thank you for services rendered. Here, for your troubles. Well then, I must return to my pondering─these theories of mine won't hypothesize themselves!"}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69978]}},"partials":[{"type":"npc","id":"1037567","obj":{"i":1037567,"n":"Charmont","l":3708,"q":1}},{"type":"quest","id":"69978","obj":{"i":69978,"n":"No Job Too Small","g":11,"l":"Labyrinthos","s":596}}]}