{"quest":{"name":"Apple-y Ever After","location":"Labyrinthos","id":69866,"patch":6.0,"sort":8105,"eventIcon":71221,"issuer":1041377,"target":1041377,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>A consternated chef despairs at her present predicament."],"objectives":["Use pouches of sulphur powder on peculiar vegetables.","Obtain the oversized apples.","Deliver the oversized apples to the distressed chef."],"dialogue":[{"name":"CULINARIAN04330","text":"Heavens forfend! To think this would happen in <span class=\"emphasis\">my</span> kitchen. The nerve! ...Oh, you there. Yes, <span class=\"emphasis\">you</span>. You've the look of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who knows what <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>'s about, and I'm in desperate need of one such as you!"},{"name":"CULINARIAN04330","text":"Picked myself a bushel of Meryall Agronomics' apples, but wouldn't you know, some nasty mandragora swiped those red beauties from under my nose! Not sure how they got in here in the first place, but that's beside the point."},{"name":"CULINARIAN04330","text":"I could well try to steal them back myself, but goodness knows how many hours it'd be before I stumbled upon that blasted bandit. I'm only one woman─I can't cover all that ground by myself! So, be a friend and help me get my apples back, would you?"},{"name":"CULINARIAN04330","text":"I just knew you'd oblige me! Now then, let's talk strategy. I'll scour the area just south of here, so you take the north. Deal?"},{"name":"CULINARIAN04330","text":"Mandragoras bury themselves in the dirt to hide, so if you see one of their bulbous heads poking out of the soil, hit them with one of these malodorous bombs. They'll be so surprised to get a face full of stink, they'll leap out, and leave behind my apples."},{"name":"CULINARIAN04330","text":"The thief will probably take off running, but let them go. I just want my pilfered fruit returned. Besides, mandragora carcass isn't on the menu tonight. Right then, I'll leave you to your search. Happy hunting!"},{"name":"ONION04330","text":"(-Offended Onion-)□△▽◎!?"},{"name":"SYSTEM","text":"The offended onion takes no leave of you as it darts off. It does not appear to be the culprit you are after."},{"name":"GARLIC04330","text":"(-Gobsmacked Garlic-)◎○▽△□◎!?"},{"name":"SYSTEM","text":"The gobsmacked garlic is so affronted by your pestering, it has fled. It does not appear to be the culprit you are after."},{"name":"QUEEN04330","text":"(-Quizzical Queen-)△▽◎◎□＄￥◎!?"},{"name":"SYSTEM","text":"The quizzical queen up and flees in a flustered state, leaving behind apples. It would appear that this knavish mandragora was behind the fruit-napping."},{"name":"CULINARIAN04330","text":"Ah, there you are. I've come up empty-handed, sad as that is to admit. How did you fare? Were you able to recover the apples?"},{"name":"CULINARIAN04330","text":"You were! Oh my, I can't thank you enough. Goodness me... Now that I've a proper look at them they're rather enormous, aren't they? Funny how I didn't see that before."},{"name":"CULINARIAN04330","text":"Labyrinthos, as you've surely noticed, is entirely man-made, and our continued prosperity is thanks in part to the elemental reactor and the false sun. Though, if truth be told, those two things are likely to blame for our oversized fruit."},{"name":"CULINARIAN04330","text":"Word is there's research afoot to see if the above ground orchards could produce something of a similar size as well. Given what little we know, though, I'm sure that day is quite a long way off."},{"name":"CULINARIAN04330","text":"Oh, begging your pardon. Here I am, talking your ear off when I'm sure you've better things to be getting on with. Heavens know I certainly do─apple pies don't bake themselves, now do they. Thank you again for your help!"}],"reward":{"gil":735,"items":[{"id":35714}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69978]}},"partials":[{"type":"npc","id":"1041377","obj":{"i":1041377,"n":"Distressed Chef","l":3708,"q":1}},{"type":"item","id":"35714","obj":{"i":35714,"n":"Chondrite Bracelet Coffer (IL 545)","l":1,"c":26566,"t":61}},{"type":"quest","id":"69978","obj":{"i":69978,"n":"No Job Too Small","g":11,"l":"Labyrinthos","s":596}}]}