{"quest":{"name":"The Case of the Missing Gleaner","location":"Labyrinthos","id":69869,"patch":6.0,"sort":8106,"eventIcon":71221,"issuer":1041383,"target":1041383,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The reactor operator is wearing a most impatient look."],"objectives":["Find the seedkin gleaner.","Speak with the elemental reactor operator."],"dialogue":[{"name":"REACTORSTAFF04333","text":"Excuse me, but can I trouble you for a moment? I'm looking for someone, you see, and I was hoping you might help."},{"name":"REACTORSTAFF04333","text":"I was due to receive a pair of beasts captured in Saint Mocianne's Arboretum, but the gleaner who's meant to make the delivery has yet to appear, and I've grown rather tired of waiting."},{"name":"REACTORSTAFF04333","text":"I tried reaching him via linkpearl, but to no avail. I'm tempted to go out and search for him myself, but...what if he arrives and I'm not here? So, would you be willing to find said gleaner for me?"},{"name":"REACTORSTAFF04333","text":"Thank you. He ought to be relatively easy to spot I should think, considering he's traveling with two mud-covered seedkin."},{"name":"REACTORSTAFF04333","text":"Search west of here first. I'll check around here, just to make sure he's not rounding the corner or some such. Should you find him before I do, hurry back here, will you?"},{"name":"GLEANER04333","text":"&lt;pant&gt; Thank goodness you're here... Prabhasa caught me by surprise... Gave me a nasty shock. But what are you doing all the way out here? "},{"name":"GLEANER04333","text":"Ah, of course. I suppose all this waiting would make anyone rather nervous. I'll give my apologies to the operator when I deliver these specimens."},{"name":"GLEANER04333","text":"As for the specimens themselves...well, let's just say I'm rather surprised they're still in one piece, despite being bathed in lightning. Their earth alignment probably saved them, come to think of it."},{"name":"GLEANER04333","text":"At any rate, thank you, kind stranger. Doubt I'd still be among the living if not for your aid! Right then, I had better get going. Don't want to keep the operator waiting any longer than he already has."},{"name":"REACTORSTAFF04333","text":"There you are. I was wondering when I would see you again. The gleaner told me everything that happened─how you got him out of a tight spot."},{"name":"REACTORSTAFF04333","text":"He seems to have escaped largely unscathed, but the chirurgeons are giving him a thorough inspection, just in case."},{"name":"REACTORSTAFF04333","text":"You may not know this, but they're actually a variety of korpokkur, only these happen to be smeared in a unique type of mud originating from the arboretum."},{"name":"REACTORSTAFF04333","text":"Judging by the look on your face, you already know of this species, don't you? Yes, something tells me you're already quite intimate with the arboretum. Isn't it just a wonderful place? "},{"name":"REACTORSTAFF04333","text":"You must be wondering why I required these muddy little things. Well, I had a theory that their earth alignment might prove to be of use in the amplification of said element. I had not expected such an unfortunate accident would come of my curiosity, though."},{"name":"REACTORSTAFF04333","text":"Well, we're none of us the worse for wear, so perhaps not <span class=\"emphasis\">that</span> unfortunate? The gleaner's still alive and kicking, and the samples made it safely here─all thanks to you, of course. So, all's well that ends well, yes?"}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69978]}},"partials":[{"type":"npc","id":"1041383","obj":{"i":1041383,"n":"Elemental Reactor Operator","l":3708,"q":1}},{"type":"quest","id":"69978","obj":{"i":69978,"n":"No Job Too Small","g":11,"l":"Labyrinthos","s":596}}]}