{"quest":{"name":"Dolling out Punishment","location":"Labyrinthos","id":69868,"patch":6.0,"sort":8209,"eventIcon":71221,"issuer":1037565,"target":1037565,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Jessamy wishes to bend the ear of any man, woman, or child willing to listen."],"objectives":["Survey the fiend carcass, subdue the rogue mammet, and place it in the coffer upon its defeat.","Deliver the mammet-filled coffer to Jessamy."],"dialogue":[{"name":"JESSAMY","text":"Where could it have gone? What a bother this is... If only I could find someone who─ Oh! Fortune is on my side indeed."},{"name":"JESSAMY","text":"You seem the doughty sort. Might you help me locate a missing mammet?"},{"name":"JESSAMY","text":"A colleague has reported that one has escaped and gone on a rampage. It was last sighted wandering southeast of here, where it has slain one of the specimens."},{"name":"JESSAMY","text":"We've tried to deactivate the mammet remotely, but it has outright ignored our commands. Now our only recourse is to stop that willful thing by force. Perhaps you could do the honors?"},{"name":"JESSAMY","text":"If you're up for it, I'll need you to locate it and put it out of commission. Once that pugnacious poppet has been silenced, place it in this coffer, and return it to me. So, will you help?"},{"name":"JESSAMY","text":"Fantastic! I knew you weren't the type to say no to a man in need. Find the corpse of the fiend it fought, and you're like to come across that directionless doll."},{"name":"JESSAMY","text":"According to the report, it was powerful enough to defeat the creature...though that does not bode well for us. We've been left to finish the job!"},{"name":"JESSAMY","text":"Were you able to retrieve our little runaway and shove him into that container? I am ready to take it off your hands whenever you are willing to part with it...though I'm not sure why you would want to hang onto it for longer than necessary."},{"name":"JESSAMY","text":"Goodness, you've done it! I can't thank you enough, truly. Not sure what I would've done had you not come along."},{"name":"JESSAMY","text":"This mammet's unfortunate escape is the work of the Loporrits, you know. They meant no harm, I'm sure, but they insisted on tinkering with the thing's innards─wanted to make some “improvements,” apparently."},{"name":"JESSAMY","text":"And, as you can see, their earnest meddling has caused us a deal of grief. To be fair, they did look rather contrite when I told them what had transpired."},{"name":"JESSAMY","text":"I can't stay angry at them, though. They had only the best intentions. In fact, they need some cheering up after the tongue-lashing I gave them. Yes, they deserve the thickest, crunchiest carrots I can find! And on that note, farewell, adventurer, and thank you."}],"reward":{"gil":735,"items":[{"id":35715}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69982]}},"partials":[{"type":"npc","id":"1037565","obj":{"i":1037565,"n":"Jessamy","l":3708,"q":1}},{"type":"item","id":"35715","obj":{"i":35715,"n":"Chondrite Ring Coffer (IL 545)","l":1,"c":26567,"t":61}},{"type":"quest","id":"69982","obj":{"i":69982,"n":"Hither and Yarns","g":11,"l":"Labyrinthos","s":600}}]}