{"quest":{"name":"Seeing Red","location":"Labyrinthos","id":69862,"patch":6.0,"sort":8101,"eventIcon":71221,"issuer":1037575,"target":1037575,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Fjola seeks those in possession of both a green thumb and a penchant for punishing plants."],"objectives":["Use the thick burlap sack to capture a subdued stray tomato.","Deliver the stray tomato to Fjola."],"dialogue":[{"name":"FJOLA","text":"Oh my, the ways of Thaliak are as mysterious as they are providential! To think a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> so robust as you would appear before me in my hour of need. If this is not divine intervention, I know not what is. "},{"name":"FJOLA","text":"I face a trial for which I am not equal, nor shall ever be. It involves the capture of my most feared nemesis: &lt;hurk&gt; tomatoes. You see? I can barely speak the vile beast's name without my gorge rising!"},{"name":"FJOLA","text":"You would do well to consider my offer, truly! I have money set aside─quite a bit of it, in fact. All you need do is capture one of those vile vegetables. You'll find them near Meryall Agronomics, and they are quite hard to miss, disgusting things that they are."},{"name":"FJOLA","text":"This is a task I will never be able to complete on my own, of that much I can assure you. Even the thought of touching one of those nasty little things makes me...&lt;hurk&gt; P-Please hurry. The sooner this business is behind me, the better!"},{"name":"FJOLA","text":"Well? Were you able to capture one of those terrible t-t─&lt;hurk&gt;─tomatoes?"},{"name":"FJOLA","text":"Eeep...!"},{"name":"FJOLA","text":"P-Pardon me. Even in this sack, I cannot stomach the wretches. But better in than out, I suppose. At least it won't get its disastrously painful juices into anyone's eyes!"},{"name":"FJOLA","text":"You must be curious as to why tomatoes maddened into violence were running amok. Well, the truth is, a gleaner had sowed a congeries of vegetable seeds to cultivate on the plantation, and a few of these vermin managed to slip in unnoticed."},{"name":"FJOLA","text":"The soil was exceptionally fertile, by the looks of it, because the creatures proliferated with alarming ease─more so than anyone could have possibly guessed."},{"name":"FJOLA","text":"And to provide this tale with an even stranger twist, the juices they squirted into my eyes had a salubrious effect. I no longer have need of my glasses─I can see with perfect clarity now! Though I was in a <span class=\"emphasis\">great</span> deal of pain, mind you."},{"name":"FJOLA","text":"Well, when life gives you tomatoes, make...eye juice? No, that hasn't a very pithy ring to it at all. At any rate, your services have been most helpful. I will begin my research as soon as I am back in the laboratory."},{"name":"FJOLA","text":"Ah, and before I forget─your reward!"}],"reward":{"gil":835,"items":[{"num":2,"id":36064}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69978]}},"partials":[{"type":"npc","id":"1037575","obj":{"i":1037575,"n":"Fjola","l":3708,"q":1}},{"type":"item","id":"36064","obj":{"i":36064,"n":"Sykon Salad","l":560,"c":24151,"t":46}},{"type":"quest","id":"69978","obj":{"i":69978,"n":"No Job Too Small","g":11,"l":"Labyrinthos","s":596}}]}