{"quest":{"name":"To Care Enough to Send the Very Best","location":"Labyrinthos","id":69863,"patch":6.0,"sort":8207,"eventIcon":71221,"issuer":1041375,"target":1041375,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>A vexed researcher in Sharlayan Hamlet wishes there were more hours in the day."],"objectives":["Speak with the young gleaner.","Deliver the portrait to the experienced researcher."],"dialogue":[{"name":"RESEARCHER04327","text":"Oh my... A conundrum indeed. What am I to do?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Is something the matter?"},{"name":"A1","text":"Tell me what's wrong."},{"name":"RESEARCHER04327","text":"Well, aren't you a kind sort to take an interest in a stranger's woes. It's my son, you see. He's a gleaner stationed in the Near East, and he's recently returned to deliver his procurements."},{"name":"RESEARCHER04327","text":"I just received word from him a moment ago, asking me to meet him in the Archeion. Apparently, he has some sort of gift for me. Is that not thoughtful?"},{"name":"RESEARCHER04327","text":"In a stroke of ill luck, however, something urgent has come up, which I'm obliged to attend to. By the time I'm done with my business, I've little doubt my darling boy will already be gone, off on his next assignment to who knows where."},{"name":"RESEARCHER04327","text":"So you see why I'm in a pickle, surely. As much as I want to, I can't claim the gift myself. But perhaps you could in my stead, if you've the time on your hands, that is?"},{"name":"RESEARCHER04327","text":"You do? Why, thank you! I will return as soon as I'm able, so let us meet here once you have taken receipt of the present."},{"name":"GLEANER04327","text":"Hold a moment. I know you. Yes, you're <span class=\"highlight\">Forename</span>─the famous adventurer, are you not? To what do I owe the honor? "},{"name":"GLEANER04327","text":"Oh, my mother is busy, you say? That is most disheartening to hear. I wanted to tell her in person that she is now a grandmother newly made. My wife has born us a healthy baby."},{"name":"GLEANER04327","text":"I'd written to share news that we were expecting, but not that she had given birth. I had hoped to see the look on my mother's face when I told her of the happy event."},{"name":"GLEANER04327","text":"It's quite all right... No, honestly─it is. She works tirelessly for the good of all. I can hardly blame her for being unable to come running at a moment's notice. It makes me proud, in fact, to think she is so important she cannot even spare a moment to see me."},{"name":"GLEANER04327","text":"Hopefully she can spare a moment for this, though. Will you give this portrait to her? It's of me, my wife, and our newborn─her grandchild."},{"name":"GLEANER04327","text":"Now then, I must be off. There is work to be done, and I am sure my mother would be proud to know her son is following in her hardworking footsteps."},{"name":"RESEARCHER04327","text":"What fortuitous timing! I've only just arrived myself. So, what news from my son? What was it he was so eager to give me?"},{"name":"RESEARCHER04327","text":"I-Is this...? Oh goodness, it is, isn't it? It's a portrait of his family, and it includes my grandchild! Oh, how cherubic and darling. There's no baby more beautiful in all the world."},{"name":"RESEARCHER04327","text":"This has put a fire under me, I daresay. If I hadn't reason enough before, then surely this child will keep me motivated to continue my research. I will make sure that this little bundle of joy has a world in which they can grow up happy and hale."},{"name":"RESEARCHER04327","text":"And you and yours have given this little bundle of joy a chance to grow up happy and hale. Perhaps I'll go see their family once my research has slowed a bit. That would be nice, would it not?"},{"name":"RESEARCHER04327","text":"You've made me happier than you could possibly know. Thank you, truly. It isn't much, I grant you, but here─something for your pains."}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69982]}},"partials":[{"type":"npc","id":"1041375","obj":{"i":1041375,"n":"Experienced Researcher","l":3708,"q":1}},{"type":"quest","id":"69982","obj":{"i":69982,"n":"Hither and Yarns","g":11,"l":"Labyrinthos","s":600}}]}