{"quest":{"name":"Let the Good Times Troll","location":"Labyrinthos","id":69865,"patch":6.0,"sort":8104,"unlocksFunction":1,"eventIcon":71341,"issuer":1041129,"target":1041129,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>A veterinarian in Sharlayan Hamlet is wrangling with a beast of problem."],"objectives":["Find the wayward troll and slay any analas that attack.","Give the ripe fruit to the wayward troll.","Speak with the veterinarian."],"dialogue":[{"name":"RESEARCHER04329","text":"Excuse me, <span class=\"alternative-container\"><span class=\"alternative\">ma'am</span><span class=\"alternative\">sir</span></span>. I couldn't help but notice that you've a way about you that simply screams “I have an affinity for creatures of the wilds.” And since I'm never wrong about such things, might I trouble you?"},{"name":"RESEARCHER04329","text":"You see, amongst the troops of trolls living in the Outer Circuit, I came upon one who was sick beyond measure."},{"name":"RESEARCHER04329","text":"I took the poor creature in at once and saw him healed, of course, but when I attempted to return him to his rightful home, he flew into a panic, as if he could not bear the thought of going back."},{"name":"RESEARCHER04329","text":"To make matters worse, the troll saw fit to escape into a den of analas. I would go after him, but I'm so fumble-footed I'll scare him off like as not, and be torn limb from limb for my pains by the fiends!"},{"name":"RESEARCHER04329","text":"So, I turn to you. Would you seek out this troll of which I spoke? I shall provide you with his favorite food, and with it, you should be able to calm the piteous thing. Hopefully that will be enough to see his senses restored and for him to come hurrying back."},{"name":"RESEARCHER04329","text":"And, though I shudder to think of it, if any of those fell analas seek to impede you or pester that troll, make those beasts regret their interference. Oh, and don't worry─you will be rewarded for your efforts!"},{"name":"RESEARCHER04329","text":"I pray that troll can get hold of himself and return here in one piece. Let's hope the food I gave you does the trick...and that none of those pesky analas attempt to undermine our efforts."},{"name":"TROLL04329","text":"Grrr..."},{"name":"TROLL04329","text":"Muaaah!"},{"name":"TROLL04329","text":"Grrr..."},{"name":"RESEARCHER04329","text":"Look, he's returned! I can't thank you enough."},{"name":"RESEARCHER04329","text":"I know they may not look it, but trolls are really quite intelligent. Indeed, they are an intrinsic part of the woodlands of Labyrinthos, and keep it healthy and thriving."},{"name":"RESEARCHER04329","text":"Though we've a responsibility to put down the more violent and unruly ones, most trolls─such as this one─are kind, docile things. In fact, my friend here has a real chance of becoming leader of his tribe, perhaps even guardian of the forest someday."},{"name":"RESEARCHER04329","text":"It is we who saw these creatures removed from their natural habitats and relocated them within Labyrinthos. Thus, we've a responsibility to watch over them, to ensure they are well. And it would be too cruel to dispose of one simply because they're under the weather."},{"name":"RESEARCHER04329","text":"Ah yes, your reward─here, as promised. Now then, it's high time I saw this fellow returned to the Outer Circuit. Farewell, adventurer!"}],"reward":{"gil":815,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69978]}},"partials":[{"type":"npc","id":"1041129","obj":{"i":1041129,"n":"Vexed Veterinarian","l":3708,"q":1}},{"type":"quest","id":"69978","obj":{"i":69978,"n":"No Job Too Small","g":11,"l":"Labyrinthos","s":596}}]}