{"quest":{"name":"Stars Like Gems","location":"Ultima Thule","id":69876,"patch":6.0,"sort":9140,"eventIcon":71221,"issuer":1038010,"target":1038010,"genre":126,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Seih Loskh gazes longingly into the distance."],"objectives":["Search for signs of life.","Report to Seih Loskh."],"dialogue":[{"name":"SEIHLOSKH","text":"Traveler... Thy coming hath stirred a longing in me."},{"name":"SEIHLOSKH","text":"From where I lie, I behold naught but a desolate waste...but perhaps life doth persist beyond my ken. The smallest of creatures, or a single budding blossom..."},{"name":"SEIHLOSKH","text":"It may remain ever beyond my reach, for these wounds of mine heal not with time. Yet I would know of them. I would know if any cause for hope lingereth still upon our star..."},{"name":"SEIHLOSKH","text":"I beg thee, grant me a reason to take heart."},{"name":"SYSTEM","text":"The land is barren as far as the eye can see. No life is to be found here."},{"name":"SEIHLOSKH","text":"Dost thou return with glad tidings?"},{"name":"SEIHLOSKH","text":"Flowers─a joyous sight. Are there more whence these came? Didst thou find a thriving forest, or a resplendent field?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"These are sort of...it."},{"name":"A1","text":"Naught but a barren expanse, I'm afraid."},{"name":"A1","text":"Er..."},{"name":"SEIHLOSKH","text":"...'Tis as I feared. To see it now, canst thou even imagine how our star once teemed with life? How it flourished beneath golden sun and a trio of moons, stars shining like gemstones in the night?"},{"name":"SEIHLOSKH","text":"My brethren and I loved naught more than to soar amidst the clouds of green, teaching our eager hatchlings the delights of the hunt..."},{"name":"SEIHLOSKH","text":"These flowers once grew upon the mountaintops there, high among the clouds. So small did they seem to us, their fruit better suited to feeding our star's tiniest creatures... We rarely paid a single blossom any mind."},{"name":"SEIHLOSKH","text":"Yet together, vibrant with the turn of the seasons...they were breathtaking. Would that I could return, to appreciate the sight as we should have then."},{"name":"SEIHLOSKH","text":"...I had nearly forgotten what this world once was. Though it may never be so again, thou hast my gratitude for returning to me these precious memories."}],"reward":{"gil":655},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70000]}},"partials":[{"type":"npc","id":"1038010","obj":{"i":1038010,"n":"Seih Loskh","l":3712,"q":1}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}}]}