{"quest":{"name":"That Once Rang Clear","location":"Ultima Thule","id":69874,"patch":6.0,"sort":9130,"eventIcon":71221,"issuer":1038013,"target":1038013,"genre":126,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Kohl Ahleh fears for the welfare of a friend."],"objectives":["Speak with the pale dragon.","/pet the pale dragon.","Report to Kohl Ahleh."],"dialogue":[{"name":"KOHLAHLEH","text":"Little wanderer... Hast thou the courage to ken what awaits beyond this oasis? My kin, twisted body and soul, or turned to ash...all long since rotted underneath..."},{"name":"KOHLAHLEH","text":"Wilt thou venture amidst these horrors, to see if our brother yet stands? Ne'er hath he moved from his place of mourning, ere his consort was thus entombed..."},{"name":"KOHLAHLEH","text":"Would that I could bring him the solace of a gentle touch, but I dare not seek him now. Shouldst thou wish it, thou shalt know him by the pallor of the forsaken..."},{"name":"KOHLAHLEH","text":"I prithee journey past the fissures, beyond even Ahm Nohl, and seek my closest of kin... His wounds are many, but by a gentle touch they may be soothed for a time."},{"name":"SYSTEM","text":"The dragon, like so many others, is mired in his own grief. You may draw his attention if you <span class=\"highlight\">pet</span> him gently as Kohl Ahleh suggested."},{"name":"DRAGONB04338","text":"Thy gentle caress, like unto the warmth of more joyous times..."},{"name":"DRAGONB04338","text":"Thou art not of my kind. Why hast thou come?"},{"name":"DRAGONB04338","text":"So he has not yet forgotten me... I pity him."},{"name":"DRAGONB04338","text":"At times I wonder if my love doth pity me in turn. All of us unchanging, unable to be reborn..."},{"name":"DRAGONB04338","text":"Yet if naught else remains of us...we have memory. Thus do I remain beside my beloved, through a thousand thousand quiet moments. Forever..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"There is a better way to honor your love. Weave a song."},{"name":"A1","text":"I know a dragon who once believed herself forsaken..."},{"name":"DRAGONB04338","text":"Thou believest I need not languish in silence? Hmph..."},{"name":"DRAGONB04338","text":"Perhaps thou art correct. My beloved was generous, noble, and took much joy in our skies... None is more deserving of a proud melody."},{"name":"DRAGONB04338","text":"I have not the strength to weave it in this moment...but perhaps in time. I thank thee for guiding me aright."},{"name":"DRAGONB04338","text":"Pray tell Kohl Ahleh we will meet again..."},{"name":"KOHLAHLEH","text":"How fareth my kin?"},{"name":"KOHLAHLEH","text":"I see... Thou art wiser than thou knowest, for our brother was once renowned for his verse. It would be an honor and a joy to hear his voice raised in song again."},{"name":"KOHLAHLEH","text":"Perhaps, when next you return, thou shalt hear it as well."}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70000]}},"partials":[{"type":"npc","id":"1038013","obj":{"i":1038013,"n":"Kohl Ahleh","l":3712,"q":1}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}}]}