{"quest":{"name":"Futures Lost","location":"Ultima Thule","id":69873,"patch":6.0,"sort":9120,"eventIcon":71221,"issuer":1038008,"target":1038008,"genre":126,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Kohm Noskh gazes upon you with sorrowful eyes."],"objectives":["Slay the bellicose broodmother.","Report to Kohm Noskh."],"dialogue":[{"name":"KOHMNOSKH","text":"Tiny traveler... Thou hast traversed the great expanse to stand before me. I ask thee─on thy journey, didst thou find strength?"},{"name":"KOHMNOSKH","text":"None here have been spared the torment of loss...yet even tragedy cometh not in equal measure."},{"name":"KOHMNOSKH","text":"Nay, of all my kin, the broodsires feel it most deeply. Eggs crushed before their eyes, hatchlings twisted beyond recognition...they cannot be blamed for turning to madness."},{"name":"KOHMNOSKH","text":"One I would have you slay, for mine own power sufficeth not to end her suffering. She yet wandereth, restless, near the ash-choked lake, though naught but poison is to be found there now..."},{"name":"KOHMNOSKH","text":"The lake lieth beyond the vitrified fort. End the broodmother's suffering, I beg thee..."},{"name":"BALLOON","text":"Thou... Thou art the murderer of my children!"},{"name":"BALLOON","text":"Long... So long have I been weary..."},{"name":"KOHMNOSKH","text":"Thy countenance speaketh volumes... I thank thee."},{"name":"KOHMNOSKH","text":"The metal demons struck without warning... Beautiful and pitiless as falling stars."},{"name":"KOHMNOSKH","text":"We fought, yes... Yet for all our savagery, we failed to protect the young. What few survived emerged from their eggs disfigured and screaming..."},{"name":"KOHMNOSKH","text":"Would that fate had taken a different course. We might have welcomed them to this world together, and guided them unto a brilliant future..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Midgardsormr's children live on."},{"name":"A1","text":"There are still dragons on my star."},{"name":"A1","text":"I have encountered young dragons in my travels."},{"name":"KOHMNOSKH","text":"So the young have found their place elsewhere... Our kind shall live on."},{"name":"KOHMNOSKH","text":"I am gladdened to hear not all was in vain. May thy path lead thee true, traveler."}],"reward":{"gil":655},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70000]}},"partials":[{"type":"npc","id":"1038008","obj":{"i":1038008,"n":"Kohm Noskh","l":3712,"q":1}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}}]}