{"quest":{"name":"Ending as One","location":"Ultima Thule","id":69878,"patch":6.0,"sort":9210,"unlocksFunction":1,"eventIcon":71341,"issuer":1040876,"target":1040876,"genre":126,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The thinking Ea is quite visibly ruminating."],"objectives":["Defeat two drifting Ea to lure out the unified Ea, then slay it.","Speak with the thinking Ea."],"dialogue":[{"name":"THINK04342","text":"How fortunate that you are here, corporeal being, for we are in need of your assistance."},{"name":"THINK04342","text":"I am sure you saw some of my kind drifting about the untamed wilds just over there. As I understand, they are binding their spirits together as one in hopes of diluting their consciousnesses and thereby erasing their sorrows."},{"name":"THINK04342","text":"Unfortunately, the resulting amalgam doubtless longs for more minds to incorporate, and if other Ea approach it, we may be drawn into the growing mass against our will."},{"name":"THINK04342","text":"Your corporeal form seems to outweigh your mental capacity, so you should be safe, however. Please destroy the collective consciousness before it kills us all."},{"name":"THINK04342","text":"Your ready acceptance gladdens me. I believe that if you lay waste to two wandering souls, the amalgam will appear. Do be aware that while your mind is safe, it may present other dangers should it realize what you are attempting."},{"name":"THINK04342","text":"By my estimation, the amalgam should appear after two wandering souls are erased."},{"name":"THINK04342","text":"I see you made quick work of the amalgam. Of course, it is well within each Ea's rights to choose when they wish to end their own existence. But to force others to join them─however accidentally─is another matter."},{"name":"THINK04342","text":"This whole ordeal has led me to contemplate how I should meet my own demise... Ah, but forgive me─I forgot such matters are not left to choice for your kind."},{"name":"THINK04342","text":"Truthfully, I envy you. To go forth each day full of vigor, not knowing when your lives will be unexpectedly snuffed out... It must feel incredible."},{"name":"THINK04342","text":"...My apologies if I have made you uncomfortable. I am unused to speaking with mortals."},{"name":"THINK04342","text":"Be assured that I appreciate your help, and you have given me much to think about regarding death─or, perhaps, life."}],"reward":{"gil":735,"aetherCurrent":1,"items":[{"num":2,"id":5784,"one":1},{"num":2,"id":5785,"one":1},{"num":2,"id":5773,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69994]}},"partials":[{"type":"npc","id":"1040876","obj":{"i":1040876,"n":"Thinking Ea","l":3712,"q":1}},{"type":"item","id":"5784","obj":{"i":5784,"n":"Deepwood Green Dye","l":30,"c":22810,"t":55}},{"type":"item","id":"5785","obj":{"i":5785,"n":"Celeste Green Dye","l":30,"c":22810,"t":55}},{"type":"item","id":"5773","obj":{"i":5773,"n":"Lime Green Dye","l":1,"c":22810,"t":55,"p":216}},{"type":"quest","id":"69994","obj":{"i":69994,"n":"Where Kn∞wledge Leads","g":11,"l":"Ultima Thule","s":612}}]}