{"quest":{"name":"Final Words, Final Thoughts","location":"Ultima Thule","id":69879,"patch":6.0,"sort":9220,"eventIcon":71221,"issuer":1038026,"target":1038026,"genre":126,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Row-rooth has something to ask you."],"objectives":["Speak with Row-rooth.","While transfigured, read the epitaphs.","Speak with Row-rooth.","While transfigured, read the epitaph.","Speak with Row-rooth."],"dialogue":[{"name":"ROWROOTH","text":"I have a question─one that can only be answered by a being of flesh and bone. Will you hear it?"},{"name":"ROWROOTH","text":"Thank you. Before I ask, however, I require that you learn more of my kind, lest your answer be senseless and vapid."},{"name":"ROWROOTH","text":"You can come to know us through our final words─though, alas, you cannot comprehend them in your corporeal form."},{"name":"ROWROOTH","text":"Thus, I shall temporarily free you from your body, allowing you to perceive as we Ea do. Please indicate when you are ready to shuffle off your mortal coil."},{"name":"ROWROOTH","text":"You have prepared, yes? Very well. After you have been liberated, I ask that you read three epitaphs ere returning to me."},{"name":"ROWROOTH","text":"Please brace yourself, as there is the recorded evidence that this may “feel weird”..."},{"name":"SYSTEM","text":"In order to progress, you must complete the objectives while transfigured."},{"name":"SYSTEM","text":"You will return from your transfigured status if you move too far away. Look to your map for the transfiguration's area of effect."},{"name":"SYSTEM","text":"If necessary, speak with Row-rooth to restore the transfiguration."},{"name":"ROWROOTH","text":"I ask that you read three epitaphs, then return to me."},{"name":"ROWROOTH","text":"Tragically, your spirit has re-entered your body. Permit me to free you once more."},{"name":"SYSTEM","text":"Something is written here in an unfamiliar script. You cannot read it as you are."},{"name":"SYSTEM","text":"In order to progress, you must be under the transfigured status."},{"name":"MONUMENTA04343","text":"(-Epitaph-)I grasp eternity, yet I hold only loss.<br>If forever has an end,<br>Why has it not come?"},{"name":"MONUMENTB04343","text":"(-Epitaph-)We fought to go beyond our star;<br>We fought to go beyond our dimension;<br>We fought for nothing."},{"name":"MONUMENTB04343","text":"(-Epitaph-)With no future, we turn to the past,<br>Knowing none have turned to our present.<br>We are the dead end."},{"name":"ROWROOTH","text":"You have read them? This is well. However, you have yet to look upon our most important text. Please seek it in the charming wooded area outside our home."},{"name":"ROWROOTH","text":"Please seek our most important text amidst the memory of trees. I do not know how to make this any clearer."},{"name":"MONUMENTA04343","text":"(-Epitaph-)The price of eternity is joy;<br>Its gift, unending sorrow."},{"name":"ROWROOTH","text":"So you have read all that was left behind..."},{"name":"ROWROOTH","text":"Those inscriptions were written by the first of our kind. The first to know the pinnacle of enlightenment, and the first to know the depths of despair."},{"name":"ROWROOTH","text":"They have prepared you to answer my question. As someone bound to a corporeal form, do you think there is hope to be found in life?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Of course there's hope!"},{"name":"A1","text":"The only way to know is to keep living."},{"name":"ROWROOTH","text":"Strange... But perhaps it is precisely that spongy form which allows you to cling to the intangible unto death. How fortunate for you."},{"name":"ROWROOTH","text":"Fascinating... It must be precisely that spongy form which allows you to cling to the intangible unto death. How fortunate for you."},{"name":"ROWROOTH","text":"Fascinating... It appears that embarking on that quest for hope and seeing it to its ultimate conclusion is a sort of corporeal privilege."},{"name":"ROWROOTH","text":"Fascinating... Though your flesh is spongy and weak, it gives you the strength to live in pursuit of hope."},{"name":"ROWROOTH","text":"That was most edifying. Creatures of flesh enjoy shiny tokens, do they not? Please have some as thanks."},{"name":"ROWROOTH","text":"...Ah, yes. I shall return you to your body, as it seems you are fond of it."}],"reward":{"gil":975},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69994]}},"partials":[{"type":"npc","id":"1038026","obj":{"i":1038026,"n":"Row-rooth","l":3712,"q":1}},{"type":"quest","id":"69994","obj":{"i":69994,"n":"Where Kn∞wledge Leads","g":11,"l":"Ultima Thule","s":612}}]}