{"quest":{"name":"Cooler than Being Cool","location":"Labyrinthos","id":69870,"patch":6.0,"sort":8301,"eventIcon":71221,"issuer":1037593,"target":1037593,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Marvene is thinking long and hard about how best to acquire what she needs."],"objectives":["Obtain ice crystals from center somas.","Deliver the soma ice crystals to Marvene."],"dialogue":[{"name":"MARVENE","text":"Why, hello there. Hmmm, let me guess...you're an adventurer? A mercenary for hire, willing to stand against any beast, so long as the reward is commensurate?"},{"name":"MARVENE","text":"Well then, I've the job for you and a prize to match."},{"name":"MARVENE","text":"I'm in need of two rather unique crystals, which can be obtained from somas─ice giants of fierce repute. You'll find the frigid fiends lumbering about southeast of here. So, if you wouldn't mind?"},{"name":"MARVENE","text":"Bring me the crystals I've asked for, and you will have your reward. Should be easy enough work for you, I imagine. You seem like the sort of <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who has seen <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> fair share of scrapes."},{"name":"MARVENE","text":"Still in one piece, are you? Very good. Now, have you the crystals?"},{"name":"MARVENE","text":"Yes, exactly what I was looking for. Excellent work."},{"name":"MARVENE","text":"I see that glint in your eyes. You wish to know how I mean to use them, don't you? Then allow me to satisfy your curiosity. As you know, Kokkol and his fellow fools have seen fit to amplify fire-aspected aether using the reactor."},{"name":"MARVENE","text":"I see that glint in your eyes. You wish to know how I mean to use them, don't you? Then allow me to satisfy your curiosity as much as I'm able. Something foul is afoot with the reactor. I've heard tell that dangerous plans are in motion as we speak."},{"name":"MARVENE","text":"Abnormal heat signals have been detected in a portion of the aether conductor running beneath our feet. These ice crystals can counteract these undue temperature spikes by forcibly cooling the affected areas."},{"name":"MARVENE","text":"But enough about me and my woes. You have more than earned your reward, adventurer. Should I need any assistance in the future, I will be sure to call upon you and your expertise."}],"reward":{"gil":735,"items":[{"num":2,"id":36059}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69985]}},"partials":[{"type":"npc","id":"1037593","obj":{"i":1037593,"n":"Marvene","l":3708,"q":1}},{"type":"item","id":"36059","obj":{"i":36059,"n":"Giant Popoto Pancakes","l":545,"c":24072,"t":46}},{"type":"quest","id":"69985","obj":{"i":69985,"n":"Her Children, One and All","g":11,"l":"Labyrinthos","s":603}}]}