{"quest":{"name":"The Body Beautiful","location":"Ultima Thule","id":69883,"patch":6.0,"sort":10010,"eventIcon":71221,"issuer":1040882,"target":1040882,"genre":126,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The yearning Ea appears to be gazing at you intently."],"objectives":["Obtain two cores from wandering luminions.","Deliver the luminion cores to the yearning Ea."],"dialogue":[{"name":"SEEKINGTHEBODY04347","text":"Greetings, unfamiliar life-form. Being that you bear a corporeal form─as surely as I, as you can see, do not─perhaps you might offer me a way out of my predicament. You see, I have been attempting to fashion a vessel that may house our weary souls. Sadly, with no model to work from, I am ashamed to admit my experiments have failed─and rather spectacularly, at that. "},{"name":"SEEKINGTHEBODY04347","text":"You may have noticed the by-products of my failed labors, as they now wander aimlessly and pathetically about these environs. I had intended to clean up this mess myself, but the task might prove difficult for a formless being such as myself. Might you put the pitiful creatures out of their misery in my stead?"},{"name":"SEEKINGTHEBODY04347","text":"I thank you, curious one! If you might also retrieve for me their internal cores in the process, I daresay it would be of great benefit to me in future experiments. In any event, I eagerly await word of your inevitable success."},{"name":"SEEKINGTHEBODY04347","text":"Still lingering, are you? If you have forgotten the task, you are to hunt down two of those unfortunate luminions, and retrieve for me their cores. You need worry about nothing else─I understand that there is much here that is beyond your unenlightened mind's comprehension."},{"name":"SEEKINGTHEBODY04347","text":"Well? Do the unwitting products of my labors suffer no more? And have you brought back their cores to me? If so, do return them to me."},{"name":"SEEKINGTHEBODY04347","text":"...Yes. These are without a doubt the cores that form the doleful hearts of my kind. While I am disheartened to see my efforts end in this way, I can only learn what I can from my failures, that my future experimentations might give rise to a satisfactory vessel."},{"name":"SEEKINGTHEBODY04347","text":"...In any event, it has been quite some time since we have encountered any entities with even a modicum of intelligence, as you seem to possess. I daresay our conversations have provided us with a sliver of stimulation that has eluded us for ages."},{"name":"SEEKINGTHEBODY04347","text":"I am grateful for your assistance in more ways than one. I do hope the day will come when we can one day meet each other─ah, how might you say it?─in the flesh."}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70000]}},"partials":[{"type":"npc","id":"1040882","obj":{"i":1040882,"n":"Yearning Ea","l":3712,"q":1}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}}]}