{"quest":{"name":"A Life of Regret","location":"Ultima Thule","id":69889,"patch":6.0,"sort":10070,"icon":101151,"eventIcon":71221,"issuer":1042075,"target":1042075,"genre":126,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The anxious Ea looks longingly skyward.","The anxious Ea fears for the well-being of their friend, who has not emerged from their dwelling in quite some time, and is unresponsive when called. You agree to see if you cannot reach out to the anxious Ea's companion somehow.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Your skin prickles with sadness as you feel pulsating waves of misery from the Ea within. It would appear that the resident of the dwelling has been overcome with despair and means to end their own life. With a heavy heart, you decide to return to the anxious Ea to share what you have gleaned.","While respecting their feelings, the anxious Ea is not ready to let their friend pass into the void. To that end, they ask you to procure a lump of nerve tissue from one of the enigmatic “other ones” that roam in the vicinity of the wellspring of regret. Moved by the Ea's concern, you agree to the task.","You successfully hunt down an other one and extract its nerve tissue. Now all that remains is to deliver it back to the anxious Ea, that they might do all in their power to save their esteemed colleague from a dire fate.","Back at the abode, the Ea is able to use the nerve tissue you provided to amplify their thoughts to a degree where they can reach their friend─and in doing so prevent said companion's passing. Rejoicing that they will be able to enjoy philosophical musings and discussions with their companion for the foreseeable future, the no-longer-anxious Ea thanks you for your help and offers you a token of thanks before you go on your way."],"objectives":["Send out an empathetic wave toward the Ea dwelling.","Speak with the anxious Ea.","Defeat an other one to obtain its sinew.","Deliver the nerve tissue to the anxious Ea."],"dialogue":[{"name":"EA04353","text":"Hummm... Still no response. I wonder if they have already scattered to the wind. That would be ever so unfortunate, you see..."},{"name":"EA04353","text":"...My, what a large cranial dome you have─and impeccable timing. My esteemed colleague often holds council at their home here, but they have not emerged in quite some time. Perhaps you could pay a visit and see what the trouble may be?"},{"name":"EA04353","text":"They may be a bit taken aback if a stranger invades their thoughts, so I would advise transmitting a happy sentiment to show that you mean them no harm."},{"name":"MOANINGEA04353","text":"(-Disembodied Voice-)Unnnhhh... Leave me... There's...unghhh...nothing left..."},{"name":"SYSTEM","text":"The anguished groans of the Ea are resonating in your head. Tell the anxious Ea you were able to find remnants of their friend's thoughts."},{"name":"EA04353","text":"I see. If they mean to melodramatically evanesce into the abyss in the comfort of their own home, then I ought to respect their wishes. "},{"name":"EA04353","text":"And yet... I feel the need to be selfish and keep them here to confabulate further on such views. Yes, I shall have to talk them out of it!"},{"name":"EA04353","text":"For that, I shall need your help once more, large-headed-but-wholly-capable stranger. Could you fetch me a neurological sinew from an other one? You should find them wandering about the wellspring of regret..."},{"name":"EA04353","text":"You should be able to hunt down an other one in the vicinity of the wellspring of regret. Pull out one of the long, fibrous cords from its vertebrae. "},{"name":"EA04353","text":"Bah! It is no use! The walls of their humble abode are far too thick for my telepathy to penetrate! Did you bring me the sinew?"},{"name":"EA04353","text":"Perfect! This zigzagging fibrous cord is exactly what I need to amplify my empathy!"},{"name":"EA04353","text":"These do extinguish quickly, but it should be enough for me to rile my friend with some provocative persiflage. A moment, please."},{"name":"MOANINGEA04353","text":"Uuughhh... My mind still smarts... Your worn-out jape was bad enough, but did you have to <span class=\"emphasis\">shock</span> me as well?"},{"name":"EA04353","text":"I had entirely forgotten that, despite coming from a dumb beast, the neurological sinew from the other one would still transmit its last jolting thought─the killing blow you dealt it. "},{"name":"MOANINGEA04353","text":"Yes, well, it was enough to traumatize me back onto this plane, that much is certain. Ugh... I think I shall take a stroll around the plaza to rid myself of that unpleasant sensation. Good day."},{"name":"EA04353","text":"My friend always was a bit melodramatic in their conduct, but I do believe I will have to keep a closer eye on them from now on. Aside from their close call with dispersion, they are showing other signs that they are losing their faculties."},{"name":"EA04353","text":"We have a friendship that spans millennia. They can stand to wait a bit longer until the void takes us all─it would be dreadfully boring without their curt, fatalistic commentary."},{"name":"EA04353","text":"That being said, I shall make for the plaza as well. If they somehow manage to careen towards the elutriation tank, I shall be <span class=\"emphasis\">very</span> irritated."},{"name":"EA04353","text":"...Oh, and I do very much appreciate your assistance. I do not have much to offer, but I hope this shall suffice. Thank you for saving my friend's life."}],"reward":{"gil":935,"items":[{"num":2,"id":5729,"one":1},{"num":2,"id":5734,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70000]}},"partials":[{"type":"npc","id":"1042075","obj":{"i":1042075,"n":"Anxious Ea","l":3712,"q":1}},{"type":"item","id":"5729","obj":{"i":5729,"n":"Snow White Dye","l":30,"c":22811,"t":55,"p":216}},{"type":"item","id":"5734","obj":{"i":5734,"n":"Soot Black Dye","l":30,"c":22807,"t":55,"p":216}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}}]}