{"quest":{"name":"A Parent's Love","location":"Ultima Thule","id":69886,"patch":6.0,"sort":9180,"icon":101150,"eventIcon":71221,"issuer":1042070,"target":1042072,"genre":126,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>This mother worries for her child.","A distressed dragon requests you check on her daughter's welfare. Though she does not speak to why her brethren prevent her leaving Reah Tahra, she insists that she cannot go herself, so you accede.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Though you locate the dragon's daughter, she seems entirely unable to interact with her environment. Indeed, you are unsure whether she is alive at all.","You tell the unmoving dragonling's mother what you have witnessed, but she appears incapable of facing the reality of her daughter's condition. She does mention a consort of hers, however, who you duly head off to question.","In speaking to the mother's consort, you learn that her dragonling took the brunt of some manner of laser-based assault during the machine invasion. For reasons that have escaped memory and understanding, she was seemingly frozen in time at that very instant, and has remained hovering on the border between life and death ever since. Confronted with a sight far too disturbing to bear, her mother became obsessed with her child's condition even while persisting in the denial of its truth─a state of affairs which has now culminated in her slipping away from Reah Tahra while you were absorbed in conversation.","You follow the mother to the only place she could have gone, and are confronted with the shocking scene of her corpse. More surprising still are the words that then ring forth, seemingly from her still-static daughter.","The stoic consort finds the daughter's sudden and brief capacity for speech as perplexing as you do. Nevertheless, he believes that your sharing in this tale and its apparent conclusion has brought comfort to all involved."],"objectives":["Search for the dragonling in Ostrakon Deka-okto.","Speak with the unmourning mother.","Speak with the stoic consort.","Search for the empty-eyed dragon.","Speak with the stoic consort."],"dialogue":[{"name":"WANEDDRAGON04350","text":"Thou! Thou canst leave this place!"},{"name":"WANEDDRAGON04350","text":"Find my child in my stead, I beg thee. She doubtless wants for her mother's warmth, but my kin permit me not to quit this nest. They feign contrition, but if they truly pitied me, they would allow me to seek my child..."},{"name":"WANEDDRAGON04350","text":"Thou must go, and assure me of her safety."},{"name":"WANEDDRAGON04350","text":"The last I saw of my child, she was but a short distance from the shallow lake. Ask her how she fares, I beg thee..."},{"name":"HOLLOWEYESDRAGON04350","text":"..."},{"name":"SYSTEM","text":"The dragonling stares unblinking across the desolate landscape, eyes glassy enough that you cannot be certain she even remains among the living..."},{"name":"HOLLOWEYESDRAGON04350","text":"..."},{"name":"SYSTEM","text":"Clearly all is not well with this dragon. Her mother would surely wish to know..."},{"name":"WANEDDRAGON04350","text":"This cannot be..."},{"name":"WANEDDRAGON04350","text":"Thou must have given her a dreadful fright, for her to freeze so! Though she hath never been fond of strangers..."},{"name":"WANEDDRAGON04350","text":"'Tis clearer than ever that I must see her myself. If only I could be freed from the watchful eyes of my consort..."},{"name":"WANEDDRAGON04350","text":"Not moments ago did I feel his gaze upon me─once so loving, yet now so bitterly cold. How he doth patronize me!"},{"name":"WANEDDRAGON04350","text":"...Thine eyes bespeak curiosity. My consort was much the same, in times past─ever desiring to know more. A pity he changed so."},{"name":"WANEDDRAGON04350","text":"Nevertheless... He would surely divulge much if thou were to speak with him. Thou needst only seek the least pleasant countenance here."},{"name":"WANEDDRAGON04350","text":"Curiosity reigneth in thy mind, is this not so? My consort hath the answers thou seekest..."},{"name":"HOLLOWEYESDRAGON04350","text":"..."},{"name":"FRUSTRATEDDRAGON04350","text":"Verily, she is─was─my beloved consort...but she is lost to me now."},{"name":"FRUSTRATEDDRAGON04350","text":"Thou sought her progeny, didst thou not? Then thou knowest as well as I..."},{"name":"FRUSTRATEDDRAGON04350","text":"That dragonling was stripped of all she was by the machines. I recall the battle, the burst of heat and light...her smoldering form."},{"name":"FRUSTRATEDDRAGON04350","text":"I know not what occurred then, but when I returned to myself, she was there. Neither dead, nor truly alive...as if imprisoned in her final moments by some cruel deity. And so she hath remained ever since."},{"name":"FRUSTRATEDDRAGON04350","text":"When she found us, my consort broke somewhere deep within. She seeth naught beyond her child...though I do not imagine she seeth her true."},{"name":"FRUSTRATEDDRAGON04350","text":"And now, she hath gone... Thou knowest whence. 'Twas inevitable..."},{"name":"FRUSTRATEDDRAGON04350","text":"Though no hope remaineth in my heart...I should like to know what has become of them."},{"name":"SYTEM","text":"The mother lies still, never again to awake."},{"name":"HOLLOWEYESDRAGON04350","text":"My dear... I shall love...unto the end of time..."},{"name":"HOLLOWEYESDRAGON04350","text":"..."},{"name":"SYSTEM","text":"The dragonling speaks no more. Her mother's consort should be informed of what has happened here."},{"name":"FRUSTRATEDDRAGON04350","text":"Hmm... 'Tis strange. Though no stranger than the rest, perhaps..."},{"name":"FRUSTRATEDDRAGON04350","text":"Thou couldst not change their fates... Yet in learning our tale, thou hast come to share my burden...and theirs as well. I thank thee."}],"reward":{"gil":1015},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70000]}},"partials":[{"type":"npc","id":"1042070","obj":{"i":1042070,"n":"Unmourning Mother","l":3712,"q":1}},{"type":"npc","id":"1042072","obj":{"i":1042072,"n":"Stoic Consort","l":3712,"q":1}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}}]}