{"quest":{"name":"Left Alive","location":"Ultima Thule","id":69884,"patch":6.0,"sort":9160,"icon":101150,"eventIcon":71221,"issuer":1041058,"target":1041058,"genre":126,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Sehth Toskh senses a kindred spirit within you.","Sehth Toskh asks that you speak with several dragons who regret to this day that they were not able to join Midgardsormr in his escape, that they might take some comfort in your tales of faraway places.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You speak with two wyrms in Reah Tahra, though the solace they find in your words is somewhat limited by their abiding doldrums. Sehth Toskh has indicated that one more dragon that would benefit from your insight awaits to the southeast...","You journey toward the vitrified fort only to discover a similarly vitrified dragon, who Sehth Toskh introduces as an old friend who once wished to join Midgardsormr in his journey to a new star. Beleaguered by conquerors from the Alphatron Star as they were, none who would have followed the great wyrm were able to do so, and the life of the dragon before you was tragically cut short─however, Sehth Toskh clearly believes that there is some comfort to be found in the knowledge that their faith was well placed.","Having returned to the marginally less depressing Reah Tahra, Sehth Toskh thanks you for the bit of peace you have brought him by sharing your tidings of Midgardsormr. However grim the history of those in Ultima Thule remains, you too can take comfort in knowing that you have raised at least one dragon's sunken spirits this day."],"objectives":["Speak with the dragons about your home.","Seek out the dragon to the southeast.","Speak with Sehth Toskh."],"dialogue":[{"name":"SEHTHTOSKH","text":"Hmm... I sense the power of one of my kin upon thee. A covenant, perhaps, with a great wyrm long departed from our star..."},{"name":"SEHTHTOSKH","text":"Hmm... I sense the power of one of my kin upon thee─that of a great wyrm, long departed from our star. Though his gaze falleth not upon thee now..."},{"name":"SEHTHTOSKH","text":"“Midgardsormr”... Then that is the name by which thy kind know him."},{"name":"SEHTHTOSKH","text":"Long ago he left us, fleeing our home with his children. From thy presence, I surmise that his decision was the right one..."},{"name":"SEHTHTOSKH","text":"Some yet wish they had chosen the same path, though such regrets avail them naught. "},{"name":"SEHTHTOSKH","text":"Nevertheless, tales of thy star may divert them from their anguish for a time. Seek those who would hear thee in Reah Tahra and unto the vitrified isle, tiny mortal..."},{"name":"SEHTHTOSKH","text":"Two with whom I would have thee speak abide within this very nest. One... One remaineth by the battlefield."},{"name":"KOHLAHLEH","text":"Thou hailest from the star to which our brother fled? Tell me, then─doth thy home boast resplendent vistas, as ours once did?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It has vast blue seas, stretching far unto the horizon."},{"name":"A2","text":"It has wondrous islands that float among the clouds."},{"name":"KOHLAHLEH","text":"Ah... Though I shall never again dip my wings in such an ocean, perchance I may dream of one when next I slumber..."},{"name":"KOHLAHLEH","text":"Ah... Though I shall never again soar through the clouds, perchance I may bask in the splendor of such isles when next I slumber..."},{"name":"EHSKKAN","text":"The great wyrm that did take leave of this star... Yes, I remember him well. Are there many such tiny creatures on the star whence he fled?"},{"name":"Q2","text":"What will you say?"},{"name":"A1","text":"Many of all shapes and sizes!"},{"name":"A2","text":"There are many, and they have formed their own nations."},{"name":"EHSKKAN","text":"Hm... Then thy star, too, knoweth war. Differences lead only to conflict."},{"name":"EHSKKAN","text":"No matter how far thou venturest, thou cannot flee from this truth. No more could I. This fate was inevitable... It must have been..."},{"name":"SEHTHTOSKH","text":"Hast thou visited the vitrified fort? One of my kin there did dream of other stars..."},{"name":"KOHLAHLEH","text":"Soon I may dream of the visions thou hast imparted to me..."},{"name":"EHSKKAN","text":"Leave me, tiny creature... I have much to ponder."},{"name":"SEHTHTOSKH","text":"(-???-)Dost thou wonder who lieth beneath this veil of ash?"},{"name":"SEHTHTOSKH","text":"'Twas with this wyrm at my side that I looked to the skies and saw thy “Midgardsormr” departing for the great expanse. The machines were already upon us."},{"name":"SEHTHTOSKH","text":"He called to us─those of us who still lived─and begged us follow him, that we might find another star and start anew..."},{"name":"SEHTHTOSKH","text":"Alas, most branded him a coward who lacked the fire to defend his home. When he left, 'twas with but his own eggs."},{"name":"SEHTHTOSKH","text":"The mightiest of the machines gave chase as he fled─to many of my kin's jeering approval. The “coward” had proven useful, they said."},{"name":"SEHTHTOSKH","text":"However, some few did wish to follow him. Midgardsormr was wiser and more formidable than most─this, they believed. They knew he would forge a better fate than awaited us here..."},{"name":"SEHTHTOSKH","text":"Would that they had not been halted by the ferocity of the machines' onslaught, in the end."},{"name":"SEHTHTOSKH","text":"...Thou hast my gratitude for coming so far to meet mine old friend. Thy tale means more to us than thou shalt ever know."},{"name":"SEHTHTOSKH","text":"Return with me now to Reah Tahra. Thou art doubtless eager to away from this ill-favored place."},{"name":"SEHTHTOSKH","text":"Thou hast rendered solace unto us when we had naught but sorrow. I thank thee, <span class=\"highlight\">Forename Surname</span>."}],"reward":{"gil":855},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70000]}},"partials":[{"type":"npc","id":"1041058","obj":{"i":1041058,"n":"Sehth Toskh","l":3712,"q":1}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}}]}