{"quest":{"name":"Come Back to Us","location":"Ultima Thule","id":69880,"patch":6.0,"sort":9230,"eventIcon":71221,"issuer":1038030,"target":1038030,"genre":126,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Jaw-jaadg emits a muffled noise resembling a cough."],"objectives":["With the chat mode in <span class=\"highlight\">Say</span>, enter any phrase containing a “coo” sound to call out to the Ea.","Speak with the lingering Ea.","Speak with Jaw-jaadg."],"dialogue":[{"name":"JAWJAADG","text":"Fleshy one, come hither. I have a task of some import I would entrust to you. Worry not─it should be well within your capacities. You see, I wish to summon back one of my fellow Ea who lingers at the gate to the beyond."},{"name":"JAWJAADG","text":"To what end they wait there, I do not know. What I <span class=\"emphasis\">do</span> know is that if they do not return to us, their spirit will eventually unravel, leaving them nothing but a wandering entity like those on the outside."},{"name":"JAWJAADG","text":"And so, I would ask you to summon them back to our abode before they are consigned to such a fate. Can you do this for me?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Leave it to me."},{"name":"A1","text":"Can't you do this yourself?"},{"name":"JAWJAADG","text":"I have tried, but they do not respond─perhaps my own calls are too weak, or indistinguishable from the surrounding noises. Your voice, needless to say, would produce a more distinct and unusual sound, and thus be more likely to pique their interest. Well, what do you say?"},{"name":"JAWJAADG","text":"I am much obliged. Simply make for the gate and call out to my friend. Might I suggest a variant of the traditional Ea beckoning? Allow me to demonstrate. Ahem...<span class=\"emphasis\">coo-ooo-ooo-ooo</span>!"},{"name":"JAWJAADG","text":"Does my fellow Ea still linger by the gate to the beyond? Pray summon them back to our abode."},{"name":"SYSTEM","text":"coo"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase containing the word “coo” to call out to the Ea."},{"name":"WAITING04344","text":"(-Distant Voice-)Is that a beckoning I hear? The timbre of your cooing sounded rather...dull. Anyhow, if it is I you seek, you will find me to the north of where you stand."},{"name":"JAWJAADG","text":"Have you summoned my friend back from the gate yet? If not, please do it quickly. Our philosophical discussions are so drab without them. Their hypotheticals are irritatingly entertaining, you see."},{"name":"WAITING04344","text":"Are you the one who summoned me? No wonder your voice sounded so strange, with that fleshy body of yours. I have not seen your kind before─might you have come here from afar?"},{"name":"WAITING04344","text":"...I see. Then you must feel very privileged to have stumbled upon us. This gate here serves as the ingress to our bastion of enlightenment. All who come from afar to seek such knowledge must pass through."},{"name":"WAITING04344","text":"I had stood here for so long, expecting a visitor. Perhaps it is you for whom I have waited. I could see myself ready to greet someone from another world."},{"name":"WAITING04344","text":"...But why do you come to us now, in this moment? And why <span class=\"emphasis\">from</span> the village, not toward?"},{"name":"WAITING04344","text":"...Oh, did they now? That is an unexpected development. In any event, I was waiting for someone, and that someone has come. There is no need to wait further. Let Jaw-jaadg be assured that I shall return anon."},{"name":"JAWJAADG","text":"I am pleased to inform you that our friend has returned, and our debates are more amusing for it. It seems I was wise to enlist the help of an outsider."},{"name":"JAWJAADG","text":"As you may be aware, this settlement was originally conceived as a place where we might explore─and one day solve─the mysteries of our universe. Many Ea made the pilgrimage here to contribute to this great cause. Oh, how little we knew..."},{"name":"JAWJAADG","text":"As such, it is not uncommon for someone to wait at the gates for a guest. Tradition, really. However, my friend─for whatever their reasons─waited overly long. So long that their spirit remembers the act itself, but they have no memory of who they wished to meet there."},{"name":"JAWJAADG","text":"Now that you have come for them, they feel that they have fulfilled what they set out to do. They have been set free from the lingering thoughts that bound them."},{"name":"JAWJAADG","text":"At any rate, I am grateful to you for returning my friend to our ranks. Here, I would offer this as a token of thanks."},{"name":"JAWJAADG","text":"Furthermore, I am relieved you were able to make the beckoning call in the right tone. If you had “cue”-d instead of “coo”-ed, it would have been equivalent to telling them that their mind was as empty as a hollow crater─and I doubt they would have been amused."}],"reward":{"gil":815},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70000]}},"partials":[{"type":"npc","id":"1038030","obj":{"i":1038030,"n":"Jaw-jaadg","l":3712,"q":1}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}}]}