{"quest":{"name":"Loud and Proud","location":"Ultima Thule","id":69885,"patch":6.0,"sort":9170,"icon":101150,"eventIcon":71221,"issuer":1042067,"target":1042067,"genre":126,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The old wyrm is displeased at the state of the spring.","The old wyrm tells you of his wish to restore the spring at the center of Reah Tahra to its former potable glory. As the dragons apparently have a rather unusual means of cleansing their water supplies, you are summarily tasked with finding a dragon who yet retains a loud voice to roar at it.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Some small distance from Reah Tahra, you find a bloodthirsty dragon, who you manage to goad into accompanying you back to the spring. As the dragon is unwilling to wait for your tiny legs to carry you there, however, you must take the risk of approaching...<br><br>※Speak to the bloodthirsty dragon in Ostrakon Deka-okto to mount.","The dragon roars by the spring to little apparent effect, but is willing to make one more attempt in the name of impressing upon you how fruitless your efforts are.<br><br>※Speak to the bloodthirsty dragon in Ostrakon Deka-okto to mount.","Though there is no perceivable difference in the spring's appearance upon exposure to a second roar, the old wyrm remarks that it tastes slightly better than it did. Surprisingly, even the bloodthirsty dragon grudgingly admits that your efforts were not entirely in vain─albeit for somewhat more egotistical reasons.","Upon speaking with him further, the old wyrm remarks that he finds himself both nostalgic and hopeful at his fellow's roar having wrought even a minor change. He departs to spread the news to the other dragons, who perhaps will be inspired to sing proudly once more."],"objectives":["Search for a dragon with a formidable roar.","Ride the bloodthirsty dragon and use Roar on the spring.","Ride the bloodthirsty dragon and use Roar on the spring once more.","Speak with the old wyrm."],"dialogue":[{"name":"DRAGONWATERINGPLACE043498","text":"Ere the mechanical menace descended, the spring before thee was clear as the purest glass. Now behold the vile blight upon it..."},{"name":"DRAGONWATERINGPLACE043498","text":"Should we do nothing, naught shall remain save poison and black ash. Alas, my roar no longer rings loud enough to cleanse these waters, and my kin here fare little better."},{"name":"DRAGONWATERINGPLACE043498","text":"Yet at times, I hearken unto a faraway call, strong and resounding...though I know not whence it cometh. Wouldst thou seek its source, that our wellspring might be saved?"},{"name":"DRAGONWATERINGPLACE043498","text":"I shudder to imagine the fetid springs upon thine own star, with only thy tiny voices to cleanse them. ...Or perhaps thy kind gathereth to roar as one?"},{"name":"WYVERN043498","text":"I would not fain waste mine energies on thy lost cause, morsel. Begone with thee, ere thou findest thyself betwixt my teeth..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Then you admit your roar is pathetic?"},{"name":"A2","text":"Apologies, I was unaware I was addressing a <span class=\"emphasis\">dragonet</span>."},{"name":"WYVERN043498","text":"Dost thou <span class=\"emphasis\">wish</span> to be devoured!?"},{"name":"WYVERN043498","text":"Hmph. With my peerless roar shall I demonstrate the futility of thy pursuit, then savor the despair upon thy countenance when thou art forced to admit defeat..."},{"name":"WYVERN043498","text":"Get thee astride my back. I cannot abide watching thy stunted limbs struggle."},{"name":"DRAGONWATERINGPLACE043498","text":"Thou found a surpassingly rude member of dragonkind? Hmm..."},{"name":"WYVERN043498","text":"Thou hast not yet abandoned hope? Pity..."},{"name":"SYSTEM","text":"The waters of the spring lie stagnant and foul. Perhaps the bloodthirsty dragon's roar can cleanse them."},{"name":"SYSTEM","text":"The water ripples slightly, but you are unable to detect any significant changes."},{"name":"WYVERN043498","text":"(-Bloodthirsty Dragon-)Now dost thou ken my wisdom? We may attempt another angle, shouldst thou thirst for greater despair..."},{"name":"SYSTEM","text":"The spring appears slightly clearer for a moment, but you are unable to detect any significant changes."},{"name":"WYVERN043498","text":"(-Bloodthirsty Dragon-)Admit thy defeat. This spring shall never regain its lost splendor."},{"name":"WYVERN043498","text":"(-Bloodthirsty Dragon-)Though if thy tale be true, thou art not the only fool in need of this lesson. Let us speak with that old wyrm..."},{"name":"DRAGONWATERINGPLACE043498","text":"Mayhap 'twas too much to ask that these waters would run clear once more..."},{"name":"WYVERN043498","text":"Thou shouldst know such dreams are folly. To live is one matter, but to <span class=\"emphasis\">hope</span>..."},{"name":"DRAGONWATERINGPLACE043498","text":"...Is not so futile as thou wouldst believe. Hearken closely─I drank of this spring not moments ago."},{"name":"DRAGONWATERINGPLACE043498","text":"Though the difference be slight, it tasteth less brackish than before. Thine actions were not wasted."},{"name":"WYVERN043498","text":"Hmph. Thou sought to restore it to its crystalline state. Thy aspirations have failed, in sooth."},{"name":"WYVERN043498","text":"However...I suppose 'tis proof enough that my roar still possesseth great power, despite the darkness that consumeth me."},{"name":"WYVERN043498","text":"In that sense, perhaps thou art correct that some good resulted from mine efforts...and thine, morsel."},{"name":"DRAGONWATERINGPLACE043498","text":"For any change, no matter how small, I am grateful."},{"name":"DRAGONWATERINGPLACE043498","text":"To recall the taste of pure water once more, and to know that we yet have the power to fight our decline..."},{"name":"DRAGONWATERINGPLACE043498","text":"Others shall doubtless be heartened. Keep thine ears open, for one day thou may hearken unto a chorus of dragons' roars..."}],"reward":{"gil":935},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70000]}},"partials":[{"type":"npc","id":"1042067","obj":{"i":1042067,"n":"Old Wyrm","l":3712,"q":1}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}}]}