{"quest":{"name":"Combat Evolved","location":"Ultima Thule","id":69890,"patch":6.0,"sort":10101,"icon":101152,"unlocksFunction":1,"eventIcon":71341,"issuer":1038043,"target":1038043,"genre":126,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>N-4486 is searching for a sparring subject.","Omicron unit N-4486 requests you fight against an Omicron aggressor to provide valuable combat data. Upon further prompting, it also provides you with a pocket-sized level checker to ensure that said data makes it back in one piece.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You do battle with the Omicron aggressor until it is out of commission. As it finishes recording your combat data, the level checker comes to life with an excited beeping, indicating either that you have done quite well, or that it is best handed off to someone with more technological aptitude ere it explodes. Who can say?","N-4486 efficiently analyzes the data before synthesizing a proposal on how the Omicrons might best improve their own strategy. It seems personally keen to see more combat...though at this point, you can hardly claim surprise."],"objectives":["Use the level checker mini on the weakened Omicron aggressor.","Deliver the beeping level checker mini to N-4486."],"dialogue":[{"name":"N4486","text":"Initiating communication... This unit requests your participation in an Omicron combat simulation."},{"name":"N4486","text":"98.8% of the past 12,359 sessions have produced the exact same result. Thus, an unknown quantity such as yourself is required."},{"name":"N4486","text":"An Omicron aggressor is positioned outside the base. This unit has instructed said opponent to record all combat session data. You may initiate your assault when your preparations are complete."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Won't its records be destroyed if I smash it?"},{"name":"A2","text":"Are you looking for more of a “pummeling” or a “pulverizing”?"},{"name":"N4486","text":"Uncertainty detected. &lt;whirr&gt; Reviewing previous transmission... Verbal analysis suggests this unit has omitted crucial information regarding the current mission. This unit begs your pardon."},{"name":"N4486","text":"Once you have nearly destroyed the aggressor, you are requested to activate this device, which will automatically transfer combat data to a convenient portable format. Initiating handover protocol..."},{"name":"N4486","text":"Sending coordinates... Per the transmission you have just received, the opponent is located on the planar frame extending from this base. Reconfiguring emotional state to “grateful”... &lt;whirr&gt; This unit thanks you for your cooperation!"},{"name":"N4486","text":"Per this unit's previous transmission, the opponent is located on the planar frame extending from this base. When the aggressor has been sufficiently damaged, you are requested to recover combat data using the device provided."},{"name":"N4486","text":"&lt;whirr&gt; Reviewing received transmission... Analysis suggests the aggressor is no longer operational. Requesting return of previously provided recording device."},{"name":"N4486","text":"Extraction of combat data complete. Analyzing..."},{"name":"N4486","text":"&lt;whirr&gt; Quality of data greatly exceeds expected values and all previous records. Reconfiguring emotional state to “impressed”!"},{"name":"N4486","text":"The data suggests you engaged the aggressor at close quarters and gave it little time to respond. This unit will submit a request to the logistics matrix for the augmentation of emergency escape apparatus..."},{"name":"N4486","text":"The data suggests you kept your distance from the aggressor and attacked whenever you witnessed an opening. This unit will submit a request to the logistics matrix to update our evasive protocols..."},{"name":"N4486","text":"The data suggests you summoned significant levels of aether in order to defeat the aggressor. This unit will submit a request to the logistics matrix for the augmentation of protective apparatus..."},{"name":"N4486","text":"Searching database for situationally appropriate axiom... &lt;whirr&gt; “Only through combat can we improve ourselves. The absence of new challenge results in stagnation.”"},{"name":"N4486","text":"Records indicate this base has not encountered new threats in a considerable amount of time. This unit sees potential value in enduring attacks more frequently, though its discord prevention module is buzzing in a most irritating fashion."},{"name":"N4486","text":"&lt;whirr&gt; Reconfiguring emotional state to “grateful”... This unit appreciates your cooperation with the collection of combat data. Analysis suggests it will prove invaluable to the further development of Base Omicron."}],"reward":{"gil":775,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69995]}},"partials":[{"type":"npc","id":"1038043","obj":{"i":1038043,"n":"N-4486","l":3712,"q":1}},{"type":"quest","id":"69995","obj":{"i":69995,"n":"Vic┨οry  ̈ ̈ ̈╳, │̆││ε Lost","g":11,"l":"Ultima Thule","s":613}}]}