{"quest":{"name":"A Labyrinthine Descent","location":"Old Sharlayan","id":69897,"patch":6.0,"sort":515,"icon":101100,"eventIcon":71201,"issuer":1038684,"target":1038695,"genre":11,"journal":["Alisaie is excited to share your revelations.","After mulling over what you learned at the Last Stand, Alisaie is convinced that the recent increase in gleaner activity has something to do with the Forum. She urges you to return to Noumenon and share this discovery with the other Scions at once.","You relay your suspicions to the others, prompting Alphinaud to reevaluate the situation. Krile subsequently concludes that a journey into Labyrinthos itself is in order. With the next step of the investigation decided, Alisaie offers to lead you to the entrance of what has been described as a vast, underground complex.<br><br>※You must be following Alisaie to complete this task. Speak with her again should you become separated.","Following Alisaie's unwavering guidance, you arrive at the Hall of Artifice. Krile waits nearby like an anxious tour guide, counting heads as the Scions gather together.","The ever-prepared Krile has secured permission for your group to board the lift in the Hall of Artifice, and there is no time like the present!","You descend into Labyrinthos with Krile and the others. Although momentarily overwhelmed by the sheer scale and ambition of this artificial ecosystem, the demands of the investigation bring you back to your senses. The gleaners scattered about in upper Acrinthos may just have the answers to your questions...","You have spoken to a number of gleaners about their duties in Labyrinthos. Krile should be interested in what you have to report.","Krile listens carefully as you repeat the gleaners' words. There certainly seems to be a method to the recent madness, but the precise nature of the Forum's plan has yet to come into focus..."],"objectives":["Speak with Krile.","Speak with Alisaie and follow her lead.","Speak with Krile.","Gather information in upper Acrinthos.","Share your findings with Krile."],"dialogue":[{"name":"ALISAIE","text":"We should tell the others what we've learned about the gleaners."},{"name":"ALISAIE","text":"Go on ahead to Noumenon, and I'll join you in a moment─Master Dickon will want his cups back!"},{"name":"ALPHINAUD","text":"Where is Alisaie? I thought she was with you."},{"name":"YSHTOLA","text":"My loyal assistant returns! There is a lexicon on the first floor that I need you to─ Ah. You've found something, haven't you?"},{"name":"GRAHATIA","text":"Is that coffee I smell? Did I miss the tea break?"},{"name":"KRILE","text":"Welcome back, <span class=\"highlight\">Forename</span>. Been for a walk and cleared your head, have you?"},{"name":"ALISAIE","text":"Not exactly. We did some impromptu investigating and turned up information on the gleaners..."},{"name":"YSHTOLA","text":"It makes sense. The gleaners take their requests directly from institutions and bureaucrats, but as you say, they ultimately answer to the Forum."},{"name":"YSHTOLA","text":"A sudden and significant increase in gleaner traffic and in cargo... It certainly gives the impression of an overarching plan being put into motion."},{"name":"ALPHINAUD","text":"Let us see what theory we can build from the facts..."},{"name":"ALPHINAUD","text":"As Y'shtola observed earlier, Noumenon's archives appear to contain no information concerning the Final Days."},{"name":"ALPHINAUD","text":"Coupled with what <span class=\"highlight\">Forename</span> and Alisaie learned at the Last Stand, we can be reasonably sure that most Sharlayans know nothing of that particular period of ancient history."},{"name":"ALPHINAUD","text":"Yet my father and his colleagues are not only familiar with the Final Days, but are also somehow certain that the destruction being perpetrated by the Telophoroi is wholly unlike these apocalyptic events..."},{"name":"ALPHINAUD","text":"Moreover, the Forum claims to be so occupied by a duty of such pressing importance that they saw fit to unanimously deny Eorzea's request for aid."},{"name":"ALPHINAUD","text":"And now the gleaners, official agents of the state, have been mobilized on an unprecedented scale."},{"name":"KRILE","text":"I do not think it a stretch to conclude that the gleaners' recent activities are in service to the Forum's secretive ends."},{"name":"KRILE","text":"In which case, our next course of action seems obvious: we visit Labyrinthos and assess the situation for ourselves. And if we're lucky, the gleaners will be far more receptive to our questions."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"A fine idea!"},{"name":"A1","text":"What should we expect down there?"},{"name":"A1","text":"Anything would be better than burying my head in another dusty book..."},{"name":"KRILE","text":"I'm glad you approve! You won't be disappointed, I promise!"},{"name":"KRILE","text":"Oh, I would hate to spoil the surprise!"},{"name":"KRILE","text":"I understand not everyone is the studious type. Consider this a welcome change of pace, then!"},{"name":"GRAHATIA","text":"As for myself, there are a few more subjects I should like to research. I may join you later, but feel free to leave behind your borrowed books and be on your way. I'll see to it that each is returned to its proper place."},{"name":"KRILE","text":"That would be a great help. Thank you, Raha!"},{"name":"ALISAIE","text":"Let's head down the stairs over there, and I'll show you where the entrance is."},{"name":"GRAHATIA","text":"Watch your step in Labyrinthos. It's rather more perilous than a simple storehouse. Although that will likely make the experience all the more attractive to an adventurer like you!"},{"name":"ALISAIE","text":"Ready? Labyrinthos is not too far from here, but you may find the path a bit disorienting."},{"name":"ALISAIE","text":"I'll take the lead, so stay close!"},{"name":"SYSTEM","text":"Follow Alisaie and try not to fall behind."},{"name":"ALISAIE","text":"Here we are! Through this door and down the stairs."},{"name":"ALISAIE","text":"You did remember to attune to the shard back there, didn't you? It will make your life much easier if you need to come back in a hurry. Otherwise, we should keep moving!"},{"name":"ALPHINAUD","text":"I've not been to Labyrinthos in the longest time. Even as a student, my visits were few and far between."},{"name":"ALISAIE","text":"You didn't take a wrong turn into the Rostra there, did you? I doubt the Forum would take kindly to you barging into a private session."},{"name":"YSHTOLA","text":"How did the Forum learn of the Final Days, and exactly how much do they know? More to the point, what do they intend to do about it? Hopefully the answer to at least one of those questions lies below..."},{"name":"KRILE","text":"We're all here now, yes? I've taken the liberty of securing permission for our group's descent."},{"name":"KRILE","text":"Right, everyone onto the lift and down we go!"},{"name":"NILZOZO","text":"Your entrance papers appear to be in order. Do you wish to descend into Labyrinthos, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>?"},{"name":"Q2","text":"Descend to Labyrinthos?"},{"name":"ALPHINAUD","text":"Excuse me, are you a gleaner? If you don't mind, I have some questions to ask..."},{"name":"ALISAIE","text":"...Hmmm, fascinating, but could we go back to what you were saying earlier?"},{"name":"YSHTOLA","text":"Nay, I am not shirking my duties. I've not been down here in an age, and wished to get my bearings before I went bumbling about."},{"name":"YSHTOLA","text":"From what I can see, however, there is naught obviously out of place. It seems we shall have to resort to discreet inquiries, as usual."},{"name":"KRILE","text":"Most of those gathered here appear to be gleaners. Why don't you wander around and try making small talk?"},{"name":"DOBBIN","text":"You want to know what I'm doing? Hauling books. And ore. And fauna. If it needs hauling, I haul it."},{"name":"DOBBIN","text":"Every decade or so, they take stock in Labyrinthos─you know, sort and tidy up the inventory. Never seen an operation like this before, though."},{"name":"DOBBIN","text":"They just did one a few summers ago, even! Then, with no warning at all, this mess gets dropped in our laps. Orders from on high. Damned if I know the reason. Could be that they're changing the layout, eh? Preparing for the next big expansion..."},{"name":"SYSTEM","text":"Your exchange with Dobbin has taught you about “Taking stock in Labyrinthos.”"},{"name":"DOBBIN","text":"Soon as the guildship sent out the summons, I knew this would be a rough job. They never call on us out of the blue for anything easy..."},{"name":"TIEVE","text":"Let me think, let me think! The rhea seeds should be Item 1058, cumin seeds 1059, snurbleberry 1060...or were they 1061!?"},{"name":"TIEVE","text":"Argh, my head feels like it's stuffed with moko grass! Why more loads to take out than carry in!?"},{"name":"TIEVE","text":"Why do all this at once and risk mixing it up!? What if someone mistakes the Coerthan carrots for the Gyr Abanian carrots? What then!?"},{"name":"SYSTEM","text":"Your exchange with Tieve has taught you about “Large shipments coming in and out of Labyrinthos.”"},{"name":"TIEVE","text":"Huh!? So 2023 was <span class=\"emphasis\">La Noscean</span> topsoil? Then 2024 was...was...from Thanalan? Or the Shroud!?"},{"name":"ERENVILLE","text":"You here to help or give me more headaches? Because you don't have the look of a gleaner, and I'm in no mood for idle chatter."},{"name":"ERENVILLE","text":"One of my colleagues was so exhausted he took a tumble and crashed into a pile of crates. Now I have a pack of marmots running loose..."},{"name":"SYSTEM","text":"Your exchange with Erenville has taught you about “Exhausted gleaners.”"},{"name":"ERENVILLE","text":"Those little devils are quick as sin and twice as hard to catch. I suppose I had better start searching..."},{"name":"KRILE","text":"Any luck, <span class=\"highlight\">Forename</span>? What tales did the gleaners have to tell?"},{"name":"KRILE","text":"So this grand operation began without warning? And for every item they bring in, they're sending more inventory somewhere else. Hmm... That would explain the haggard faces I've been seeing."},{"name":"KRILE","text":"We were right─the Forum is definitely up to something. And they're turning Labyrinthos upside down in the process."}],"reward":{"gil":1055},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69896]},"next":[69898]},"partials":[{"type":"npc","id":"1038684","obj":{"i":1038684,"n":"Alisaie","l":3706,"q":2}},{"type":"npc","id":"1038695","obj":{"i":1038695,"n":"Krile","l":3708,"q":2}},{"type":"quest","id":"69896","obj":{"i":69896,"n":"A Seat at the Last Stand","g":11,"l":"Old Sharlayan","s":514}},{"type":"quest","id":"69898","obj":{"i":69898,"n":"Glorified Ratcatcher","g":11,"l":"Labyrinthos","s":516}}]}