{"quest":{"name":"Deeper into the Maze","location":"Labyrinthos","id":69899,"patch":6.0,"sort":517,"eventIcon":71201,"issuer":1038702,"target":1038718,"genre":11,"journal":["Alphinaud is gazing into the Archeion with an appraising look."],"objectives":["Speak with the Archeion custodian.","Speak with Y'shtola.","Speak to people outside the Archeion.","Search for the pack-bearing gleaner.","Move to the designated location, and sedate the target with the sleeping dart.","Speak with Alphinaud."],"dialogue":[{"name":"ALISAIE","text":"Were you caught in mist on your way here? The sprayers keep the air humid, so the habitat feels as close as possible to a natural forest."},{"name":"YSHTOLA","text":"This is the foremost material archive in Sharlayan. I should love to explore its treasures shelf by shelf, but I fear we have little time for such indulgences."},{"name":"KRILE","text":"Don't worry about me, I'm hale and healthy! In fact, I'm beginning to suspect that..."},{"name":"KRILE","text":"...Nay, let's discuss this later. The investigation demands our undivided attention."},{"name":"ALPHINAUD","text":"Well, we won't learn anything of value standing out here. Let us proceed into the main building and speak with the custodian."},{"name":"ALPHINAUD","text":"Greetings. We are here to peruse the Archeion's vaults."},{"name":"GUIDEOFTHEARCHEION","text":"Peruse? You are clearly not gleaners, then. Might I ask your affiliation?"},{"name":"KRILE","text":"We belong to the Students of Baldesion, but...is that relevant? I was given to believe that the vaults─those open to the public, at least─were...open to the public."},{"name":"GUIDEOFTHEARCHEION","text":"Ordinarily, yes, that would be the case. At present, however, access is restricted. Only persons directly involved in the reorganization efforts are permitted to enter."},{"name":"YSHTOLA","text":"Not us, then. I suppose we had better move along to another facility."},{"name":"KRILE","text":"This building has a lift which connects to the middle tier, yes? Might we at least make use of that?"},{"name":"GUIDEOFTHEARCHEION","text":"That service has also been suspended, I am afraid. For the time being, priority has been given over to the conveyance of inventory."},{"name":"ALISAIE","text":"What, so this is as far as we can go!?"},{"name":"GUIDEOFTHEARCHEION","text":"I apologize for the inconvenience. Please come again after our restructuring operation is concluded."},{"name":"ALISAIE","text":"By that time, it will be too late. And we were so close to getting answers..."},{"name":"YSHTOLA","text":"We need to rethink our approach. Let us step outside for the moment, shall we?"},{"name":"GUIDEOFTHEARCHEION","text":"...Students of Baldesion. Hmph."},{"name":"ALPHINAUD","text":"The Forum must be wary of exposure indeed to so heavily restrict the use of public institutions..."},{"name":"ALISAIE","text":"If they're going to close off facilities, then they ought to announce it! The students must be furious!"},{"name":"KRILE","text":"Labyrinthos is constructed in the shape of a mortar. This upper layer is called the “Outer Circuit,” and the “Medial Circuit” lies one tier below us..."},{"name":"TIREDSTAFF04363","text":"Sleep... I need sleep..."},{"name":"TROUBLEDSTUDENT04363","text":"How can they close the <span class=\"emphasis\">Archeion</span>? I mean, really..."},{"name":"YSHTOLA","text":"We are at an impasse. As we have no other leads, I should like to pursue this one further..."},{"name":"YSHTOLA","text":"But I doubt that our stone-faced custodian will be swayed by heartfelt pleas. We must seek another means to access the lower levels."},{"name":"YSHTOLA","text":"'Tis likely that the people in this area are involved in the restructuring in one way or another. If we were to ingratiate ourselves, they might allow us to accompany them on the lift."},{"name":"YSHTOLA","text":"Let us ask around. Surely someone is in need of a few strong backs to lighten the load."},{"name":"TIREDSTAFF04363","text":"What's that? Take you down on the lift with me? Sorry, but not a chance. I've been up and down all day, and only now have I finally found a spare moment to rest."},{"name":"TIREDSTAFF04363","text":"I did see a gleaner fellow heading out the gate there, though. Shouldering a large pack─engaged in some manner of task. Maybe he'll be headed down below after he's done with...whatever it is he's doing."},{"name":"TIREDSTAFF04363","text":"Please, even talking is an effort. Go and bother that gleaner I told you about..."},{"name":"TROUBLEDSTUDENT04363","text":"Am I taking the lift? Oh, no, we're just students. They won't let us into the Archeion, even though we found..."},{"name":"TROUBLEDSTUDENT04363","text":"...Actually, we have no idea what it is we found─there's no record of such a creature anywhere. But it was wandering around Tranquility, and so we thought to donate it to the vaults."},{"name":"GIANTBEAVER04363","text":"(-Muffled Voice-)&lt;squeal&gt; &lt;squeal&gt;"},{"name":"TROUBLEDSTUDENT04363","text":"Oddest little squeal, don't you think? Anyway, I suppose we'll have to take care of it until the Archeion is open again."},{"name":"TROUBLEDSTUDENT04363","text":"At first we thought it might have escaped from one of the research laboratories, but when we reported our find to the Studium, they were just as dumbfounded as we were..."},{"name":"TROUBLEDSTUDENT04363","text":"If it truly is a newly discovered species, we could have our names appear in a gazette!"},{"name":"GIANTBEAVER04363","text":"(-Muffled Voice-)&lt;squeal&gt; &lt;squeal&gt; &lt;squeal&gt;"},{"name":"ERENVILLE","text":"Quiet. You'll frighten it away."},{"name":"ERENVILLE","text":"...Ah, it's you again. I don't mean to be rude, but I'm in the middle of another task. The cloudkin I need to capture is close. Very close."},{"name":"ERENVILLE","text":"Hm? You wish to help me with this, too? You spend your time in unusual ways, my friend."},{"name":"ERENVILLE","text":"Still, two hunters are generally better than one. Very well."},{"name":"ERENVILLE","text":"The canal here is a common gathering spot for birds of all kinds, but the one I'm after today is the hornbill."},{"name":"ERENVILLE","text":"Its feathers are green, and its cry a distinctive “caw.” Single it out and shoot it with this sleeping dart."},{"name":"ERENVILLE","text":"The effects are short-lived, so I'll lie in wait down by the riverbank to claim our quarry. Be sure to hit the right one!"},{"name":"SYSTEM","text":"Search your surroundings for the hornbill. You may move the camera, as well as zoom in and out. Target the hornbill and use the blowgun with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"ALISAIE","text":"I took a quick peek inside, but it's awfully dark in there..."},{"name":"YSHTOLA","text":"The Medial Circuit which Erenville mentioned is the tier directly below us."},{"name":"YSHTOLA","text":"Unlike the lowest level of Labyrinthos with its rigid security, one can usually roam the middle layer quite freely. Let us see what we might find."},{"name":"KRILE","text":"I never would've noticed this cave on my own! Thank the Scholar that Erenville knew of it...and that you were there to persuade him to share."},{"name":"ALPHINAUD","text":"This must be it─the entrance to the mineshaft."},{"name":"ALPHINAUD","text":"'Tis faint, but I hear something moving within... Creatures homed there by the researchers, you think?"},{"name":"ALPHINAUD","text":"Well, slavering beasts aside, we will need to watch our footing. We should tighten our straps and such before we continue."}],"reward":{"gil":1135,"items":[{"id":35667}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69898]},"next":[69900]},"partials":[{"type":"npc","id":"1038702","obj":{"i":1038702,"n":"Alphinaud","l":3708,"q":2}},{"type":"npc","id":"1038718","obj":{"i":1038718,"n":"Alphinaud","l":3708,"q":1}},{"type":"item","id":"35667","obj":{"i":35667,"n":"Horse Chestnut Head Gear Coffer (IL 515)","l":1,"c":26558,"t":61}},{"type":"quest","id":"69898","obj":{"i":69898,"n":"Glorified Ratcatcher","g":11,"l":"Labyrinthos","s":516}},{"type":"quest","id":"69900","obj":{"i":69900,"n":"The Medial Circuit","g":11,"l":"Labyrinthos","s":518}}]}