{"quest":{"name":"Glorified Ratcatcher","location":"Labyrinthos","id":69898,"patch":6.0,"sort":516,"eventIcon":71201,"issuer":1038695,"target":1038702,"genre":11,"journal":["Krile appears lost in thought."],"objectives":["Speak with Erenville.","Search for grizzled mice and defeat any enemies which appear.","Capture the grizzled mouse.","Search for the grizzled mouse and defeat any enemies which appear.","Use the rat sack to capture the grizzled mouse.","Search for the grizzled mouse and use the rat sack to capture it.","Deliver the squirming rat sack to Erenville.","Speak with Alphinaud."],"dialogue":[{"name":"ERENVILLE","text":"Those little devils are quick as sin and twice as hard to catch. I suppose I had better start searching..."},{"name":"KRILE","text":"We would do well to learn more of what, specifically, the gleaners are being tasked to do, as well as who has tasked them to do it."},{"name":"KRILE","text":"If you're game, <span class=\"highlight\">Forename</span>, I have an idea..."},{"name":"KRILE","text":"Didn't one of the gleaners you questioned say something about escaped marmots?"},{"name":"KRILE","text":"Perhaps if you were to help him capture said creatures, he might be inclined towards a more friendly and <span class=\"emphasis\">enlightening</span> conversation..."},{"name":"KRILE","text":"In the meantime, I will turn my charms upon this gleaner here. We can compare notes afterwards. Happy hunting!"},{"name":"KRILE","text":"Terribly sorry to disturb you! I need to submit this report of mine, and quickly─it's a bit overdue. Could you remind me of the approximate date the guildship was enlisted to help facilitate this most recent operation?"},{"name":"ERENVILLE","text":"You wish to help me find the marmots? I've nothing suitable to pay you for your services, but if you're offering out of the goodness of your heart, I'd welcome the assistance."},{"name":"ERENVILLE","text":"The name is Erenville, friend. Specialist in the collection of live specimens."},{"name":"ERENVILLE","text":"That said, the capture of these Nagxian marmots is a trial I've no desire to repeat. “Grizzled mice,” they call them."},{"name":"ERENVILLE","text":"For a mercy, there are no other marmot species on this tier at present, so there should be no mistaking our little fugitives. If you happen to catch any, stuff them in this sack. Gently, of course."},{"name":"ERENVILLE","text":"Where to begin, you wonder? I've not seen any scampering around here, so we'll need to widen our search into the surrounding forest."},{"name":"ERENVILLE","text":"Be on your guard. There are beasts out there that won't hesitate to prey on a marmot─or <span class=\"emphasis\">you</span>."},{"name":"ERENVILLE","text":"I'll search the trees to the west. The eastern part of the forest is all yours. Good luck."},{"name":"MARMOTA04361","text":"&lt;chirp&gt;"},{"name":"MARMOTA04361","text":"&lt;chirp&gt; &lt;squeak&gt;"},{"name":"SYSTEM","text":"Barely have you readied the sack when the grizzled mouse scampers off into the underbrush..."},{"name":"MARMOTA04361","text":"&lt;chirp&gt;"},{"name":"MARMOTA04361","text":"&lt;squeak&gt;"},{"name":"SYSTEM","text":"The rodent nimbly evades your grasp before once more disappearing into the trees..."},{"name":"MARMOTA04361","text":"&lt;chirp&gt;"},{"name":"MARMOTA04361","text":"&lt;squeak&gt; &lt;squeak&gt;"},{"name":"SYSTEM","text":"More prepared for its speed this time, you succeed in closing the sack over your elusive quarry!"},{"name":"ERENVILLE","text":"How did you fare? I tracked down three of the pack, which leaves one unaccounted for..."},{"name":"ERENVILLE","text":"Ah, there's the odd marmot out."},{"name":"ERENVILLE","text":"Wait here a moment while I put our friends in a holding cage."},{"name":"ERENVILLE","text":"Thankfully, the marmots seem to be unharmed. They've held up well in isolation, but it's much too soon to release them into the habitat."},{"name":"ERENVILLE","text":"It's a good thing we were able to recapture them so swiftly. You have my thanks."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Who tasked you to capture them in the first place?"},{"name":"A1","text":"What will you do with the marmots now?"},{"name":"ERENVILLE","text":"Why, the authority in charge of Labyrinthos, now and in perpetuity. The same officials who've had us working day and night of late─the honorable members of the Forum, who else?"},{"name":"ERENVILLE","text":"Suitable for consumption and easy to breed─those were the two conditions I was given for the stock I was instructed to procure."},{"name":"ERENVILLE","text":"That's for the Forum to decide. They are the guiding authority behind Labyrinthos after all, and this job was but one small part of this great inventory of theirs."},{"name":"ERENVILLE","text":"Suitable for consumption and easy to breed─those were the two conditions I was given for the stock I was instructed to procure."},{"name":"ERENVILLE","text":"I don't know what the Forum has planned for these creatures, but at the very least, I doubt they'll be served for dinner today or tomorrow."},{"name":"ALISAIE","text":"There you are, <span class=\"highlight\">Forename</span>."},{"name":"KRILE","text":"Is this the gleaner you mentioned? The one who was looking for lost marmots?"},{"name":"ERENVILLE","text":"Interesting company you keep, friend. Who are you folk, anyway?"},{"name":"KRILE","text":"I am Krile of the Students of Baldesion. These others are my associates."},{"name":"KRILE","text":"Truth be told, the Forum's decisions of late have not sat entirely well with us. That is why we made the descent into Labyrinthos─we hoped that by seeing those decisions put into action, we might more fully understand their reasoning."},{"name":"ERENVILLE","text":"Wise and practical. Never hurts to try and gain a broader perspective, does it?"},{"name":"ERENVILLE","text":"Anyway, duty calls─other animals to capture and enclosures to empty. Once again, I'm sorry that I can't offer you more for your services."},{"name":"KRILE","text":"Did you learn anything new from your friend there?"},{"name":"KRILE","text":"So we've confirmed that the order for this ambitious operation did indeed come directly from the Forum. However, the gleaners have not been informed of its purpose..."},{"name":"KRILE","text":"I'd say that fits with everything we've heard thus far."},{"name":"ALPHINAUD","text":"We also discovered when the operation was begun. The Forum contacted the gleaners' guildship and put their people to this great work some four days after the Telophoroi made their chilling declaration."},{"name":"ALPHINAUD","text":"As seasoned travelers, the gleaners keep abreast of news from every corner of the world out of necessity. Thus am I inclined to trust that their calendar of events is accurate."},{"name":"YSHTOLA","text":"Altogether, it gives the distinct impression that this undertaking was a sudden and unexpected development..."},{"name":"YSHTOLA","text":"Yet I find it hard to believe that such a comprehensive restructuring of Labyrinthos and its archives could have been planned in so brief a window."},{"name":"YSHTOLA","text":"Nay, this plan was long in the making─they were but awaiting the right time to put it into effect."},{"name":"ALISAIE","text":"And the Telophoroi's declaration was what set it all in motion?"},{"name":"YSHTOLA","text":"It seems likely. But let us not leap to conclusions just yet."},{"name":"YSHTOLA","text":"For the moment, I suggest we conduct a wider investigation of Labyrinthos. The more facilities we visit, the more pieces of the puzzle we stand to find."},{"name":"KRILE","text":"In that case, how about we head to the Archeion? From there, we can reach the lower─"},{"name":"ALISAIE","text":"Krile! What's wrong!?"},{"name":"KRILE","text":"I'm fine...truly. The sudden descent has left me with a bit of headache, that's all."},{"name":"KRILE","text":"Nothing that will stop me from soldiering on. Let's be about it, then!"},{"name":"ALPHINAUD","text":"At least allow me to take the lead. I'm fairly certain I remember the way to the Archeion."},{"name":"ALPHINAUD","text":"We follow the path east, through the forest where you were chasing after that mouse...or marmot, was it? Anyway, 'tis the trolls you need to watch out for!"},{"name":"ALISAIE","text":"Were you caught in mist on your way here? The sprayers keep the air humid, so the habitat feels as close as possible to a natural forest."},{"name":"YSHTOLA","text":"This is the foremost material archive in Sharlayan. I should love to explore its treasures shelf by shelf, but I fear we have little time for such indulgences."},{"name":"KRILE","text":"Don't worry about me, I'm hale and healthy! In fact, I'm beginning to suspect that..."},{"name":"KRILE","text":"...Nay, let's discuss this later. The investigation demands our undivided attention."},{"name":"ALPHINAUD","text":"Behold, the Archeion. As Noumenon serves as Sharlayan's literary archive, so does this structure house the city's wealth of material data."},{"name":"ALPHINAUD","text":"The architecture, too, is similar. This building you see is merely the upper entrance─an access point to the vaults carved into the cliffside itself."},{"name":"ALPHINAUD","text":"Within those vast rooms are stored countless samples and specimens, as well as the detailed records which describe them."},{"name":"ALPHINAUD","text":"In a manner of speaking, the Archeion contains a physical history of Sharlayan's unwavering dedication to the accumulation of knowledge."}],"reward":{"gil":1175},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69897]},"next":[69720,69721,69722,69723,69724,69725,69726,69727,69899]},"partials":[{"type":"npc","id":"1038695","obj":{"i":1038695,"n":"Krile","l":3708,"q":2}},{"type":"npc","id":"1038702","obj":{"i":1038702,"n":"Alphinaud","l":3708,"q":2}},{"type":"quest","id":"69897","obj":{"i":69897,"n":"A Labyrinthine Descent","g":11,"l":"Old Sharlayan","s":515}},{"type":"quest","id":"69720","obj":{"i":69720,"n":"It's Not the Heat, It's the Humidity","g":121,"l":"Labyrinthos","s":50}},{"type":"quest","id":"69721","obj":{"i":69721,"n":"No Laughing Matter","g":121,"l":"Labyrinthos","s":60}},{"type":"quest","id":"69722","obj":{"i":69722,"n":"Building Good Habitats","g":121,"l":"Labyrinthos","s":1101}},{"type":"quest","id":"69723","obj":{"i":69723,"n":"An Ore-ful Lot","g":121,"l":"Labyrinthos","s":1110}},{"type":"quest","id":"69724","obj":{"i":69724,"n":"Raised on the Fallen","g":121,"l":"Labyrinthos","s":1120}},{"type":"quest","id":"69725","obj":{"i":69725,"n":"Pot Luck","g":121,"l":"Labyrinthos","s":1130}},{"type":"quest","id":"69726","obj":{"i":69726,"n":"Uncommon Scents","g":121,"l":"Labyrinthos","s":1140}},{"type":"quest","id":"69727","obj":{"i":69727,"n":"A Hard Task to Digest","g":121,"l":"Labyrinthos","s":1150}},{"type":"quest","id":"69899","obj":{"i":69899,"n":"Deeper into the Maze","g":11,"l":"Labyrinthos","s":517}}]}