{"quest":{"name":"Learn to Love","location":"Ultima Thule","id":69891,"patch":6.0,"sort":10110,"icon":101152,"unlocksFunction":1,"eventIcon":71341,"issuer":1041656,"target":1041656,"genre":126,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The inquisitive Omicron is eager to understand a certain phenomenon.","You are asked to help the inquisitive Omicron with an experiment to see how loved ones can positively impact one's capabilities in combat. As this opportunity is too good to pass up, you patiently await its return with its “consort” of choice.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","When the inquisitive Omicron returns, the two of you quickly decide that the most attainable means by which to give it a special relationship with its consort is to bequeath said consort with the pet name “my beloved.” All too eager to press on with its research, however, your Omicron friend immediately sends its pseudo-partner away to self-destruct so that it may measure what possible enhancements have resulted from their bond.","At the inquisitive Omicron's request, you collect the forlorn remains of my beloved for analysis. For just a moment, perched at the edge of the universe, you stop to wonder what the hells you are doing with your life.","Back at Base Omicron, your largely unruffled partner in crime ponders continuing its work by creating its own “family.” Perhaps someday it will come to truly understand the concepts it is investigating...or perhaps not."],"objectives":["Wait at the designated location.","Search for my beloved's remains.","Deliver my beloved's remains to the inquisitive Omicron."],"dialogue":[{"name":"VERIFICATIONOMNICRON04355","text":"Assistance requested. This unit has observed a curious phenomenon in which certain members of enemy factions have exhibited a marked increase in their combat capabilities."},{"name":"VERIFICATIONOMNICRON04355","text":"Analysis suggests that said members share unique, intraspecific bonds with others in their faction. These individuals were conferred titles such as “consort” and “family.”"},{"name":"VERIFICATIONOMNICRON04355","text":"This unit detected no difference in physiology that would provide notable advantages in combat, yet the presence of intraspecific bonds alone led to an increase in performance. Records indicate that one member of a bond-group exhibits this exponential improvement when others are eliminated."},{"name":"VERIFICATIONOMNICRON04355","text":"Potential benefits of such augmentation are projected to be immense. Thus, this unit's query─are you familiar with the aforementioned phenomenon?"},{"name":"VERIFICATIONOMNICRON04355","text":"&lt;whirr&gt; This is fortunate, as this unit has constructed a “consort” for research purposes. You are asked to delineate the method by which this unit might form an intraspecific bond with said consort."},{"name":"VERIFICATIONOMNICRON04355","text":"Requesting standby at present coordinates. Initiating consort retrieval..."},{"name":"VERIFICATIONOMNICRON04355","text":"Activating introduction... This unit presents the aforementioned consort. At present, its capabilities are comparable to subordinate patrol units. How should we proceed?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You could give it a pet name."},{"name":"A2","text":"You need to grow closer."},{"name":"VERIFICATIONOMNICRON04355","text":"Scanning identification database... &lt;whirr&gt; Records indicate this Omicron is designated “Test Unit 0043.” This unit requests confirmation that said appellation qualifies as sufficiently “pet.”"},{"name":"VERIFICATIONOMNICRON04355","text":"Hesitance detected... &lt;whirr&gt; New proposal: “my beloved.” A review of this unit's memory shows that a member of an enemy faction referred to its bond-mate as such."},{"name":"VERIFICATIONOMNICRON04355","text":"Synonyms detected. Initiating semantic review... &lt;whirr&gt; “Closer (1)” suggests obtaining a nearer physical proximity to the target than at present. This unit will move toward the consort in an attempt to develop the desired intraspecific bond."},{"name":"VERIFICATIONOMNICRON04355","text":"...Visual analysis at this range reveals a dent in the target's frame. Estimated impact on functionality: inconsequential. This unit requests confirmation that such discoveries will result in improved performance."},{"name":"VERIFICATIONOMNICRON04355","text":"Cross-referencing gesture database... &lt;whirr&gt; Implication identified as “doubtful.” Issuing new proposal to refer to the Omicron as “my beloved,” simulating the way in which a member of an enemy faction referred to its bond-mate."},{"name":"OMNICRON04355","text":"Appellation change confirmed. New designation: “my beloved.”"},{"name":"VERIFICATIONOMNICRON04355","text":"Reconfiguring emotional status to “grateful”... &lt;whirr&gt; This unit appreciates your assistance in facilitating the creation of a special bond with my beloved. Initiating phase two of experiment..."},{"name":"VERIFICATIONOMNICRON04355","text":"This unit will evaluate whether the destruction of my beloved bears a positive impact on this unit's combat capabilities."},{"name":"VERIFICATIONOMNICRON04355","text":"Transmitting self-destruct command to my beloved..."},{"name":"VERIFICATIONOMNICRON04355","text":"Analyzing unit status... &lt;whirr&gt; No changes in functionality detected. Possibility of transmission failure estimated at 78%. This unit asks that you confirm that my beloved has successfully executed the self-destruct command. Retrieval of remains also requested."},{"name":"VERIFICATIONOMNICRON04355","text":"Awaiting confirmation of successful transmission. Retrieval of remains also requested."},{"name":"VERIFICATIONOMNICRON04355","text":"Requesting retrieval of my beloved. Potential for reconstruction and further experimentation remains high."},{"name":"VERIFICATIONOMNICRON04355","text":"Self-destruct confirmed successful. &lt;whirr&gt; Sadly, experiment confirmed unsuccessful. Analysis of this unit's parameters shows no change in functionality."},{"name":"VERIFICATIONOMNICRON04355","text":"This unit will consider executing a “family” simulation after reconsulting enemy faction data, but based on the results of the consort simulation, termination of research may be advisable."},{"name":"VERIFICATIONOMNICRON04355","text":"Reconfiguring emotional state from “disappointed” to “grateful”... &lt;whirr&gt; This unit thanks you once more for your cooperation. Your proposed methodology may be implemented in future experiments."}],"reward":{"gil":855,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69995]}},"partials":[{"type":"npc","id":"1041656","obj":{"i":1041656,"n":"Inquisitive Omicron","l":3712,"q":1}},{"type":"quest","id":"69995","obj":{"i":69995,"n":"Vic┨οry  ̈ ̈ ̈╳, │̆││ε Lost","g":11,"l":"Ultima Thule","s":613}}]}