{"quest":{"name":"A Fisherman's Friend","location":"Thavnair","id":69906,"patch":6.0,"sort":524,"eventIcon":71201,"issuer":1038608,"target":1038609,"genre":11,"journal":["Matsya regards you nervously."],"objectives":["Speak with Matsya and have him accompany you.","Speak with Mehrunnah while accompanied by Matsya.","Speak with Nashreen while accompanied by Matsya.","Speak with Bhazahma while accompanied by Matsya.","Accompany Matsya to the pier and then speak with him.","Speak with Thancred."],"dialogue":[{"name":"KHALZAHL","text":"If foreign vessels won't come to us, why not use our own to deliver the wares to them!?"},{"name":"PORTMANAGER04368","text":"It's not so simple, Khalzahl. And besides, everyone is in the same boat. <span class=\"emphasis\">Everyone</span>."},{"name":"MATSYA","text":"Um...if I may ask, what is it that you do?"},{"name":"MATSYA","text":"An adventurer, you say! And you travel the world, helping people..."},{"name":"MATSYA","text":"Then...that must mean you're great at dealing with strangers! Please, won't you teach me to be like you?"},{"name":"MATSYA","text":"You see, I've brought some fresh fish with me─the portion I couldn't preserve─and I want to sell them."},{"name":"MATSYA","text":"The problem is, I'm terrible with people. I've ever only dealt with Khalzahl, and I can't talk to customers without getting my trunk in a twist..."},{"name":"MATSYA","text":"So please...as silly as it might sound, will you not peddle the fish in my stead, and show me how it's done?"},{"name":"MATSYA","text":"If you're willing, please let me know, and we can begin at once!"},{"name":"SYSTEM","text":"The events to follow cannot be skipped. You may wish to cancel any pending Duty Finder registrations."},{"name":"THANCRED","text":"Folk here are rather...<span class=\"emphasis\">business-minded</span>, for want of a better word, but at least they are welcoming of foreigners. In ordinary times, this harbor must overflow with visitors from all over the world."},{"name":"URIANGER","text":"'Tis a storehouse like any other, at first glance. Yet in contrast to its scale, there is a distinct lack of activity."},{"name":"ESTINIEN","text":"Seeing as there's dried fish, I wondered if there might be dried squid as well..."},{"name":"MATSYA","text":"You'll do it, then? Show me how to deal with customers? I'm in your debt!"},{"name":"MATSYA","text":"Right, please try peddling my fish to...shall we say, three people here in Yedlihmad. I will observe you and learn!"},{"name":"SYSTEM","text":"Matsya is now accompanying you. Keep him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Matsya behind by entering a different area, or by speaking with him and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Matsya join you again, return and speak with him at the original location."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Talk."},{"name":"A1","text":"Part ways."},{"name":"A1","text":"Nothing."},{"name":"MATSYA","text":"To travel to unfamiliar places and speak with unfamiliar peoples... Your conversational skills must be astounding!"},{"name":"SYSTEM","text":"Are you sure you wish to part ways with Matsya?"},{"name":"MATSYA","text":"O-Oh, did you have other things you needed to do? In that case, I'll head back to the pier for now..."},{"name":"MATSYA","text":"Ah, you're back! Shall we continue where we left off, then?"},{"name":"SYSTEM","text":"Matsya has yet to arrive. Be sure he is at your side before attempting to continue."},{"name":"MEHRUNNAH","text":"Hm? Yes?"},{"name":"SYSTEM","text":"You should have Matsya accompanying you before you attempt to sell the fish."},{"name":"MEHRUNNAH","text":"Hm? Yes?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Fish, fish! I got fish here! Fresh fish, straight from the sea's bosom to your mouth!"},{"name":"A2","text":"Greetings, friend. How fare you of late?"},{"name":"MEHRUNNAH","text":"Er...I'm sure your bosom fish are very fresh, but this is rather sudden... I don't need any fish right now, so thanks but no thanks."},{"name":"SYSTEM","text":"You fail to make a sale..."},{"name":"MATSYA","text":"N-Never mind, it never goes well the first time. I'm sure you'll fare better with the next customer!"},{"name":"MEHRUNNAH","text":"Greetings to you too. &lt;sigh&gt; I suppose I'm well enough given the circumstance..."},{"name":"MEHRUNNAH","text":"Things have settled down somewhat, but it was utter chaos when that tower first appeared. Everyone grabbing whatever they could, trampling over each other to get to the city..."},{"name":"MEHRUNNAH","text":"Many remain there for now, but I could not stay away. Had to come back─continue with my life, such as it is."},{"name":"MEHRUNNAH","text":"Whether or not it was the right choice...only time will tell."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"It's too risky out here. Maybe you ought to move to the city too."},{"name":"A3","text":"There's no place like home, but don't do anything dangerous, eh?"},{"name":"MEHRUNNAH","text":"Well, I make sure to keep well clear of the tower. And when more monsters emerge from it, I heed the Radiant Host's instructions."},{"name":"MEHRUNNAH","text":"No place safer than the city, of course, but if everyone up and left, what would happen to Yedlihmad? Dangerous though it may be, I'll keep doing what I've always done, to the extent I can."},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"I understand. Were it me, I'd probably carry on doing what I do best as well."},{"name":"A4","text":"All right. Best of luck to you, and stay safe."},{"name":"MEHRUNNAH","text":"Oh, trust me, I don't. I make sure to keep well clear of the tower, and when more monsters emerge from it, I heed the Radiant Host's instructions."},{"name":"MEHRUNNAH","text":"I hope they deal with it soon so we can get back to our normal lives. To the days when you could earn as much as you gave, and tuck into a meal satisfied that you did good work..."},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"Speaking of meals, why not have some fresh fish today?"},{"name":"A5","text":"Those days will come again before you know it. Till then, stay safe!"},{"name":"MEHRUNNAH","text":"What do you do for a living, if you don't mind me asking?"},{"name":"MEHRUNNAH","text":"Well now, a fishmonger! Do you have your goods with you? If so, I'd like to buy some."},{"name":"MEHRUNNAH","text":"Like me, you're doing your part to keep things normal. I respect that."},{"name":"MATSYA","text":"Th-Thank you for your custom! The catch of the day is shallows cod─delectable stewed in coconut milk, or baked with a sprinkle of salt."},{"name":"SYSTEM","text":"You succeed in making a sale!"},{"name":"MEHRUNNAH","text":"You too, friend. And best of luck to us both."},{"name":"SYSTEM","text":"The conversation ends without a sale..."},{"name":"MATSYA","text":"N-Never mind. Sale or no, the way you established a rapport was very enlightening. Come, let's find another potential customer!"},{"name":"MEHRUNNAH","text":"Hm? Fresh fish, you say?"},{"name":"MEHRUNNAH","text":"Ohhh, you're a fishmonger!"},{"name":"MEHRUNNAH","text":"Heh, when you <span class=\"emphasis\">bait</span> me like that, how can I not bite? Very well, give me some of your fish!"},{"name":"MATSYA","text":"Th-Thank you for your custom! The catch of the day is shallows cod─delectable stewed in coconut milk, or baked with a sprinkle of salt."},{"name":"SYSTEM","text":"You succeed in making a sale!"},{"name":"MATSYA","text":"That you should make a sale on the first attempt... I've learned a lot already, and I hope to learn more still!"},{"name":"MATSYA","text":"That was just the first person, so not to worry. We still have plenty of opportunities."},{"name":"NASHREEN","text":"Hm? A hawker, are you?"},{"name":"NASHREEN","text":"A hawker, are you? Do you sell fruit, by chance?"},{"name":"NASHREEN","text":"If so, I want to buy some amra. Let's say a dozen. They don't need to be export quality."},{"name":"Q6","text":"What will you say?"},{"name":"A6","text":"Amra shmamra! My fresh fish is the only thing you need!"},{"name":"A6","text":"What do you need so many amra for?"},{"name":"NASHREEN","text":"Um...no? As I said, it's amra that I want. If I wanted fish, I would've asked for it!"},{"name":"SYSTEM","text":"You fail to make a sale..."},{"name":"MATSYA","text":"Oh well... If it's not what they want, then there's no point forcing it. Let's move on to the north side of town, shall we?"},{"name":"NASHREEN","text":"Why, for eating, of course! It may seem like a lot, but of late, I go through that much in no time at all."},{"name":"NASHREEN","text":"I am a stocktaker by trade, but with no vessels coming these days, the wares are beginning to pile up."},{"name":"NASHREEN","text":"By the same token, nothing is coming in from overseas. But not a day goes by that someone doesn't come asking when the next shipment is arriving for this and that and this and that..."},{"name":"NASHREEN","text":"All of it wears me down, and I find myself feeling constantly hungry..."},{"name":"Q7","text":"What will you say?"},{"name":"A7","text":"Are you sure you're actually hungry?"},{"name":"A7","text":"I know how you feel..."},{"name":"NASHREEN","text":"You know, when I think on it, I'm not so sure..."},{"name":"NASHREEN","text":"Rather than hungry, perhaps I've been feeling...unfulfilled? And I try to fill the void by gorging on food I like."},{"name":"Q8","text":"What will you say?"},{"name":"A8","text":"Take care not to overeat."},{"name":"A8","text":"Do you like fish?"},{"name":"NASHREEN","text":"Thank you. A pity you don't sell fruit, but I enjoyed our little chat! It took my mind off my troubles for a moment."},{"name":"SYSTEM","text":"The conversation ends without a sale..."},{"name":"MATSYA","text":"N-Never mind. If nothing else, you left her with a positive impression. Let's move on to the north side of town, shall we?"},{"name":"NASHREEN","text":"Heh, I'll try not to, thank you. Perhaps it's for the best you don't sell fruit. Still, I enjoyed our chat. It took my mind off my troubles for a moment."},{"name":"SYSTEM","text":"The conversation ends without a sale..."},{"name":"MATSYA","text":"N-Never mind. If nothing else, you left her with a positive impression. Let's move on to the north side of town, shall we?"},{"name":"NASHREEN","text":"Fish? I do like fish, as a matter of fact. Why do you ask?"},{"name":"NASHREEN","text":"Oh, so you're a fishmonger! Apologies for the misunderstanding!"},{"name":"NASHREEN","text":"Hmm... Seeing as you're here, do you happen to have Akyaali sardine? They're perfect in a spicy soup."},{"name":"MATSYA","text":"We certainly do, madam! And if you like it spicy, I also recommend them pickled in oil with a generous amount of chilies."},{"name":"NASHREEN","text":"Oh, that does sound like a wonderful challenge! I didn't have fish in mind at first, but I daresay I'll enjoy these. Thank you!"},{"name":"SYSTEM","text":"You succeed in making a sale!"},{"name":"MATSYA","text":"We're doing great so far... Dare I hope that we can make it three of three?"},{"name":"MATSYA","text":"Not a bad result so far... Let's see if we can finish on a high note!"},{"name":"MATSYA","text":"Don't lose heart yet. We'll sell something to the next person, I'm sure of it!"},{"name":"BHAZAHMA","text":"Hm? What is it?"},{"name":"BHAZAHMA","text":"What is it? If you don't mind, I'm rather busy."},{"name":"BHAZAHMA","text":"Ohhh gods, my stomach... Ungh..."},{"name":"BHAZAHMA","text":"Aether sickness? No, no, nothing so unusual. In my hurry to get back to work, I just ate a little too quickly..."},{"name":"Q9","text":"What will you say?"},{"name":"A9","text":"Some fresh fish will settle your stomach, and mine are the freshest of all!"},{"name":"A9","text":"You should take it easier─eat more slowly and savor your food."},{"name":"BHAZAHMA","text":"Ugh, food is the <span class=\"emphasis\">last</span> thing I need right now... Go and sell your fish to someone else!"},{"name":"SYSTEM","text":"You fail to make a sale..."},{"name":"MATSYA","text":"N-Never mind, we just approached him at a bad time─and timing is everything, yes?"},{"name":"MATSYA","text":"Thank you so much for your demonstration─it was a truly eye-opening experience. Come, let us return to the pier."},{"name":"BHAZAHMA","text":"Would that I could, but I can't afford to be idle. Like as not, circumstances will surely get worse before they get better."},{"name":"BHAZAHMA","text":"And so I'm working as hard as I can while I still can, the better to be prepared."},{"name":"Q10","text":"What will you say?"},{"name":"A10","text":"What an industrious young man you are!"},{"name":"A10","text":"How do you intend to prepare?"},{"name":"BHAZAHMA","text":"W-Well, it's not like I'm trying to impress anyone..."},{"name":"BHAZAHMA","text":"Now, if you'll excuse me, I must be getting back to work. Take care."},{"name":"SYSTEM","text":"The conversation ends without a sale..."},{"name":"MATSYA","text":"T-Too bad we couldn't make a sale, but we did manage to build something of a relationship...?"},{"name":"MATSYA","text":"Thank you so much for your demonstration─it was a truly eye-opening experience. Come, let us return to the pier."},{"name":"BHAZAHMA","text":"By stockpiling supplies. For that, I need to earn coin so I can buy food, medicine, what have you."},{"name":"Q11","text":"What will you say?"},{"name":"A11","text":"How about some fish for your supplies? They're fresh caught!"},{"name":"A11","text":"Do we have anything suitable, Matsya?"},{"name":"BHAZAHMA","text":"Aye, well, fish wouldn't be bad, but I don't want to go through the hassle of preserving them myself. I'd rather buy stuff that's ready to store."},{"name":"BHAZAHMA","text":"So I'm afraid I'll have to pass on your fish. Now, if you'll excuse me, I must be getting back to work."},{"name":"SYSTEM","text":"The conversation ends without a sale..."},{"name":"MATSYA","text":"T-Too bad we couldn't make a sale, but we did manage to build something of a relationship...?"},{"name":"MATSYA","text":"Thank you so much for your demonstration─it was a truly eye-opening experience. Come, let us return to the pier."},{"name":"MATSYA","text":"Oh, er...we do have some dried products too─Thavnairian cucumber and puff-paya fish."},{"name":"MATSYA","text":"They're the last of the batch, so if you're interested, you can have them for a discount."},{"name":"BHAZAHMA","text":"Truly!? By all means, I'll take them all!"},{"name":"SYSTEM","text":"You succeed in making a sale!"},{"name":"MATSYA","text":"Heh heh, you remembered what I told you earlier─that I preserve what I catch. Which serves to show the importance of being attentive!"},{"name":"MATSYA","text":"Thank you so much for your demonstration─it was a truly eye-opening experience. Come, let us return to the pier."},{"name":"MATSYA","text":"Come, let us return to the pier. I wish to thank you properly for your kind help."},{"name":"MATSYA","text":"Th-Thank you so much for showing me how to talk to customers."},{"name":"MATSYA","text":"You managed to sell to everyone you approached. Any merchant in Radz–at–Han would be envious of your success!"},{"name":"MATSYA","text":"Watching you at work was truly inspiring! By applying the lessons I've learned, I hope to one day peddle as well as you!"},{"name":"MATSYA","text":"You managed to sell to two of the three people you approached. Adventurers do indeed have great conversational skills!"},{"name":"MATSYA","text":"Watching you at work was very enlightening. By applying the lessons I've learned, I hope to one day peddle as well as you!"},{"name":"MATSYA","text":"You managed to sell to one of the three people you approached. It was difficult, but when you put your mind to it, you succeeded."},{"name":"MATSYA","text":"Though you did fail too...but there are lessons to be learned in both success and failure! By applying yours, I'll endeavor to become a better peddler."},{"name":"MATSYA","text":"Though you didn't manage to sell any fish in the end...but the way you fearlessly approached strangers gave me much courage!"},{"name":"MATSYA","text":"When I peddle my wares, I'll remember your example and endeavor to be fearless too."},{"name":"MATSYA","text":"Still...there's only so much I can do alone. I hope that things will return to normal for Khalzahl soon..."},{"name":"KHALZAHL","text":"I thought I heard a familiar voice, and who should it be but Matsya..."},{"name":"MATSYA","text":"Khalzahl! H-Have you finished your business at the guild?"},{"name":"KHALZAHL","text":"So you were there too..."},{"name":"KHALZAHL","text":"Forgive me... Try as I might, I can't find any buyers."},{"name":"KHALZAHL","text":"With no ships coming in and hardly any going out, there simply aren't any options. At this rate..."},{"name":"MATSYA","text":"So...you can't buy my fish anymore?"},{"name":"KHALZAHL","text":"I'm sorry, Matsya. I truly am. But for now, you must peddle your own goods."},{"name":"MATSYA","text":"But...by myself, I can't..."},{"name":"KHALZAHL","text":"I want to help you, I do. But as it stands, I can barely help myself."},{"name":"KHALZAHL","text":"I've poured my all into the consortium, and I'll be damned if I let it fall apart. I've friends and families depending on me, and I can't─I <span class=\"emphasis\">won't</span>─fail them. The Sisters as my witness."},{"name":"MATSYA","text":"Khalzahl..."},{"name":"MATSYA","text":"N-Not to worry. Using what I've learned from you, I'm sure I'll manage...somehow."},{"name":"MATSYA","text":"Well, I had best return to my village. My thanks again, and please take care on the road."},{"name":"URIANGER","text":"Mayhap owing to the island's small size, the tower's impact upon the people's lives doth appear more pronounced here than in Eorzea."},{"name":"ESTINIEN","text":"There you are. Gotten over the aether sickness, have you?"},{"name":"THANCRED","text":"I see you've been busy. Managed to learn a tidbit or two, I trust?"},{"name":"THANCRED","text":"I see... We also heard that the tower is affecting many locals' livelihoods, but to think that it would be to such an extent..."},{"name":"THANCRED","text":"For another notable─if not wholly unexpected─discovery, disappearances and kidnappings are disturbingly commonplace."},{"name":"THANCRED","text":"As before, the culprits are almost certainly tempered imperial soldiers."},{"name":"THANCRED","text":"And as before, they mean to use the faith of their hapless thralls to call forth a lunar primal. Business as usual for the Telophoroi."}],"reward":{"gil":1135},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69905]},"next":[69732,69733,69734,69907,70025]},"partials":[{"type":"npc","id":"1038608","obj":{"i":1038608,"n":"Matsya","l":3709,"q":2}},{"type":"npc","id":"1038609","obj":{"i":1038609,"n":"Thancred","l":3709,"q":1}},{"type":"quest","id":"69905","obj":{"i":69905,"n":"On Low Tide","g":11,"l":"Thavnair","s":523}},{"type":"quest","id":"69732","obj":{"i":69732,"n":"Fruit Savior","g":120,"l":"Thavnair","s":1201}},{"type":"quest","id":"69733","obj":{"i":69733,"n":"Shelling Out","g":120,"l":"Thavnair","s":1210}},{"type":"quest","id":"69734","obj":{"i":69734,"n":"Tikka Hike","g":120,"l":"Thavnair","s":1220}},{"type":"quest","id":"69907","obj":{"i":69907,"n":"House of Divinities","g":11,"l":"Thavnair","s":525}},{"type":"quest","id":"70025","obj":{"i":70025,"n":"Steppe Child","g":122,"l":"Thavnair","s":1221,"f":1}}]}