{"quest":{"name":"The Full Report, Warts and All","location":"Labyrinthos","id":69901,"patch":6.0,"sort":519,"eventIcon":71201,"issuer":1038731,"target":1038740,"genre":11,"journal":["Alisaie is not about to let Erenville out of her sight."],"objectives":["Speak with Y'shtola.","While transfigured, speak with Alphinaud.","Head to the designated location while transfigured and accompanied by Alphinaud and Alisaie.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"It feels wrong to spy on Erenville, helpful as he's been...but what other choice do we have?"},{"name":"YSHTOLA","text":"Did you see which way Erenville went...?"},{"name":"KRILE","text":"Forgive me, my attention has been elsewhere... We were following Erenville, weren't we?"},{"name":"ALISAIE","text":"Erenville was headed westwards along the path outside the Archeion. Come, we can still catch him!"},{"name":"ALPHINAUD","text":"It seems Y'shtola wishes to have a word with us."},{"name":"ALISAIE","text":"We've fallen too far behind. And this damned mist won't help matters!"},{"name":"KRILE","text":"I can still hear it..."},{"name":"YSHTOLA","text":"Hold a moment. I have an idea."},{"name":"YSHTOLA","text":"If memory serves, that colossal wall-like structure is Logistikon Beta─one of Labyrinthos's climate control centers."},{"name":"YSHTOLA","text":"It should have its own lifts, with which one could access the upper or lower tiers... Aye, if I were an agent of the Forum, it would make for a convenient meeting place..."},{"name":"YSHTOLA","text":"But even if we happen to find Erenville in the company of said agent, we cannot expect them to reveal issues of importance as we nonchalantly stroll past."},{"name":"YSHTOLA","text":"Nay, we shall have to remain undetected."},{"name":"ALPHINAUD","text":"If only G'raha and his Vanish spell were here..."},{"name":"YSHTOLA","text":"Oh, but there are other ways of turning “invisible.”"},{"name":"YSHTOLA","text":"Hippity hop, my little toads!"},{"name":"KRILE","text":"Goodness!"},{"name":"YSHTOLA","text":"Unaccustomed to transfiguration? Worry not. It will wear off with the passage of time."},{"name":"YSHTOLA","text":"I suggest you and your green companions hop along and catch up with Erenville. Should you feel the magicks fading, return to me and I will refresh the enchantment."},{"name":"KRILE","text":"Um...and what am I to do in the meantime?"},{"name":"YSHTOLA","text":"Wait here with me. In your current state of mind, you'd be as likely to leap into the jaws of a predator as you would learn anything of note."},{"name":"YSHTOLA","text":"Which reminds me: ware the creatures hereabouts. In that form, you are essentially defenseless."},{"name":"SYSTEM","text":"You have changed into a toad! You must remain transfigured in order to progress with quest objectives."},{"name":"SYSTEM","text":"You will return from your transfigured status if you move too far away. Look to your map for the transfiguration's area of effect."},{"name":"SYSTEM","text":"Speak with Y'shtola to restore or prolong the transfiguration."},{"name":"ALISAIE","text":"Ribbit ribbit?"},{"name":"YSHTOLA","text":"Stand still, and I shall recast the spell. The transformation <span class=\"emphasis\">should</span> last long enough to allow you to find and spy upon Erenville."},{"name":"KRILE","text":"&lt;sigh&gt; I would've enjoyed being a toad for a little while, if only for the change of pace... But Y'shtola is right. I am too preoccupied with other matters."},{"name":"ALPHINAUD","text":"Ribbit?"},{"name":"SYSTEM","text":"Alphi-toad's stare speaks volumes, all of which you presume are variations of “Why are you not a toad?” Speak with Y'shtola to have her recast the spell."},{"name":"ALPHINAUD","text":"Ribbit, ribbit... Ribbit!"},{"name":"SYSTEM","text":"Alphi-toad and Ali-toad are now accompanying you. Keep them at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave your quest companions behind by entering a different area, or by speaking with them and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have your companions join you again, return and speak with them at the original location."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Talk."},{"name":"A1","text":"Part ways."},{"name":"A1","text":"Nothing."},{"name":"A1","text":"<span class=\"highlight\">Discuss your surroundings.</span>"},{"name":"ALPHINAUD","text":"Ribbit ribbit. Ribbit..."},{"name":"ALPHINAUD","text":"Ribbit? Ribbit ribbit?"},{"name":"ALISAIE","text":"Ribbit? Ribbit ribbit!"},{"name":"ALISAIE","text":"Ribbit... Ribbit ribbit?"},{"name":"ALISAIE","text":"Ribbit ribbit!"},{"name":"SYSTEM","text":"Ali-toad glares tiny toad daggers at you, likely in a furious attempt to express the sentiment that “This won't work if you're not a toad!” Speak with Y'shtola to have her recast the spell."},{"name":"ALPHINAUD","text":"Ribbit... Ribbit ribbit?"},{"name":"SYSTEM","text":"Alphi-toad attempts and fails to shake his head, but you nevertheless understand that he is telling you this is the wrong way."},{"name":"ALISAIE","text":"Ribbit ribbit... Ribbit ribbit!"},{"name":"SYSTEM","text":"Ali-toad turns to face the north. Perhaps she is suggesting you cross the bridge..."},{"name":"Q2","text":"Are you sure you wish to part ways with your companion?"},{"name":"ALPHINAUD","text":"Ribbit? Ribbit ribbit."},{"name":"SYSTEM","text":"Alphi-toad hops back towards Y'shtola and Krile."},{"name":"ALISAIE","text":"Ribbit!? Ribbit!"},{"name":"SYSTEM","text":"Ali-toad hops back towards Y'shtola and Krile."},{"name":"ALPHINAUD","text":"Ribbit ribbit!"},{"name":"ALISAIE","text":"Ribbit! Ribbit ribbit!"},{"name":"SYSTEM","text":"Your companions have yet to arrive. Be sure they are at your side before attempting to continue."},{"name":"ALISAIE","text":"Our toad performance needs work, apparently. I'll have to pay more attention the next time I see one..."},{"name":"YSHTOLA","text":"You've come back alone? Where are your warty companions?"},{"name":"ALPHINAUD","text":"I suppose we should have known a gleaner who specializes in animal procurement would not be so easily deceived... Yet he seemed inclined to put his trust in us all the same."},{"name":"ALPHINAUD","text":"More importantly, perhaps, we've discovered a new piece of the puzzle─this “momentous duty” the Forum agent mentioned."},{"name":"ALPHINAUD","text":"Sharlayan has been called to action, and the Telophoroi's declaration was the catalyst. Whatever charge it is they hope to fulfill, they deem it of sufficient import to disrupt all of Labyrinthos, not to mention ignore Eorzea's request for aid..."}],"reward":{"gil":1055},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69900]},"next":[69728,69729,69730,69731,69902,70016]},"partials":[{"type":"npc","id":"1038731","obj":{"i":1038731,"n":"Alisaie","l":3708,"q":1}},{"type":"npc","id":"1038740","obj":{"i":1038740,"n":"Alphinaud","l":3708,"q":1}},{"type":"quest","id":"69900","obj":{"i":69900,"n":"The Medial Circuit","g":11,"l":"Labyrinthos","s":518}},{"type":"quest","id":"69728","obj":{"i":69728,"n":"Learning to Sow","g":121,"l":"Labyrinthos","s":1160}},{"type":"quest","id":"69729","obj":{"i":69729,"n":"A Ripe Trade","g":121,"l":"Labyrinthos","s":1170}},{"type":"quest","id":"69730","obj":{"i":69730,"n":"It's Not Mud","g":121,"l":"Labyrinthos","s":1180}},{"type":"quest","id":"69731","obj":{"i":69731,"n":"Not Mushroom for Error","g":121,"l":"Labyrinthos","s":1190}},{"type":"quest","id":"69902","obj":{"i":69902,"n":"A Guide of Sorts","g":11,"l":"Labyrinthos","s":520}},{"type":"quest","id":"70016","obj":{"i":70016,"n":"Lost Little Troll","g":121,"l":"Labyrinthos","s":1191,"f":1}}]}