{"quest":{"name":"A Guide of Sorts","location":"Labyrinthos","id":69902,"patch":6.0,"sort":520,"icon":101101,"eventIcon":71201,"issuer":1038741,"target":1038747,"genre":11,"journal":["Alisaie is staring off in the direction Erenville departed, a thoughtful look on her face.","Alisaie takes a moment to consider the information you learned from Erenville's meeting. Conceding that further interrogation of the gleaners is unlikely to be productive, she suggests you rejoin Y'shtola and Krile and decide where to go from there.","You return to your fellow Scions only to find that Krile is absent. Y'shtola, worried for her colleague's condition, sent her back to Meryall Agronomics alone. Now regretting that decision, she asks that you search for Krile in the vicinity of the farm.","You find Krile by a patch of unusual flowers, and the reason behind her odd behavior finally becomes clear. It seems the headaches were a result of Hydaelyn attempting to make contact with one of Her chosen. Krile hands you a heartbloom, then relinquishes control of her body to the primal that She might deliver to you a message: “In darkness seek joy. Surrender not to sadness, and see beyond despair. Walk free, and bear the light for others to follow.”<br><br>Still contemplating Hydaelyn's cryptic words, you hear voices raised in protest further down the hill. Fourchenault, it seems, has caught wind of your investigations, and you are taken to the Rostra to stand trial at the Forum's inquiry. Though your colleagues seize the opportunity to confront Sharlayan's leadership with what they have recently learned, they succeed only in confirming that Fourchenault and the others are bound to a duty they cannot ignore─and that said duty is connected to a discovery made in the course of studies of the aetherial sea. The assembly concludes with a vote on a proposal allowing the Scions to remain in Sharlayan on the condition that you cease all efforts to discover the nature of the nation's “momentous duty.” The proposal is passed, and so you will not be expelled from the city...for now.","Y'shtola does not appear to be disheartened by the Forum's judgment, but is rather intrigued by the revelation that the Forum's duty is somehow connected to the aetherial sea. She does admit, however, that with your actions thus curtailed in the city, any further progress will be hard-won..."],"objectives":["Speak with Y'shtola.","Search for Krile.","Speak with Y'shtola."],"dialogue":[{"name":"ALPHINAUD","text":"If we happen to cross paths with Erenville again, I should like to thank him properly."},{"name":"YSHTOLA","text":"You've come back alone? Where are your warty companions?"},{"name":"ALISAIE","text":"What duty could warrant the direct involvement of the Forum and the commitment of all its resources?"},{"name":"ALISAIE","text":"Judging by what we just heard, none of the gleaners were offered any kind of explanation. At this point, it seems abundantly clear that we'll learn nothing new by pressing them further."},{"name":"ALISAIE","text":"We should head back to Y'shtola and Krile for the moment. See what they think of this."},{"name":"ALPHINAUD","text":"...Where is Krile?"},{"name":"ALISAIE","text":"It's funny how normal the forest seems now. As a toad, it was all so much more ominous and threatening..."},{"name":"YSHTOLA","text":"Welcome back. I trust you found Erenville, then?"},{"name":"YSHTOLA","text":"Interesting... I had a feeling you would learn something important─even if that something was simply a confirmation that no one knows much of anything."},{"name":"YSHTOLA","text":"We should share this with Krile, then discuss how we'd like to proceed."},{"name":"YSHTOLA","text":"Assuming we find her back at the farm. She was still behaving oddly, so I bade her return and rest there..."},{"name":"YSHTOLA","text":"Perhaps not the best decision, in hindsight. Would you mind checking near those flowers she was so entranced by? The rest of us can survey the more distant areas, just in case she decided to wander."},{"name":"ALPHINAUD","text":"My father may be right─that I am still groping in the dark for answers. But I needed him to know that I would never stop searching. I owed that much to Arenvald...and myself."},{"name":"ALISAIE","text":"Thank the gods for Scholarch Montichaigne. I absolutely <span class=\"emphasis\">loathe</span> arguing in circles."},{"name":"GRAHATIA","text":"I apologize for the trouble I've caused you. I was pondering the significance of what I had just read as I left the restricted section..."},{"name":"GRAHATIA","text":"...And knocked over the security mammet on my way out. I promise to be more vigilant next time."},{"name":"KRILE","text":"You may encounter some raised eyebrows, but do continue to claim the Students as your sponsor whensoever the need arises."},{"name":"KRILE","text":"I believe in the guiding principles of the Scions...and I know my grandfather would have as well."},{"name":"YSHTOLA","text":"Well, at least we've been allowed to remain in the city."},{"name":"YSHTOLA","text":"And our endless investigations have not been in vain─we now know that this mysterious duty of theirs began with whatever the Forum discovered in the aetherial sea."},{"name":"YSHTOLA","text":"With our freedoms so sorely curtailed, however, we will struggle to learn aught more of substance here in Sharlayan..."}],"reward":{"gil":975},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69901]},"next":[69903]},"partials":[{"type":"npc","id":"1038741","obj":{"i":1038741,"n":"Alisaie","l":3708,"q":1}},{"type":"npc","id":"1038747","obj":{"i":1038747,"n":"Y'shtola","l":3706,"q":1}},{"type":"quest","id":"69901","obj":{"i":69901,"n":"The Full Report, Warts and All","g":11,"l":"Labyrinthos","s":519}},{"type":"quest","id":"69903","obj":{"i":69903,"n":"Estate Visitor","g":11,"l":"Old Sharlayan","s":521}}]}