{"quest":{"name":"House of Divinities","location":"Thavnair","id":69907,"patch":6.0,"sort":525,"eventIcon":71201,"issuer":1038611,"target":1038616,"genre":11,"journal":["Judging by his furrowed brow, something important has occurred to Estinien."],"objectives":["Search the area for Matsya.","Search for Matsya.","Render aid to Matsya.","Speak with Matsya.","Gather information in Akyaali.","Speak with Matsya."],"dialogue":[{"name":"THANCRED","text":"Helping a struggling fisherman you've only just met to peddle his catch... Yes, you would do something like that."},{"name":"URIANGER","text":"Mayhap owing to the island's small size, the tower's impact upon the people's lives doth appear more pronounced here than in Eorzea."},{"name":"ESTINIEN","text":"That Matsya fellow you were helping─he's Arkasodara, is he not?"},{"name":"ESTINIEN","text":"Apparently, 'tis almost exclusively his people that are being kidnapped. Should he be traveling alone?"},{"name":"URIANGER","text":"If summoning is this perpetrator's aim, it doth stand to reason that Arkasodara would be their primary targets."},{"name":"URIANGER","text":"For 'tis the faith of their ancestors which prevaileth in this land, and many are devout adherents still."},{"name":"THANCRED","text":"We'd better go after him. Akyaali lies to the west, as I recall─the same direction as Krile's acquaintance, incidentally."},{"name":"ESTINIEN","text":"It's settled, then. Keep your eyes peeled while we make for the village."},{"name":"SYSTEM","text":"You do not see Matsya nearby, but the elevated ground up ahead may provide a better vantage point..."},{"name":"SYSTEM","text":"You do not see Matsya from here either..."},{"name":"MATSYA","text":"(-???-)N-No! Leave me alone! Help! Somebody, help!"},{"name":"SYSTEM","text":"Matsya's voice─and it came from the north!"},{"name":"BALLON","text":"Fuel... Gather fuel..."},{"name":"BALLON","text":"Meddlers... Eliminate..."},{"name":"MATSYA","text":"H-Huh? Where did they go? Why are you here...?"},{"name":"THANCRED","text":"I see you found him in time."},{"name":"MATSYA","text":"Y-You and your friends came to look for me? I don't know how to thank you..."},{"name":"MATSYA","text":"On my way home, I took a moment to stop and rest. Think about what to do about, well...everything."},{"name":"MATSYA","text":"And then those men came..."},{"name":"THANCRED","text":"Kidnappers. We'd heard that the Arkasodara were being targeted."},{"name":"THANCRED","text":"Surely you have as well? Perhaps it's best if you took refuge in the city."},{"name":"MATSYA","text":"We've considered it, me and the others. But fishing is all we know─the ocean all we have."},{"name":"THANCRED","text":"I see... That's your decision to make, but you should take care not to travel alone."},{"name":"URIANGER","text":"A question, if I may."},{"name":"URIANGER","text":"'Tis our understanding that strange fiends have emerged from the tower. What canst thou tell us of these beings?"},{"name":"MATSYA","text":"Not much, I'm afraid. I have no idea what they are."},{"name":"MATSYA","text":"But I've heard that some bear an unsettling resemblance to our divinities."},{"name":"MATSYA","text":"For that reason, some have taken to calling the tower “Zot”..."},{"name":"MATSYA","text":"\"House of divinities“ in the old tongue, it means."},{"name":"MATSYA","text":"But they're not true divinities. They're monstrous imitations that bring only death!"},{"name":"URIANGER","text":"To have one's faith so twisted is a grievous indignity, and full justified art thou in thine outrage."},{"name":"URIANGER","text":"Know that 'tis for no other purpose but to neutralize the tower that we have journeyed to this land."},{"name":"URIANGER","text":"In time we may be forced to contend with these false gods, and thus we would learn all we may about them. Wilt thou not tell us of thy divinities and their true nature?"},{"name":"MATSYA","text":"You've come all this way to save us...? Really!? To think I had you peddling fish..."},{"name":"MATSYA","text":"But to answer your question─yes, of course! We would gladly tell you about our gods. “We,” I say, because I'm a terrible storyteller, and I'd ask my fellow villagers to do it."},{"name":"MATSYA","text":"So please come to our village. We're good, gods-fearing folk, all of us, and we'd be honored to share our knowledge. <span class=\"emphasis\">And</span> fish!"},{"name":"URIANGER","text":"What sayest thou? Shall we pay visit to Akyaali?"},{"name":"MATSYA","text":"Wonderful! Just follow the road west and down the hill─you can't miss it!"},{"name":"URIANGER","text":"So, 'tis the simulacra of Thavnairian gods that are being summoned... If any doubt existed before, there can be none now: the kidnapped Hannish are imprisoned in the tower."},{"name":"URIANGER","text":"I pray that we will be able to save them..."},{"name":"THANCRED","text":"Though indeed, saving them will mean confronting their false gods, like as not. Aye, as you said, we'd do well to study their religious traditions. To Akyaali."},{"name":"THANCRED","text":"A charming little village. Shame about the hideous tower."},{"name":"URIANGER","text":"Familiar though I am with the myths and legends of this island, to hear them spoken by heirs to this storied heritage giveth them new life."},{"name":"ESTINIEN","text":"Mark you that platform out on the water. Some manner of shrine, perhaps?"},{"name":"MATSYA","text":"Welcome to Akyaali, my friend! The name means “white beach,” and there isn't much here save that...but please make yourself at home."},{"name":"MATSYA","text":"Your companions have already begun talking to everyone. Feel free to show yourself around and do the same."},{"name":"MATSYA","text":"Any one of us can tell you about our gods, but you could do worse than to start with Khanga and old Hasveydah. They're free at the moment, as it happens."},{"name":"MATSYA","text":"I'll try to think if there is anything useful I can share with you as well. After all, I still owe you for rescuing me on the hill!"},{"name":"KHANGA","text":"Hm? You wish to know about our gods? What a curious visitor you are. Most want fish. In any case, I'm happy to oblige."},{"name":"KHANGA","text":"Now, I don't know how it is whence you hail, but our isle is home to many gods."},{"name":"KHANGA","text":"They can be divided into two groups: the Manusya, beings of wisdom who assume the form of men; and the Mrga, beings of might who assume the form of beasts."},{"name":"KHANGA","text":"Together They are divinities─Their forms and personalities many and varied."},{"name":"KHANGA","text":"Some are kind and gentle, others stern and temperamental─just like we mortals can be."},{"name":"KHANGA","text":"All are possessed of great insight and experience, and by heeding Their teachings, we strive to be better people and live better lives."},{"name":"KHANGA","text":"Different though They may be, both the Manusya and the Mrga are equally divine and equally revered."},{"name":"HASVEYDAH","text":"Interested in learning about our gods, you say? Heh, that's what I like to hear! Prick up your ears, then, and listen."},{"name":"HASVEYDAH","text":"In ancient times, the Manusya and the Mrga─deities who look like men and beasts, respectively─were locked in conflict."},{"name":"HASVEYDAH","text":"Eventually, seeking the wisdom of the Manusya, the Mrga cast aside Their own heads and took up those of Their foes."},{"name":"HASVEYDAH","text":"Likewise, the Manusya coveted the might of the Mrga, and so They too resolved to trade heads."},{"name":"HASVEYDAH","text":"Thus were born new gods possessed of both might and wisdom, and They ushered in an age of harmony between the two factions."},{"name":"HASVEYDAH","text":"From then on, as a sign of Their esteem for one another, the Manusya have worn animal faces, and the Mrga the limbs of men."},{"name":"HASVEYDAH","text":"We honor the Manusya and the Mrga by incorporating Their sacred images into works both practical and artistic. Try looking out for them, eh?"},{"name":"MATSYA","text":"There you are. Learned a thing or two about our gods, I trust?"},{"name":"MATSYA","text":"While you were off talking to the others, I remembered something that may be of interest."},{"name":"MATSYA","text":"If you could let your friends know, I'll go and fetch it from my home at once."},{"name":"MATSYA","text":"Apologies for the wait. I wished to show you this hanging scroll which depicts three of our most revered deities."},{"name":"URIANGER","text":"By all means, we should like to see it."},{"name":"MATSYA","text":"They are Manusya─you heard about Them already, yes? Three sisters."},{"name":"MATSYA","text":"The center one is the eldest. Cinduruva, a goddess of wisdom. For this, alchemists hold Her in the highest."},{"name":"MATSYA","text":"To Her right is the middle sister, Sanduruva. As a goddess of wealth, She counts many traders among Her followers."},{"name":"MATSYA","text":"And on the left is Minduruva, the youngest sibling. She presides over the crafts, and so is beloved by weavers."},{"name":"MATSYA","text":"Although each is worshipped for different reasons, the sisters are usually portrayed together in these works, which people keep in their homes for good fortune."},{"name":"URIANGER","text":"In like fashion to the Manusya, the deities of Eorzea preside over myriad aspects of life. And what of the Mrga, if I may ask?"},{"name":"MATSYA","text":"The Mrga hold power over nature. In ages past, They were revered as guardian deities in times of conflict."},{"name":"MATSYA","text":"If you have occasion to visit our temples and ruins, you'll find Their images there."},{"name":"MATSYA","text":"Among them is a god who possesses a gaja's head, and He is venerated as the progenitor of the Arkasodara."},{"name":"MATSYA","text":"And then there are dragons. They occupy a special place in our history."},{"name":"ESTINIEN","text":"You worship dragons too?"},{"name":"MATSYA","text":"It's said that an ancestor of the satrap─that's the ruler of Radz-at-Han─forged a covenant with a dragon divinity in ancient times."},{"name":"MATSYA","text":"This divinity has since acted as the guardian deity of the satrap. Legend holds that, if ever the satrap is in need, his dragon ally will fly to his aid!"},{"name":"ESTINIEN","text":"Dragon ally..."},{"name":"THANCRED","text":"You claimed to be a terrible storyteller, but nothing could be further from the truth."},{"name":"THANCRED","text":"The passion you bear for your faith is plain to hear. I am confident that the information you've given us will serve us well in our efforts to deal with the tower."},{"name":"MATSYA","text":"That is very kind of you to say. Thank you! I will pray for your success."},{"name":"THANCRED","text":"Right, I believe it's time we sought out Krile's acquaintance."},{"name":"THANCRED","text":"An alchemist by the name of Nidhana."},{"name":"THANCRED","text":"According to Krile's notes, we're to find her at a place called the Great Work, further north along the coast."}],"reward":{"gil":1095},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69906]},"next":[69908]},"partials":[{"type":"npc","id":"1038611","obj":{"i":1038611,"n":"Estinien","l":3709,"q":1}},{"type":"npc","id":"1038616","obj":{"i":1038616,"n":"Matsya","l":3709,"q":2}},{"type":"quest","id":"69906","obj":{"i":69906,"n":"A Fisherman's Friend","g":11,"l":"Thavnair","s":524}},{"type":"quest","id":"69908","obj":{"i":69908,"n":"The Great Work","g":11,"l":"Thavnair","s":526}}]}