{"quest":{"name":"On Low Tide","location":"Thavnair","id":69905,"patch":6.0,"sort":523,"eventIcon":71201,"issuer":1038600,"target":1038608,"genre":11,"journal":["His stomach behaving once more, Thancred is ready to get to work."],"objectives":["Gather information in Yedlihmad.","Speak with Khalzahl.","Speak with Matsya."],"dialogue":[{"name":"URIANGER","text":"Be thou assured that I am quite recovered. Lassi is truly a boon for unruly stomachs."},{"name":"ESTINIEN","text":"Is it truly so amusing to see my hair bound? 'Tis how I used to wear it. A functional fashion."},{"name":"ESTINIEN","text":"Perhaps you were confused by how you found me following Nidhogg's demise. It had fallen loose after the chirurgeons removed me from my armor and put me to bed. I simply decided to leave it that way for a time, seeing as I would not don the Azure Dragoon's helm again."},{"name":"THANCRED","text":"Right, let us split up and make inquiries in town. <span class=\"highlight\">Forename</span>, the pier is yours."},{"name":"THANCRED","text":"Once we have learned what we can, we regroup by the aetheryte...off-putting though the mere sight of it may be."},{"name":"SYSTEM","text":"The crate is laden with fruits, but they are on the verge of spoiling, as if they have been left too long."},{"name":"SYSTEM","text":"Gazing out from the pier, you spy boats moored off nearby isles, with the silhouettes of larger seafaring vessels farther away."},{"name":"SYSTEM","text":"Compared to other ports you have visited in the past, there appears to be very little activity."},{"name":"QEFIRAZ","text":"Well now, if it isn't a traveler... You're a rare sight in these unsettled times."},{"name":"QEFIRAZ","text":"People have been giving us a wide berth since that accursed tower suddenly appeared on Narunnair."},{"name":"QEFIRAZ","text":"If it just stood there and loomed ominously, perhaps things would be fine after a fashion, but no─it had to spawn fell fiends as well."},{"name":"QEFIRAZ","text":"We still have our lives thanks to the Radiant Host, but business is as good as dead. What'll become of us, only the gods know..."},{"name":"QEFIRAZ","text":"It's a shame not everyone's as brave as you. Or foolish."},{"name":"DJINALEEL","text":"What am I doing? Oh, recording my sales. Still do it daily out of habit, though I don't know why I bother. Hardly sell anything these days."},{"name":"DJINALEEL","text":"Business has never been this terrible...but I suppose things could be even worse. I could have a consortium to keep afloat, like Khalzahl."},{"name":"DJINALEEL","text":"I don't envy his position. Better to be alone with my little operation, I've come to realize."},{"name":"DJINALEEL","text":"You're a traveler, by the looks of you? If you have a moment, perhaps you could pay Khalzahl a visit. He'd be glad for tidings from abroad."},{"name":"DJINALEEL","text":"Like as not, you'll find him at the Saltwind's Sails, the harbor guild building across the water from here."},{"name":"DJINALEEL","text":"If times are tough for me, they must be a thousand times worse for Khalzahl. I can't help but worry for him."},{"name":"PORTMANAGER04368","text":"And what do you expect me to do?"},{"name":"KHALZAHL","text":"The Dalmascans aren't coming!? But we already have everything they ordered! What are we supposed to do with it?"},{"name":"PORTMANAGER04368","text":"I don't know, but yelling at me isn't going to help. All I know is that their plans have changed, and that's that."},{"name":"PORTMANAGER04368","text":"Look, you must have known this might happen. The Empire is at war with itself, and the provinces are in chaos."},{"name":"PORTMANAGER04368","text":"And then there's the tower sitting on our doorstep spitting out monstrosities."},{"name":"PORTMANAGER04368","text":"The city has its defenses, but we've been afforded no protection out here. We can't blame foreigners for not wanting to take the risk."},{"name":"KHALZAHL","text":"Gah! But this will be an enormous loss!"},{"name":"KHALZAHL","text":"All right, all right... Forget about the Dalmascans. Surely <span class=\"emphasis\">some</span> ships are still coming?"},{"name":"KHALZAHL","text":"We have fresh produce, handicrafts, medicines─all the perennial Hannish favorites."},{"name":"KHALZAHL","text":"Our consortium works closely with merchants and artisans to supply only the finest wares. Quality is guaranteed!"},{"name":"PORTMANAGER04368","text":"&lt;sigh&gt; I know all these things, Khalzahl, I do."},{"name":"PORTMANAGER04368","text":"Which is why I regret to say I have <span class=\"emphasis\">nothing</span> for you. All voyages have been canceled or indefinitely postponed."},{"name":"PORTMANAGER04368","text":"And you are...?"},{"name":"KHALZAHL","text":"Wait, you're a foreigner, are you not? A merchant!? Please tell me you're a merchant!"},{"name":"KHALZAHL","text":"I see... That's a shame..."},{"name":"KHALZAHL","text":"I'm sorry, but we're discussing important matters. If you need something, please talk to one of the others."},{"name":"MATSYA","text":"(-???-)Um, excuse me..."},{"name":"MATSYA","text":"M-My name is Matsya, and I'm here to see Khalzahl..."},{"name":"MATSYA","text":"Oh, it seems he's busy. I'll come back later, then..."},{"name":"KHALZAHL","text":"If foreign vessels won't come to us, why not use our own to deliver the wares to them!?"},{"name":"PORTMANAGER04368","text":"It's not so simple, Khalzahl. And besides, everyone is in the same boat. <span class=\"emphasis\">Everyone</span>."},{"name":"MATSYA","text":"Y-Yes? Can I help you...?"},{"name":"MATSYA","text":"Ah, I remember seeing you back in the guild. You wanted to speak with Khalzahl, too, did you?"},{"name":"MATSYA","text":"I'm Matsya, a fisherman of Akyaali─a nearby village."},{"name":"MATSYA","text":"I sell my catch to Khalzahl, who offers it to foreign merchants. But he hasn't bought anything for a while now."},{"name":"MATSYA","text":"When I heard that the consortium had been struggling, I became worried and decided to come and see him."},{"name":"MATSYA","text":"...Just as soon as he's free, anyway. He's a hardworking man, and I dare not disturb him."}],"reward":{"gil":775,"items":[{"id":35669}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69904]},"next":[69906]},"partials":[{"type":"npc","id":"1038600","obj":{"i":1038600,"n":"Thancred","l":3709,"q":1}},{"type":"npc","id":"1038608","obj":{"i":1038608,"n":"Matsya","l":3709,"q":2}},{"type":"item","id":"35669","obj":{"i":35669,"n":"Horse Chestnut Hand Gear Coffer (IL 515)","l":1,"c":26560,"t":61}},{"type":"quest","id":"69904","obj":{"i":69904,"n":"For Thavnair Bound","g":11,"l":"Old Sharlayan","s":522}},{"type":"quest","id":"69906","obj":{"i":69906,"n":"A Fisherman's Friend","g":11,"l":"Thavnair","s":524}}]}