{"quest":{"name":"Estate Visitor","location":"Old Sharlayan","id":69903,"patch":6.0,"sort":521,"eventIcon":71201,"issuer":1038746,"target":1040291,"genre":11,"journal":["Alisaie has a look of dissatisfaction."],"objectives":["Speak with Alphinaud.","Speak with Alisaie while accompanied by Alphinaud.","Speak with Ameliance while accompanied by Alphinaud and Alisaie.","Speak with Alphinaud.","Speak with Krile in the main hall of the Baldesion Annex."],"dialogue":[{"name":"ALPHINAUD","text":"My father may be right─that I am still groping in the dark for answers. But I needed him to know that I would never stop searching. I owed that much to Arenvald...and myself."},{"name":"YSHTOLA","text":"We shall have to think very carefully about how we are to proceed from here."},{"name":"GRAHATIA","text":"I apologize for the trouble I've caused you. I was pondering the significance of what I had just read as I left the restricted section..."},{"name":"GRAHATIA","text":"...And knocked over the security mammet on my way out. I promise to be more vigilant next time."},{"name":"KRILE","text":"You may encounter some raised eyebrows, but do continue to claim the Students as your sponsor whensoever the need arises."},{"name":"KRILE","text":"I believe in the guiding principles of the Scions...and I know my grandfather would have as well."},{"name":"ALISAIE","text":"The overall picture has grown clearer, yes, but that's in spite of the Forum being so maddeningly vague about this duty of theirs."},{"name":"ALISAIE","text":"Why are they so reluctant to explain their actions in plain words?"},{"name":"ALISAIE","text":"Survival, come what may... Is Father's work so vital that it takes precedence over his own family?"},{"name":"AMELIANCE","text":"(-???-)Alphinaud...? Alisaie...? It <span class=\"emphasis\">is</span> you!"},{"name":"AMELIANCE","text":"(-???-)When I heard you'd been dragged before the Forum, I came as swiftly as I could. I am so very glad they allowed you to stay..."},{"name":"ALISAIE","text":"M-Mother!?"},{"name":"AMELIANCE","text":"Ameliance Leveilleur, at your service."},{"name":"AMELIANCE","text":"And you fine people must be the Scions of the Seventh Dawn. How lovely it is to finally meet you!"},{"name":"ALPHINAUD","text":"Mother, please. We don't wish to make things difficult for you. If word reaches Father that you were here─"},{"name":"AMELIANCE","text":"Oh, bother that. Am I to be chastised for speaking with my own children!? I am well aware that you and “Master Fourchenault” are not on the best of terms at the moment, but I've been absolutely desperate to see my darlings again!"},{"name":"AMELIANCE","text":"You <span class=\"emphasis\">will</span> come by the house, won't you? I have gifts waiting."},{"name":"YSHTOLA","text":"The timing couldn't be better. As matters stand, we shan't be going anywhere until we discuss matters with Thancred's group and reconsider our options."},{"name":"YSHTOLA","text":"Go, visit your home. We will be back at the annex when you are ready to rejoin us."},{"name":"ALISAIE","text":"I'm not sure we─ <span class=\"highlight\">Forename</span>, what do you think?"},{"name":"AMELIANCE","text":"<span class=\"highlight\">Forename</span>? <span class=\"emphasis\">The</span> <span class=\"highlight\">Forename Surname</span>!?"},{"name":"AMELIANCE","text":"What a splendid day this has turned out to be! Champion of Eorzea, I <span class=\"emphasis\">insist</span> that you join us!"},{"name":"AMELIANCE","text":"Ah, but we must be quick about it. Not for my own benefit, but should my husband return and find you enjoying our hospitality, the servants will be made to suffer the consequences."},{"name":"AMELIANCE","text":"<span class=\"highlight\">Forename</span>! If you would be so kind as to escort my children to the estate...?"},{"name":"ALISAIE","text":"And then she was gone─and with her any opportunity to protest..."},{"name":"KRILE","text":"Indeed─the matter is settled. Enjoy yourselves, you three!"},{"name":"ALISAIE","text":"I'm sure Alphinaud thinks nothing of it─he invited classmates over all the time. But I, well... I wasn't the most... It was a different time for me, all right!?"},{"name":"ALPHINAUD","text":"I apologize... My mother is not one to take no for an answer. Still, I am glad─relieved, even─to see her in such high spirits."},{"name":"ALPHINAUD","text":"What say you, <span class=\"highlight\">Forename</span>? Though it seems we shall have little enough time to enjoy it, will you accompany us on our visit home?"},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Talk."},{"name":"A1","text":"Part ways."},{"name":"A1","text":"Nothing."},{"name":"ALPHINAUD","text":"Let us give Alisaie a push, then, and be on our way."},{"name":"Q2","text":"Are you sure you wish to part ways with your companions?"},{"name":"ALPHINAUD","text":"What? Right now? Nothing for it, I suppose, but Mother was most insistent you come as well. We shall be waiting for you by the Rostra."},{"name":"ALPHINAUD","text":"Shall we hurry along to the estate? Mother will be wondering where we are."},{"name":"SYSTEM","text":"Your companions have yet to arrive. Be sure they are at your side before attempting to continue."},{"name":"ALISAIE","text":"Oh no, I'm not going to suffer this by myself. Make sure Alphinaud is coming along first!"},{"name":"SYSTEM","text":"You must be accompanied by Alphinaud and have him at your side in order to proceed with quest objectives."},{"name":"ALISAIE","text":"Fine... If we're going, then let's get it over with! But be sure to stay in the entrance hall─no peeking into our private chambers, thank you very much!"},{"name":"ALPHINAUD","text":"Why ever not? Your room was always perfectly neat and tidy..."},{"name":"ALISAIE","text":"Everyone has things they'd rather keep to themselves, don't they? Cherished mementos you couldn't bring yourself to throw away, childhood toys─"},{"name":"ALISAIE","text":"I mean, uh... Gah, never mind! The Leveilleur estate is that way, straight down the stairs. Come on!"},{"name":"SYSTEM","text":"Alphinaud and Alisaie are now accompanying you. Keep them at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave your quest companions behind by entering a different area, or by speaking with them and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have your companions join you again, return and speak with them at the original location."},{"name":"A3","text":"<span class=\"highlight\">Discuss the view from the bridge.</span>"},{"name":"A3","text":"<span class=\"highlight\">Discuss Auk's Landing.</span>"},{"name":"ALPHINAUD","text":"After all we've been through together, 'tis strange to be here with you now. To come full circle and see how much has changed..."},{"name":"ALPHINAUD","text":"Are you ready to visit the estate? Mother will be cross if we come without Alisaie. The Rostra was to be our rendezvous point..."},{"name":"ALISAIE","text":"The Leveilleur estate is in the northern part of Journey's End, just down the stairs from the Rostra."},{"name":"ALISAIE","text":"Oh, and please don't make a fuss when we get there. It's only a house!"},{"name":"ALISAIE","text":"Alphinaud will be at the Rostra. Mother wants to see both of us, so let's go and grab him, shall we?"},{"name":"ALPHINAUD","text":"When Alisaie and I were little, this bridge was as far as we were permitted to wander alone."},{"name":"ALPHINAUD","text":"I say “alone,” but my mother or a servant was always somewhere nearby, keeping a watchful eye."},{"name":"ALPHINAUD","text":"And now look at us. Traveling to different continents...different worlds, even."},{"name":"ALISAIE","text":"As children, Alphinaud and I would often wait here for our father to come home from work."},{"name":"ALISAIE","text":"It must've been a day when his meetings ran long, because I remember growing restless, and leaning out over the railing to watch the water rush by."},{"name":"ALISAIE","text":"Father, of course, arrived at that exact moment. Came pounding down the path in a panic, crying out my name..."},{"name":"ALPHINAUD","text":"Oh yes, this is where I first practiced magic on an actual person."},{"name":"ALPHINAUD","text":"Alisaie had fallen, you see, and scraped her knee quite badly─so I tried casting the simple restorative spell I had only just learned."},{"name":"ALPHINAUD","text":"How she smiled when the wound closed. The joy and relief... That was, I believe, the very moment I chose the healing arts as the main subject of my studies."},{"name":"ALISAIE","text":"We used to come here all the time with Grandfather! In summer, I would dip my hands and feet in the fountain and splash about..."},{"name":"ALISAIE","text":"Not Alphinaud, though─even back then, he wasn't very fond of playing in water. He'd make any excuse to avoid it."},{"name":"ALISAIE","text":"Which would explain how I came to swim like an auk, and he sink like a stone!"},{"name":"ALISAIE","text":"Not going after all? Then neither shall I! Though I suppose I'll never hear the end of it from Mother if we don't... Hmm. We'll wait at the Rostra in case you change your mind."},{"name":"ALISAIE","text":"Decided to come with us? And you're sure about this? &lt;sigh&gt; All right...if only to see the smile on Mother's face."},{"name":"AMELIANCE","text":"Oh, are you the advance party? I should like to receive you all at once, if that's not too much to ask!"},{"name":"SYSTEM","text":"You must be accompanied by Alphinaud and Alisaie, and have them at your side in order to proceed with quest objectives."},{"name":"AMELIANCE","text":"And here you are at last! Please, do come in!"},{"name":"ALISAIE","text":"And that was that. Only the gods know when we'll be back again..."},{"name":"ALPHINAUD","text":"Thank you for indulging Mother's request─I can see it meant a lot to her. And I, uh, shall refrain from inquiring as to the content of your private conversation."},{"name":"ALPHINAUD","text":"Our visit was all too brief... For now, however, it will have to suffice. As will these tokens of home that we carry with us─these gifts to help us remember who we are and whence we came..."},{"name":"ALPHINAUD","text":"But enough sentimentality. Let us return to the annex and rejoin our companions!"},{"name":"KRILE","text":"Enjoyed your time with the Leveilleurs, I hope? I would ask how the twins fared, but their new outfits tell the tale!"},{"name":"KRILE","text":"I only hope we can help them to reconcile with their father, that they might return home one day with their heads held high..."},{"name":"KRILE","text":"In the meantime, we edge ever closer to the secret the Forum strives to hide. And the flower bequeathed to you by Hydaelyn is sure to guide us going forward."},{"name":"KRILE","text":"I'm confident that once we've heard your report from Thavnair, we'll be well equipped to plot out our next move!"},{"name":"KRILE","text":"I'm confident that once you've scouted out the situation in Thavnair, we'll be well equipped to plot out our next move!"}],"reward":{"gil":1175},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69902]},"next":[69913]},"partials":[{"type":"npc","id":"1038746","obj":{"i":1038746,"n":"Alisaie","l":3706,"q":1}},{"type":"npc","id":"1040291","obj":{"i":1040291,"n":"Krile","l":3817,"q":2}},{"type":"quest","id":"69902","obj":{"i":69902,"n":"A Guide of Sorts","g":11,"l":"Labyrinthos","s":520}},{"type":"quest","id":"69913","obj":{"i":69913,"n":"In the Dark of the Tower","g":11,"l":"Old Sharlayan","s":531}}]}