{"quest":{"name":"The Medial Circuit","location":"Labyrinthos","id":69900,"patch":6.0,"sort":518,"eventIcon":71201,"issuer":1038719,"target":1038732,"genre":11,"journal":["Alisaie seems eager to get underway."],"objectives":["Survey the area and defeat any enemies that appear.","Survey the next area and defeat any enemies that appear.","Speak with Alphinaud.","Survey the area at the designated location.","Gather information at Meryall Agronomics.","Investigate the stacked boxes.","Speak with Y'shtola."],"dialogue":[{"name":"ALPHINAUD","text":"Man-made though it may be, this shaft was designed to resemble a natural cave system. Heed Erenville's warning and do step carefully."},{"name":"YSHTOLA","text":"The Medial Circuit which Erenville mentioned is the tier directly below us."},{"name":"YSHTOLA","text":"Unlike the lowest level of Labyrinthos with its rigid security, one can usually roam the middle layer quite freely. Let us see what we might find."},{"name":"KRILE","text":"I never would've noticed this cave on my own! Thank the Scholar that Erenville knew of it...and that you were there to persuade him to share."},{"name":"ALISAIE","text":"Assuming everyone's tightened their straps and checked their gear, then I say we head on in. Given the terrain ahead, though, it might be wise to leave some distance between us─we don't want to be stumbling over each other if it comes to a fight."},{"name":"ALISAIE","text":"Take it slow, and don't forget to check your surroundings from time to time! We can meet up again at the other end of the tunnel."},{"name":"ALISAIE","text":"<span class=\"highlight\">Forename</span>! Did you know Krile almost took a tumble back there? She can't possibly still be dizzy from the lift..."},{"name":"KRILE","text":"I was being careful, I swear! The slope was steeper than I thought, and I lost my footing for a moment, that's all. I'm not injured, if you don't count my pride..."},{"name":"YSHTOLA","text":"That mineshaft was infested with mythrilcaps. Some sort of research project, I wonder?"},{"name":"YSHTOLA","text":"I suppose they <span class=\"emphasis\">are</span> a most unusual creature. Why did they develop such long limbs when all they do is shuffle about narrow tunnels?"},{"name":"ALPHINAUD","text":"Everyone seems to have made it through without incident. Nothing of consequence, at least. And, as promised, the tunnel has delivered us into the Medial Circuit."},{"name":"ALPHINAUD","text":"As I recall, this tier is where they keep a wide variety of samples for agricultural production."},{"name":"ALPHINAUD","text":"If Erenville's assumption holds true─that specimens are being collected in preparation for a great migration─then we should see evidence of such plans in the area's research projects."},{"name":"ALPHINAUD","text":"Let's follow the path to the nearest farming facility and see what we see..."},{"name":"ALPHINAUD","text":"My memories of this place are a touch hazy, but if we keep to the path heading north, then we should eventually arrive at a farm of some kind..."},{"name":"KRILE","text":"Aha, now I know where we are─this is Meryall Agronomics."},{"name":"KRILE","text":"Labyrinthos is host to a wide variety of vegetation, which allows us to conduct studies on cultivation methods utilized in foreign lands."},{"name":"KRILE","text":"And it is this facility which coordinates and oversees those efforts. The “fruits” of their research go to feed their Labyrinthos colleagues, or so I hear."},{"name":"ALISAIE","text":"More notable successes might make it to the Agora. Foods so exotic you'd be hard-pressed to guess their origin, let alone how they might taste."},{"name":"KRILE","text":"Indeed! Mystery vegetables without a name, only a list of nutritional benefits scribbled on a card..."},{"name":"ALPHINAUD","text":"Hm... I see no gleaners hereabouts, yet these workers seem to share that same sense of urgency."},{"name":"ALPHINAUD","text":"'Tis possible they know something of the Forum's plans and their underlying motivations. Worth looking into, wouldn't you say?"},{"name":"ALPHINAUD","text":"See what you can coax from the workers. The rest of us will do the same or cast about for useful clues."},{"name":"ALPHINAUD","text":"...And so you've spent years researching these high-yield cultivation techniques?"},{"name":"ALISAIE","text":"I'm told this cart holds the harvest meant for the larders here. Nothing out of the ordinary..."},{"name":"KRILE","text":"A field full of ripe vegetables being left to rot on the vine. Not a single picker hard at work. Clearly procuring readily available fresh food is not the Forum's priority..."},{"name":"YSHTOLA","text":"I took a moment to survey the surrounding area. There are several other facilities nearby we can investigate if we fail to learn aught of value here."},{"name":"JEBKE","text":"Oh, hello there! We weren't expecting visitors─not with use of the lift being restricted. How <span class=\"emphasis\">did</span> you make it down here, anyway?"},{"name":"JEBKE","text":"The mineshaft, you say? Well, you're a much hardier soul than I!"},{"name":"JEBKE","text":"Under normal circumstances, I'd reward such tenacity with a guided tour of the fields, but I'm afraid the Forum has us filling order lists a malm long."},{"name":"JEBKE","text":"Massive-yet-detailed requests. Literal wagonloads of crop samples, and hardly any time to put them together."},{"name":"JEBKE","text":"When I first heard of this grand “reorganization,” I assumed we would be shuffling around old stock to make room for the new. Then came the orders for ridiculous quantities of seeds we've already thoroughly researched."},{"name":"JEBKE","text":"Passing strange, eh? I pressed for an explanation...and was met with vague assurances that all would be revealed in due course. Not the most satisfying answer..."},{"name":"JEBKE","text":"Visit us again when the lift is back in normal operation. I should hope we'll have all-new crops to show you by then...but we probably won't."},{"name":"CARRIER04364","text":"&lt;huff&gt; &lt;huff&gt; ...Do I have aught to be taken down below? More than I can carry, and then some!"},{"name":"CARRIER04364","text":"Most of our stock is sent off via the cargo lift, but some has been earmarked for aerial transport. Hence the stack of crates atop that hill over there. Gods, hauling the lot up that slope was a job and a half..."},{"name":"CARRIER04364","text":"Right, back to it, then! Once I'm done here, I think I'll take some fresh fruit to the Last Stand and have them whip me up a dessert..."},{"name":"HARVESTER04364","text":"What crops are we raising? Well, as you can see, this one is a variety of grape."},{"name":"HARVESTER04364","text":"Only needs a good source of sunlight to grow, and the conditions here are nothing short of perfect. Hardly surprising, given that it's native to a particular locale in the very place upon which Labyrinthos was modeled─a region in the south of Ilsabard."},{"name":"HARVESTER04364","text":"It boasts remarkable habitat diversity, allowing for myriad flora and fauna to thrive. Chilly peaks in the north give way to swaths of temperate plains, which in turn transition into a hot, humid coastline."},{"name":"HARVESTER04364","text":"Such bountiful territory is ever contested, as you might expect. Used to be called Corvos before the imperials renamed it Locus Amoenus."},{"name":"HARVESTER04364","text":"The Forum saw it not as a prize, however, but as a researcher's ideal environment─one whose climates we strove to recreate within the confines of Labyrinthos. It's since provided a rich foundation for countless experiments in cultivation."},{"name":"HARVESTER04364","text":"Once we've picked the fruit, we'll need to take cuttings. Rather a lot of them, in fact. Wonder if they're planning to grow a new vineyard somewhere..."},{"name":"YSHTOLA","text":"The stack of crates on the hill is going below? That sounds promising. I'll gather the others and join you there."},{"name":"SYSTEM","text":"The labels on these crates tell the story of their contents: bundles of common seeds and saplings, accompanied by sheaves of reports."},{"name":"ALPHINAUD","text":"It feels wrong to spy on Erenville, helpful as he's been...but what other choice do we have?"},{"name":"ALISAIE","text":"Let's get after him already! We've waited too long as it is!"},{"name":"KRILE","text":"Forgive me, my attention has been elsewhere... We were following Erenville, weren't we?"},{"name":"YSHTOLA","text":"Is Krile still feeling unwell? I've never seen her so distracted..."},{"name":"YSHTOLA","text":"Keep an eye on her, but keep moving, too─we cannot let our quarry slip away."}],"reward":{"gil":615},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69899]},"next":[69901]},"partials":[{"type":"npc","id":"1038719","obj":{"i":1038719,"n":"Alisaie","l":3708,"q":1}},{"type":"npc","id":"1038732","obj":{"i":1038732,"n":"Y'shtola","l":3708,"q":1}},{"type":"quest","id":"69899","obj":{"i":69899,"n":"Deeper into the Maze","g":11,"l":"Labyrinthos","s":517}},{"type":"quest","id":"69901","obj":{"i":69901,"n":"The Full Report, Warts and All","g":11,"l":"Labyrinthos","s":519}}]}