{"quest":{"name":"The Color of Joy","location":"Radz-at-Han","id":69915,"patch":6.0,"sort":533,"eventIcon":71201,"issuer":1040261,"target":1038588,"genre":11,"journal":["Alphinaud has a mind to join the others at the High Crucible."],"objectives":["Speak with Alisaie.","Speak with Alisaie again.","Speak with Alphinaud.","Speak with Alisaie.","Speak with Krile at the Baldesion Annex.","Speak with Ojika Tsunjika."],"dialogue":[{"name":"ALISAIE","text":"Like his sister Tiamat, Vrtra is possessed of a gentle soul. I'm glad they're on our side."},{"name":"ALPHINAUD","text":"The attendant was kind enough to give me directions to the High Crucible. First, let us return to the mulberry orchard."},{"name":"ALPHINAUD","text":"I understand the mulberries are for the silkworms. Grown a stone's throw away from the satrap's residence... It gives it the quintessential Thavnairian flair, don't you think?"},{"name":"ALISAIE","text":"From here, we're supposed to follow the path left and past the mulberries..."},{"name":"ALPHINAUD","text":"The word Yuj apparently means “bind” in the local tongue, and this district is so named because it connects all others in the city."},{"name":"ALPHINAUD","text":"If we manage to come this far, we shouldn't have trouble finding the High Crucible─or so I was told."},{"name":"ALISAIE","text":"Where the street turns, enter the door straight ahead then descend the steps..."},{"name":"ALISAIE","text":"I thought the Crystarium was confusing, but it doesn't compare to Radz–at–Han. The architecture and decorations make it even harder to get your bearings."},{"name":"ALISAIE","text":"Anyway, let's see where this door takes us."},{"name":"ALISAIE","text":"Whew, it seems we're on the right track."},{"name":"ALPHINAUD","text":"And here is the aetheryte plaza. So far so good, and there isn't much further to go."},{"name":"ALPHINAUD","text":"From here, we just need to cross to the other side of the hall, then pass through the larger of two doorways. The High Crucible lies beyond."},{"name":"ALPHINAUD","text":"I suspect the others have already collected the warding scales. Come, let us join them."},{"name":"THANCRED","text":"You took your time. Got turned around, I take it?"},{"name":"URIANGER","text":"Though this land hath been afforded a respite, in turmoil do many others languish still. Our work is far from finished."},{"name":"ALPHINAUD","text":"What an immense laboratory... How many such places were enlisted to help forge the warding scales, I wonder."},{"name":"YSHTOLA","text":"Excellent. You're in time to hear the latest good news."},{"name":"KRILE","text":"The Students have previously turned to Radz–at–Han's alchemists for help with the analysis of various artifacts."},{"name":"KRILE","text":"That is how I became acquainted with Nidhana. I'm glad we could rescue her, and pray she makes a full recovery..."},{"name":"GRAHATIA","text":"I'm quite well now, I assure you. As they say, the stronger the taste─and stranger the color─the more effective the remedy."},{"name":"GRAHATIA","text":"With my body trying to replenish the aether I spent, however, I'm feeling rather famished..."},{"name":"GRAHATIA","text":"I think a sampling of the local delicacies is in order. Hamsa cuisine would be a good place to start, perhaps?"},{"name":"ESTINIEN","text":"As I heard it, after you defeated Nidhogg, his scales found their way into the hands of the Firmament's artisans."},{"name":"ESTINIEN","text":"Steeped in power as they are, it's no surprise that they were coveted. Still, it is a strange legacy for the vengeful wyrm."},{"name":"ALISAIE","text":"We're last, of course, but at least we found the place."},{"name":"NIDHANA","text":"The last thing I remember before being absorbed into the tower was you rushing towards me..."},{"name":"NIDHANA","text":"I can only imagine the hardships you and yours must have had to overcome to rescue us."},{"name":"NIDHANA","text":"No amount of words will suffice to express my gratitude, but I hope the flower's radiant glow says everything I cannot."},{"name":"OJIKATSUNJIKA","text":"Ah, you are returned!"},{"name":"KRILE","text":"It's good to be back, and with the fruit of our labors safely in storage!"},{"name":"KRILE","text":"For now, we have but to wait for the others to return from their respective meetings with the Alliance leaders."},{"name":"KRILE","text":"As Thancred suggested, you should get some rest in the meantime!"},{"name":"KRILE","text":"Your chamber is comfortable, I hope? If it's cold in there, just let me know─we have plenty of blankets to spare."},{"name":"OJIKATSUNJIKA","text":"Welcome back, <span class=\"highlight\">Forename</span>! Krile has apprised me of your recent accomplishments. What an amazing feat to eliminate a tower, and pave the way to deal with the rest."},{"name":"OJIKATSUNJIKA","text":"While it isn't much, I've changed your sheets and plumped up your pillow. After all, there's nothing like collapsing in a nice clean bed after completing a major malmstone, be it penning a thesis or defeating deiform entities!"},{"name":"OJIKATSUNJIKA","text":"So, would you like to take a look at your new and improved lodgings now?"},{"name":"Q1","text":"Retire to your chamber?"}],"reward":{"gil":2972,"items":[{"num":2,"id":36036}]},"reqs":{"jobs":[{"lvl":81,"id":142}],"quests":[69914]},"next":[69916]},"partials":[{"type":"npc","id":"1040261","obj":{"i":1040261,"n":"Alphinaud","l":3707,"q":1}},{"type":"npc","id":"1038588","obj":{"i":1038588,"n":"Ojika Tsunjika","l":3706,"q":5}},{"type":"item","id":"36036","obj":{"i":36036,"n":"Archon Loaf","l":520,"c":24037,"t":46,"p":3829}},{"type":"quest","id":"69914","obj":{"i":69914,"n":"The Jewel of Thavnair","g":11,"l":"Thavnair","s":532}},{"type":"quest","id":"69916","obj":{"i":69916,"n":"Sound the Bell, School's In","g":11,"l":"Old Sharlayan","s":534}}]}