{"quest":{"name":"A Boy's Errand","location":"Thavnair","id":69910,"patch":6.0,"sort":528,"eventIcon":71201,"issuer":1038631,"target":1037649,"genre":11,"journal":["Little does Nidhana know that she is about to send you on another errand."],"objectives":["Speak with Varshahn.","Speak with Varshahn again.","Gather information at the tower outpost.","Speak with Varshahn.","Mount the hamsa.","Ride the hamsa to the Giantsgall Grounds.","Speak with Zeynuha."],"dialogue":[{"name":"NIDHANA","text":"If you will excuse me, I shall return to my work on the talisman."},{"name":"VARSHAHN","text":"Ah, you are both back. Excellent."},{"name":"VARSHAHN","text":"I have a message for you, Mistress Nidhana."},{"name":"VARSHAHN","text":"It would seem the stores of giantsgall are running low."},{"name":"NIDHANA","text":"What? But when last I looked, there was still plenty..."},{"name":"VARSHAHN","text":"I suspect that was before Urianger told everyone about their tempering cure, and Estinien shared his knowledge of dragons. Your peers have since been inspired to fashion a number of new talisman prototypes."},{"name":"NIDHANA","text":"I see... Well, if it leads to new possibilities, then far be it from me to complain, but we will need to replenish our stores..."},{"name":"VARSHAHN","text":"I should be happy to tend to this if you like."},{"name":"NIDHANA","text":"As much as I appreciate the offer, my dear boy, I can't in good conscience send you out there alone while kidnappers are at large."},{"name":"NIDHANA","text":"<span class=\"highlight\">Forename</span>─loath though I am to press another task on you so soon, might I ask you to fetch the giantsgall?"},{"name":"NIDHANA","text":"In case you're not familiar, giantsgall is a type of ore found on the island. Owing to its hardness and aetherial conductivity, it has applications in many disciplines─alchemy not least of all."},{"name":"NIDHANA","text":"The quarry where it is found, aptly named Giantsgall Grounds, isn't far away, so it shouldn't take much of your time. May we impose on you once more?"},{"name":"NIDHANA","text":"Thank you! Upon arriving at the grounds, please seek out a man named Zeynuha. He will furnish you with the ore."},{"name":"VARSHAHN","text":"At the very least, permit me to accompany you. It so happens I have an errand of my own that will take me to the outpost nearby."},{"name":"VARSHAHN","text":"May we borrow a pair of hamsa, Mistress Nidhana?"},{"name":"NIDHANA","text":"By all means. Do try to be patient with them─those that survived are still in training."},{"name":"VARSHAHN","text":"I will bring the hamsa to the entrance. Meet me there when you are ready."},{"name":"NIDHANA","text":"Despite his tender years, Varshahn is thoughtful and dependable. It's easy to see why he was chosen to be the satrap's attendant!"},{"name":"VARSHAHN","text":"Here are our hamsa, <span class=\"highlight\">Forename</span>. If the creatures look familiar, it is because they are close kin to your Eorzean dodos."},{"name":"VARSHAHN","text":"Hamsa have long been kept as livestock in Thavnair, and many a hatchery may be found here. Alas, the largest of these was recently razed by monsters from the tower."},{"name":"VARSHAHN","text":"On account of said hatchery being situated near the tower, the Radiant Host repurposed its remnants as an outpost."},{"name":"VARSHAHN","text":"That is where my errand takes me, and your own destination is but a stone's throw away."},{"name":"VARSHAHN","text":"If you have no objections, let us first make for the outpost. We set forth at your word."},{"name":"VARSHAHN","text":"You are ready? Then let us depart. You need only ride and relax─my bird and I will take the lead for yours to follow."},{"name":"Q1","text":"Mount the hamsa and travel to the outpost?"},{"name":"VARSHAHN","text":"Let us be off. If you haven't ridden dodos before, be warned that they have a wobbling gait."},{"name":"VARSHAHN","text":"That spectacular formation stretching out over the water is called Khadga─a word which means “sword.”"},{"name":"VARSHAHN","text":"This sword, legend holds, was wielded by the Manusya against the Mrga before it was cast down at conflict's end."},{"name":"VARSHAHN","text":"To the left and requiring no introduction is the tower. As you can see, it straddles a small isle."},{"name":"VARSHAHN","text":"Almost there. Though the main part of the hatchery is atop the cliff, the outpost itself is on the beach."},{"name":"VARSHAHN","text":"And here we are. Manned by the Radiant Host, this outpost is our first line of defense against the tower."},{"name":"NAHBDEEN","text":"Well, well, who should it be but young Varshahn. On an errand for the satrap?"},{"name":"VARSHAHN","text":"I am. His Excellency bade me come to collect your report."},{"name":"VARSHAHN","text":"He also wished to express his heartfelt gratitude to the brave men and women of the Radiant Host for their unflagging dedication."},{"name":"NAHBDEEN","text":"We simply do our duty, but we are honored to receive His Excellency's regard."},{"name":"NAHBDEEN","text":"And yet, for his boundless benevolence, his treatment of one so young could be regarded as...callous."},{"name":"NAHBDEEN","text":"Though we have enjoyed relative peace and calm these past few days, this remains the front line of battle. No place for children."},{"name":"NAHBDEEN","text":"Your predecessor too often traveled alone. It's been, what, two years now since you took over? I wonder how the fellow is faring..."},{"name":"VARSHAHN","text":"Like those before him, he went on to represent the satrap in foreign lands. Wherever he may now be, I am certain he is well."},{"name":"VARSHAHN","text":"As for myself, I assure you that all I do, I do of my own volition, and gladly. I pray you do not think ill of His Excellency."},{"name":"NAHBDEEN","text":"Certainly not, lad... Whatever happens, my faith in the satrap is unwavering. But still I worry for you."},{"name":"NAHBDEEN","text":"We would be overcome with sadness if something were to befall you, for you are as a little brother to us all. Take care, do you hear?"},{"name":"VARSHAHN","text":"I will, Nahbdeen. Thank you."},{"name":"NAHBDEEN","text":"And who might this be? Not Hannish by the look of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"VARSHAHN","text":"Permit me to introduce <span class=\"highlight\">Forename Surname</span>, of the Eorzean contingent, come to assist in the making of the talisman."},{"name":"NAHBDEEN","text":"From Eorzea, you say! Towers have appeared over there too, yes? Tell me, what is the situation like?"},{"name":"VARSHAHN","text":"May I suggest that you exchange information with our soldiers? Both parties would stand to learn something of value, I believe."},{"name":"NAHBDEEN","text":"An excellent idea. Given the unprecedented nature of the threat, some of ours are understandably anxious. We would be glad for any tidings you can share."},{"name":"NAHBDEEN","text":"You two, bring Varshahn the latest report, and answer any questions he may have."},{"name":"VARSHAHN","text":"All appears quiet with the tower at the moment. I daresay the soldiers won't mind if you approached them."},{"name":"BREEDINGSTAFF04374","text":"The last monster that came out of the tower laid waste to the hatchery, slaughtering many good hamsa. The poor creatures didn't deserve it..."},{"name":"SYSTEM","text":"This is the fellow that carried you hither. Its breathing is somewhat ragged, perhaps due to its inexperience as a mount."},{"name":"NAHBDEEN","text":"It occurs to me I have yet to properly introduce our company."},{"name":"NAHBDEEN","text":"We are the Radiant Host, a military order under the satrap's command. Our duty is to preserve peace in the land, be it patrolling the streets or dealing with heretofore unknown threats such as now."},{"name":"NAHBDEEN","text":"We train hard, and admit only capable warriors to our ranks. Even so, we've struggled to contend with the fiends from the tower."},{"name":"NAHBDEEN","text":"Though we succeeded in striking them down on the two occasions they came in force, we had to pay a heavy price."},{"name":"NAHBDEEN","text":"What of the towers in Eorzea? Do they likewise spawn monsters?"},{"name":"NAHBDEEN","text":"So it's much the same everywhere... With every nation struggling, we cannot expect calls for outside aid to be answered."},{"name":"NAHBDEEN","text":"My thanks not only for the information, but for accompanying Varshahn besides. While he's wise beyond his years, he's still a child, and we couldn't bear to see him come to harm."},{"name":"KHUTEEYU","text":"You wish to know about the tower? To be honest, we know little and less about it ourselves."},{"name":"KHUTEEYU","text":"This “Tower of Zot,” as folk have taken to calling it, suddenly appeared where it did on the isle of Narunnair."},{"name":"KHUTEEYU","text":"We're safe from its influence at this distance, but go too far into the water, and you'll expose yourself to its corrupting aether."},{"name":"KHUTEEYU","text":"You're a foreigner, aren't you? How are they dealing with the tower in your homeland?"},{"name":"KHUTEEYU","text":"Our struggles are not unique... Then our hopes still lie with the talismans. We must keep the monsters contained until they're ready."},{"name":"KHUTEEYU","text":"When the tower first appeared, we sent scouts on a boat to investigate. But it quickly became apparent that something was amiss."},{"name":"KHUTEEYU","text":"One after another our comrades were corrupted. We could only look on in horror as they slew each other..."},{"name":"IMHUDI","text":"Ah, I've heard about you. The visitor from Eorzea. Is there anything you can tell us about the Telophoroi?"},{"name":"IMHUDI","text":"We know that they're the ones behind the tower, and that they've declared war on the whole world."},{"name":"IMHUDI","text":"But why are they doing this? What is it that they want? This, we don't understand."},{"name":"IMHUDI","text":"...What? They want to die...and take everyone with them!? What madness is this!?"},{"name":"IMHUDI","text":"Well, you can bet that we won't let those bastards have their way! We'll fight them with everything we have, like our Eorzean and Far Eastern brothers!"},{"name":"IMHUDI","text":"Grrr, those demented fools... If they want to go to hell, they can bloody well arrange their own passage, and leave the rest of us out of it!"},{"name":"VARSHAHN","text":"Finished speaking with the soldiers, have you? I hope it was as enlightening for you as it was for them."},{"name":"VARSHAHN","text":"As a neutral nation and trading hub both, Radz–at–Han ordinarily receives a steady stream of news from abroad. Alas, this stream dried up when trading vessels stopped coming."},{"name":"VARSHAHN","text":"Amidst the dearth of information, everyone will have been grateful for your account."},{"name":"VARSHAHN","text":"...But come, you had best see to your original errand. As mine will keep me here awhile longer, however, I'm afraid I cannot guide you the rest of the way."},{"name":"VARSHAHN","text":"Worry not, the path is straightforward─you need but follow the road east. Upon the hamsa, you will arrive before you know it."},{"name":"VARSHAHN","text":"Brief though it was, I enjoyed our time together. Till we meet again."},{"name":"VARSHAHN","text":"Lest you have forgotten, to get to the Giantsgall Grounds, you need but follow the road east. The hamsa should deliver you there quite quickly."},{"name":"SYSTEM","text":"Though the hamsa appears to want to return home, it reluctantly offers you its back."},{"name":"SYSTEM","text":"Should you become separated from your steed, speak with the Radiant beastkeeper at the Hamsa Hatchery to mount it again."},{"name":"Q2","text":"Mount the hamsa?"},{"name":"BREEDINGSTAFF04374","text":"If you're looking for your hamsa, it returned here by itself a while ago. You still have need of it?"},{"name":"SYSTEM","text":"No sooner do you arrive at your destination than the hamsa dashes off..."},{"name":"SYSTEM","text":"Speak with the Radiant beastkeeper at the Hamsa Hatchery to mount the hamsa, then ride it to the Giantsgall Grounds."},{"name":"ZEYNUHA","text":"Aye, this is indeed the Giantsgall Grounds, and I am Zeynuha. Is there something you require?"},{"name":"ZEYNUHA","text":"Giantsgall for the alchemists, you say? But of course they shall have it!"},{"name":"ZEYNUHA","text":"They labor tirelessly to deal with the tower, and 'tis the least we can do to provide them with the materials they need."}],"reward":{"gil":1135},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69909]},"next":[69742,69743,69744,69745,69911]},"partials":[{"type":"npc","id":"1038631","obj":{"i":1038631,"n":"Nidhana","l":3709,"q":2}},{"type":"npc","id":"1037649","obj":{"i":1037649,"n":"Zeynuha","l":3709,"q":2}},{"type":"quest","id":"69909","obj":{"i":69909,"n":"Shadowed Footsteps","g":11,"l":"Thavnair","s":527}},{"type":"quest","id":"69742","obj":{"i":69742,"n":"Hamsa Retrieval","g":120,"l":"Thavnair","s":1301}},{"type":"quest","id":"69743","obj":{"i":69743,"n":"High Hopes for the Hatchery","g":120,"l":"Thavnair","s":1310}},{"type":"quest","id":"69744","obj":{"i":69744,"n":"Cutting Edge Solutions","g":120,"l":"Thavnair","s":1320}},{"type":"quest","id":"69745","obj":{"i":69745,"n":"Rushing up That Hill","g":120,"l":"Thavnair","s":1330}},{"type":"quest","id":"69911","obj":{"i":69911,"n":"Tipping the Scale","g":11,"l":"Thavnair","s":529}}]}