{"quest":{"name":"The Jewel of Thavnair","location":"Thavnair","id":69914,"patch":6.0,"sort":532,"eventIcon":71201,"issuer":1040252,"target":1040260,"genre":11,"journal":["Thancred is rested and ready to set out."],"objectives":["Speak with the Radiant guardsman.","Speak with Estinien and have him accompany you.","Speak with the attentive Radiant while accompanied by Estinien.","Speak with the watchful Radiant while accompanied by Estinien.","Speak with the vigilant Radiant while accompanied by Estinien.","Speak with the Meghaduta attendant while accompanied by Estinien.","Speak with Alisaie."],"dialogue":[{"name":"ESTINIEN","text":"Whew... Carrying all those Matanga may have been the true struggle..."},{"name":"THANCRED","text":"Had enough rest, have you? You never were one for being idle. Right─Varshahn bade us come to Meghaduta at our earliest convenience."},{"name":"THANCRED","text":"The others will join us there once they have finished tending to the prisoners."},{"name":"THANCRED","text":"Ah, wait. On second thought, you and Estinien should go on ahead. I need to make a quick detour by the Great Work."},{"name":"THANCRED","text":"We left G'raha in the alchemists' care, you see. Best to fetch him before he's crammed into a specimen jar."},{"name":"ESTINIEN","text":"Just you and me, then. The guardsman at the gate should wave us through."},{"name":"THANCRED","text":"When we delivered G'raha to the alchemists, they were not a little excited."},{"name":"THANCRED","text":"Perhaps it was Nidhana's rescue that brought them joy, but given their fascination with Estinien, I'm not quite sure..."},{"name":"ESTINIEN","text":"With the tower gone, I expect that the state of alert will be lifted."},{"name":"RADIANTHOSTGATEKEEPER","text":"Ah, honored Scions! You are free to enter at your leisure!"},{"name":"RADIANTHOSTGATEKEEPER","text":"As I cannot leave my post, I'm afraid you must make your own way."},{"name":"RADIANTHOSTGATEKEEPER","text":"Should you require directions in the city, the sentry stationed at the fountain atop the steps should be glad to assist you."},{"name":"ESTINIEN","text":"Though I have been to Radz–at–Han before, this place is a veritable maze."},{"name":"ESTINIEN","text":"Rather than risk getting lost, we had best ask for directions from this sentry at the fountain."},{"name":"ESTINIEN","text":"Lead the way...and don't expect me to act as your tour guide like certain others."},{"name":"SYSTEM","text":"Estinien is now accompanying you. Keep him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Estinien behind by entering a different area, or by speaking with him and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Estinien accompany you again, return and speak with him at the original location."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Talk."},{"name":"A1","text":"Part ways."},{"name":"A1","text":"Nothing."},{"name":"ESTINIEN","text":"First, we should seek out the sentry in front of the fountain."},{"name":"ESTINIEN","text":"...Name of the fountain? No idea. Do fountains normally have names?"},{"name":"Q2","text":"Are you sure you wish to part ways with Estinien?"},{"name":"ESTINIEN","text":"Lost your way, I take it. Hardly surprising in this maze of a city. Best return to where we started."},{"name":"ESTINIEN","text":"Found your bearings, have you? Then let's get going to Meghaduta."},{"name":"SYSTEM","text":"Estinien has yet to arrive. Be sure he is at your side before attempting to continue."},{"name":"ALZADAALSPATHGUARD04378","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, I presume. I understand you are here for an audience with the satrap. If you require directions to Meghaduta, I should be glad to provide them."},{"name":"SYSTEM","text":"You should have Estinien accompanying you before receiving directions."},{"name":"ALZADAALSPATHGUARD04378","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, I presume. I understand you are here for an audience with the satrap. If you require directions to Meghaduta, I should be glad to provide them."},{"name":"ALZADAALSPATHGUARD04378","text":"The satrap's residence is situated in Dharma, the highest part of Radz–at–Han."},{"name":"ALZADAALSPATHGUARD04378","text":"To get there, I would ordinarily recommend a route that takes you by the bazaars in the city's north. Due to the state of alert, however, most businesses are currently closed, and the aetheryte disabled."},{"name":"ALZADAALSPATHGUARD04378","text":"As such, I will provide you with an alternate path. First, please ascend the steps next to this fountain, then continue left."},{"name":"ALZADAALSPATHGUARD04378","text":"There will be more steps, and upon ascending them, you will emerge on Paksa's Path."},{"name":"ALZADAALSPATHGUARD04378","text":"Proceed through the large door on the right, and you will arrive at Ruveydah Fibers. Within you will find another sentry who will give you further guidance."},{"name":"ESTINIEN","text":"In other words, we head up. Sounds straightforward enough."},{"name":"ALZADAALSPATHGUARD04378","text":"You wish to hear the directions again? But of course. To get to Meghaduta, first ascend the steps next to this fountain, then continue left."},{"name":"ALZADAALSPATHGUARD04378","text":"There will be more steps, and upon ascending them, you will emerge on Paksa's Path."},{"name":"ALZADAALSPATHGUARD04378","text":"Proceed through the large door on the right, and you will arrive at Ruveydah Fibers. Within you will find another sentry who will give you further guidance."},{"name":"A3","text":"<span class=\"highlight\">Discuss the sumptuous portal.</span>"},{"name":"ESTINIEN","text":"You heard the sentry. We head up."},{"name":"ESTINIEN","text":"Ah yes, I know about this portal. It leads to a nearby isle. The treasure vault of one of Radz–at–Han's wealthiest families."},{"name":"ESTINIEN","text":"They took the god of luck for their guardian, on account of which they occasionally open up a section of their vaults. For aspiring treasure hunters to try their own “luck”, or so they say."},{"name":"ESTINIEN","text":"There are also coffers hidden across the land that act as portals. Find one, and you gain access to the vault."},{"name":"ESTINIEN","text":"Something to bear in mind in case you exhaust your funds while on the road. 'Tis a troublesome experience, as I can personally attest."},{"name":"RUVEYDAHFIBRESGUARD04378","text":"Heading to Meghaduta, are you? In that case..."},{"name":"RUVEYDAHFIBRESGUARD04378","text":"Heading to Meghaduta, are you? In that case, please follow this hallway to my right and go through the door at the top of the stairs."},{"name":"RUVEYDAHFIBRESGUARD04378","text":"You'll emerge at the entrance to the airship landing, where another sentry should be on hand to assist you."},{"name":"RUVEYDAHFIBRESGUARD04378","text":"Incidentally, if you ascend the steps to either side of me, you'll find the workshops of Ruveydah Fibers. Though you're free to observe the artisans, take care not to lose your way."},{"name":"RUVEYDAHFIBRESGUARD04378","text":"If you are heading to Meghaduta, please follow this hallway to my right and go through the door at the top of the stairs."},{"name":"RUVEYDAHFIBRESGUARD04378","text":"You'll emerge at the entrance to the airship landing, where another sentry should be on hand to assist you."},{"name":"A4","text":"<span class=\"highlight\">Discuss the vibrant textiles.</span>"},{"name":"ESTINIEN","text":"Quite an ordeal to get to the satrap's residence... It could stand to be a more obvious route, like the one to the Vault or Kugane Castle."},{"name":"ESTINIEN","text":"Ah, Thavnairian weave. Hard to imagine more vibrant stuff. I daresay Aymeric would be partial to the gold thread. And the blue, of course. He loves his blue."},{"name":"ESTINIEN","text":"I've never put much thought into what I wear. A spare set of clothing is usually all I carry, and if that isn't enough, I can always obtain something locally."},{"name":"LANDINGGUARD04378","text":"If you are here for an airship, I'm afraid all flights have been suspended until further notice."},{"name":"LANDINGGUARD04378","text":"If you are here for an airship, I'm afraid all flights have been suspended until further notice."},{"name":"ESTINIEN","text":"So the state of alert is still in effect. Perhaps it's for the best."},{"name":"ESTINIEN","text":"That aside, we're not here for an airship─we have business at Meghaduta."},{"name":"LANDINGGUARD04378","text":"Oh, in that case, permit me to direct you!"},{"name":"LANDINGGUARD04378","text":"From here it's quite simple, really. Ascend these steps, and then continue straight ahead and across the bridge. You cannot miss it."},{"name":"LANDINGGUARD04378","text":"To get to Meghaduta, simply ascend these steps, and then continue straight ahead and across the bridge. You cannot miss it."},{"name":"A5","text":"<span class=\"highlight\">Discuss Dharma.</span>"},{"name":"ESTINIEN","text":"Confusing as it is, you'd think they intended to make a maze out of Radz–at–Han."},{"name":"ESTINIEN","text":"Kugane was flat, at least. If you became lost, you could head to higher ground to get the lay of the land."},{"name":"ESTINIEN","text":"Ah, I remember passing by here with Varshahn. The situation being as it was, he regretted not being able to show us the sights."},{"name":"ESTINIEN","text":"Life has yet to return to normal here, but when it does, you ought to pay another visit."},{"name":"ESTINIEN","text":"Though the city is confusing, the food is quite good. I'm partial to hamsa myself─the meat's surprisingly tender and flavorful."},{"name":"HAMSA04378","text":"(-Irritated Hamsa-)Squaaawk! Squaaawk!"},{"name":"MEGHADUTAEMPLOYEE","text":"Greetings and welcome to Meghaduta. May I inquire after your business?"},{"name":"MEGHADUTAEMPLOYEE","text":"Greetings and welcome to Meghaduta. May I inquire after your business?"},{"name":"ESTINIEN","text":"We are members of the Scions of the Seventh Dawn, come at the invitation of His Excellency."},{"name":"MEGHADUTAEMPLOYEE","text":"Ah, of course. We have been expecting you."},{"name":"MEGHADUTAEMPLOYEE","text":"I will show you into the audience chamber, if you would please follow me."},{"name":"ALPHINAUD","text":"Our apologies again. I hope we didn't force you to conclude your conversation prematurely."},{"name":"ALISAIE","text":"So, what were you and Vrtra talking about?"},{"name":"ALISAIE","text":"...Nothing? Very well, if you say so."},{"name":"ALISAIE","text":"The others have gone ahead to the High Crucible. Let's catch up to them."}],"reward":{"gil":1184},"reqs":{"jobs":[{"lvl":81,"id":142}],"quests":[69913]},"next":[69915]},"partials":[{"type":"npc","id":"1040252","obj":{"i":1040252,"n":"Thancred","l":3709,"q":2}},{"type":"npc","id":"1040260","obj":{"i":1040260,"n":"Alisaie","l":3707,"q":1}},{"type":"quest","id":"69913","obj":{"i":69913,"n":"In the Dark of the Tower","g":11,"l":"Old Sharlayan","s":531}},{"type":"quest","id":"69915","obj":{"i":69915,"n":"The Color of Joy","g":11,"l":"Radz-at-Han","s":533}}]}