{"quest":{"name":"The Satrap of Radz-at-Han","location":"Thavnair","id":69912,"patch":6.0,"sort":530,"icon":101104,"eventIcon":71201,"issuer":1038653,"target":1038589,"genre":11,"journal":["Thancred is wearing a grim expression.","With a heavy heart, you inform the alchemists of Nidhana's imprisonment within the Tower of Zot. Though saddened, they are resolved to produce as many warding scales as they can, that all those held captive might be saved. Varshahn then arrives bearing messages from the satrap, who invites the Scions to meet with him in Radz–at–Han. You duly accept, and make your way to the gates situated east of the Giantsgall Grounds, on the Perfumed Rise.","Varshahn guides you through the city to Meghaduta, the satrap's residence, where you come face-to-face with the man himself, Ahewann. Not to be fooled, however, Estinien demands an end to the charade, and so does the true ruler of Radz–at–Han reveal himself: the great wyrm Vrtra, youngest of the first brood. The people of Ahewann's line have long posed as the satrap, while Varshahn, like other attendants before him, is a simulacrum created to serve as a vessel for the wyrm's will. The true history of Thavnair thus brought to light, Vrtra puts forth a proposal: if the Scions will agree to lead an assault on the Tower of Zot, he will provide them with more warding scales to shield them from its corruption. Though the offer is undeniably attractive, help will likely be required if you are to succeed in the mission, and it is decided that you will return to Sharlayan to confer with the rest of your order.","Though the meeting took an unexpected turn, you now have a clear objective ahead of you. Having given everyone a friendly reminder to attune to the local aetheryte, Thancred sets off back to Sharlayan, and you and the others follow.","After your eventful sojourn in Thavnair, you find yourself back in Sharlayan for a brief respite, and look to discussing the Tower of Zot with your comrades when the time is right."],"objectives":["Speak with Varshahn.","Speak with Thancred.","Speak with Thancred in the main hall."],"dialogue":[{"name":"URIANGER","text":"Thy demeanor bespeaketh consternation, <span class=\"highlight\">Forename</span>..."},{"name":"ESTINIEN","text":"Hm... Bad tidings, I take it."},{"name":"THANCRED","text":"First, we must inform everyone of the situation, Nidhana's colleagues included."},{"name":"THANCRED","text":"I'll call them together for a gathering...but I think it would be best if you were the one to explain."},{"name":"ALCHEMISTOFTHEGREATWORKC","text":"Oh, Nidhana... &lt;sob&gt;"},{"name":"ALCHEMISTOFTHEGREATWORKA","text":"Can...can you answer me this..."},{"name":"ALCHEMISTOFTHEGREATWORKA","text":"Though Nidhana is trapped in the tower, she's still alive, yes?"},{"name":"ALCHEMISTOFTHEGREATWORKA","text":"Then..."},{"name":"ALCHEMISTOFTHEGREATWORKB","text":"Then we must make warding scales. As many as we can."},{"name":"ALCHEMISTOFTHEGREATWORKB","text":"The prototype works perfectly. This, Nidhana proved at peril to herself."},{"name":"ALCHEMISTOFTHEGREATWORKB","text":"So let us make more scales, that she and all those who were taken might be saved!"},{"name":"ALCHEMISTOFTHEGREATWORKA","text":"Aye! As alchemists, this is how we will help win the fight!"},{"name":"VARSHAHN","text":"My friends, the satrap has been made aware of the tragedy."},{"name":"VARSHAHN","text":"He offers his heartfelt condolences, and reiterates his pledge to provide you with all that you require. To that end, he bade me give you this linkpearl, that he might personally discuss the production of the warding scales with you."},{"name":"VARSHAHN","text":"And for our Eorzean visitors, I bear an invitation."},{"name":"VARSHAHN","text":"In her report, Mistress Nidhana noted your vital contributions to the talisman's creation."},{"name":"VARSHAHN","text":"This fact came to the satrap's attention, and in recognition of your deeds, he wishes to meet you."},{"name":"VARSHAHN","text":"In addition to thanking you in person, he would also discuss further avenues of collaboration."},{"name":"VARSHAHN","text":"And so, if it is agreeable, will you not accompany me to Radz–at–Han for an audience with His Excellency?"},{"name":"THANCRED","text":"We should be honored, of course. Closer cooperation between our lands can only be to the benefit of all."},{"name":"VARSHAHN","text":"Then it is settled. Please come to the gates east of the Giantsgall Grounds, and I will show you into the city."},{"name":"THANCRED","text":"Of the satrap, I only know the common tidbits. That though the position is hereditary, he is not considered a sovereign. And that, despite possessing considerable authority, he wields it sparingly."},{"name":"THANCRED","text":"Given the esteem in which the locals hold him, however, it's safe to assume he's good at his job. We could do far worse for an ally."},{"name":"URIANGER","text":"Be it here or in Eorzea, all share in the desire to deliver the captives. Thus united, I pray that we may join in common cause with the satrap."},{"name":"ESTINIEN","text":"When last I visited, the city was brimming with life. I expect the tower has dampened the mood somewhat."},{"name":"VARSHAHN","text":"All present? Then let us proceed."},{"name":"VARSHAHN","text":"Owing to the threat of the tower, the city is currently in a state of high alert, and strict restrictions are in place for entry."},{"name":"VARSHAHN","text":"Though you have been granted special permission, I ask that you remain close to me at all times."},{"name":"URIANGER","text":"That we should encounter one of the first brood in such a circumstance..."},{"name":"ESTINIEN","text":"If our course of action is decided, let's not tarry."},{"name":"THANCRED","text":"That meeting took a rather unexpected turn, but we now have a clear objective ahead of us."},{"name":"THANCRED","text":"Let us rejoin our comrades in Sharlayan, and muster a suitable crew for our foray into the Tower of Zot."},{"name":"THANCRED","text":"Oh, and if you haven't already done so, be sure to attune to the aetheryte here before departing. Unless of course you <span class=\"emphasis\">enjoy</span> violent nausea..."},{"name":"THANCRED","text":"Just as I was getting used to balmy Thavnair, we're back in chilly Sharlayan... Take care not to catch your death, eh? We need you for the battles to come."},{"name":"THANCRED","text":"Now then, everyone appears to be here, so let us take stock of all the developments and discoveries."},{"name":"THANCRED","text":"Now then, your investigation here remains, but when that's over, we can take stock of all of the developments and discoveries."}],"reward":{"gil":2608},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69911]},"next":[69913]},"partials":[{"type":"npc","id":"1038653","obj":{"i":1038653,"n":"Thancred","l":3709,"q":2}},{"type":"npc","id":"1038589","obj":{"i":1038589,"n":"Thancred","l":3817,"q":1}},{"type":"quest","id":"69911","obj":{"i":69911,"n":"Tipping the Scale","g":11,"l":"Thavnair","s":529}},{"type":"quest","id":"69913","obj":{"i":69913,"n":"In the Dark of the Tower","g":11,"l":"Old Sharlayan","s":531}}]}