{"quest":{"name":"A Capital Idea","location":"Old Sharlayan","id":69917,"patch":6.0,"sort":535,"eventIcon":71201,"issuer":1038781,"target":1038796,"genre":11,"journal":["Krile is still digesting a rather hefty portion of food for thought."],"objectives":["Speak with G'raha Tia in the main hall of the Baldesion Annex.","Enter the command room in Limsa Lominsa.","Speak with Raubahn in the Ala Mhigan Quarter."],"dialogue":[{"name":"ALPHINAUD","text":"While Scholarch Montichaigne is best known for his role as head of the Studium, he is said to be one of the finest mages Sharlayan has ever produced."},{"name":"ALPHINAUD","text":"Having seen for myself the ease with which he weaves extraordinarily complex and powerful magicks, I have no reason to doubt the claim."},{"name":"ALISAIE","text":"Some of my earliest memories are of Scholarch Montichaigne, actually. He was a close friend of our grandfather."},{"name":"ALISAIE","text":"He would come for tea and amaze us with his tricks, much like his demonstration with the paper and ink. He's a huge part of why I wanted to enter the Studium in the first place."},{"name":"KRILE","text":"Well, that's given me much to mull over. I feel as though we're one step closer to understanding the Forum's true motives...and the mysteries of life itself, for good measure."},{"name":"KRILE","text":"It's funny─ I came here with the intent of expressing my gratitude, only to leave more indebted than before. I've a feeling his friendship and support will be a great boon to us in days to come."},{"name":"KRILE","text":"And on that note, let's head back to the annex. Perhaps on the way, you could better acquaint yourself with Qih Aliapoh as the scholarch suggested, while I share our findings with Raha."},{"name":"ALPHINAUD","text":"Estinien returned not long after we'd departed for the Studium. A shame that he missed the chance to attend our lecture with the scholarch... Or perhaps not."},{"name":"ALISAIE","text":"You'd better not let your guard down around Qih. One small favor becomes another, then another, and before you know it, you'll be running to the other side of the world in search of a bottle of wine or some other rubbish."},{"name":"ALISAIE","text":"Then again, it might make for a welcome change of pace from your usual heroics, and as the scholarch said, it could also lead to interesting discoveries."},{"name":"KRILE","text":"It seems I've done an adequate job of relaying Scholarch Montichaigne's lecture to Raha. Given his experiences in the field of souls and memories, he had no trouble understanding it."},{"name":"ESTINIEN","text":"Having spent most of the time in Thavnair, I've yet to fully grasp the lie of the land here in Sharlayan. Even finding my way to the annex proved a challenge."},{"name":"GRAHATIA","text":"Ah, welcome back. From what I hear, your trip to the Studium proved most educational."},{"name":"GRAHATIA","text":"While you were away, I received word from our fellow Scions."},{"name":"GRAHATIA","text":"As expected, news of the warding scales was met with much joy. Preparations are now underway to bring the leadership of the Grand Company of Eorzea and the Eastern alliance together to determine a way forward."},{"name":"GRAHATIA","text":"Our friends have asked that we bring the scales in our possession to Limsa Lominsa."},{"name":"ALISAIE","text":"So the time has come for us to go on the offensive?"},{"name":"GRAHATIA","text":"It's too early to say for certain, but that does seem to be the way the winds are blowing."},{"name":"GRAHATIA","text":"I, for one, can think of no reason to oppose such a plan, but let us see what awaits us in Vylbrand."},{"name":"KRILE","text":"Let's start by getting the scales out of storage. Give me a hand would you, Estinien?"},{"name":"KRILE","text":"Phew... I didn't realize these crates were so heavy."},{"name":"KRILE","text":"I shouldn't complain, though. Vrtra and the alchemists of the Great Work put their heart and soul into each and every one of these scales, so you must treat them with the utmost care."},{"name":"ALISAIE","text":"Are you not coming with us?"},{"name":"KRILE","text":"As much as I would like to escape the Forum's watchful gaze, I've little choice but to stay behind."},{"name":"KRILE","text":"We're already on thin ice, and if I─in my capacity as our official representative─were found to be consorting with foreign powers... Well, you can imagine how <span class=\"emphasis\">that</span> would go."},{"name":"KRILE","text":"I shall remain here, and do my utmost to avoid ruffling any more feathers as I await word from Master Matoya and our other allies."},{"name":"ALPHINAUD","text":"With luck, we'll soon have good news of our own to share."},{"name":"ALPHINAUD","text":"The tide is about to turn─ I can feel it. To Limsa Lominsa!"},{"name":"KRILE","text":"If you learn aught of interest, be sure to let me know! In the meantime, I will do what I can to aid our cause, though I fear that will be precious little given the circumstances."},{"name":"ZANTHAEL","text":"Ah, I was told to expect you. As you may or may not be aware, the Admiral is at present entertaining the Elder Seedseer and the sultana."},{"name":"ZANTHAEL","text":"Three of the most powerful women in the world in one room... Do you need a moment to prepare, or shall I show you to them?"},{"name":"Q1","text":"Proceed to the command room?"},{"name":"MERLWYB","text":"My apologies for calling you away from Sharlayan at such short notice."},{"name":"ALPHINAUD","text":"On the contrary, we are honored and grateful. And pleasantly surprised to be joined by such esteemed company."},{"name":"KANESENNA","text":"'Twas only right that this discussion be conducted in person."},{"name":"KANESENNA","text":"We are locked in a war of attrition. Our forces struggle to contain the threat posed by the towers, and it is only a matter of time before we are overwhelmed."},{"name":"KANESENNA","text":"Victory will only be claimed through decisive action, and we have taken the initiative to set the wheels in motion."},{"name":"ALPHINAUD","text":"It is reassuring to learn we are all in accord..."},{"name":"ALPHINAUD","text":"...But might I ask what your plan entails?"},{"name":"NANAMOULNAMO","text":"It hinges entirely on the warding scales and our ability to utilize their potential to the fullest."},{"name":"MERLWYB","text":"During your time in Sharlayan, the allied nations have been engaged on separate fronts, with no end in sight."},{"name":"MERLWYB","text":"To make matters worse, a surge in abductions of kobolds, Sahagin, Ixal, and Ananta have given rise to an increasing number of primals as well."},{"name":"MERLWYB","text":"But your triumph in Radz-at-Han has given us cause to hope once more."},{"name":"NANAMOULNAMO","text":"The time has come to free ourselves of this menace."},{"name":"NANAMOULNAMO","text":"And it is you, the Scions of the Seventh Dawn, who have shown us the way!"},{"name":"KANESENNA","text":"While the bulk of our forces will continue to hold the Telophoroi at bay, we will dispatch our finest to strike at the enemy's heart: Garlemald."},{"name":"KANESENNA","text":"These brave few will be the Ilsabard contingent."},{"name":"ALPHINAUD","text":"To think such progress has been made in so short a span!"},{"name":"MERLWYB","text":"Its objectives are twofold."},{"name":"MERLWYB","text":"The first is to provide aid to the people of Garlemald."},{"name":"NANAMOULNAMO","text":"As previously reported, countless imperial soldiers and civilians have been tempered. Robbed of their free will, they serve the Telophoroi's every whim without question."},{"name":"NANAMOULNAMO","text":"They too are victims. It is our duty to deliver them from their suffering, not for strategic or political gain, but because it is the right thing to do."},{"name":"NANAMOULNAMO","text":"I do not ask that we set aside the decades of conflict and conquest─that we simply choose to forgive and forget."},{"name":"NANAMOULNAMO","text":"I ask only that in choosing to remember we do not also forsake our compassion and morality, for without that, there can be no reconciliation. Only death without end."},{"name":"MERLWYB","text":"Aye, on that we can all agree. Our second objective is the colossal tower that Thancred and Urianger observed in the capital."},{"name":"MERLWYB","text":"Though its purpose remains unclear, there's reason to believe the smaller spires are merely a precursor of what's yet to come."},{"name":"MERLWYB","text":"Until the Tower of Zot was toppled, we'd failed to make any headway─though the same could be said of the Telophoroi. They're certainly in no rush to press further into our lands."},{"name":"MERLWYB","text":"I'd wager the spires' primary purpose is to divide and keep us occupied...while they work towards our annihilation."},{"name":"KANESENNA","text":"This would appear to be substantiated by Y'shtola's analysis of the towers' influence on aetherial currents."},{"name":"KANESENNA","text":"Based on her observations inside the Tower of Zot, the spires siphon aether from the land, consuming it to maintain their form. However, they draw forth far more than is required for this task alone."},{"name":"KANESENNA","text":"The excess of aether remains unaccounted for, but we can be sure it is not being harnessed for our benefit."},{"name":"MERLWYB","text":"It wouldn't surprise me in the least if it was being redirected to the larger spire in the capital. There's a logic in that. Regardless, once we have uncovered the truth..."},{"name":"MERLWYB","text":"...We'll bring their schemes crashing down, along with their infernal towers."},{"name":"ESTINIEN","text":"That's all well and good."},{"name":"ESTINIEN","text":"But what would you have us do? I assume it's more than handing over the scales and being on our way."},{"name":"MERLWYB","text":"We want you and your scales to join the Ilsabard contingent."},{"name":"MERLWYB","text":"Consider it an official request, from both the Grand Company of Eorzea and the Eastern alliance. Do you accept?"},{"name":"ALISAIE","text":"Perhaps you should be the one to answer that..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"For honor and glory!"},{"name":"A2","text":"For the people of Garlemald!"},{"name":"A2","text":"For revenge against the Telophoroi!"},{"name":"MERLWYB","text":"Couldn't have put it better myself."},{"name":"KANESENNA","text":"Y'shtola, Thancred, and Urianger have already pledged their support, and are on their way to meet the rest of the contingent."},{"name":"KANESENNA","text":"They were positive you would come to the same decision as they did. Luckily for all involved, their prediction was correct."},{"name":"NANAMOULNAMO","text":"Once you have delivered the warding scales to Ala Mhigo, the contingent will embark on its journey to Ilsabard."},{"name":"NANAMOULNAMO","text":"Raubahn and Lord Aymeric are overseeing preparations, so I suggest you make yourselves known upon arrival."},{"name":"MERLWYB","text":"Pack warm clothing─furs and the like. Without it, the cold will do you in before the Telophoroi so much as draw steel. As for us, we'll keep the enemy busy while you're gone. They're not the only ones who can create a diversion."},{"name":"MERLWYB","text":"Now go, safe in the knowledge Eorzea will be as you left it─or better─upon your return."},{"name":"ZANTHAEL","text":"Though we are used to attending to dignitaries, it is rare to receive so many at once."},{"name":"ZANTHAEL","text":"Oh, and did you recognize the sultana's shield? None other than Jenlyns Straightblade, captain of the Sultansworn."},{"name":"ZANTHAEL","text":"Nowhere near as imposing and impressive as Storm Marshal Slafyrsyn, but I nevertheless sense there's more to him than meets the eye..."},{"name":"ALPHINAUD","text":"I'll admit, this is all rather daunting, though not quite in the way I was expecting..."},{"name":"ALPHINAUD","text":"We'll be standing shoulder to shoulder with our alliance's finest. The best of the best. The Warrior of Light, and...well, me."},{"name":"ALPHINAUD","text":"It's silly, I know. Perhaps this is my way of distracting myself from the part I <span class=\"emphasis\">should</span> be worried about...marching into Garlemald."},{"name":"ALISAIE","text":"You know, I'm quite looking forward to seeing who's been selected for the Ilsabard contingent. I've a few people in mind. Care to make a friendly wager?"},{"name":"GRAHATIA","text":"I must quiz Thancred and Urianger on the conditions we can expect in Garlemald. I know it's cold, but <span class=\"emphasis\">how</span> cold? Will I need to keep my ears covered? They can be a bit sensitive at times..."},{"name":"ESTINIEN","text":"If Aymeric asks after me, say I'm getting on fine and leave it at that. Don't you dare breathe a word about the cord."},{"name":"AYMERIC","text":"Ah, fancy meeting you here. I trust our mutual friend is settling into life as a Scion?"},{"name":"AYMERIC","text":"Collaboration never was his forte. The moment the fighting ended, off he'd go, like a gaelicat swept up in a strong breeze."},{"name":"AYMERIC","text":"But rest assured, he will always be there when you need him. Probably."},{"name":"RAUBAHN","text":"Ah, the wanderers return! You've been busy, bringing down a tower and producing the keys to destroying the rest of them."},{"name":"RAUBAHN","text":"You should be proud. Those warding scales of yours are what's made this whole venture possible."},{"name":"ALPHINAUD","text":"Will you and Lord Aymeric be leading the contingent?"},{"name":"AYMERIC","text":"Regrettably, no. Our role is to organize the various delegations into a cohesive unit. Once we have seen you all off, it's back to our respective posts."},{"name":"AYMERIC","text":"We dare not neglect our duties for too long lest our defensive efforts fall into disarray."},{"name":"AYMERIC","text":"And just between us, there was a fair amount of opposition to the formation of the Ilsabard contingent. The very suggestion that we send out some of our finest troops behind enemy lines to render aid unto the Garleans has made me rather unpopular in certain quarters..."},{"name":"ESTINIEN","text":"Hmph. Can't please them all."},{"name":"AYMERIC","text":"Sadly not, though I do my best. Truth be told, I'd much rather be at your side, charging into the fray. Alas, I've battles of my own to fight, where words may serve me better than any blade."},{"name":"RAUBAHN","text":"I hate to say it, but Lord Aymeric's struggles mirror my own."},{"name":"RAUBAHN","text":"For the time being, the best we can offer you is the peace of mind from knowing Eorzea is in safe hands."},{"name":"RAUBAHN","text":"As you fight the good fight in Ilsabard, I and the other commanders will do what we can to convince the naysayers that our cause is just."},{"name":"ALPHINAUD","text":"Thank you. Both of you."},{"name":"SHADOWHUNTER","text":"(-???-)We meet again..."},{"name":"SHADOWHUNTER","text":"Much has occurred since we parted ways in Werlyt. From what I gather, the protective talismans you obtained led to the formation of this expeditionary force."},{"name":"SHADOWHUNTER","text":"Word of your exploits travels quickly. From what I gather, the protective talismans you obtained led to the formation of this expeditionary force."},{"name":"SHADOWHUNTER","text":"My contribution on this occasion is but a minor one, that being the information I have shared with Maxima. For the sake of the people of Garlemald, may the fates be on your side."},{"name":"ESTINIEN","text":"So you're not coming with us."},{"name":"ESTINIEN","text":"Strange. I thought you'd have a stake in this."},{"name":"SHADOWHUNTER","text":"I do. The Telophoroi have laid waste to my homeland and enslaved my people."},{"name":"SHADOWHUNTER","text":"But though every mote of my being cries for vengeance, I cannot be the one to deliver it. My presence alone would place the entire mission in jeopardy."},{"name":"SHADOWHUNTER","text":"I stand accused of murdering Emperor Varis and plunging Garlemald into chaos. Were I to travel with the Ilsabard contingent, it would give my countrymen ample cause to question our motives."},{"name":"SHADOWHUNTER","text":"Conversely, those who believe me innocent may instead celebrate the return of a former legatus and attempt to raise me to a position of leadership, further destabilizing the region and complicating the contingent's mission."},{"name":"SHADOWHUNTER","text":"Whether I am branded a villain or hailed as a hero, I would only hinder your efforts."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"We will deliver your people from harm, in your stead."},{"name":"A3","text":"I doubt they'll be pleased to see the champion of Eorzea set foot on Garlean soil..."},{"name":"A3","text":"I understand. Werlyt is in your hands."},{"name":"SHADOWHUNTER","text":"For what it is worth, you have my gratitude."},{"name":"SHADOWHUNTER","text":"You and your comrades have the strength and courage to deliver my countrymen. I am certain of it."},{"name":"SHADOWHUNTER","text":"A fair point, but so long as you refrain from announcing your arrival to all and sundry, the average person should have no inkling as to your identity."},{"name":"SHADOWHUNTER","text":"Although your titles and deeds are common knowledge, only a select few would recognize you on sight alone."},{"name":"SHADOWHUNTER","text":"Perhaps one day, they will learn that the Warrior of Light is not a demon to be feared, but a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> deserving of their trust."},{"name":"SHADOWHUNTER","text":"And I will defend it to my dying breath. After the sacrifices my sons and daughters made, I can do no less."},{"name":"SHADOWHUNTER","text":"I and the government of Werlyt intend to offer refuge to those fleeing Garlemald. Should that time come, we will be ready."},{"name":"MAXIMA","text":"In light of Gaius's rather unique circumstances, I instead will assume the role of your guide."},{"name":"MAXIMA","text":"Though I may have defected for political reasons, my love for Garlemald endures. I would stop at nothing to protect her and her people."},{"name":"RAUBAHN","text":"Well said. Might I ask you to escort our friends inside?"},{"name":"AYMERIC","text":"You might even bump into an old acquaintance or two. And if I don't see you again ere you depart, may the Fury guide and protect you. All of you."}],"reward":{"gil":868,"items":[{"id":35678}]},"reqs":{"jobs":[{"lvl":82,"id":142}],"quests":[69916]},"next":[69918]},"partials":[{"type":"npc","id":"1038781","obj":{"i":1038781,"n":"Krile","l":3706,"q":1}},{"type":"npc","id":"1038796","obj":{"i":1038796,"n":"Raubahn","l":2408,"q":1}},{"type":"item","id":"35678","obj":{"i":35678,"n":"Pewter Chest Gear Coffer (IL 525)","l":1,"c":26559,"t":61}},{"type":"quest","id":"69916","obj":{"i":69916,"n":"Sound the Bell, School's In","g":11,"l":"Old Sharlayan","s":534}},{"type":"quest","id":"69918","obj":{"i":69918,"n":"Best of the Best","g":11,"l":"The Lochs","s":536}}]}