{"quest":{"name":"Tipping the Scale","location":"Thavnair","id":69911,"patch":6.0,"sort":529,"eventIcon":71201,"issuer":1037649,"target":1038653,"genre":11,"journal":["Zeynuha has a sack of giantsgall for you."],"objectives":["Deliver the sack of giantsgall to Nidhana.","Speak with Nidhana.","Speak with the Radiant Host soldier.","Speak with Thancred."],"dialogue":[{"name":"ZEYNUHA","text":"Here you are─a sack of the purest giantsgall. We always set some aside for our alchemist friends."},{"name":"ZEYNUHA","text":"When you deliver it, let the good folk of the Great Work know that we're grateful for their efforts. If they need more, they need but ask."},{"name":"ZEYNUHA","text":"Payment? You needn't worry─the satrap will see us compensated. But even if he did not, we wouldn't hesitate to provide what we can. We're in this fight together, after all."},{"name":"NIDHANA","text":"Ah, welcome back, <span class=\"highlight\">Forename</span>. Dare I hope you have the giantsgall?"},{"name":"NIDHANA","text":"Oh my, such fine specimens! Thank you so much for bringing these!"},{"name":"NIDHANA","text":"We now have everything we need to make our next prototype─one that should be capable of passing our most rigorous tests."},{"name":"NIDHANA","text":"When it is ready, it will be time for the <span class=\"emphasis\">true</span> test, so please take your ease while you can!"},{"name":"THANCRED","text":"Nothing unusual so far. Don't worry about us─think only of your own task."},{"name":"URIANGER","text":"The warding scale doth promise to alter the course of conflict. Yet even as it giveth us cause to rejoice, we must needs brace ourselves for the Telophoroi's response."},{"name":"ESTINIEN","text":"What of that boy... Varshahn, was it?"},{"name":"ESTINIEN","text":"Running this and that errand for the satrap, you say...<br>...Hm? Why do I ask? 'Tis nothing. Curiosity."},{"name":"RADIANTHOST04375","text":"The satrap has granted you the use of this boat. May it serve you well!"},{"name":"NIDHANA","text":"This is a rather finer boat than I had expected, but I won't complain."},{"name":"NIDHANA","text":"All that remains is to board and be on our way. Oh, and if I should become corrupted, do not stay your hand. Of course I pray it does not come to that, but you must protect yourself."},{"name":"NIDHANA","text":"Other alchemists can fulfill my role, but you and your blessing are one of a kind...and perhaps our only hope for toppling this tower. For all our sakes, do not hesitate to do what must be done. Whatever that may be."},{"name":"NIDHANA","text":"...Well, the longer I draw this out, the more nervous I become. Let's be off!"},{"name":"Q1","text":"Head to the Tower of Zot with Nidhana?"},{"name":"RADIANTHOST04375","text":"Ah, you are returned! But...where is Mistress Nidhana?"},{"name":"RADIANTHOST04375","text":"Manusya preserve... Just when we had succeeded in making the talisman..."},{"name":"RADIANTHOST04375","text":"I-I must report this at once! Meanwhile, please return to the Great Work!"},{"name":"URIANGER","text":"Thy demeanor bespeaketh consternation, <span class=\"highlight\">Forename</span>..."},{"name":"ESTINIEN","text":"Hm... Bad tidings, I take it."},{"name":"THANCRED","text":"...Something's gone awry, hasn't it? What happened?"},{"name":"THANCRED","text":"So it was Fandaniel after all... Damn that bastard!"},{"name":"THANCRED","text":"I'm sure you wanted to do more...but you were right to return here first."},{"name":"THANCRED","text":"We must tread warily lest we endanger Nidhana and the other captives."}],"reward":{"gil":1415},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69910]},"next":[69912]},"partials":[{"type":"npc","id":"1037649","obj":{"i":1037649,"n":"Zeynuha","l":3709,"q":2}},{"type":"npc","id":"1038653","obj":{"i":1038653,"n":"Thancred","l":3709,"q":2}},{"type":"quest","id":"69910","obj":{"i":69910,"n":"A Boy's Errand","g":11,"l":"Thavnair","s":528}},{"type":"quest","id":"69912","obj":{"i":69912,"n":"The Satrap of Radz-at-Han","g":11,"l":"Thavnair","s":530}}]}