{"quest":{"name":"In the Dark of the Tower","location":"Old Sharlayan","id":69913,"patch":6.0,"sort":531,"icon":101105,"eventIcon":71201,"issuer":1040291,"target":1040252,"genre":11,"journal":["Krile glances at you with expectant eyes.","In the Baldesion Annex, you and your fellow Scions gather to share the findings of your investigations in Sharlayan and Radz–at–Han. Krile is of the opinion that assaulting the Tower of Zot should be the highest priority, and having conceived of a strategy, the party sets forth for Thavnair. Upon arriving on the island, you are to first regroup at the outpost at the Hamsa Hatchery.","Arriving at the outpost, you are greeted by Nahbdeen, who bids you stand by at the boat which will bear you to the tower.","After a short wait, your comrades join you at the boat. Some have weathered the aetheryte journey better than others, but all stand ready to breach the tower. Having received the warding scales from Varshahn, you make a final review of your strategy, which will see your forces divided into two groups; yours will fight its way to the tower's core, while the other will focus on keeping the prisoners alive until they can be set free. With that, naught remains to be done but give the word to launch the boat and commence the operation.<br><br>※To enlist your companion NPCs for this duty, speak with them near the entrance or access Duty Support via the main menu. Use the Duty Finder if you wish to complete the instance alongside fellow players.","Inside the tower's forbidding interior, you cut a path through tempered imperial soldiers and confront three Manusya of Thavnairian myth made manifest─the Magus Sisters. Though these unfamiliar primals are formidable, you eventually emerge the victor, thereby neutralizing the spire's defenses.","Employing her ability to see aether, Y'shtola identifies the tower's core, which, to her dismay, appears to hold a man's severed limb. To who it once belonged and why it is there is a mystery, but it is undoubtedly what sustains the structure, and so Estinien wastes no time destroying it. With nothing to perpetuate its existence, the tower begins to fade─along with the floor beneath your feet─but thinking quickly, G'raha Tia invokes a levitation spell and sees everyone to safety.","Back at the outpost, Thancred informs you that the prisoners are being transported to the city, where they will receive treatment for tempering. As you gaze out at the water, the menacing tower nowhere to be seen, you allow yourself a moment to savor this small victory before steeling yourself for the next battle."],"objectives":["Speak with Nahbdeen at the Hamsa Hatchery.","Stand by at the boat.","Enter the Tower of Zot. ","Speak with Thancred."],"dialogue":[{"name":"KRILE","text":"Since there has been progress in both investigations, shall we share the findings from our respective locales?"},{"name":"NAHBDEEN","text":"Ah, our friend of Eorzea, we've been expecting you! You and yours will lead the mission into the tower, I'm told."},{"name":"NAHBDEEN","text":"The warding scales will be delivered soon. Till then, please stand by at the boat we have readied."},{"name":"NAHBDEEN","text":"When your fellows arrive, I will direct them to join you. We pray for your safety and success!"},{"name":"NAHBDEEN","text":"If the satrap trusts you and yours to lead the mission, then you must be formidable warriors indeed."},{"name":"NAHBDEEN","text":"Glad are we to count you as allies!"},{"name":"ALISAIE","text":"Unnngh... If this is the future of aetheryte travel, I think I'll stick to boats..."},{"name":"ALPHINAUD","text":"Aye... No warning, however emphatic, could have prepared me for that..."},{"name":"GRAHATIA","text":"On account of which we are a little late, but fighting fit! Mostly."},{"name":"VARSHAHN","text":"My friends, permit me to thank you for accepting this mission."},{"name":"KRILE","text":"You must be...hm... We should still call you Varshahn, I suppose?"},{"name":"VARSHAHN","text":"Indeed. It would not do to confuse our soldiers."},{"name":"KRILE","text":"Very well, then."},{"name":"KRILE","text":"For our part, we are humbled that you should see fit to entrust us with your warding scales. Please convey as much to His Excellency."},{"name":"VARSHAHN","text":"One for each of you. Please accept them with my blessings."},{"name":"THANCRED","text":"Our thanks. With these, we can go anywhere those with the blessing of Light can go."},{"name":"THANCRED","text":"Not only for this operation either, but all the ones to come. We can finally break your monopoly on primals."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I've been waiting for this day!"},{"name":"A1","text":"I wouldn't mind carrying on as before, you know."},{"name":"A1","text":"In that case, they're all yours from now on."},{"name":"THANCRED","text":"So have we, my friend. So have we."},{"name":"THANCRED","text":"Hah, spoken like our champion. Rest assured we'll ever have need of you, though we will do what we can to lighten your burden."},{"name":"THANCRED","text":"Ah, but I'm afraid we can't let you retire just yet. You're the Scions' brightest star, after all."},{"name":"YSHTOLA","text":"If everyone is amenable to it, let us review the strategy for good measure."},{"name":"YSHTOLA","text":"As previously agreed, we will divide into two groups."},{"name":"YSHTOLA","text":"<span class=\"highlight\">Forename</span> and <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> band will break through the tower's defenses and locate its core."},{"name":"YSHTOLA","text":"Meanwhile, the rest of us will tend to the prisoners, who will doubtless want for healing due to the duress of repeated summonings."},{"name":"URIANGER","text":"The primals which the tower bringeth forth shall be deities of Thavnairian myth."},{"name":"URIANGER","text":"As we have no prior experience with such foes, pray exercise the utmost caution when confronting them."},{"name":"ALPHINAUD","text":"We commence the operation at your word, my friend."},{"name":"ALPHINAUD","text":"For the people of Thavnair─nay, the entire world─we must prevail!"},{"name":"Q2","text":"What will you do?"},{"name":"A2","text":"Small talk."},{"name":"A2","text":"Form a party and enter the Tower of Zot."},{"name":"A2","text":"Nothing."},{"name":"ALPHINAUD","text":"I may have taken up new arms, but my role is unchanged. I am a healer, through and through."},{"name":"ALPHINAUD","text":"Yet in knowing who once wore this sage's mantle, I wonder... When all is said and done, will I look back on the battles I chose to fight with pride?"},{"name":"ALISAIE","text":"My warding scale is safely tucked away. I'm ready when you are, <span class=\"highlight\">Forename</span>."},{"name":"ALISAIE","text":"I may not be the Azure Dragoon, former or otherwise, but I guarantee that I'll give as good as I get!"},{"name":"THANCRED","text":"With Y'shtola keeping them company, the other party will be able to hold their own against the enemy if needs be."},{"name":"THANCRED","text":"So we can tackle our own task without worrying over them. Come, let us be about it!"},{"name":"ESTINIEN","text":"First this armor, blessed with Ratatoskr's power, and now Vrtra's scale... Much has changed for dragons to show me such favor."},{"name":"ESTINIEN","text":"And with Nidhogg with me, in spirit and in hand, no obstacle will bar our way."},{"name":"URIANGER","text":"Aside from primals, within the tower we shall for a certainty encounter enthralled imperial soldiers."},{"name":"URIANGER","text":"Defenders conveyed hither by means unknown, who will stop at nothing to hinder our efforts..."},{"name":"YSHTOLA","text":"Lest you worry, I've not forgotten my healing spells."},{"name":"YSHTOLA","text":"Be it restoration or destruction, this sorceress can command whatever magicks the situation requires."},{"name":"GRAHATIA","text":"Though our parties are separate, I will trust in you─as I know you will trust in me."},{"name":"GRAHATIA","text":"Let us both give it our all, and add another rousing chapter to the saga!"},{"name":"KRILE","text":"This is the closest I've ever been to one of the towers. Such a sinister aura it exudes..."},{"name":"KRILE","text":"It's been a while since last I took to the field, and I can't help but feel nervous. But with everyone at my side, I'm sure all will be well!"},{"name":"VARSHAHN","text":"The Radiant Host and I will be watching from the outpost, ready to act at the first sign of unusual activity."},{"name":"VARSHAHN","text":"May the scales serve you well, and protect you in lieu of Vrtra's fangs and claws."},{"name":"CINDURUVA","text":"No matter the cost, we must protect the tower."},{"name":"ESTINIEN","text":"Whew... Carrying all those Matanga may have been the true struggle..."},{"name":"THANCRED","text":"The liberated prisoners are being transported to Radz–at–Han for treatment."},{"name":"THANCRED","text":"Alisaie and Y'shtola will oversee the administration of the tempering treatment, with support from those who know a healing spell or two."},{"name":"THANCRED","text":"We'll go and join them in the city once you've had a moment to catch your breath."},{"name":"SYSTEM","text":"You may now enter the Tower of Zot with a party of NPC avatars. To make use of this feature, open the <span class=\"highlight\">Trust</span> interface located under <span class=\"highlight\">Duty</span> in the main menu."}],"reward":{"gil":3000,"instance":78},"reqs":{"jobs":[{"lvl":81,"id":142}],"questsType":"all","quests":[69903,69912]},"next":[69914]},"partials":[{"type":"npc","id":"1040291","obj":{"i":1040291,"n":"Krile","l":3817,"q":2}},{"type":"npc","id":"1040252","obj":{"i":1040252,"n":"Thancred","l":3709,"q":2}},{"type":"instance","id":"78","obj":{"i":78,"n":"The Tower of Zot","c":61801,"t":"Dungeons","min_lvl":81,"max_lvl":82,"min_ilvl":500}},{"type":"quest","id":"69903","obj":{"i":69903,"n":"Estate Visitor","g":11,"l":"Old Sharlayan","s":521}},{"type":"quest","id":"69912","obj":{"i":69912,"n":"The Satrap of Radz-at-Han","g":11,"l":"Thavnair","s":530}},{"type":"quest","id":"69914","obj":{"i":69914,"n":"The Jewel of Thavnair","g":11,"l":"Thavnair","s":532}}]}