{"quest":{"name":"Sound the Bell, School's In","location":"Old Sharlayan","id":69916,"patch":6.0,"sort":534,"icon":101106,"eventIcon":71201,"issuer":1038769,"target":1038780,"genre":11,"journal":["Krile and G'raha Tia were having a pleasant conversation until you barged in.","Following your late-night feast with the junior Scions, you awake to find Krile and G'raha engaged in idle banter. During your adventures in Thavnair, Scholarch Montichaigne had stopped by the annex for a friendly chat, only to find you absent. Krile invites you to join her in visiting her former schoolmaster, that you may express your gratitude for his kind words in the Rostra.","As alumni of the Studium, Alisaie and Alphinaud jump at the chance to accompany you to their old stamping ground, though there is some concern that recent events will cast a pall over what would otherwise be a jubilant return.","You meet with Krile and the twins outside the entrance of Phenomenon, which as Alphinaud zealously explains, is the very heart of the Studium. Alisaie also recalls with some chagrin her brother's astonishing achievements and fearsome reputation during his days as a student, until Krile turns the conversation to more immediate matters. She points out that Scholarch Montichaigne is a notoriously difficult man to track down, and the surest way to find him is to question the young scholars in the vicinity.","As Alphinaud finds himself mobbed with fervent admirers, you narrow your search to students more amenable to calm conversation. One helpful young man points you in the direction of a “Miss Aliapoh,” a name with a strangely familiar ring to it.","Qih Aliapoh, overseer of proceedings at Searchers' Meet, eventually provides you with useful information, but not before a lengthy and unsolicited explanation of the facility, due in no small part to mistaking you for a gleaner. Having spent more than enough time humoring the hopeless helper, you make your way to Makers' Meet, as she advised.","You arrive in the laboratory to discover a noticeable lack of scholarchs. Thankfully, a nearby student reveals he had spoken to Montichaigne but a few moments ago, and you follow your latest lead down the corridor.","Montichaigne has unwittingly sent you on a merry chase, but any frustration accumulated over the arduous search soon dissolves as he greets you with a warm smile. Light-hearted chatter then gives way to graver matters, and he reveals that an enchantment has been placed upon all Forum members to prevent them from revealing the truth of their great duty. Unable to speak further on the subject, he instead gives an impromptu lecture on the relationship between memories and the soul, and though its relevance is not yet apparent, you take his words to heart nonetheless. Satisfied that he has imparted to you sufficient food for thought, Montichaigne concludes the lesson and bids you farewell."],"objectives":["Speak with Alisaie.","Speak with Krile.","Speak with the excitable student.","Speak with Miss Aliapoh.","Speak with the level-headed student.","Search for Montichaigne."],"dialogue":[{"name":"GRAHATIA","text":"I hope you didn't mind us barging into your room for our late-night feast. For what it's worth, it did me a world of good to put our troubles to one side, if only for a moment."},{"name":"KRILE","text":"Oh, there you are! Feeling refreshed, I hope?"},{"name":"KRILE","text":"I was about to make my way to the Studium, as it happens."},{"name":"KRILE","text":"I wanted to try and speak with Scholarch Montichaigne and thank him for coming to our rescue in the Rostra."},{"name":"KRILE","text":"As it turns out, he'd come here to see <span class=\"emphasis\">us</span> following the hearing, only to find that we'd already departed for Thavnair. Knowing him, he was probably hoping to chew the cud with his former students."},{"name":"KRILE","text":"Since we're still waiting for Y'shtola and the others, I thought now the perfect time to pay him a visit. Care to join me?"},{"name":"KRILE","text":"Then it's settled! The twins will be coming too, assuming Alphinaud can tear himself away from his new toys. I'll let you rally the troops while I go on ahead to Phenomenon."},{"name":"GRAHATIA","text":"Considering my recent impropriety, perhaps I should avoid showing my face around the Studium for a time..."},{"name":"KRILE","text":"That might be for the best. If the others should return, tell them we will not be long."},{"name":"GRAHATIA","text":"Unlike some of the Scions, I am not an alumni of the Studium. As such, I have no acquaintances there I am obliged to visit."},{"name":"GRAHATIA","text":"And while I would love nothing more than to pore over the many great tomes of Phenomenon, I fear my presence there would stir up more unwanted trouble...so! For now, I will be patient. Much as it pains me to do so."},{"name":"ALPHINAUD","text":"If Father can master these fiendish contraptions, then so can I!"},{"name":"ALISAIE","text":"Heading out for a stroll?"},{"name":"ALISAIE","text":"The scholarch himself was here? In that case, what are we waiting for?"},{"name":"ALPHINAUD","text":"I too am eager to see him, though I somewhat dread the thought of visiting the Studium. I daresay our notoriety precedes us..."},{"name":"ALISAIE","text":"...Alphinaud of all people worrying over his reputation. And at our alma mater, no less! Will wonders never cease."},{"name":"ALISAIE","text":"You'll understand soon enough. Off we go!"},{"name":"ALPHINAUD","text":"It feels like only yesterday that I first walked through these doors..."},{"name":"ALISAIE","text":"See that sculpted pitcher above the entrance? That's the mark of Thaliak, the Scholar. Bearer of the waters of knowledge. It's no exaggeration to say that Sharlayan itself is one enormous shrine to Him, and that's especially noticeable here in the Studium."},{"name":"KRILE","text":"Here it is: Phenomenon. While I expect you made note of it before─one can hardly miss it─this is the first time you've been here on official business, correct?"},{"name":"KRILE","text":"While most of the space is taken up by the expansive auditoriums, it also houses numerous laboratories, testing grounds for experimental magicks, and a host of administrative offices and so forth."},{"name":"ALPHINAUD","text":"As the center of what would later become the Studium, it was established to promote the study of aetherological phenomena, hence the name."},{"name":"ALPHINAUD","text":"Though with aether being a fundamental aspect of nature, its scope expanded to include every conceivable facet of life and even the universe itself."},{"name":"ALPHINAUD","text":"And then, in the four hundred and thirty-second year of the Sixth Astral Era, Phenomenon was decreed complete and the Studium officially opened as a place of learning."},{"name":"ALPHINAUD","text":"With a long and storied history, it is without question the world's leading authority in aetherology, the arcane, the occult, astromancy, and countless other fields, standing proud as─"},{"name":"ALISAIEANDKRILE","text":"(-Alisaie and Krile-)...Sharlayan's foremost educational institute!"},{"name":"KRILE","text":"You always did enjoy giving the grand tour to new students!"},{"name":"ALISAIE","text":"Indeed, I've long since lost track of how many times he has recited that same foppish speech. Such is his undying love for his old stamping ground."},{"name":"ALISAIE","text":"He was in top form back then. Youngest to enter the Studium, graduated with highest honors in magical arts and aetherology, undisputed champion of the debating chamber..."},{"name":"KRILE","text":"Hold on. You both joined the Studium at the same age, yes? And from where I stand, you're equally prodigious scholars."},{"name":"ALISAIE","text":"Nice of you to say, but Alphinaud actually entered half a year before me. Nor did I do well enough to graduate with honors. And I am certainly not the Studium's most notorious master debater."},{"name":"ALISAIE","text":"In all respects have I ever been in his shadow. If nothing else, just remember that this was where the legend of Alphinaud Leveilleur began."},{"name":"ALISAIE","text":"We should expect everyone to be fully aware of our recent escapades. Hopefully, we'll be somewhat more welcome here than we were at the Last Stand."},{"name":"ALISAIE","text":"I know better than anyone the adoration the student body has for Alphinaud, and with a bit of luck, it might work to our advantage."},{"name":"KRILE","text":"Well, there's no time like the present."},{"name":"KRILE","text":"First things first, let's look for Scholarch Montichaigne. Other faculty tend to frequent their offices, but unfortunately for us, he's fond of wandering wheresoever his whims take him..."},{"name":"KRILE","text":"Let's split up and ask the students if they've seen him!"},{"name":"ALPHINAUD","text":"I assure you, I'll tell you all about it <span class=\"emphasis\">after</span> my business with the scholarch has concluded!"},{"name":"STUDENTA04380","text":"(-Overzealous Student-)The scholarch!? Tell me, my good fellow, does this have something to do with saving the world from catastrophe?"},{"name":"STUDENTB04380","text":"(-Solemn Student-)Might we turn our attention to Master Leveilleur's graduation thesis? I, too, have my doubts regarding our policy of nonintervention..."},{"name":"STUDENTC04380","text":"(-Bright-eyed Student-)Is it true that your experiences overseas are the reason you have incurred the ire of the Forum? Oh, what I wouldn't give to see you butt heads with those old codgers!"},{"name":"ALISAIE","text":"Things were bad enough during our school days, and Alphinaud's time abroad has only heightened his fame. Or should that be infamy?"},{"name":"ALISAIE","text":"He had his rivals and detractors, of course. Though most of them gave that up after his adoring fans set upon them like ravenous dogs."},{"name":"ALISAIE","text":"Alphinaud, on the other hand, never paid them much notice. They were simply beneath him..."},{"name":"KRILE","text":"Unsurprisingly, the scholarch is not in his office. I did, however, speak with one student who saw him not long ago, so he can't have gone far."},{"name":"STUDENTD04380","text":"Th-That was Alphinaud Leveilleur, wasn't it? <span class=\"emphasis\">The</span> Alphinaud Leveilleur!"},{"name":"STUDENTD04380","text":"And he's with his sister and Master Baldesion's granddaughter! This can only mean one thing─an event of epoch-shattering proportions is fast approaching! Spread the word!"},{"name":"STUDENTD04380","text":"Oh, sorry, you said you're looking for the scholarch, yes? Knowing him, he could be anywhere, but Miss Aliapoh should have a better idea."},{"name":"STUDENTD04380","text":"What could warrant the sudden return of so many esteemed alumni? Is there truth to the rumors...? I must get to the bottom of this!"},{"name":"QIHALIAPOH","text":"Are you lost? Wander in off the street, perhaps?"},{"name":"QIHALIAPOH","text":"Wait, don't tell me... You're a trainee gleaner fresh off the guildship! I'm right, aren't I?"},{"name":"QIHALIAPOH","text":"Oh, how silly of me, an orientation is in order. Ahem! Allow me to bid you a warm welcome to Searchers' Meet!"},{"name":"QIHALIAPOH","text":"Let me start with a question: what is the most important thing you'll find in the Studium?"},{"name":"QIHALIAPOH","text":"That's right─books! And what's the second most important? Why, that's simple... Everything else!"},{"name":"QIHALIAPOH","text":"That's what we deal in here at Searchers' Meet. Whenever the students or tutors find themselves in need of equipment or materials, they come to us. If we don't have it in our stores, we send the gleaners off to find it."},{"name":"QIHALIAPOH","text":"Honestly, you wouldn't believe some of the requests we get. Eye of paissa this, tongue of gigantoad that...it's enough to make your hair stand on end! Which is possibly what some of our students are trying to accomplish, this being a school of magic and all."},{"name":"QIHALIAPOH","text":"As our newest gleaner, you'll have your work cut out for you, but I think you'll find it quite rewarding!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"The only thing I'm interested in <span class=\"emphasis\">gleaning</span> is information on the scholarch's whereabouts."},{"name":"A1","text":"I've tracked down many miscellaneous knickknacks in my time, but I'm no gleaner..."},{"name":"QIHALIAPOH","text":"I beg your pudding? You're not a gleaner? Then this...was all an elaborate ruse!? No, wait─come to think of it, you never actually claimed to be one in the first place. My mistake!"},{"name":"QIHALIAPOH","text":"So what you're telling me is...you're not a gleaner? Yes, that's exactly what you said, isn't it... And you're looking for a scholarch? I'm afraid we don't have any of those in stock, but I can─ Ohhh, you mean <span class=\"emphasis\">him</span>!"},{"name":"QIHALIAPOH","text":"He <span class=\"emphasis\">was</span> here, but...now he's not. I did speak with him shortly before you arrived, though. He said he was on his way to Makers' Meet."},{"name":"QIHALIAPOH","text":"Go back the way you came in, and you'll see it on the opposite side of the entrance. It's a laboratory of sorts, home to many rare and expensive curios...not to mention alarmingly frequent accidents. If you lose your way, just follow the bloodcurdling screams."},{"name":"QIHALIAPOH","text":"Ha! In the time it's taken me to tell you all of this, the scholarch has probably already left! Best of luck finding him─ I've a feeling you'll need it!"},{"name":"STUDENTE04380","text":"Yes, the scholarch was here a short while ago. He offered me advice on my current research project."},{"name":"STUDENTE04380","text":"Though we spoke at length, I don't recall him mentioning where he was planning to go next. When we parted ways, he went down the corridor. Perhaps to one of the auditoriums?"},{"name":"STUDENTE04380","text":"It's strange seeing Makers' Meet so empty. People usually treat it like a common room..."},{"name":"SYSTEM","text":"You have been granted the run of Phenomenon. If you are game, Qih Aliapoh would put your artisanry to good use."}],"reward":{"gil":1193,"items":[{"id":35676}]},"reqs":{"jobs":[{"lvl":82,"id":142}],"quests":[69915]},"next":[69746,69747,69748,69749,69750,69751,69917,70009]},"partials":[{"type":"npc","id":"1038769","obj":{"i":1038769,"n":"Krile","l":3706,"q":1}},{"type":"npc","id":"1038780","obj":{"i":1038780,"n":"Montichaigne","l":3706,"q":1}},{"type":"item","id":"35676","obj":{"i":35676,"n":"Pewter Weapon Coffer (IL 525)","l":1,"c":26557,"t":61}},{"type":"quest","id":"69915","obj":{"i":69915,"n":"The Color of Joy","g":11,"l":"Radz-at-Han","s":533}},{"type":"quest","id":"69746","obj":{"i":69746,"n":"A Volatile Education","g":119,"l":"Old Sharlayan","s":1401}},{"type":"quest","id":"69747","obj":{"i":69747,"n":"The Light of Progress","g":119,"l":"Old Sharlayan","s":1410}},{"type":"quest","id":"69748","obj":{"i":69748,"n":"My Fair Mammet","g":119,"l":"Old Sharlayan","s":1420}},{"type":"quest","id":"69749","obj":{"i":69749,"n":"The Creature from the Wooden Crate","g":119,"l":"Old Sharlayan","s":1430}},{"type":"quest","id":"69750","obj":{"i":69750,"n":"Fast Fashion","g":119,"l":"Old Sharlayan","s":1440}},{"type":"quest","id":"69751","obj":{"i":69751,"n":"Booking Books","g":119,"l":"Old Sharlayan","s":1450}},{"type":"quest","id":"69917","obj":{"i":69917,"n":"A Capital Idea","g":11,"l":"Old Sharlayan","s":535}},{"type":"quest","id":"70009","obj":{"i":70009,"n":"The Faculty","g":178,"l":"Old Sharlayan","s":10,"f":1}}]}