{"quest":{"name":"Best of the Best","location":"The Lochs","id":69918,"patch":6.0,"sort":536,"eventIcon":71201,"issuer":1038802,"target":1038817,"genre":11,"journal":["Maxima would have you meet your new traveling companions."],"objectives":["Enter the Royal Palace.","Speak with Y'shtola.","Deliver warding scales to A–Ruhn–Senna.","Deliver warding scales to Sicard.","Deliver warding scales to Lyse.","Deliver warding scales to Lucia.","Deliver warding scales to Cirina.","Deliver a warding scale to Maxima.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"With the knowledge that our allies will hold the line in our absence, we may devote our attention to the Ilsabardian front."},{"name":"ALISAIE","text":"I suppose it's easy for some people to forget there are civilians in Garlemald, too, when the only imperials they've ever known are soldiers..."},{"name":"GRAHATIA","text":"So that's Gaius Baelsar. The horrors he must have seen... Many of his own making, I do not doubt."},{"name":"ESTINIEN","text":"Like Gaius, I too stand accused of Varis's murder, though I am rather less recognizable on sight. Still, it's something to bear in mind once we reach Garlemald."},{"name":"AYMERIC","text":"I neglected to mention earlier that we received a report from our troops that may be of interest to you. While engaged with a lunar primal, a great wyrm swooped down from the skies above and came to their aid."},{"name":"AYMERIC","text":"This wyrm, as described, was the spitting image of Tiamat. It would seem she too continues to wage war against the Telophoroi."},{"name":"RAUBAHN","text":"Once we've seen the contingent on its way, I will return to my duties here in Ala Mhigo."},{"name":"RAUBAHN","text":"As many of our most capable will be traveling with you to Garlemald, we who remain will have to fight that much harder to make up the difference. But let no man say I do not welcome the challenge. Aye, this old bull isn't ready to hang up his horns yet!"},{"name":"SHADOWHUNTER","text":"Regardless of how my countrymen receive you, the cold will not treat you kindly. Underestimate it at your peril."},{"name":"MAXIMA","text":"The other members of the Ilsabard contingent are gathered in the Royal Palace."},{"name":"MAXIMA","text":"I shall inform them of your arrival, so please make your way inside as soon as you are ready."},{"name":"RESISTANCEGATEGUARD","text":"Ah, the remaining members of the Scions. Your friends and most of the Ilsabard contingent await you within."},{"name":"RESISTANCEGATEGUARD","text":"Would you like me to see you through?"},{"name":"Q1","text":"Enter the Royal Palace?"},{"name":"RESISTANCEGATEGUARD","text":"Do you wish to meet with the rest of the Ilsabard contingent?"},{"name":"LUCIA","text":"I've led troops into battle many a time, but never a unit with such a diverse range of talents."},{"name":"LUCIA","text":"While I've been briefed on their capabilities, I expect you could provide additional insight into their strengths and weaknesses. I'd appreciate any advice you may have."},{"name":"MAXIMA","text":"I cast my lot with the Populares to bridge the divide between Garlemald and her territories, that all may be united in common cause."},{"name":"MAXIMA","text":"But we were disparaged as a radical element. Dissenters looking to destabilize the Empire from within. Many friends and even my parents perished in “unfortunate accidents.” I, too, would surely have met the same fate had I not defected."},{"name":"MAXIMA","text":"Nevertheless, I still dream of equality and peace for us all. As the world itself stands on the brink of collapse, I hold out hope that one day that dream will become reality."},{"name":"CIRINA","text":"I am glad to see you well, <span class=\"highlight\">Forename</span>. Grandmother was worried for you."},{"name":"CIRINA","text":"The night I agreed to come hither and join the contingent, the gods sent her a strange dream."},{"name":"CIRINA","text":"Two suns─one burning red, the other frozen black. Closer they circled, closer and closer, and as they danced the world fell to ruin. In blinding chaos she spied blackened silhouettes, and knew at once that one was yours."},{"name":"CIRINA","text":"Yet we knew not how to interpret this dream, save as a sign that great danger awaits. But whatever lies ahead, I will walk with you, traveler."},{"name":"LYSE","text":"It seems so long ago we were sailing across the Ruby Sea, and charging about the Azim Steppe with Cirina and the others. I'd say we're overdue for another adventure!"},{"name":"LYSE","text":"Ah, it brings back memories to see so many familiar faces. We've been through so much together. Good times and...not so good."},{"name":"LYSE","text":"I expect Garlemald will be mostly the latter, but I'd like to believe we'll look back on these days more fondly in the years to come. But for that to happen, we'll have to make it out of this alive. Don't you die on me, aye?"},{"name":"SICARD","text":"Until the Empire fell, Garleans were the only ones we was allowed to impose “tariffs” upon at sea. Weren't easy pickin's, but I made myself a pretty gil."},{"name":"SICARD","text":"Since they've been so generous to me and mine, perhaps it's time I returned the favor and gave a little somethin' back."},{"name":"ARUHNSENNA","text":"In case you were wondering, Eschiva will be staying behind to defend the Twelveswood with my sisters."},{"name":"ARUHNSENNA","text":"She was of the opinion she would make a useful addition to our contingent─and was eager to make good on her vow to accompany me as well. Which was...flattering...but ultimately, it was decided that her skills would be better put to use keeping our homeland safe. I am of course obligated to share with her every detail when I return."},{"name":"ARUHNSENNA","text":"With so many people from so many places, I'm rather out of my element."},{"name":"ARUHNSENNA","text":"Regardless, I am a Seedseer, and will endeavor to acquit myself accordingly."},{"name":"YSHTOLA","text":"Besides the delegates assembled here, the Amalj'aa and several other tribes offered to send troops of their own."},{"name":"YSHTOLA","text":"Unfortunately, due to their physiology, many would struggle simply to survive in the harsh climate of Ilsabard. They would also likely prove tempting targets for abduction by the Telophoroi..."},{"name":"YSHTOLA","text":"All things considered, they can better aid the cause by bolstering our defenses in Eorzea─though their eagerness to do more has been noted."},{"name":"YSHTOLA","text":"We few shall have to suffice. Ere we embark, we must distribute the warding scales to our comrades. Care to do the honors?"},{"name":"YSHTOLA","text":"I suspect a few of our comrades will be rather pleased to speak with you again, which is why I thought you'd be the ideal candidate."},{"name":"YSHTOLA","text":"In the meantime, I have a bone to pick with Thancred and Urianger regarding their wagging tongues..."},{"name":"LUCIA","text":"Warding scales for the Ishgardian delegation, I take it?"},{"name":"LUCIA","text":"Many thanks. These talismans may prove to be the deciding factor in the battles to come."},{"name":"LUCIA","text":"I find myself...conflicted by this foray into Garlemald. Sent by the Empire to infiltrate Ishgard, only to throw in my lot with those whose secrets I was supposed to be stealing..."},{"name":"LUCIA","text":"And now I lead a mission to save the countrymen I betrayed."},{"name":"LUCIA","text":"But that is doubtless why I was chosen by Lord Aymeric. He would have me put my extensive knowledge and former ties to good use. I will not disappoint him."},{"name":"LUCIA","text":"For the future of Ishgard, Garlemald, and the world at large, I will lead us to victory."},{"name":"ARUHNSENNA","text":"Yes?"},{"name":"ARUHNSENNA","text":"So these are the famed warding scales? Enough for me and my men, I see."},{"name":"ARUHNSENNA","text":"I myself am especially grateful for this opportunity to visit distant lands. I wish to follow in the footsteps of Master A–Towa and learn all there is to learn of this star we call home."},{"name":"ARUHNSENNA","text":"Indeed, that is the primary reason I volunteered to join the expedition. To journey outside the Twelveswood, much less enter into imperial territory, is a rare privilege afforded a Padjal."},{"name":"ARUHNSENNA","text":"Not that I'm tagging along to see the sights. The Garleans would benefit from my healing magicks, as would our comrades, should fighting break out."},{"name":"ARUHNSENNA","text":"Under normal circumstances, I would not be allowed to travel outside of the Twelveswood. The Elder Seedseer, however, has granted me special permission."},{"name":"ARUHNSENNA","text":"She has bid me lend my magicks to the people of Garlemald while learning all I can of their ways. In so doing, I will come closer to understanding myself and my place in the world...or so she says."},{"name":"ARUHNSENNA","text":"<span class=\"emphasis\">I</span> say it is past time our allies benefited from the power at a Seedseer's disposal. Some bemoan that we hide our light under a bushel, and I intend to address that criticism."},{"name":"SICARD","text":"I hear you've got somethin' for us."},{"name":"SICARD","text":"Ahh, them scales everyone's been talkin' about. Pretty little things, ain't they? Reckon they'll be worth a gil or two when this is all over, but we'll hold on to 'em for now."},{"name":"SICARD","text":"And one more thing─ I know what you're all thinkin'. “Why didn't they send Eynzahr instead?”"},{"name":"SICARD","text":"Buggered if I know. All the Admiral and Captain Hyllfyr told me was they needed someone to help “safeguard the future.” And here I am. Can't say they haven't got a sense of humor."},{"name":"SICARD","text":"'Course, some of you might be wonderin' what good a pirate is on dry land, in the middle of the soddin' snow of all places. Well, me and my crew'll do whatever needs doin', so let's set sail─or however the sayin' goes on airships."},{"name":"LYSE","text":"That a set of warding scales I spy? Not that I would know what they'd look like..."},{"name":"LYSE","text":"Wow, look at these! Even a layman like me can tell they're bursting with aether. All the better to fend off the...tempering waves? Is that the right term?"},{"name":"LYSE","text":"Anyway, these'll give us one less thing to worry about. Which just leaves the other mountain of whatever else is waiting for us in Garlemald."},{"name":"LYSE","text":"Only one way to find out, eh? And nervous or not, I'd march through all seven hells if it gave me a chance to put Zenos back in the grave where he belongs."},{"name":"CIRINA","text":"We heard it would be cold in Garlemald, so we came prepared..."},{"name":"CIRINA","text":"Oh, the talismans! We are to keep these close at all times, yes? I will see that no one misplaces theirs."},{"name":"CIRINA","text":"Ah, and before I forget, I have a message from Hien."},{"name":"CIRINA","text":"\"In distant lands, in times of strife,<br>Together, stand; together, fight,<br>In darkness shines the light of life.“"},{"name":"CIRINA","text":"...I hope I have done his words justice. Doma, like much of Othard, has been plagued by the towers. Yet while he could not be here, he wished to express his shared conviction."},{"name":"CIRINA","text":"Hien and Yugiri labor without rest to unite the people, and with their aid will we keep the enemy at bay."},{"name":"CIRINA","text":"And we of the Steppe and the Eastern alliance will repay their efforts by ending this war!"},{"name":"MAXIMA","text":"Do you have a warding scale for me, too?"},{"name":"MAXIMA","text":"Thank you for this─and for going to such incredible lengths for the sake of my people."},{"name":"MAXIMA","text":"Though I have little to offer in return, I would impart some advice, if I may. You have been told by many to ware the cold of Ilsabard, and I cannot stress enough that this is no token warning."},{"name":"MAXIMA","text":"I will be distributing specially made warming tinctures─courtesy of the Alchemists' Guild─but understand that they are no substitute for proper protection."},{"name":"MAXIMA","text":"I leave the provisioning of said protection to your discretion. Now, let us proceed to the Ala Mhigan Quarter."},{"name":"MAXIMA","text":"While you make your final preparations, I will have the pilots ready the airships."},{"name":"ALISAIE","text":"If you've anything you still need to take care of, you'd better see to it now!"},{"name":"THANCRED","text":"This coat is quite warm, but I have something rather thicker for occasions like these. There's no telling how long we'll be out in the open, and we can't go starting fires willy-nilly if we want to avoid detection."},{"name":"URIANGER","text":"Concoctions to fortify the flesh against wind and cold are commonly sold in the Ul'dahn markets─though they are of dubious provenance and efficacy."},{"name":"URIANGER","text":"'Tis said, however, that in recent days the Alchemists' Guild hath produced a tincture capable of such a feat. Mayhap the achievements of their Thavnairian counterparts did spur them to action, that they not be put to shame."},{"name":"YSHTOLA","text":"It's something of a constant refrain that we require warmer clothing. My present garb may be lacking, fur collar notwithstanding..."},{"name":"GRAHATIA","text":"Since my “revival,” I've been lax in expanding my limited wardrobe. Think we have time for a quick trip back to Old Sharlayan? I recall a rather fetching coat..."},{"name":"ESTINIEN","text":"Preparations? I've got my armor and my lance. What more could I need?"},{"name":"RESISTANCEGATEGUARD","text":"I believe the other members of the contingent are at present acquiring supplies for the journey ahead. Are you not in need of anything else?"},{"name":"ALPHINAUD","text":"This is our last chance to make ready before we set forth."},{"name":"THANCRED","text":"You needn't worry about Urianger and I. We still have what we wore in Garlemald before."},{"name":"THANCRED","text":"Estinien claims to be quite warm and toasty beneath his armor, and since he spent a fair bit of time up north recently as well, I have no reason to doubt his words."},{"name":"THANCRED","text":"Most of the others will be borrowing Grand Company stock. The rest of you could do likewise, I suppose, provided you're not overly concerned with style."},{"name":"YSHTOLA","text":"Hmm... Not to put too fine a point on it, but I wouldn't be seen dead in one of those ridiculous overcoats. If only I had time to find something to my liking..."},{"name":"TATARU","text":"(-???-)Hark! Is that the cry of Scions in need of a tailor I hear?"},{"name":"ALPHINAUD","text":"B-But how!?"},{"name":"TATARU","text":"Muahaha! I have my ways. Oh yes, indeed!"},{"name":"TATARU","text":"You thought you could sneak off to Ilsabard without telling me?"},{"name":"TATARU","text":"Ha! Nothing escapes my notice!"},{"name":"TATARU","text":"Now, you <span class=\"emphasis\">will</span> wear these garments I've made for you whether you like it or not!"},{"name":"GRAHATIA","text":"You never cease to amaze!"},{"name":"GRAHATIA","text":"But...why do you need a new outfit as well? Wait─are you coming with us!?"},{"name":"TATARU","text":"What? No. Of course not, silly. It's all in the name of fashion! Rather, the pursuit of the highest quality fashion! Besides, how can I expect others to wear my creations if I've never worn them myself?"},{"name":"TATARU","text":"Ah, I did have one other thing to share."},{"name":"TATARU","text":"Aergmhus and Bluomwyda have finally returned from assignments in faraway lands!"},{"name":"TATARU","text":"They'll be staying at the Rising Stones for a while, to keep an eye on events throughout Eorzea."},{"name":"TATARU","text":"Since they'll be running things back at headquarters...I was wondering...if I could lend a hand...in Sharlayan?"},{"name":"YSHTOLA","text":"Oh, why not. You can keep Krile company in the Baldesion Annex."},{"name":"ALISAIE","text":"Yes, we'd love to have you there. And I heard Aergmhus and Bluomwyda did a fine job carrying on in our stead while we were lying comatose. With them in charge of the Rising Stones, we've nothing to worry about."},{"name":"TATARU","text":"My thoughts exactly! Also, while I'm confident you won't go collapsing again (because a certain someone who shall remain nameless isn't in a position to transport your souls to another world), if anything similarly disastrous <span class=\"emphasis\">were</span> to happen, I'll be well positioned to do something about it."},{"name":"TATARU","text":"Anyway, I've got a few things to take care of, and then I'll make my way to Sharlayan..."},{"name":"TATARU","text":"I really do hope these new clothes are enough to keep you warm in Garlemald."},{"name":"TATARU","text":"It's not much, but it's the only thing I can do for you, other than pray for your safe return. Which I will. Every day..."},{"name":"ALPHINAUD","text":"Let's not keep the contingent waiting any longer."},{"name":"TATARU","text":"Here are your winter woolies, handcrafted by yours truly!"}],"reward":{"gil":1071,"items":[{"id":35851}]},"reqs":{"jobs":[{"lvl":82,"id":142}],"quests":[69917]},"next":[69919]},"partials":[{"type":"npc","id":"1038802","obj":{"i":1038802,"n":"Maxima","l":2408,"q":1}},{"type":"npc","id":"1038817","obj":{"i":1038817,"n":"Alphinaud","l":2408,"q":1}},{"type":"item","id":"35851","obj":{"i":35851,"n":"Northsea Coat","l":1,"c":43967,"t":35,"p":100}},{"type":"quest","id":"69917","obj":{"i":69917,"n":"A Capital Idea","g":11,"l":"Old Sharlayan","s":535}},{"type":"quest","id":"69919","obj":{"i":69919,"n":"A Frosty Reception","g":11,"l":"The Lochs","s":537}}]}