{"quest":{"name":"Personae non Gratae","location":"Garlemald","id":69925,"patch":6.0,"sort":543,"eventIcon":71201,"issuer":1039896,"target":1039896,"genre":11,"journal":["Jullus has his orders, unpleasant though they may be."],"objectives":["Gather information in Tertium.","Speak with Alphinaud.","Assist Flavius.","Speak with Alphinaud.","Speak with Jullus."],"dialogue":[{"name":"ALPHINAUD","text":"It will take more than a trifle such as this to deter us."},{"name":"ALPHINAUD","text":"Compared to what Garlemald's people have suffered in recent days, these collars are a minor inconvenience."},{"name":"ALISAIE","text":"I have to remind myself not to touch it, even if it starts to itch. I'd rather not set if off by accident..."},{"name":"ALISAIE","text":"...Anyway, enough about that. Let's learn what we can from the refugees."},{"name":"JULLUS","text":"As per Lord Quintus's instructions, I am to supervise you during your time here in Tertium."},{"name":"JULLUS","text":"Before you ask, no I don't have a key or any other means to remove your collars. Nor would I tell you if I did. And if you try anything, you'll soon wish you hadn't."},{"name":"JULLUS","text":"So, do you truly intend to speak with the others, or was that merely a ruse?"},{"name":"ALPHINAUD","text":"We're in no hurry to disobey Lord Quintus, if that's what you mean. Or perhaps you doubt the wisdom of his decision?"},{"name":"JULLUS","text":"...Do as you will. But remember, I'll be watching."},{"name":"JULLUS","text":"If I catch wind of you doing anything untoward─trying to trick our people into turning their coats and the like─those shock collars will be the least of your worries. Understood?"},{"name":"ALISAIE","text":"Though we're somewhat compromised, to put it lightly, let's not waste this opportunity. I suggest splitting up and learning what we can of their situation. And above all else, don't use magicks of any sort."},{"name":"JULLUS","text":"You, on the other hand, may go wheresoever you wish. Even outside the camp. I know full well I couldn't stop you if I tried."},{"name":"JULLUS","text":"But do not forget, if you do <span class=\"emphasis\">anything</span> to endanger us or our interests, Alphinaud and Alisaie will pay the price."},{"name":"ALPHINAUD","text":"Is there aught we may do to ease your woes?"},{"name":"ALISAIE","text":"So cold...and probably hasn't had a proper meal in days."},{"name":"ALISAIE","text":"If only we'd brought some food with us. But perhaps I could use a little magic to─ No, I mustn't. Gods, this is so frustrating..."},{"name":"JULLUS","text":"You heard what I said. Don't make me repeat myself."},{"name":"SABINIANUS","text":"S-So...c-c-cold..."},{"name":"SYSTEM","text":"This young soldier is on the verge of losing consciousness."},{"name":"SABINIANUS","text":"..."},{"name":"CAESO","text":"You came with Jullus, didn't you? Well, whatever business brought you here, you'd best keep your hands off that aetheryte. It's deactivated, but I'd rather you didn't mess about with it."},{"name":"CAESO","text":"There are others throughout the city. Built by Garleans─<span class=\"emphasis\">for</span> Garleans. Could teleport all over in the blink of an eye, provided there was a terminal nearby."},{"name":"CAESO","text":"These days, however, we use the aetheryte's power to keep this place lit, though that comes at the cost of its normal function."},{"name":"CAESO","text":"My expertise in maintaining magitek weaponry isn't exactly applicable to the machina you'll find here, but I'll see if I can get this aetheryte working again. Anything to keep busy..."},{"name":"MARCELLINUS","text":"I know who you are. The so-called champion of Eorzea. Come to gloat, have you!?"},{"name":"MARCELLINUS","text":"I'll wipe that smirk off your face... By the blood of our fallen compatriots, I swear I'll─ Ugh!"},{"name":"MARCELLINUS","text":"Damn... Tore the sutures..."},{"name":"MARCELLINUS","text":"Of all the times... The worst of the lot within striking distance and I can't even muster the strength..."},{"name":"MARCELLINUS","text":"If it weren't for the IIIrd bleeding us, we'd be the end of you..."},{"name":"MARCELLINUS","text":"Vergilia's treachery nearly cost Lord Quintus his life, but we made our escape. Took shelter in a mansion─tended to the wounded as we prepared to strike back─and then..."},{"name":"MARCELLINUS","text":"Night fell and we gathered around the radio...then the roar, the terrible roar. The capital was in chaos, but we were spared..."},{"name":"MARCELLINUS","text":"...If you can call this a mercy. Mind intact, but body broken. A soldier in name alone."},{"name":"MARCELLINUS","text":"I'd cut you down where you stand if I could. Murderer..."},{"name":"MARCELLINUS","text":"How it must pain Lord Quintus to see our proud legion reduced to this. My suffering, my regrets─they are nothing compared to his."},{"name":"OCTAVIA","text":"It's you! <span class=\"highlight\">Forename Surname</span>!"},{"name":"OCTAVIA","text":"I-I served under Lord Gaius in the XIVth Legion. I was there on the night the Praetorium fell..."},{"name":"OCTAVIA","text":"You and your adventurers... You killed them. My comrades, my friends... Swept them aside in their dozens, as though they were nothing to you..."},{"name":"OCTAVIA","text":"...And maybe I am too. Just another faceless enemy to be cut down. But it won't be long until our countrymen return─until you get what you deserve. Mark my words!"},{"name":"OCTAVIA","text":"I was ready to abandon all hope...until I saw you. <span class=\"emphasis\">You</span>... Soon, very soon, we'll make you pay for every life you've taken!"},{"name":"SYSTEM","text":"This radio is the same model as the one used at Victors' Spoils. Perhaps it is what saved the soldiers here from being tempered..."},{"name":"ALPHINAUD","text":"Did you learn anything of note?"},{"name":"ALPHINAUD","text":"Then your findings are consistent with my own. Their plight is desperate indeed."},{"name":"ALPHINAUD","text":"The sick and injured are at greatest risk. Without warmth and proper nutrition, I fear they will soon perish."},{"name":"ALPHINAUD","text":"I realize there is precious little we can do for them at present, but I cannot bear to see them suffer."},{"name":"ALPHINAUD","text":"Please, will you help me tend to them?"},{"name":"ALPHINAUD","text":"There are several people in the next carriage I have yet to speak with. Could you start there?"},{"name":"FLAVIUS","text":"Who's there? My eyes, they... I can't see all that well..."},{"name":"FLAVIUS","text":"Aaah... Thank you. The numbness has subsided a little."},{"name":"FLAVIUS","text":"But I know...I won't last much longer. You should look to the others who can still fight. Give them my ration..."},{"name":"FLAVIUS","text":"If me going hungry means someone else lives to see another day, so be it. Least I can still serve in that way..."},{"name":"FLAVIUS","text":"Would...would you stay with me a little longer...? Hold my hand... Yours are so much warmer..."},{"name":"ALPHINAUD","text":"So those you met fare no better? I was afraid you would say that."},{"name":"ALPHINAUD","text":"I know we were warned against meddling in their affairs, but we can't leave them like this. Perhaps we might gain permission to have the contingent deliver supplies?"},{"name":"ALPHINAUD","text":"Quintus may have made his feelings on the matter quite clear, but even he must recognize they are not in a position to refuse help..."},{"name":"ALPHINAUD","text":"Maybe Jullus could persuade him? Though we'd need to persuade Jullus first..."},{"name":"ALPHINAUD","text":"Just a little more..."},{"name":"JULLUS","text":"Well? Seen enough?"},{"name":"ALPHINAUD","text":"Jullus, the people here have barely enough food and fuel to survive. Have you and the other soldiers been able to procure any more supplies?"},{"name":"JULLUS","text":"We've been scavenging provisions from the nearby houses, as most families keep─kept, rather─some stored away in the event they were snowed in."},{"name":"JULLUS","text":"Still, going out and getting it is dangerous work, and we've a lot of mouths to feed."},{"name":"JULLUS","text":"Fuel is the greater concern, though. We had some ceruleum set aside...until it was stolen."},{"name":"JULLUS","text":"We haven't identified the culprit. Could've been other refugees, or one of the afflicted for all we know."},{"name":"JULLUS","text":"Either way, we're down to the last dregs. Without the heating they need, those in poor health are only going to get worse instead of better..."},{"name":"ALISAIE","text":"If it's ceruleum you need, our contingent has secured a ready supply. We can have some sent over!"},{"name":"JULLUS","text":"We will not accept your charity."},{"name":"JULLUS","text":"If we can hold on a little longer, the situation is sure to change. Aye─everything will change..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"One of your comrades mentioned something along those lines."},{"name":"A1","text":"Those mysterious countrymen of yours, I assume?"},{"name":"JULLUS","text":"Heard something of it, have you? Well. From what I've seen, there's little you could do to interfere, so there's no harm in telling you."},{"name":"JULLUS","text":"One of our scouts spotted a hooded man issuing instructions to the afflicted─or in the bastard's words, “loyal servants of the Telophoroi.”"},{"name":"JULLUS","text":"Then, he made his way inside the imperial palace─or what stands in its place."},{"name":"JULLUS","text":"We'd identified the seat of the enemy's power, we realized. Lord Quintus dispatched a messenger to the Xth Legion saying as much, and instructing them to join forces with the provincial legions. To prepare for a combined assault on the Telophoroi."},{"name":"JULLUS","text":"Once our allies arrive, your contingent will be sent running for the hills. Then, we shall reclaim the capital by our own hand!"},{"name":"ALPHINAUD","text":"And how do you intend to survive in the meantime? At this rate, many of your countrymen will perish long before reinforcements reach Garlemald."},{"name":"ALPHINAUD","text":"They need help <span class=\"emphasis\">now</span>. Say the word, and we will bring you ceruleum."},{"name":"JULLUS","text":"...I will speak with Lord Quintus."},{"name":"ALISAIE","text":"So? Did he agree to it?"},{"name":"JULLUS","text":"No. He will not place Garlemald in the debt of her enemies."},{"name":"JULLUS","text":"I have, however, been ordered to search for ceruleum outside. As you are under my watch, you will come with me."},{"name":"ALPHINAUD","text":"Very well. After all, many hands make light work."},{"name":"JULLUS","text":"&lt;sigh&gt; You lot are more trouble than you're worth."},{"name":"JULLUS","text":"Once we are outside, you will follow my instructions to the letter. We depart shortly."}],"reward":{"gil":949},"reqs":{"jobs":[{"lvl":82,"id":142}],"quests":[69924]},"next":[69926]},"partials":[{"type":"npc","id":"1039896","obj":{"i":1039896,"n":"Jullus","l":3710,"q":2}},{"type":"quest","id":"69924","obj":{"i":69924,"n":"The Last Bastion","g":11,"l":"Garlemald","s":542}},{"type":"quest","id":"69926","obj":{"i":69926,"n":"His Park Materials","g":11,"l":"Garlemald","s":544}}]}