{"quest":{"name":"No Good Deed","location":"Garlemald","id":69927,"patch":6.0,"sort":545,"eventIcon":71201,"issuer":1038789,"target":1039913,"genre":11,"journal":["Now that the fire has burned out, Jullus is ready to move on."],"objectives":["Speak with Jullus.","Use a Ist Legion incendiary #37 on the destroyed magitek armor to retrieve a ceruleum tank.","Deliver the warmachina ceruleum tank to Jullus.","Wait at the designated location.","Speak with Jullus."],"dialogue":[{"name":"ALPHINAUD","text":"Owing to the wealth of experience I've accrued in gathering firewood, I was even able to provide Jullus with some basic pointers on the subject. I thought it might help to further build a rapport...and to distract him from his other concerns."},{"name":"ALISAIE","text":"Well, at least my clothes are finally dry. Though they could still do with a proper wash."},{"name":"JULLUS","text":"All right, now that you've recovered from your escapades in the pond, there's another location I'd like to search, just outside the park."},{"name":"ALPHINAUD","text":"The warmachina appears to be patrolling the area of its own volition. I wonder whether it is simply following its original orders, or if it now serves the Telophoroi..."},{"name":"ALISAIE","text":"Everything was built on an enormous scale, and with thick, cleanly cut stone─much like Amaurot. Given what we now know, such similarities are no coincidence."},{"name":"JULLUS","text":"As you can see, this place is littered with the remnants of various types of warmachina."},{"name":"JULLUS","text":"While my comrades and I have already recovered the tanks from the less-damaged units, those that took a more severe beating are harder to scavenge. We decided to save those for another time─that time being now."},{"name":"JULLUS","text":"Rather than prise them apart, piece by piece, it would be quicker to remove the outer casing using compact explosives. With luck, we'll gain access to the tanks without rupturing them."},{"name":"JULLUS","text":"Though the force generated by these devices is relatively weak, I would advise you stand well clear to avoid being hit by any shrapnel."},{"name":"JULLUS","text":"Before even bothering, though, you should check the machina's ceruleum gauge to see if there is any left. It should still provide an accurate reading even when the unit itself is inactive."},{"name":"JULLUS","text":"If the gauge is broken... I'll let you decide whether to use an explosive or not. Should you need more, come to me."},{"name":"ALPHINAUD","text":"Understood. Let's get to work."},{"name":"JULLUS","text":"You still have the explosives I gave you, yes?"},{"name":"JULLUS","text":"Remember to check the ceruleum gauge before attempting to remove the outer casing."},{"name":"JULLUS","text":"If the gauge has been damaged and you can't determine if there's any fuel left to recover, use your best judgment."},{"name":"JULLUS","text":"Need some more? Here."},{"name":"JULLUS","text":"I've a fair amount of explosives to spare today, but tomorrow is another story. We can't afford to waste them on units with nothing to offer, so be sure to check the gauge first."},{"name":"JULLUS","text":"Of course, if the gauge is damaged, it's up to you to make the call."},{"name":"SYSTEM","text":"According to the ceruleum gauge, this unit's fuel tank is empty."},{"name":"SYSTEM","text":"After successfully removing the warmachina's outer casing and retrieving the ceruleum tank, you find it to be completely empty..."},{"name":"SYSTEM","text":"The ceruleum gauge on this unit appears to have been broken, giving you no way to determine how much fuel its tank may hold..."},{"name":"SYSTEM","text":"After successfully removing the warmachina's outer casing and retrieving the ceruleum tank, you find it to be completely empty..."},{"name":"SYSTEM","text":"The ceruleum gauge on this unit appears to have been broken, giving you no way to determine how much fuel its tank may hold..."},{"name":"SYSTEM","text":"You retrieve the warmachina's ceruleum tank to find...it is still half-full! Or half-empty, depending on one's perspective. Either way, Jullus will surely be pleased by your discovery."},{"name":"SYSTEM","text":"You need to ask Jullus for more explosives."},{"name":"JULLUS","text":"More explosives? ...Wait, is that what I think it is?"},{"name":"JULLUS","text":"You've done it again! Truly, luck is on your side."},{"name":"JULLUS","text":"With this, we should be able to refuel quite a few of our heaters."},{"name":"JULLUS","text":"It's time we headed back. Wait here while I go and see how Alisaie and Alphinaud are faring."},{"name":"MARCELLINUS","text":"Why are you here? To laugh at our misfortune!?"},{"name":"JULLUS","text":"Alphinaud and Alisaie will be fine...providing they do not resist."}],"reward":{"gil":1038},"reqs":{"jobs":[{"lvl":83,"id":142}],"quests":[69926]},"next":[69928]},"partials":[{"type":"npc","id":"1038789","obj":{"i":1038789,"n":"Jullus","l":3710,"q":1}},{"type":"npc","id":"1039913","obj":{"i":1039913,"n":"Jullus","l":3710,"q":2}},{"type":"quest","id":"69926","obj":{"i":69926,"n":"His Park Materials","g":11,"l":"Garlemald","s":544}},{"type":"quest","id":"69928","obj":{"i":69928,"n":"Alea Iacta Est","g":11,"l":"Garlemald","s":546}}]}