{"quest":{"name":"His Park Materials","location":"Garlemald","id":69926,"patch":6.0,"sort":544,"eventIcon":71201,"issuer":1039896,"target":1039906,"genre":11,"journal":["Jullus finds himself in the somewhat bizarre position of leading ambassadors of an enemy contingent on a salvage mission."],"objectives":["Speak with Alisaie.","Search for ceruleum in Forum Solius.","Speak with Jullus.","Search for ceruleum at the designated location.","Deliver the temperature regulator ceruleum tank to Jullus."],"dialogue":[{"name":"ALPHINAUD","text":"Although this is hardly the solution we had in mind, it will have to suffice for the time being."},{"name":"ALISAIE","text":"Without our healing magicks, there's little we can do for these people beyond offer words of encouragement. But this way we'll be able to offer them tangible assistance."},{"name":"JULLUS","text":"We will begin our search for ceruleum in Regio Urbanissima."},{"name":"JULLUS","text":"The first location is Forum Solius, a park to the northwest of this station."},{"name":"JULLUS","text":"You are to remain close at all times and act only as ordered. Follow me."},{"name":"ALPHINAUD","text":"To think this macabre graveyard for warmachina was once a park..."},{"name":"JULLUS","text":"This is the place."},{"name":"ALISAIE","text":"So, this is the park... I'm surprised they found space for one amongst all these buildings."},{"name":"JULLUS","text":"Actually, the recreational areas came first. The houses were later built around them."},{"name":"JULLUS","text":"\"A healthy society requires communal spaces for children to play, and adults to socialize.“"},{"name":"JULLUS","text":"This park was named after the founding father of the Empire, the great Solus zos Galvus."},{"name":"ALPHINAUD","text":"Did we come to extract ceruleum from the wrecked magitek armor?"},{"name":"JULLUS","text":"No, we've already drained it dry. Same goes for the rest of the machina in the vicinity."},{"name":"JULLUS","text":"But as our ceruleum has been stolen, we must scour the city for every last drop."},{"name":"JULLUS","text":"And while I don't expect to find anything here, I've decided to try one more time, in case something has been overlooked."},{"name":"ALPHINAUD","text":"I see. Then with your permission, we will commence the search."},{"name":"ALPHINAUD","text":"I don't imagine there would be much need for magitek in a park of all places, but then again, I wasn't raised in Garlemald. They may have uses for ceruleum that I've yet to consider."},{"name":"ALISAIE","text":"This...whatever-it-is appears to have some sort of symbolic meaning relating to this park. Even though the place is named after Solus, it doesn't seem to be a statue of him. Well, at least not anymore."},{"name":"ALISAIE","text":"Maybe it was once a fountain? Or somewhere the man himself used to sit? Not that it would matter, even if we knew, but I can't help wondering."},{"name":"JULLUS","text":"..."},{"name":"SYSTEM","text":"Jullus ignores you as he stares at the water in silence, as if searching for something he knows has gone and will never return..."},{"name":"SYSTEM","text":"Though rather small by Garlean standards, the structure is reminiscent of a merchant's stall. Perhaps it was built for children to play at shopkeeper."},{"name":"SYSTEM","text":"There is nothing inside resembling magitek or any other devices that would be fueled by ceruleum..."},{"name":"SYSTEM","text":"Several points of interest are marked on the map of Forum Solius. The pond, children's play areas... To your knowledge, however, none would require the use of ceruleum."},{"name":"SYSTEM","text":"A cursory inspection of the wrecked magitek armor confirms that the fuel canisters have long since been drained of ceruleum, as Jullus said."},{"name":"SYSTEM","text":"The contraption is built in the style of imperial warmachina armed with a battery of weapons and capable of transforming into different configurations...but on closer inspection, it appears to be no more than a children's slide."},{"name":"JULLUS","text":"Oh, it's you. Any luck?"},{"name":"ALPHINAUD","text":"There's no sign of any ceruleum."},{"name":"JULLUS","text":"Hmm... Hardly surprising, but disappointing nonetheless."},{"name":"ALISAIE","text":"I couldn't help noticing you gazing at the pond. Is something the matter?"},{"name":"JULLUS","text":"What? Yes─ I mean, no, I'm..."},{"name":"JULLUS","text":"It's just...I used to bring my brother and sister here to play."},{"name":"JULLUS","text":"The pond was heated to stop it from freezing over, so like all the other children, they just had to wade in and splash about. Would've stayed there if I didn't drag them out. We'd be sopping wet when all was said and done. Every time."},{"name":"JULLUS","text":"And every time, when we'd get home, Mother would scold us, saying we'd catch our death walking around like that..."},{"name":"ALPHINAUD","text":"The pond was heated..."},{"name":"ALPHINAUD","text":"With a ceruleum-powered heater, by chance?"},{"name":"JULLUS","text":"I suppose it must have been... Come to think of it, I remember seeing engineers changing out a tank beneath a hatch..."},{"name":"JULLUS","text":"But that was a long time ago, when the water still flowed clear and wasn't this...brackish muck."},{"name":"JULLUS","text":"We can't see a thing, and I can't remember where the hatch might be."},{"name":"JULLUS","text":"With the machinery most likely broken, the amount of filth in there is probably the only reason it hasn't frozen over. I'd wager it's still unbearably cold, though."},{"name":"ALISAIE","text":"Jullus...what are your thoughts on magic?"},{"name":"JULLUS","text":"The average Garlean would jump out of their skin if they saw it. But the Ist has a few foreign signiferi and medici, so it doesn't scare me."},{"name":"ALISAIE","text":"Then I take it you won't mind if I employ a little now."},{"name":"ALISAIE","text":"Alphinaud, as you have a knack for finding dry wood, why don't you bring me some? Once that's done, a blast of Verfire should do the trick."},{"name":"ALPHINAUD","text":"Leave it to me!"},{"name":"JULLUS","text":"You're not planning to go in there, are you?"},{"name":"ALISAIE","text":"Of course I am. That tank isn't going to fetch itself."},{"name":"ALISAIE","text":"It's nothing so involved as extracting unprocessed ceruleum from a frozen lake like how the tappers do it. We're talking about a shallow pond in a park. And we have a way of warming ourselves up after."},{"name":"JULLUS","text":"But that's...insane!"},{"name":"ALISAIE","text":"So, fancy a dip?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"A little friendly competition might make things interesting..."},{"name":"A1","text":"The last thing we need is you catching a cold."},{"name":"A1","text":"Step aside while I drink the pond dry! That way, we'll find it in no time!"},{"name":"ALISAIE","text":"Last one to find a ceruleum tank is a rotten egg! Though I daresay we'll both <span class=\"emphasis\">smell</span> like rotten eggs when this is over..."},{"name":"ALISAIE","text":"If you're that concerned for my well-being, you can dive in and help me look! The quicker we find that ceruleum, the sooner we can get out of here."},{"name":"ALISAIE","text":"That may be the stupidest thing I've heard in a while! And that's saying something considering who my brother is."},{"name":"ALISAIE","text":"I can't fault your enthusiasm, though. Let's do it my way first, and if that doesn't work...perhaps <span class=\"emphasis\">then</span> you can try your method. With Alphinaud's help."},{"name":"ALISAIE","text":"G-G-Gods be good, it's cold! Perhaps we sh-sh-should've listened to Jullus after all!"},{"name":"JULLUS","text":"I can't believe what I'm seeing..."},{"name":"SYSTEM","text":"You delve into the murky water but come up empty-handed. To add injury to insult, the icy wind on your damp clothing chills you to the bone..."},{"name":"SYSTEM","text":"Beneath the water, your fingers catch on what you think might be a handle..."},{"name":"SYSTEM","text":"You open the hatch and retrieve a ceruleum tank!"},{"name":"SYSTEM","text":"However, your grand discovery comes at great personal cost, as you become acutely aware of the freezing cold and a rancid odor emanating from every ilm of your body. Jullus will doubtless feel compelled to pinch his nose shut when you deliver to him your prize..."},{"name":"ALISAIE","text":"You f-f-found it!? Hmph! There must be another one around here s-s-somewhere!"},{"name":"JULLUS","text":"Did you find anything? &lt;sniff&gt; &lt;sniff&gt; I hope you did..."},{"name":"JULLUS","text":"That's it!"},{"name":"JULLUS","text":"And there's still some ceruleum left!"},{"name":"JULLUS","text":"Ah, the fire's still not ready... Hold on, I'll give Alphinaud a hand!"},{"name":"ALISAIE","text":"Call me an Ul'dahn because by fire I am reborn...and my clothes are mostly dry now, too."},{"name":"JULLUS","text":"I appreciate you recovering the ceruleum, but I wish you'd taken the time to discuss the plan with me beforehand."},{"name":"JULLUS","text":"Despite the way you've been treated, in Lord Quintus's eyes, you're still envoys deserving of protection. If you were to die on my watch, he would be most displeased."},{"name":"ALISAIE","text":"Your concern is duly noted, but all's well that ends well."},{"name":"ALPHINAUD","text":"Jullus, you mentioned coming here with your younger siblings. Did you grow up in Garlemald?"},{"name":"JULLUS","text":"I did. Not far from here."},{"name":"JULLUS","text":"My father was an accomplished researcher in his youth, and for his contributions to the Empire awarded an estate. We lived well─better than many."},{"name":"ALISAIE","text":"What was Garlemald like in those days?"},{"name":"JULLUS","text":"...Everything. It was everything you could imagine...and so much more."},{"name":"JULLUS","text":"Even during the coldest winters, we always found warmth and comfort at home."},{"name":"JULLUS","text":"Coming in from the snow, taking off your coat and sitting down for a hot meal...with family..."},{"name":"JULLUS","text":"Visiting friends and relatives, receiving that same welcome. Knowing they had everything they needed."},{"name":"JULLUS","text":"Walking down the street, seeing the lights in all the houses, hearing the faint sounds of laughter and song. Of happiness..."},{"name":"JULLUS","text":"And although the summers came and went all too quickly, in that brief respite, the ice would melt and the forgotten grass make its triumphant return."},{"name":"JULLUS","text":"Grey clouds gave way to blue skies. Some mornings, we'd climb to the top of the tallest building we could find to watch the sun rise..."},{"name":"JULLUS","text":"...Never again. Those rooftops are rubble. Those friends dead, and those memories... But if I could reclaim even a fraction of what we once had..."},{"name":"JULLUS","text":"Soon, our chance will come. We just need to hold on a little longer..."}],"reward":{"gil":1079,"items":[{"id":35679}]},"reqs":{"jobs":[{"lvl":83,"id":142}],"quests":[69925]},"next":[69927]},"partials":[{"type":"npc","id":"1039896","obj":{"i":1039896,"n":"Jullus","l":3710,"q":2}},{"type":"npc","id":"1039906","obj":{"i":1039906,"n":"Jullus","l":3710,"q":1}},{"type":"item","id":"35679","obj":{"i":35679,"n":"Pewter Hand Gear Coffer (IL 525)","l":1,"c":26560,"t":61}},{"type":"quest","id":"69925","obj":{"i":69925,"n":"Personae non Gratae","g":11,"l":"Garlemald","s":543}},{"type":"quest","id":"69927","obj":{"i":69927,"n":"No Good Deed","g":11,"l":"Garlemald","s":545}}]}