{"quest":{"name":"At the End of the Trail","location":"Garlemald","id":69922,"patch":6.0,"sort":540,"eventIcon":71201,"issuer":1037712,"target":1038867,"genre":11,"journal":["Jareck is amenable to making a deal."],"objectives":["Speak with Alisaie.","Search for Alphinaud.","Speak with Alisaie.","Speak with Alisaie again.","Search for hints as to Licinia and her sister's whereabouts.","Search for Licinia.","Speak with Alisaie."],"dialogue":[{"name":"ALISAIE","text":"The fire we built at Victors' Spoils won't last forever, and it's too dangerous for Licinia and the others to search for more kindling. If we can get them some ceruleum, that'll be one less thing for them to worry about...for a time, at least."},{"name":"JARECK","text":"So, you've come seeking ceruleum, have you?"},{"name":"JARECK","text":"What!? Those purebloods up at Victors' Spoils sent you?"},{"name":"JARECK","text":"To turn to their enemies for help...they must be more desperate than I'd thought. Then again, Licinia's got her little sister to think about..."},{"name":"ALISAIE","text":"A sister? But we only saw Licinia and three men."},{"name":"JARECK","text":"It's possible she died from whatever was ailing her. If she needed treatment, I doubt there'd be any way to get it around here."},{"name":"JARECK","text":"I may have refused Licinia at first─thinking she'd come back with something to exchange─but I can spare them a bottle's worth of ceruleum."},{"name":"JARECK","text":"Consider it a reward for introducing me to the rest of your contingent. Be sure to send them our way, you hear?"},{"name":"ALISAIE","text":"I can't for the life of me think why Licinia would keep her sister a secret from us, but we can ask about that after we've delivered this ceruleum. Come on, let's hurry back!"},{"name":"JARECK","text":"I don't know the details, but she mentioned a sister three years her junior who's in poor health. That being the case, I thought her people would be willing to cough up some supplies in exchange for ceruleum...but maybe they didn't have anything after all."},{"name":"ALISAIE","text":"This isn't right. It's too quiet..."},{"name":"ALISAIE","text":"I would've thought Alphinaud would still be treating them by the fire...but they're nowhere to be seen."},{"name":"ALISAIE","text":"I'll look inside the house, while you search outside. They can't have gone far!"},{"name":"WEAKENEDGARLEAN","text":"Ungh... Damn it... Damn it all!"},{"name":"ALPHINAUD","text":"They asked me...asked me to help carry supplies...but when I followed them back here...they attacked me."},{"name":"ALPHINAUD","text":"Caught me off guard... Forced me...to defend myself. I fear they fared rather worse than me..."},{"name":"WEAKENEDGARLEAN","text":"You can't fool us. We know...we know what you're about!"},{"name":"WEAKENEDGARLEAN","text":"Vultures, that's what you are! Waiting in the wings for us to show weakness, then in you swoop!"},{"name":"WEAKENEDGARLEAN","text":"Here to help? What rot! All a ploy...to make us lower our guard..."},{"name":"WEAKENEDGARLEAN","text":"Let you in...put ourselves at your mercy... Put us in chains, steal our lands...get your revenge..."},{"name":"ALPHINAUD","text":"You're wrong... That's not what any of us want."},{"name":"ALISAIE","text":"Save the arguments for later, we've got bigger problems!"},{"name":"ALISAIE","text":"I found empty medicine bottles and a bed that was still warm."},{"name":"ALISAIE","text":"It's true─ Licinia was hiding her sick sister inside the house!"},{"name":"ALISAIE","text":"But now...there's no sign of either of them."},{"name":"ALISAIE","text":"Where are they? Where did they go!?"},{"name":"WEAKENEDGARLEAN","text":"Away from you and yours. And if you think I'll tell you, you're a fool. I'd never give up my people!"},{"name":"ALISAIE","text":"We're trying to help them, you idiot!"},{"name":"ALISAIE","text":"Her sister's ill─the empty bottles prove it. So the medicine ran out, or she put it in her pockets to make it easier to carry..."},{"name":"ALISAIE","text":"...or to avoid the sound of clinking glass."},{"name":"ALISAIE","text":"There are beasts everywhere─ How could you let them go alone!?"},{"name":"WEAKENEDGARLEAN","text":"To protect them from you!"},{"name":"WEAKENEDGARLEAN","text":"You invade our homeland...taint it with the same sorcery used to slay our countrymen... A Garlean should sooner die than suffer the insult!"},{"name":"WEAKENEDGARLEAN","text":"Better for them to flee...keep their purity intact...than be corrupted by your vile magicks!"},{"name":"WEAKENEDGARLEAN","text":"We were waiting...waiting for a chance to free them...since the moment you arrived..."},{"name":"ALPHINAUD","text":"This is getting us nowhere."},{"name":"ALPHINAUD","text":"I cannot say how Licinia and her sister will react when we find them, but find them we must."},{"name":"ALPHINAUD","text":"Go on without me, both of you. I first need to tend to my injuries...and theirs. I will join you in the search after."},{"name":"ALISAIE","text":"...All right. Be careful."},{"name":"ALISAIE","text":"We'll do our best to find them quickly."},{"name":"ALISAIE","text":"There's only one path out of here, so that's where we'll start."},{"name":"ALPHINAUD","text":"I will follow as soon as I can. After I've given them some basic treatment, I'll take the men inside the house and use a light sleeping enchantment to help them rest─and ensure that they don't cause any more trouble."},{"name":"ALPHINAUD","text":"I'm sorry...but this is something I must do."},{"name":"WEAKENEDGARLEAN","text":"Rob us of our lands...rob us of our pride... No, no─I'll not allow it..."},{"name":"WEAKENEDGARLEAN","text":"Better to die free than live in servitude and shame. The girls...the girls'd say the same..."},{"name":"ALISAIE","text":"Two sets of fresh footprints... Young women, judging by the size."},{"name":"ALISAIE","text":"This is definitely them. Come on."},{"name":"ALISAIE","text":"The trail stops at the frozen lake. Perhaps they chose this route so as not to leave footprints."},{"name":"ALISAIE","text":"I can't think of any other reason. Look at this place─it's crawling with beasts, and I can only imagine how hard it must be for her ailing sister to cross the ice."},{"name":"ALISAIE","text":"We could really do with Alphinaud's help, but we can't afford to wait for him. Let's split up and look for clues."},{"name":"SYSTEM","text":"The empty bottle smells faintly of alcohol. The thin coating of dirt indicates it has been here for some time, and is unlikely to have any connection to Licinia or her sister..."},{"name":"SYSTEM","text":"The wet paper half-buried in the snow appears to be a flyer for a theater group, though the run of shows advertised has long since ended..."},{"name":"SYSTEM","text":"The blood staining the snow appears to be fresh. Judging by the amount, the victim may have been severely wounded..."},{"name":"SYSTEM","text":"The trail of blood leads southeastwards..."},{"name":"SYSTEM","text":"...The two bodies are already cold."},{"name":"ALPHINAUD","text":"..."},{"name":"ALISAIE","text":"There must've been <span class=\"emphasis\">something</span> we could've done... But what?"},{"name":"ALISAIE","text":"...Should we have never come here? Would they still be alive if we hadn't?"}],"reward":{"gil":1234},"reqs":{"jobs":[{"lvl":82,"id":142}],"quests":[69921]},"next":[69923]},"partials":[{"type":"npc","id":"1037712","obj":{"i":1037712,"n":"Jareck","l":3710,"q":1}},{"type":"npc","id":"1038867","obj":{"i":1038867,"n":"Alisaie","l":3710,"q":1}},{"type":"quest","id":"69921","obj":{"i":69921,"n":"How the Mighty Are Fallen","g":11,"l":"Garlemald","s":539}},{"type":"quest","id":"69923","obj":{"i":69923,"n":"A Way Forward","g":11,"l":"Garlemald","s":541}}]}