{"quest":{"name":"Tracks in the Snow","location":"Garlemald","id":69920,"patch":6.0,"sort":538,"eventIcon":71201,"issuer":1038839,"target":1038846,"genre":11,"journal":["Emmanellain is, as usual, milling about aimlessly."],"objectives":["Speak with Emmanellain.","Search for footprints in the snow.","Search for more footprints in the snow.","Speak with Alisaie.","Survey the designated location.","Approach the girl in green.","Speak with the girl in green."],"dialogue":[{"name":"ALPHINAUD","text":"I've never thought myself much of an explorer, though I suppose my adventures have taken me to all sorts of strange and distant places. With that in mind, traversing an ice field should be a simple feat!"},{"name":"ALISAIE","text":"So, it's into the Eblan Rime we go. But where do we even start looking in such a place?"},{"name":"EMMANELLAIN","text":"What ho, chums! Been given something to do, have you? As it happens, I too have been ordered to <span class=\"emphasis\">make myself useful</span>!"},{"name":"ALISAIE","text":"Sounds like rather a tall order..."},{"name":"ALISAIE","text":"Ahem. Since you ask, we're to scour the Eblan Rime for survivors."},{"name":"EMMANELLAIN","text":"What!? Wander around ice fields on the off chance you'll find someone!?"},{"name":"EMMANELLAIN","text":"You'd take forever to finish the job without the benefit of my expertise─or more specifically, my telescope! Come friends, I know just the spot to begin our search!"},{"name":"ALISAIE","text":"...I'll probably regret this, but we may as well humor him."},{"name":"ALPHINAUD","text":"The few buildings I can see don't appear to be residences. They may still warrant investigation, though."},{"name":"ALISAIE","text":"I'm surprised by how many wild beasts there are roaming about the place. Perhaps now that the soldiers have gone, they're free to wander and forage as they please."},{"name":"EMMANELLAIN","text":"I spy with my little telescope..."},{"name":"EMMANELLAIN","text":"A massive...sheep-thing? Or maybe it's a cow? Not what we're after, either way.<br>...Is that an aether current? Ah, no, just a wind sprite."},{"name":"EMMANELLAIN","text":"Hmm... Other than that, it's all snow, snow, snow. But lo! What do I see o'er yon hillock?"},{"name":"EMMANELLAIN","text":"There's no mistaking it. That's a girl."},{"name":"ALPHINAUD","text":"A survivor!? Show me!"},{"name":"EMMANELLAIN","text":"Over there, behind that tree. It looks like she's running away from something...though surely not us? She wouldn't even know we're here unless she had a telescope like mine."},{"name":"EMMANELLAIN","text":"All I can tell...is that...she's wearing a pale green dress...a rather fetching one, at that!"},{"name":"ALPHINAUD","text":"She'll be long gone by the time we get anywhere near, but we should be able to follow her footprints."},{"name":"EMMANELLAIN","text":"I'll let Lucia know where you're heading."},{"name":"EMMANELLAIN","text":"Oh, and take these warming tinctures with you!"},{"name":"EMMANELLAIN","text":"The poor girl must be chilled to the bone, if not on the verge of freezing to death."},{"name":"ALISAIE","text":"That's...actually very thoughtful. Thank you. But won't you need some for yourself?"},{"name":"EMMANELLAIN","text":"No, no! I'll be fine! As a man of chivalry, my honor demands I do no less. And lest we forget, the very reason we are here is to protect those in need."},{"name":"EMMANELLAIN","text":"Now go, and godsspeed!"},{"name":"EMMANELLAIN","text":"Why are you still here!? If you dally any longer, you will miss your chance to play the hero!"},{"name":"SYSTEM","text":"A trail of fresh footprints lead east..."},{"name":"ALPHINAUD","text":"According to the label here, this place was used by those involved with extracting ceruleum..."},{"name":"ALISAIE","text":"Hmm... Other than the footprints, I see no signs of recent activity."},{"name":"SYSTEM","text":"These footprints appear to be the same as those you saw previously, and they lead towards the building..."},{"name":"ALISAIE","text":"We're getting closer. I'm sure of it."},{"name":"ALISAIE","text":"At first, we thought she'd gone inside the building, but the door doesn't look to have been opened in some time."},{"name":"ALISAIE","text":"She might still be nearby, so we'll keep looking around here."},{"name":"ALISAIE","text":"Then again, it's also possible that she ran right past this place. Would you mind searching up ahead?"},{"name":"ALISAIE","text":"As Emmanellain said, it's highly unlikely she was running away from us."},{"name":"ALISAIE","text":"Even so, we mustn't do anything to startle her. For all she knows, we're soldiers of an invading army, so we need to be careful not to give the wrong impression."},{"name":"SYSTEM","text":"The girl in the green dress anxiously surveys her surroundings."},{"name":"SYSTEM","text":"Were you to call out to her from this distance, it might attract wild beasts to your location. It would be safer to get closer first, but you must do so without drawing her attention."},{"name":"SYSTEM","text":"Follow the girl from a safe distance."},{"name":"SYSTEM","text":"The objective will end in failure if you are noticed. Make use of cover such as rocks to approach her without being seen."},{"name":"SYSTEM","text":"Similarly, the objective will also end in failure if you fall too far behind."},{"name":"SYSTEM","text":"Should you fail to complete the objective, you may try again by returning to the designated location."},{"name":"Q1","text":"Attempt to follow the girl in green again?"},{"name":"LICINIA","text":"Phew... Still in one piece..."},{"name":"LICINIA","text":"Wh-Who are you!?"},{"name":"LICINIA","text":"Stay back! This house is packed with explosives! Take another step and I'll blow this place sky-high!"},{"name":"ALPHINAUD","text":"Please! We just want to talk!"},{"name":"ALPHINAUD","text":"I'm Alphinaud. This is my sister, Alisaie, and our good friend <span class=\"highlight\">Forename</span>."},{"name":"ALPHINAUD","text":"We have no intention of hurting or taking anything from you or anyone else. I give you my word."},{"name":"ALPHINAUD","text":"We and our comrades have come to provide aid to the people of Garlemald─"},{"name":"LICINIA","text":"Aid!? You savages are the ones responsible for all of this! You did this to us!"},{"name":"ALISAIE","text":"We didn't, I promise you. One of the other reasons we came was to find out what happened here, in fact."},{"name":"ALISAIE","text":"The Telophoroi are the ones to blame. They're the ones who laid waste to Garlemald, and they won't stop until they've destroyed the entire world. They're the enemy─<span class=\"emphasis\">our</span> enemy."},{"name":"ALPHINAUD","text":"On our way, we encountered imperial soldiers who had been made their thralls. Those poor souls are now in our care, and we are striving to cure them of their affliction."},{"name":"ALPHINAUD","text":"You're the first person we've met who wasn't already enslaved... How were you able to escape the Telophoroi's influence? Are there any others like you?"},{"name":"ALPHINAUD","text":"...I'm sorry, I don't mean to overwhelm you. Let's start with introductions. Can you tell me your name?"},{"name":"LICINIA","text":"(-Licinia-)I...my name's Licinia. As for how I've managed to stay sane..."},{"name":"LICINIA","text":"(-Licinia-)I've been asking myself the same question. Ever since that night...and the roar, that terrible roar... And then the screams. I was screaming too, I think. I'm not sure. I can't remember."},{"name":"LICINIA","text":"(-Licinia-)Then came the silence. Everything was still."},{"name":"LICINIA","text":"(-Licinia-)It was like...waking up from a nightmare. I thought that maybe the fighting had stopped, so I stepped outside..."},{"name":"LICINIA","text":"(-Licinia-)If your hells are real, I saw one that day."},{"name":"LICINIA","text":"(-Licinia-)I ran...past friends, people I'd known all my life. Eyes vacant. Dead. Staring at the sky."},{"name":"LICINIA","text":"(-Licinia-)Others were mad and violent. I saw them struggle with soldiers, but didn't stay to watch. I fled, as far as my legs would take me."},{"name":"ALISAIE","text":"Do you have family here? Is this their home?"},{"name":"LICINIA","text":"(-Licinia-)No, this is Victors' Spoils. A mansion for retired soldiers. Or it was, but now me and my─me and a few others are, um, borrowing it."},{"name":"LICINIA","text":"(-Licinia-)As for the explosives...I was making that up."},{"name":"LICINIA","text":"(-Licinia-)I just wanted to keep everyone else safe, and I didn't know if you were... &lt;sigh&gt; The truth is, our supplies are running low. You said you're here to help. Can you?"},{"name":"ALPHINAUD","text":"Of course! Whatever assistance we can provide, we will."},{"name":"LICINIA","text":"(-Licinia-)Thank you. I'd better tell the others first, though. Wait here."},{"name":"LICINIA","text":"(-Licinia-)This is everyone."},{"name":"WEAKENEDGARLEAN","text":"Licinia says you can be trusted...but these are desperate times. We'd be fools to let foreign troops into our home."},{"name":"WEAKENEDGARLEAN","text":"Having said that...were you to provide us with means of heating the place─as a sign of goodwill─perhaps we could take you at your word..."},{"name":"WEAKENEDGARLEAN","text":"If that is too much to ask, then leave us be."},{"name":"ALPHINAUD","text":"Time to put my firewood-gathering skills to use. Could you provide the spark with a little magic, Alisaie?"},{"name":"ALISAIE","text":"We'll have a fire burning in no time. May we build it under that gazebo?"},{"name":"WEAKENEDGARLEAN","text":"The what...? Oh, you mean the bower. Yes, yes, do as you will."},{"name":"LICINIA","text":"(-Licinia-)..."}],"reward":{"gil":1071},"reqs":{"jobs":[{"lvl":82,"id":142}],"quests":[69919]},"next":[69921]},"partials":[{"type":"npc","id":"1038839","obj":{"i":1038839,"n":"Emmanellain","l":3710,"q":1}},{"type":"npc","id":"1038846","obj":{"i":1038846,"n":"Girl In Green","l":3710,"q":1}},{"type":"quest","id":"69919","obj":{"i":69919,"n":"A Frosty Reception","g":11,"l":"The Lochs","s":537}},{"type":"quest","id":"69921","obj":{"i":69921,"n":"How the Mighty Are Fallen","g":11,"l":"Garlemald","s":539}}]}