{"quest":{"name":"Alea Iacta Est","location":"Garlemald","id":69928,"patch":6.0,"sort":546,"icon":101109,"eventIcon":71201,"issuer":1039913,"target":1039915,"genre":11,"journal":["Once again, Jullus has been entrusted with an unenviable task.","Negotiations with the Ist Legion have failed, and Alphinaud and Alisaie have been taken as hostages. It has been decided that you will escort Jullus to Camp Broken Glass, where he will present the conditions for Alisaie and Alphinaud's release. Before that, however, he requests that you inform two of the soldiers charged with retrieving your contingent's supplies of your imminent departure. He also gives the rather cryptic instruction that his comrades “ask the iyl” for further details, although its meaning is entirely lost on you for the moment.","The two soldiers give very different yet equally startling responses to the suggestion that they “ask the iyl,” and it is clear they know precisely what this entails. As neither appears willing to expound further on this riddle, your only choice is to glean the truth from Jullus himself.","When pressed about his instructions to ask the iyl, Jullus remains tight-lipped. The only hint he gives is that, providing your allies agree to Quintus's demands, the true meaning will be of no relevance to you. While this is hardly reassuring, he reminds you that the two of you must cooperate to ensure the negotiations reach successful conclusion. He then asks that you wait for him at a location nearby that he wishes to visit on the way to Camp Broken Glass.","After taking a brief detour past what remains of Jullus's home, you arrive at your camp. The negotiations have barely begun when you learn that Alphinaud and Alisaie have been freed by your comrades, depriving Quintus of his leverage. With the tables turned, Jullus and the other troops prepare to carry out their second set of orders by launching an attack on the Ilsabard contingent. Before any blood is spilled, however, you receive yet more surprising news. You learn that the Xth Legion─the reinforcements Quintus had been expecting─have instead agreed to a truce with the Grand Company of Eorzea. Quintus then commands his soldiers to comply with the Xth's wishes, thus ending the confrontation.","Thanks to Lucia's calm handling of a perilous situation, as well as the political maneuvering of your allies at home, hostilities between the Ilsabard contingent and the Ist Legion have come to an end. However, the question of what lies ahead has yet to be answered."],"objectives":["Speak with Marcellinus.","Speak with Octavia.","Speak with Jullus.","Wait at the specified location.","Speak with Lucia."],"dialogue":[{"name":"MARCELLINUS","text":"Why are you here? To laugh at our misfortune!?"},{"name":"JULLUS","text":"You will accompany me back to your camp, where I will meet with your leader and present Lord Quintus's demands."},{"name":"JULLUS","text":"Before we depart, however, there is something I would ask of you."},{"name":"JULLUS","text":"Assuming your contingent complies, the supplies they surrender will need to be transported here."},{"name":"JULLUS","text":"That task falls to Legionaries Marcellinus and Octavia, who will pilot magitek armor to your headquarters. You are to inform them that we are leaving shortly."},{"name":"JULLUS","text":"Tell them to <span class=\"emphasis\">ask the iyl</span> for further details. In those words."},{"name":"JULLUS","text":"Once you've seen to that, meet me by the exit."},{"name":"MARCELLINUS","text":"You again..."},{"name":"MARCELLINUS","text":"\"Ask the iyl,“ he said? Heh...heh heh... &lt;sigh&gt;"},{"name":"MARCELLINUS","text":"So. That's to be the way of it. After all this..."},{"name":"MARCELLINUS","text":"How ironic that you should be the one to deliver the news."},{"name":"MARCELLINUS","text":"If those are my orders, then so be it. For the glory...of Garlemald..."},{"name":"OCTAVIA","text":"What do you want with me!?"},{"name":"OCTAVIA","text":"\"Ask the iyl“... So Lord Quintus has reached a decision."},{"name":"OCTAVIA","text":"I knew he would understand. That he would recognize the savage is a ruthless, merciless creature, and to defeat him, we too must be...uncompromising..."},{"name":"OCTAVIA","text":"I...am ready. In the name of Emperor Varis, for the glory of Garlemald, I will fulfill...my duty!"},{"name":"JULLUS","text":"Have you done as instructed?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Their duties involve more than the transportation of supplies, don't they?"},{"name":"A1","text":"What do you mean by “ask the iyl”?"},{"name":"JULLUS","text":"Duty is rarely a simple thing. We <span class=\"emphasis\">have</span> been given additional orders, though whether we will be required to follow them depends entirely on your contingent."},{"name":"JULLUS","text":"I am not at liberty to divulge that. What I <span class=\"emphasis\">can</span> say is this: you have no cause for concern if our demands are met."},{"name":"JULLUS","text":"You and I are in this together now. Like it or not, we <span class=\"emphasis\">have</span> to cooperate."},{"name":"JULLUS","text":"There is one other matter... A place I'd like to visit on the way to your camp."},{"name":"JULLUS","text":"It's a short walk from here. Follow me."},{"name":"JULLUS","text":"Give me a moment. Please."},{"name":"SYSTEM","text":"Jullus lingers by the ruins, reluctant to leave and reluctant to stay. Unable to move on..."},{"name":"Q2","text":"Wait here?"},{"name":"JULLUS","text":"We will make no attempt to resist."},{"name":"LUCIA","text":"Much and more has occurred since last we met."},{"name":"LUCIA","text":"As for determining what comes next, we must speak with Lord Quintus."}],"reward":{"gil":956},"reqs":{"jobs":[{"lvl":83,"id":142}],"quests":[69927]},"next":[69929]},"partials":[{"type":"npc","id":"1039913","obj":{"i":1039913,"n":"Jullus","l":3710,"q":2}},{"type":"npc","id":"1039915","obj":{"i":1039915,"n":"Lucia","l":3710,"q":2}},{"type":"quest","id":"69927","obj":{"i":69927,"n":"No Good Deed","g":11,"l":"Garlemald","s":545}},{"type":"quest","id":"69929","obj":{"i":69929,"n":"Strange Bedfellows","g":11,"l":"Garlemald","s":547}}]}