{"quest":{"name":"A Way Forward","location":"Garlemald","id":69923,"patch":6.0,"sort":541,"icon":101108,"eventIcon":71201,"issuer":1038868,"target":1039883,"genre":11,"journal":["Alphinaud's resolve may be shaken, but he has not forgotten his duty.","The tragedy that unfolded on the Eblan Rime has clearly left its mark on Alphinaud and Alisaie. Your hearts heavy with guilt and sorrow, you return to Camp Broken Glass to relay these unfortunate events.","Lucia and the others are shocked to hear the outcome of your first encounter with Garlean locals. Making a conscious effort not to dwell on the matter, the conversation turns to the collapse of the Empire. You come to the realization that some few were spared from being tempered by devices known as radios, which, perhaps more by coincidence than design, possess similar properties to the warding scales. The discussion is interrupted by the discovery of an intruder in the camp─a young Garlean soldier named Jullus who was caught stealing provisions. Despite his initial hostility, he is eventually persuaded to take you, Alisaie, and Alphinaud to parley with his commander.","Lucia offers a few parting words, including cryptic comments to observe proper social etiquette, and that Thancred will be worried for your well-being. As Jullus is within earshot, you can only surmise it is a not-so-subtle reminder to take no action against the soldiers regardless of the circumstances─you are to observe their disposition only; and should you come to be in need of assistance, a concealed Thancred will likely be nearby to offer it. You ponder this possibility as you prepare for a journey across the snowy plains.","Jullus decides to wait until your party is outside of Camp Broken Glass before revealing even the slightest hint as to where you are heading, for fear your allies might surmise the location of his base of operations. For the time being, you comply with his wishes and follow him until you are all out of earshot.","Jullus explains the route you must take in order to approach his faction's headquarters. As he is still extremely wary around you and the twins, he forbids you from drawing your weapons in his presence. In order to keep an eye on them, Jullus instructs Alphinaud and Alisaie to take the lead, while you join him in bringing up the rear.<br><br>※If you part ways with Jullus or fall behind Alphinaud and Alisaie, return to the starting point and speak with Jullus to try again.","You manage to evade the local wildlife and finally reach Liminal Station IV. The sense of accomplishment is fleeting, however, as Jullus then reveals that this location is nothing more than a brief stop for him to ensure that none of your comrades are attempting to follow in violation of the agreement. Satisfied you are alone, he bids you continue along to your true destination.","The next part of your journey will take you near the remains of a sprawling residential district. With hordes of tempered soldiers and civilians prowling the streets, your party will need to move swiftly to sneak past without incident."],"objectives":["Speak with Lucia.","Speak with Lucia again.","Speak with Jullus.","Speak with Jullus again to accompany him.","Speak with Jullus, then follow Alphinaud and Alisaie.","Speak with Jullus."],"dialogue":[{"name":"ALISAIE","text":"If only we'd had a chance to talk things over...but it's too late now. Too late by far."},{"name":"ALPHINAUD","text":"We have already caused enough harm here. Let us return to the camp before we cause any more."},{"name":"ALPHINAUD","text":"As for those inside the house, we should send someone to take care of them. Someone who isn't us."},{"name":"ALPHINAUD","text":"All we can do for now is make our report to Lucia...and do everything in our power to prevent further tragedy."},{"name":"ALPHINAUD","text":"So let us linger here no more. Come..."},{"name":"ALPHINAUD","text":"Would you mind giving Lucia a full report?"},{"name":"ALISAIE","text":"We mustn't forget to send some of our allies to Tapper's Den. We still owe them for the bottle of ceruleum."},{"name":"YSHTOLA","text":"Treatment of the tempered is proceeding as well as can be expected. If there is anything to report, you will be sure to know, though I gather you have a report of your own to deliver..."},{"name":"ARUHNSENNA","text":"Is something the matter? The twins look out of sorts, and you too seem a bit...off."},{"name":"MAXIMA","text":"Forgive me for saying, but the three of you appear rather drained since your return. Is there aught I might do to be of assistance?"},{"name":"LUCIA","text":"Alisaie and Alphinaud tell me they have finished their preliminary search for survivors, but refrained from saying much more than that."},{"name":"LUCIA","text":"Clearly they are reluctant to provide details. Might I ask for your account?"},{"name":"ALPHINAUD","text":"Perhaps it is unwise to volunteer for a mission so soon after the previous disaster... Nevertheless, I shall not squander this opportunity."},{"name":"ALISAIE","text":"I know, I know. This won't bring back Licinia or her sister."},{"name":"ALISAIE","text":"Taking the same risks, making the same mistakes... It's possible, but better to try than to give up. Every time."},{"name":"YSHTOLA","text":"I worry they were not in the best state of mind to volunteer for this undertaking, but what's done is done. I know you will take good care of them─and yourself as well, I trust."},{"name":"ARUHNSENNA","text":"They are...resilient in the face of hardship. You as well."},{"name":"ARUHNSENNA","text":"But good intentions and stubborn determination alone will not be enough to bring our mission to a successful conclusion. Be on your guard."},{"name":"MAXIMA","text":"Jullus pyr Norbanus... It is unusual for one so young to achieve such a high rank. Very unusual."},{"name":"MAXIMA","text":"His uniform identifies him as a member of the Ist Legion, which has a particularly fierce reputation. Whoever his superior may be, I advise you to approach them with caution."},{"name":"CIRINA","text":"We captured the boy as he was about to make off with our food. He must be very hungry to take such risks."},{"name":"CIRINA","text":"Maybe we should give him something to eat. Reward him for his boldness."},{"name":"MAGNAI","text":"The lowly task of keeping watching over provisions would not normally befit the Sun. But these being unusual circumstances, I will let no man take that which is not by rights theirs."},{"name":"JULLUS","text":"Said your farewells, have you?"},{"name":"LUCIA","text":"You will be received as invited guests, and so I urge you to <span class=\"emphasis\">observe</span> proper social etiquette and conduct yourselves accordingly."},{"name":"LUCIA","text":"Your safe return takes precedence above all else. Remember this."},{"name":"LUCIA","text":"<span class=\"emphasis\">Thancred</span> in particular will be worried sick if you're gone too long. May the Fury watch over and keep you."},{"name":"LUCIA","text":"As I said before, <span class=\"emphasis\">Thancred</span> can be quite the worrier, but rest assured he only has your best interests at heart..."},{"name":"JULLUS","text":"Are you and the children ready?"},{"name":"JULLUS","text":"I will explain the route once we are outside your camp."},{"name":"JULLUS","text":"If anyone attempts to follow us, we will judge it an act of hostility. We will not hesitate to take appropriate measures."},{"name":"LUCIA","text":"I would expect nothing less. You have our full cooperation."},{"name":"ALPHINAUD","text":"We will do only as instructed. After all, this is what we have been striving for ever since we arrived."},{"name":"ALISAIE","text":"Where do you think their headquarters are? I assume there are a few others beside him and this commander he mentioned."},{"name":"JULLUS","text":"All right, this is far enough. Listen carefully."},{"name":"JULLUS","text":"We head over that hill, then follow the road until we reach Liminal Station IV."},{"name":"JULLUS","text":"Children in the lead. I want you where I can see you."},{"name":"ALISAIE","text":"We <span class=\"emphasis\">do</span> have names, you know. I'm Alisaie, and he's Alphinaud. And last but not least, there's <span class=\"highlight\">Forename</span>."},{"name":"JULLUS","text":"<span class=\"highlight\">Forename</span>... Where have I heard that before...?"},{"name":"JULLUS","text":"No matter. “Alphinaud” and “Alisaie” will watch the road ahead, while we bring up the rear."},{"name":"JULLUS","text":"I wasn't lying about there being many dangers, so you're to run─not saunter, run─towards the station. If you even think about going for your weapon, the deal's off. Should any creatures bar the way, we go around them."},{"name":"SYSTEM","text":"Once you choose to depart, Jullus will accompany you. Alphinaud and Alisaie will then begin moving towards the destination."},{"name":"SYSTEM","text":"Make your way to Liminal Station IV without falling behind."},{"name":"SYSTEM","text":"If you leave Jullus behind for any reason, or lose sight of Alphinaud and Alisaie, you may try again by returning to the starting point."},{"name":"JULLUS","text":"Ready to make a dash for the station?"},{"name":"Q1","text":"What will you say?"},{"name":"JULLUS","text":"Over that hill, then follow the road until we reach the station. So, are you ready?"},{"name":"SYSTEM","text":"Once you choose to depart, Jullus will accompany you. Alphinaud and Alisaie will then begin moving towards the destination."},{"name":"ALPHINAUD","text":"Whenever you are ready, <span class=\"highlight\">Forename</span>. Just give the word to Jullus."},{"name":"ALISAIE","text":"What are we waiting for? Let's get this over with."},{"name":"ALPHINAUD","text":"I'm still unsure about leading the way, but we will do our best!"},{"name":"ALISAIE","text":"Don't fall behind!"},{"name":"ALPHINAUD","text":"It's nothing like the ones in Thanalan..."},{"name":"ALISAIE","text":"We're here...I think."},{"name":"Q2","text":"What will you do?"},{"name":"A2","text":"Speak with Jullus."},{"name":"A2","text":"Part ways with Jullus."},{"name":"A2","text":"Nothing."},{"name":"JULLUS","text":"If it's conversation you want, save it until we've arrived."},{"name":"Q3","text":"Are you sure you wish to part ways with Jullus?"},{"name":"JULLUS","text":"Having second thoughts? Hmph! Very well. Return to and regroup where we started."},{"name":"JULLUS","text":"No shuffling along at a snail's pace to give your comrades a chance to pursue us. You're to run as fast as you can─understood?"},{"name":"SYSTEM","text":"Jullus will now accompany you. Keep up with Alphinaud and Alisaie and head for your destination."},{"name":"SYSTEM","text":"Jullus has yet to arrive. Be sure he is at your side before attempting to continue."},{"name":"JULLUS","text":"Can't any of you follow simple instructions?"},{"name":"SYSTEM","text":"Speak with Alphinaud or Alisaie at Camp Broken Glass to try again."},{"name":"JULLUS","text":"This is it. The first stop, that is."},{"name":"JULLUS","text":"Good. It looks like your friends knew better than to follow us."},{"name":"ALPHINAUD","text":"Are <span class=\"emphasis\">these</span> your headquarters?"},{"name":"JULLUS","text":"No. We're stopping here so I can check for pursuers. Since it appears you've kept to your side of the bargain, we can carry on."},{"name":"ALPHINAUD","text":"We're getting closer to the imperial palace...if one can still call it that. It truly is a terrifying sight to behold..."},{"name":"ALISAIE","text":"I wonder what sort of conditions Jullus and his comrades are living in. If they've any sense, they'll have picked somewhere like Victors' Spoils to take shelter."},{"name":"JULLUS","text":"North of the station is Regio Domorum, one of the main residential areas. Or at least it was."},{"name":"JULLUS","text":"The afflicted roam the streets in packs. They'll tear us to shreds if given the chance. Keep close─no wandering off. Understood?"}],"reward":{"gil":1031,"items":[{"id":35681}]},"reqs":{"jobs":[{"lvl":82,"id":142}],"quests":[69922]},"next":[69757,69760,69924]},"partials":[{"type":"npc","id":"1038868","obj":{"i":1038868,"n":"Alphinaud","l":3710,"q":1}},{"type":"npc","id":"1039883","obj":{"i":1039883,"n":"Jullus","l":3710,"q":2}},{"type":"item","id":"35681","obj":{"i":35681,"n":"Pewter Foot Gear Coffer (IL 525)","l":1,"c":26562,"t":61}},{"type":"quest","id":"69922","obj":{"i":69922,"n":"At the End of the Trail","g":11,"l":"Garlemald","s":540}},{"type":"quest","id":"69757","obj":{"i":69757,"n":"Heroes All","g":123,"l":"Garlemald","s":1480}},{"type":"quest","id":"69760","obj":{"i":69760,"n":"Under Lock and Code","g":123,"l":"Garlemald","s":1490}},{"type":"quest","id":"69924","obj":{"i":69924,"n":"The Last Bastion","g":11,"l":"Garlemald","s":542}}]}