{"quest":{"name":"The Last Bastion","location":"Garlemald","id":69924,"patch":6.0,"sort":542,"eventIcon":71201,"issuer":1039883,"target":1039892,"genre":11,"journal":["Jullus knows only too well that danger lurks around every corner."],"objectives":["Go with Jullus and defeat the tempered soldiers.","Speak with Jullus.","Go with Jullus and defeat the tempered soldiers.","Speak with Jullus.","Catch up with Jullus.","Go with Jullus and defeat the tempered soldiers.","Speak with Jullus.","Speak with Jullus again.","Speak with Jullus yet again.","Speak with Alphinaud.","Speak with Jullus."],"dialogue":[{"name":"ALPHINAUD","text":"We're getting closer to the imperial palace...if one can still call it that. It truly is a terrifying sight to behold..."},{"name":"ALISAIE","text":"I wonder what sort of conditions Jullus and his comrades are living in. If they've any sense, they'll have picked somewhere like Victors' Spoils to take shelter."},{"name":"JULLUS","text":"From here, we'll be heading northeast, keeping to the left of the railway."},{"name":"JULLUS","text":"While the route itself is straightforward, getting past the hordes unseen is anything but. Keep your weapons at the ready."},{"name":"ALPHINAUD","text":"They would attack their own countrymen?"},{"name":"JULLUS","text":"Aye. They spare their own but slaughter the rest without hesitation."},{"name":"JULLUS","text":"Though we'll try to avoid detection, the chances of sneaking by completely unnoticed are slim at best. I will lead the way, but in the event we are seen...you're to fight them off."},{"name":"JULLUS","text":"Those two will follow us, provided they can refrain from drawing their weapons. While I doubt they would be foolish enough to stab their guide in the back, I will not take that chance. With that said, let us proceed..."},{"name":"BALLOON","text":"Glory...to Garlemald..."},{"name":"BALLOON","text":"Death...to her enemies..."},{"name":"ALPHINAUD","text":"We must stay alert..."},{"name":"ALISAIE","text":"Godsdammit, we're perfectly capable of holding our own..."},{"name":"JULLUS","text":"I see why your comrades chose you."},{"name":"ALPHINAUD","text":"Jullus, our contingent has a cure for the afflicted, or “tempered” as we call them."},{"name":"ALPHINAUD","text":"Your people would need to be taken into custody that we may administer the treatment, but they would eventually regain their sanity."},{"name":"JULLUS","text":"Is that so? For all I know, your “treatment” would simply force them to forsake one master for another."},{"name":"JULLUS","text":"As far as I and my legion are concerned, they are no longer our people. They're beyond saving."},{"name":"JULLUS","text":"Those who thought differently and tried to reason with them were butchered for their bleeding hearts. Come─we have to keep moving."},{"name":"BALLOON","text":"Long live...the Emperor..."},{"name":"ALPHINAUD","text":"..."},{"name":"ALISAIE","text":"I hate to watch you bear this burden alone..."},{"name":"JULLUS","text":"Looks like we're not being followed. We will continue onward."},{"name":"ALPHINAUD","text":"The surest way to limit casualties is to reach our destination without drawing attention to ourselves. Perhaps afterwards we can try again to convince Jullus that the tempered can be saved..."},{"name":"ALISAIE","text":"He truly believes there's nothing that can be done for them. No wonder he isn't afraid to get his hands dirty..."},{"name":"JULLUS","text":"...I meant what I said─these “people” deserve only death. I stayed my hand before only out of a desire to remain undiscovered, and that is still the higher priority. We should continue to avoid any unnecessary confrontations."},{"name":"JULLUS","text":"Keep following the railway."},{"name":"BALLOON","text":"Aaahhh..."},{"name":"BALLOON","text":"Unnnghhh..."},{"name":"ALPHINAUD","text":"Such a transformation is likely irreversible..."},{"name":"ALISAIE","text":"To think they were once ordinary people..."},{"name":"JULLUS","text":"Look at what they have become. Would you still stand there and claim that they can be cured!?"},{"name":"ALPHINAUD","text":"Those exposed to a vast quantity of a primal's aether may suffer severe corruption..."},{"name":"ALPHINAUD","text":"Even with treatment, such victims are beyond salvation."},{"name":"JULLUS","text":"Then you admit it. Now that you have seen these monstrosities for yourself, perhaps you will think twice before speaking of a cure."},{"name":"ALPHINAUD","text":"Though I wish there was another way, I thank you for keeping us from harm."},{"name":"ALISAIE","text":"Even here in the outskirts, it's plain to see how vastly different Garlemald is compared to other cities..."},{"name":"JULLUS","text":"We're almost there."},{"name":"JULLUS","text":"You have kept your side of the agreement, so I will keep mine. This way."},{"name":"ALPHINAUD","text":"Seems secure enough, but hardly the most hospitable of places."},{"name":"JULLUS","text":"This is Tertium, one of Garlemald's largest stations. It now serves as our headquarters."},{"name":"JULLUS","text":"I've already sent the twins ahead. I will be with you soon, so wait for me at the bottom of the stairs."},{"name":"JULLUS","text":"Go on, down the stairs, like I told you."},{"name":"JULLUS","text":"Or is this your first time into an underground station? They're all over Garlemald. Even during severe blizzards, we could use them to travel from one end of the city to another. Back when they were still in operation, that is."},{"name":"ALISAIE","text":"I had no idea they had such expansive structures built underground..."},{"name":"ALPHINAUD","text":"It's plain to see why they chose this as their base of operations."},{"name":"ALISAIE","text":"They could have done a lot worse. Even so, I imagine it's not the easiest place to live."},{"name":"ALPHINAUD","text":"Indeed...and if Jullus was willing to make the perilous journey to Camp Broken Glass in search of food, their own supplies must be all but exhausted."},{"name":"ALPHINAUD","text":"They may be shielded from the wind and snow, but it's still bitterly cold. Much like Victors' Spoils, it must be a constant struggle to keep their people warm."},{"name":"JULLUS","text":"Lower your voices. While you may be here as my “guests,” the others will not take kindly to your presence."},{"name":"JULLUS","text":"My commander is in the locomotive, over there."},{"name":"ALPHINAUD","text":"Now comes the true test..."},{"name":"ALISAIE","text":"He certainly looks the part..."},{"name":"QUINTUS","text":"I will deal with you in a moment."}],"reward":{"gil":1071},"reqs":{"jobs":[{"lvl":82,"id":142}],"quests":[69923]},"next":[69925]},"partials":[{"type":"npc","id":"1039883","obj":{"i":1039883,"n":"Jullus","l":3710,"q":2}},{"type":"npc","id":"1039892","obj":{"i":1039892,"n":"Jullus","l":3710,"q":1}},{"type":"quest","id":"69923","obj":{"i":69923,"n":"A Way Forward","g":11,"l":"Garlemald","s":541}},{"type":"quest","id":"69925","obj":{"i":69925,"n":"Personae non Gratae","g":11,"l":"Garlemald","s":543}}]}