{"quest":{"name":"A Trip to the Moon","location":"The Nethergate","id":69932,"patch":6.0,"sort":550,"icon":101112,"eventIcon":71201,"issuer":1039974,"target":1042050,"genre":11,"journal":["G'raha Tia is pondering the technological marvel you have just beheld.","You rouse G'raha Tia from his intense contemplation, and he informs you that the device Fandaniel used to transport himself and Zenos to the moon is of Allagan design. After taking a moment to speculate as to the Ascian's lingering attachment to the life he led as Amon, he sends you on your way with a few words of encouragement.<br><br>※In the event that you leave the Nethergate, you may re-enter by speaking with the Lente's arrow in the Enceladeum.","Having availed yourself of similar teleportation devices in the past, there is no need to question the safety of this one. Nevertheless, it does come as a bit of a relief when you are painlessly transported to the moon in a rush of aetherial energy.","No sooner do you arrive on the moon than do you hear a strange, haunting voice call to you. The ally of whom Hydaelyn spoke, or someone else...?","You approach a tall figure you find wandering nearby, only to be attacked by specters of grief─demonstrating that you could stand to be a little more prudent in your search for a friendly face. However, for lack of a better plan...","You attempt to prod the ancient spirit again, but it vanishes ere the voice you heard earlier echoes in the distance once more. It now gives more specific instructions, summoning you to “cerulean halls.”","Though you arrive at the aforementioned cerulean halls, you find your immediate surrounds empty. You can but hope the source of the voice is secreted deeper within.","You at last locate the source of the voice, who identifies himself as “the watcher,” keeper of Zodiark's seal. He tells you that he has restored one of the brands that keep the god of Darkness imprisoned, but that he cannot tend to the remnants of the other four, beset as they are by the restless spirits of sacrificed ancients that now wander the moon. He assures you that even should you expel them from where they stand, they will not be consigned to oblivion so long as Zodiark remains the moon's captive, and thus requests that you aid him in maintaining that stasis."],"objectives":["Activate the teleportation device.","Speak with the ancient spirit.","Speak with the ancient spirit again.","Survey the destination.","Search the Watcher's Palace for the source of the voice."],"dialogue":[{"name":"ALPHINAUD","text":"I have faith in you. Now and always."},{"name":"ALISAIE","text":"Stand there for just a moment, please."},{"name":"ALISAIE","text":"...A prayer for good luck. Now you can't possibly fail!"},{"name":"THANCRED","text":"We're moving out to rendezvous with the remainder of the contingent. Leave everything here to us."},{"name":"URIANGER","text":"Fear not for Krile. Go forth...and return, I prithee."},{"name":"YSHTOLA","text":"I'm the last person who should be scolding others for using dangerous teleportation magicks. But if that is indeed how Krile reached us in time, I do wish Hydaelyn had taken a little more care..."},{"name":"YSHTOLA","text":"Regardless, 'tis nothing Urianger and I cannot put right."},{"name":"ESTINIEN","text":"We've no time for worrying over what's done. Let's go."},{"name":"KRILE","text":"..."},{"name":"GRAHATIA","text":"My apologies─I was lost in thought. This device is of Allagan design, which leads me to think I was right about Fandaniel."},{"name":"GRAHATIA","text":"No matter what he claims, he still has an attachment to the trappings of his past..."},{"name":"GRAHATIA","text":"Whether knowing this will make your path forward clearer, I cannot say, but bear it in mind."},{"name":"GRAHATIA","text":"But let us turn to the task at hand. As Hydaelyn said, the flow of aether will transport you to Mare Lamentorum."},{"name":"GRAHATIA","text":"We must hope this ally of Hers can provide you with the necessary assistance to restore the seal before Zenos and Fandaniel arrive to stop you."},{"name":"GRAHATIA","text":"It seems we are ever one step behind, but I have faith that you'll make up the difference."},{"name":"GRAHATIA","text":"Know that whatever awaits, our prayers are with you. Now go─beyond the sky!"},{"name":"GRAHATIA","text":"Spare a glance our way from on high, will you? We shall not waver, knowing that you're counting on us."},{"name":"Q1","text":"Travel to Mare Lamentorum?"},{"name":"Q2","text":"Travel to the Tower of Babil?"},{"name":"SHADOWZERO04396","text":"<span class=\"highlight-purple\">I... I...</span>"},{"name":"SHADOWZERO04396","text":"<span class=\"highlight-purple\">Return... I must...return...</span>"},{"name":"SHADOWZERO04396","text":"<span class=\"highlight-purple\">Why... Why... Why!?</span>"},{"name":"POPMESSAGE","text":"The vision's grief takes form and lashes out!"},{"name":"SHADOWZERO04396","text":"<span class=\"highlight-purple\">Home... I want... I need...</span>"},{"name":"WATCHEROFMOON","text":"(-Distant Echo-)<span class=\"highlight-purple\">You mustn't...touch...</span>"},{"name":"WATCHEROFMOON","text":"(-Distant Echo-)<span class=\"highlight-purple\">In cerulean halls...find me...</span>"},{"name":"SYSTEM","text":"No steps echo through this looming spire save your own, but you nevertheless sense a presence above..."}],"reward":{"gil":1284},"reqs":{"jobs":[{"lvl":83,"id":142}],"quests":[69931]},"next":[69933]},"partials":[{"type":"npc","id":"1039974","obj":{"i":1039974,"n":"G'raha Tia","l":4024,"q":1}},{"type":"npc","id":"1042050","obj":{"i":1042050,"n":"The Watcher","l":3711,"q":1}},{"type":"quest","id":"69931","obj":{"i":69931,"n":"Gateway of the Gods","g":11,"l":"Garlemald","s":549}},{"type":"quest","id":"69933","obj":{"i":69933,"n":"Sea of Sorrow","g":11,"l":"Mare Lamentorum","s":551}}]}