{"quest":{"name":"A Taste of the Moon","location":"Mare Lamentorum","id":69938,"patch":6.0,"sort":556,"eventIcon":71201,"issuer":1039686,"target":1038912,"genre":11,"journal":["With the Final Days fast approaching, Livingway is keen to complete her preparations."],"objectives":["Speak with Livingway.","Examine the storage crate.","Show Cookingway obscenely large carrot.","Eat obscenely large carrot.","Speak with Cookingway."],"dialogue":[{"name":"THANCRED","text":"Why do I get the feeling we're going to have our hands full dealing with the Loporrits?"},{"name":"URIANGER","text":"'Tis unfortunate that the domiciles were constructed in error, but their willingness to perform such sweeping renovations is a testament to their commitment."},{"name":"URIANGER","text":"I cannot fathom the resources required for a facility so vast..."},{"name":"YSHTOLA","text":"I should have realized something was amiss when Livingway referred to us as children. What other delightful misconceptions do they hold, I wonder."},{"name":"MAPPINGWAY","text":"Oh dear. I certainly hope Buildingway can complete the renovations before more guests arrive."},{"name":"MAPPINGWAY","text":"Or perhaps he should leave them as they are? That way, you'd have more space to lounge about."},{"name":"LIVINGWAY","text":"Right, then. Now that you're here, we need you to teach us all you can about your people, and quickly!"},{"name":"LIVINGWAY","text":"It won't be long before the Final Days are upon us in all their terrible grandeur, so it is imperative that we be prepared to receive our passengers-to-be."},{"name":"LIVINGWAY","text":"If there is anything─anything at all─that may displease them, it must be addressed posthaste."},{"name":"LIVINGWAY","text":"And address it we shall. Here at Bestways Burrow, we have assembled everything required to offer our guests the <span class=\"emphasis\">best way</span> forward!"},{"name":"LIVINGWAY","text":"...Ahem. We have produced myriad amenities we understand to be essential for day-to-day living, and I wish to hear your opinions on them!"},{"name":"LIVINGWAY","text":"I'm sure you've all worked up an appetite, so why don't we start with foodstuffs? Meet me at the Carrotorium, and we'll see about filling your bellies."},{"name":"YSHTOLA","text":"She does not want for enthusiasm. The notion of Etheirys rotting to its core being a matter of course is rather concerning, though."},{"name":"YSHTOLA","text":"Nevertheless, let us take this opportunity to learn more of the Loporrits and this vessel."},{"name":"THANCRED","text":"...Am I the only one who suspects we're not going to find anything edible whatsoever?"},{"name":"YSHTOLA","text":"Given their earlier confusion regarding our size, I cannot help but wonder if they even know the first thing about us..."},{"name":"URIANGER","text":"Hast thou spied the peculiar sentinels patrolling the vicinity? Approach them with caution─or better yet, not at all─for they make no distinction between friend or foe."},{"name":"COOKINGWAY","text":"You're a lot smaller than we expected, but I trust you still have large appetites, yes?"},{"name":"LIVINGWAY","text":"Welcome to the Carrotorium! Here we create prototypes of the various sundries required by our soon-to-be passengers."},{"name":"LIVINGWAY","text":"Allow me to introduce the head of foodstuff production─"},{"name":"COOKINGWAY","text":"Cookingway! Pleasure to meet you all!"},{"name":"COOKINGWAY","text":"Our work has involved no small amount of trial and error, but after many, many cycles of painstaking labor, I daresay we have created the finest cuisine our guests could ask for."},{"name":"COOKINGWAY","text":"I've learned all about the essential nutrients for a healthy and balanced diet from the reference materials we received! Why, I've practically worn the words from those invaluable pages!"},{"name":"COOKINGWAY","text":"Naturally, we've also considered ease of growth and production. We will not want for ingredients!"},{"name":"COOKINGWAY","text":"I must insist you try some. We have fresh stock recently prepared on account of...well, because we just woke up, and were all quite famished."},{"name":"LIVINGWAY","text":"Hop along the platforms here, and you'll find a storage unit full to bursting with delectable delights. Help yourself to anything you like."},{"name":"LIVINGWAY","text":"I'm eager to hear what you think of our work. I'm sure there's some small room for improvement, but I'm confident you'll be satisfied!"},{"name":"COOKINGWAY","text":"One serving's never enough. You'll be back for seconds and thirds, I'm sure of it!"},{"name":"SYSTEM","text":"You open the storage unit and find a rainbow-colored assortment of carrots."},{"name":"Q1","text":"Which carrot will you choose?"},{"name":"A1","text":"The unassuming orange carrot."},{"name":"A1","text":"The peculiar-looking blue carrot."},{"name":"A1","text":"The vibrant yellow carrot."},{"name":"A1","text":"The ominous crimson carrot."},{"name":"A1","text":"Take a moment to reconsider."},{"name":"SYSTEM","text":"From frond to tip, no scratches or blemishes mar this immaculate specimen. Nevertheless, if not for its excessive length and girth, one might think it was an ordinary carrot."},{"name":"SYSTEM","text":"The blue variety is strangely supple to the touch and smells vaguely of mint. Its excessive length and girth only adds to the dubiousness of this so-called carrot."},{"name":"SYSTEM","text":"While it has no peculiar smell to speak of, the yellow variant is unusually light and springy. These qualities, together with its excessive length and girth, would lead anyone to question whether it is indeed a carrot."},{"name":"SYSTEM","text":"The soft texture and redolent aroma of this crimson creation belie its staggering weight. The excessive length and girth only compound the mystery, leaving you perplexed as to the nature of this “carrot.”"},{"name":"Q2","text":"Are you certain you wish to eat this carrot?"},{"name":"SYSTEM","text":"On second thought, you elect to simply take obscenely large carrot for now. Due to its bizarre qualities, it would be prudent to ask Cookingway whether it is safe to eat first."},{"name":"COOKINGWAY","text":"So, did any of our selections set your mouth to watering?"},{"name":"COOKINGWAY","text":"Ah yes, a fine choice! One of my personal favorites, actually."},{"name":"COOKINGWAY","text":"Please, dig in! I'm eager to hear what you think."},{"name":"COOKINGWAY","text":"I hope you enjoy it as much as we do!"},{"name":"SYSTEM","text":"Judging from the expectant faces, it is clear you are expected to eat the carrot where Cookingway can observe your honest reaction to his work."},{"name":"SYSTEM","text":"With great trepidation, you take a bite out of the carrot..."},{"name":"SYSTEM","text":"There is a satisfying crunch as you sink your teeth into the orange skin, and a warm tingling sensation runs down your spine. With the second bite, a wave of euphoria washes over you, and you drown in bliss. Alas, as you finish, the elation fades, leaving you with a desperate craving for another carrot."},{"name":"SYSTEM","text":"You are taken by surprise when blue juices burst forth from the carrot and dribble down your chin. As you take your second bite, you can feel your mental faculties sharpening. Your mind opens to the universe, and for a brief moment the mysteries of existence are simple, transformative truths...but the revelation is fleeting... When you at last finish the carrot, a sweet-yet-sour aftertaste lingers on your tongue, and the number forty-two in your mind."},{"name":"SYSTEM","text":"You snap off a piece of the carrot, enjoying its crunchy texture. Righteous confidence surges within you, a certainty that you are the center of the universe─that all creation is a story and you the star, beloved and perfect and special. A god, worthy of worship and prayer...or at the very least a second roll should the dice treat you poorly."},{"name":"SYSTEM","text":"The carrot is oddly tender, but as you begin to chew, a rich aroma fills your nostrils. A newfound vigor begins welling within you! The rumbling of your stomach, however, suggests it may simply be indigestion."},{"name":"LIVINGWAY","text":"The carrot met with your approval, yes?"},{"name":"COOKINGWAY","text":"What did you think? Unlike anything you've ever tasted, yes?"},{"name":"COOKINGWAY","text":"The carrot of happiness is full to bursting with nutrients and is guaranteed to leave you feeling satiated. It's a staple among us Loporrits."},{"name":"COOKINGWAY","text":"The philosopher's carrot improves mental fortitude. Something of a shock at first bite, but it's well worth the enhanced powers of cognition."},{"name":"COOKINGWAY","text":"The lucky carrot is...well...to be honest we're not quite sure how it was first made. A happy accident, you might say. But as the name suggests, after eating one, you'll feel blessed with good fortune."},{"name":"COOKINGWAY","text":"The iron carrot can be a bit difficult to digest, but the boost to endurance it promises makes it the perfect meal before a day of heavy lifting."},{"name":"COOKINGWAY","text":"We have plenty of other varieties, too. Bleeding carrots to improve blood flow, dream carrots to help with sleep..."},{"name":"COOKINGWAY","text":"So you see, we have a carrot for every occasion!"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"These carrots are...extraordinary..."},{"name":"A3","text":"But...what if I don't like carrots?"},{"name":"A3","text":"I can certainly see demand for this in Sharlayan."},{"name":"LIVINGWAY","text":"Then why do you seem so disappointed? If they're lacking somehow, we need to know."},{"name":"LIVINGWAY","text":"You don't like carrots...? Oh, you must mean you don't like them served in this fashion. Worry not─we have puréed versions on hand if you haven't the time to chew."},{"name":"LIVINGWAY","text":"Sharlayan? What in blazes is that?"},{"name":"YSHTOLA","text":"I take it you too had a wide assortment of carrots to choose from and naught else?"},{"name":"YSHTOLA","text":"If I may ask, what exactly did these collaborators share with you about cuisine on Etheirys? Surely you are aware we have an abundance of dishes and foods you could emulate?"},{"name":"LIVINGWAY","text":"Of course we are! But, well...it was only quite recently that we established contact..."},{"name":"LIVINGWAY","text":"Even holding a conversation was a struggle at first, so imagine our surprise when they sent a mountain of books and documents with no clear instructions. The sheer amount of information was overwhelming! If it wasn't for that encyclopedia I found, we would have been at a loss where to begin."},{"name":"LIVINGWAY","text":"And so we decided, rather than divide our resources to prepare a variety of middling and potentially unsatisfying meals, it would be more efficient to devote our efforts to the production of a single perfect food."},{"name":"THANCRED","text":"That's all well and good, but man cannot live on raw carrots alone."},{"name":"THANCRED","text":"Have you considered <span class=\"emphasis\">cooking</span> them?"},{"name":"COOKINGWAY","text":"You mean steaming, boiling, roasting, and the like? I suppose we <span class=\"emphasis\">could</span> prepare the carrots in other ways..."},{"name":"COOKINGWAY","text":"But our primary concern was efficiency, and what's more efficient than sinking your teeth into a carrot fresh from production?"},{"name":"THANCRED","text":"A rather strange approach to take for one named <span class=\"emphasis\">Cooking</span>way, isn't it?"},{"name":"COOKINGWAY","text":"Well, technically speaking, Cookingway isn't my given name. When first created, we were all named in the old tongue─you know, that otherwise impenetrable parlance the watcher speaks?"},{"name":"COOKINGWAY","text":"After we received a great tome of words─a dictionary, that is─from our collaborators, we learned your language. Adverbs, gerunds, present-continuous verb conjugations... Just the basics."},{"name":"COOKINGWAY","text":"Then, we found the terms related to our given tasks, and used them to form new names. Aren't they helpful?"},{"name":"THANCRED","text":"No, not really. But it does explain a great deal."},{"name":"URIANGER","text":"Wherefore didst thy kind deem such a change necessary?"},{"name":"COOKINGWAY","text":"When the rest of your people arrive, we want to be certain they understand immediately what each of us does. You'd never be able to pronounce our original names anyway."},{"name":"URIANGER","text":"I see..."},{"name":"YSHTOLA","text":"I hope our critiques, such as they are, were helpful to you."},{"name":"YSHTOLA","text":"Though if you should decide to preserve flora and fauna from Etheirys as well, you would be able to offer the passengers a more balanced diet."},{"name":"YSHTOLA","text":"Until such a day─one I pray comes sooner than later─it would appear there is naught but carrots on the menu."}],"reward":{"gil":963,"items":[{"num":2,"id":27854}]},"reqs":{"jobs":[{"lvl":84,"id":142}],"quests":[69937]},"next":[69939]},"partials":[{"type":"npc","id":"1039686","obj":{"i":1039686,"n":"Livingway","l":3711,"q":1}},{"type":"npc","id":"1038912","obj":{"i":1038912,"n":"Cookingway","l":3711,"q":1}},{"type":"item","id":"27854","obj":{"i":27854,"n":"Purple Carrot Juice","l":390,"c":24416,"t":46,"p":3359}},{"type":"quest","id":"69937","obj":{"i":69937,"n":"A Harey Situation","g":11,"l":"Mare Lamentorum","s":555}},{"type":"quest","id":"69939","obj":{"i":69939,"n":"Styled a Hero","g":11,"l":"Mare Lamentorum","s":557}}]}