{"quest":{"name":"Helping Hands","location":"Mare Lamentorum","id":69936,"patch":6.0,"sort":554,"icon":101114,"eventIcon":71201,"issuer":1038880,"target":1038894,"genre":11,"journal":["At long last, the watcher is ready to fulfill his final duty.","The watcher would guide you to the facility housing the moon's crew, but the terrain is not easily traversed. To that end, he suggests seeking the aid of Argos to ferry you there. The moon's aetherial guardian is nowhere to be seen, however, and so the watcher suggests calling for him near the Crushing Brand.","You arrive at the Crushing Brand, but you have further yet to go. Your true destination is a nearby cavern, the Chlorophosgrot. The watcher believes the ambient aether there should allow Argos to take form.","The cavern is covered in lunar spongoi, which draw aether from the ground and disperse it into the air. There is not yet enough ambient aether in the area, however, and so the watcher asks you to spare a small portion of your own, to speed the process and help Argos to manifest.","After a few moments, a swirling mass of aether takes shape, and Argos appears in a flash of light. The aetherial guardian is as friendly as before and, perhaps sensing what is to come, creates reflections of himself, one for each of your companions. With that, your party is ready to cross the chasm and meet the moon's crew.","The watcher will accompany you no further, but he bids you heed the counsel of the moon's pilots, and prays for your success. And so you turn to your companions and the guardians which will deliver you to the other side of the chasm.","Erring on the side of caution, Y'shtola suggests the two of you cross first, with Thancred and Urianger following soon after. The plan decided, you soar over the chasm and arrive at last at the facility where the caretakers await. Wherever could they be?","As you enter into the facility, devices on the lower floor whir to life. They soon open, and from within diminutive rabbit-like creatures emerge in droves, a sight in violent defiance of all expectation. These are Hydaelyn's chosen pilots, however, so perhaps there is more to them than meets the eye."],"objectives":["Speak with the watcher.","Speak with the watcher again.","Suffuse the lunar spongoi with aether.","Speak with the watcher.","Speak with Y'shtola.","Speak with Thancred."],"dialogue":[{"name":"THANCRED","text":"The moon...is a ship? Well, now I've heard everything."},{"name":"URIANGER","text":"I should very much like to hear more of this extraordinary story..."},{"name":"YSHTOLA","text":"It may be true, but others will struggle to believe it. I can scarcely believe it myself."},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">The time is come for you to be on your way.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">The crater at the heart of Mare Lamentorum, where Zodiark was imprisoned, is not so easily traversed, however.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Let us call upon Argos, the familiar whom you met earlier. He should have no trouble bearing you across.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">As Hydaelyn created me as the gaoler, so too did She create Argos as the guard...</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">It is his nature to appear when needed, and yet he is nowhere to be found. Strange... Mayhap the imbalancing of aether has affected him.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Let us make for the Crushing Brand, and attempt to call upon him there.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">You need but recall the path you walked with Argos before, and you will find your way.</span>"},{"name":"YSHTOLA","text":"If he labors in service to Hydaelyn's plan, I see no reason not to do as he suggests. Shall we make for this Crushing Brand, then?"},{"name":"THANCRED","text":"With a little preparation, it might be possible to traverse the gap on foot."},{"name":"THANCRED","text":"Then again, it would be a long, <span class=\"emphasis\">long</span> way down if one should slip... Perhaps another time."},{"name":"URIANGER","text":"Naught could prepare me for the boundless beauty of Etheirys. Shining, shimmering, amidst a sea of stars."},{"name":"URIANGER","text":"A blue sapphire, and but one of countless other jewels brimming with life, no doubt..."},{"name":"YSHTOLA","text":"So close and yet so far. Does not the harsh terrain remind you of somewhere we've been before? The Dravanian forelands, aye."},{"name":"YSHTOLA","text":"A place that rejects the intrusion of outsiders. Where solitude reigns supreme... At the very least, it sounds suitable for Zodiark's prison."},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">The place we seek is just ahead at the Chlorophosgrot.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">You see, Argos cannot manifest without sufficient concentrations of ambient aether.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">You would be hard-pressed to find a greater confluence than inside this cavern.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Follow me.</span>"},{"name":"THANCRED","text":"The guard of Zodiark's prison, eh? Blood red eyes, slavering maw, and built like a behemoth, I'd imagine. Let's hope he's friendly."},{"name":"URIANGER","text":"Curious... This place doth call to mind Pla Enni, home of the Nu Mou."},{"name":"YSHTOLA","text":"This entire cave is thrumming with ambient aether..."},{"name":"YSHTOLA","text":"Alas, any further analysis will have to wait."},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Yes, here will do nicely.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">The lunar spongoi draw aether from the ground, which is then dispersed in the air. At present, however, the ambient energies are not quite sufficient for Argos to manifest.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Might you be willing to spare some of your own to help the spongoi along?</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Given time, the lunar spongoi would suffuse this space with sufficient aether, but we need not wait if you are willing to provide a helping hand.</span>"},{"name":"SYSTEM","text":"Argos manifests in a flash. He seems glad to see you again."},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">A most fascinating creation of Hydaelyn's, would you not agree? Should the need arise, he is even able to create reflections of himself on a whim.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Though I assure you it was no reflection which accompanied you earlier to the brand.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">No, Argos was quite eager to be at your side then, as he is now, it seems.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">I cannot recall when last he showed such an affinity for anyone. Indeed, I thought him more likely to shy away from you and your companions.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Perhaps it was more than a sense of duty that compelled him to aid you before.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">As for your companions...</span>"},{"name":"YSHTOLA","text":"Unexpected, but greatly appreciated."},{"name":"YSHTOLA","text":"I believe we are all ready."},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Then let us return outside that you may cross the chasm.</span>"},{"name":"THANCRED","text":"I was expecting something a little more intimidating and less...“man's best friend.”"},{"name":"URIANGER","text":"To whom wouldst Hydaelyn entrust the command of so grand a vessel, I wonder?"},{"name":"YSHTOLA","text":"Dalamud has long been described as the “loyal hound” of Menphina due to its relation to the greater moon..."},{"name":"YSHTOLA","text":"It seems highly improbable─if not impossible─for ancient peoples to have known of Argos, but now I wonder whether there is some connection..."},{"name":"SYSTEM","text":"Argos favors you with what could almost be described as a conspiratorial grin."},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Your destination is the structure there across the Cradle of Darkness.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">But climb onto Argos's back, and he will take care of the rest.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Once you arrive, it should not take long to find the ship's crew. The facility is designed to rouse them from their slumber in the event of Zodiark's destruction.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Heed their counsel. Together, you may guide the star and its people to a kinder fate.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">This is where we part ways. But know that I shall ever be watching and praying for your success.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Worry not for me. Real though I may appear as you and yours, I am but a part of this moon. A creation of Hydaelyn, entrusted with the memories of an acquaintance long dead, but not forgotten.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">My charge of Zodiark has ended, but so long as the moon exists, I shall not want for purpose.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">I shall remain, ever watching, ever praying for your success.</span>"},{"name":"YSHTOLA","text":"Our ally's assurances notwithstanding, we cannot be certain what awaits us on the other side, so perhaps it would be best if we did not all go at once. I propose the two of us cross first while Thancred and Urianger wait here."},{"name":"Q1","text":"Ride Argos across the chasm?"},{"name":"YSHTOLA","text":"Onward!"},{"name":"YSHTOLA","text":"A malefic aether yet permeates from the crater. Remnants of Zodiark, most like."},{"name":"YSHTOLA","text":"Just a little further..."},{"name":"YSHTOLA","text":"This structure is enormous...though that is hardly surprising given the size of the average Amaurotine."},{"name":"THANCRED","text":"Apologies for the wait."},{"name":"YSHTOLA","text":"Right, then. Let us head inside and...oh?"},{"name":"URIANGER","text":"Most intriguing. A means by which he conserveth energy, mayhap?"},{"name":"THANCRED","text":"Well, I certainly wouldn't want him to blink out of existence on our account, helpful as he's been."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Thank you, Argos. We'll take things from here."},{"name":"A2","text":"Stay here where it's safe, all right?"},{"name":"YSHTOLA","text":"If Argos is to remain without, let us not keep him waiting overlong."},{"name":"Q3","text":"Ride Argos and return across the chasm?"},{"name":"URIANGER","text":"Truly a marvel beyond description."},{"name":"YSHTOLA","text":"Its scale is reminiscent of Amaurot, or rather, the replica we visited on the First."},{"name":"Q4","text":"Ride Argos across the chasm?"}],"reward":{"gil":1211},"reqs":{"jobs":[{"lvl":84,"id":142}],"quests":[69935]},"next":[69937]},"partials":[{"type":"npc","id":"1038880","obj":{"i":1038880,"n":"The Watcher","l":3711,"q":1}},{"type":"npc","id":"1038894","obj":{"i":1038894,"n":"Thancred","l":3711,"q":2}},{"type":"quest","id":"69935","obj":{"i":69935,"n":"In Shadow's Wake","g":11,"l":"Mare Lamentorum","s":553}},{"type":"quest","id":"69937","obj":{"i":69937,"n":"A Harey Situation","g":11,"l":"Mare Lamentorum","s":555}}]}