{"quest":{"name":"In from the Cold","location":"Garlemald","id":69930,"patch":6.0,"sort":548,"icon":101110,"eventIcon":71201,"issuer":1039931,"target":1039933,"genre":11,"journal":["Lucia has further news for you.","Lucia tells you that the contingent has made excellent progress in their plans to provide heat and sustenance for the remaining Garleans. As there is nothing so dire as to require your expertise, she asks that you check on Y'shtola.","After speaking with Y'shtola, you settle in for a restful supper with comrades old and new. Alas, the moment of peace is shattered by a great wave of aether from the Tower of Babil. Though members of the contingent are protected by their warding scales, the imperials are not so fortunate, and wail as the tempering force begins to twist and torment their minds. You move to help, but are caught off guard by the sudden appearance of Fandaniel, who puts you to sleep and whisks you away...<br><br>When you awaken, you find yourself seated at a table set for dinner across from Zenos, as a smirking Fandaniel looks on. It is then you realize that your body is not your own, your soul having been extracted and placed within borrowed flesh. Your hosts then proceed to wax poetic about the primal Anima─summoned with the corpse of Varis himself, Fandaniel reveals─and Zenos's unflagging desire to cross swords with you once again.","To spur you to accept his demand for a rematch, Zenos takes control of your true body, and you are forced to pursue him through half of Regio Urbanissima to prevent him from deceiving and harming your comrades. You catch up to him in the nick of time, but it appears there will be no celebrating this small victory, as Fandaniel gleefully announces that the Final Days are soon to begin. Having at last returned to Camp Broken Glass─and yourself─you take a moment to settle back into your body before reassuring your comrades that all is well.","Alisaie, like the others, is less than pleased with recent events, and more motivated than ever to put a stop to the cruel machinations of the Telophoroi. The time to defeat Fandaniel and Zenos once and for all draws nigh!"],"objectives":["Speak with Y'shtola.","Speak with Alisaie."],"dialogue":[{"name":"YSHTOLA","text":"I see that you're still standing. Might I convince you to sit down? ...No, I thought not."},{"name":"LUCIA","text":"I assume you're curious about how matters have progressed here in your absence. Quite well, as it happens."},{"name":"LUCIA","text":"Now that we've procured ceruleum from Tapper's Den, the recently repaired heaters can provide much-needed warmth."},{"name":"LUCIA","text":"Furthermore, we've prepared sufficient food for everyone. Those from Tertium shall find a hot meal waiting upon their arrival."},{"name":"LUCIA","text":"There's one for you, so go ahead and get some well-earned rest. I believe that we're capable of wielding a ladle or two without your assistance."},{"name":"LUCIA","text":"On your way, might I ask you to seek out Y'shtola? She was but recently attending to the wounded, but she's <span class=\"emphasis\">meant</span> to be taking a rest herself. See that she is."},{"name":"LUCIA","text":"Were it not for you, Alphinaud, and Alisaie, the people of Tertium may well have perished. Though they may not realize it yet, they owe you their lives."},{"name":"YSHTOLA","text":"Yes, yes, I have been taking proper breaks and imbibing sufficient water. But what of the Warrior of Light? You and the twins have an established history of reckless disregard for your own well-being."},{"name":"YSHTOLA","text":"We're all fortunate that none of you landed yourselves in my care. I've already quite enough to deal with, between the tempered and the Ist's wounded."},{"name":"YSHTOLA","text":"Alas, though I can mend their bodies, the toll their experiences have taken on their hearts and minds is another matter altogether."},{"name":"YSHTOLA","text":"For their sakes, we mustn't waver─but nor must we rush ahead in eagerness to see the day won, and in so doing invite disaster..."},{"name":"SYSTEM","text":"You must be a Disciple of War or Magic of level 83 or above to proceed."},{"name":"SYSTEM","text":"Upon settling down for supper, several cutscenes will play in sequence."},{"name":"SYSTEM","text":"It is recommended that you set aside sufficient time to view these scenes in their entirety."},{"name":"Q1","text":"Settle down for a restful supper?"},{"name":"ALPHINAUD","text":"Are you certain that you've recovered? You mustn't push yourself, especially after an experience like that."},{"name":"THANCRED","text":"No apologies necessary, least of all to me. If anything, there's a strange comfort in knowing I'm no longer the only one to have been used as a villain's puppet. Though I pray you'll be the last..."},{"name":"URIANGER","text":"Full glad am I to see thee awake and restored to thine own flesh once more."},{"name":"YSHTOLA","text":"Hm, yes...'tis still you..."},{"name":"YSHTOLA","text":"My apologies─I realized too late that the aether emanating from the tower was distorting my perception. 'Twas likely a temporary effect, but I remain wary."},{"name":"GRAHATIA","text":"Thank heavens you're you again. Gave me quite a fright."},{"name":"ESTINIEN","text":"Whatever that was, let's not do it again, eh?"},{"name":"LUCIA","text":"I will require a detailed report on what occurred whilst you were...not yourself. For the contingent, of course."},{"name":"LUCIA","text":"It can wait until later, however. For now, it's enough that you've returned."},{"name":"MAXIMA","text":"The body that you were forced to inhabit turned cold and stiff the moment you were returned to your own. Perhaps the soul it belonged to is long gone..."},{"name":"MAXIMA","text":"Let us pray it is so, for I doubt it would be better off in the care of Zenos or Fandaniel."},{"name":"ALISAIE","text":"You're certain you're well? Nothing out of place? No missing bits?"},{"name":"ALISAIE","text":"Good. Though I won't promise the same for Fandaniel and Zenos after I'm through with them..."},{"name":"ALISAIE","text":"How much must these people suffer before they're satisfied?"},{"name":"ALISAIE","text":"How many cruel, pointless tricks must they play?"},{"name":"ALISAIE","text":"Prelude to the Final Days or no, this ends now!"}],"reward":{"gil":2000},"reqs":{"jobs":[{"lvl":83,"id":142}],"quests":[69929]},"next":[69931]},"partials":[{"type":"npc","id":"1039931","obj":{"i":1039931,"n":"Lucia","l":3710,"q":2}},{"type":"npc","id":"1039933","obj":{"i":1039933,"n":"Alisaie","l":3710,"q":1}},{"type":"quest","id":"69929","obj":{"i":69929,"n":"Strange Bedfellows","g":11,"l":"Garlemald","s":547}},{"type":"quest","id":"69931","obj":{"i":69931,"n":"Gateway of the Gods","g":11,"l":"Garlemald","s":549}}]}