{"quest":{"name":"In Shadow's Wake","location":"Mare Lamentorum","id":69935,"patch":6.0,"sort":553,"eventIcon":71201,"issuer":1039989,"target":1038876,"genre":11,"journal":["The watcher would discuss grave matters with you."],"objectives":["Search for your comrades at the Watcher's Palace.","Inspect the dimly glowing crystal.","Inspect the faintly glowing crystal.","Inspect the warmly glowing crystal.","Inspect the brightly glowing crystal.","Speak with Y'shtola."],"dialogue":[{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Before we speak at length, I believe a change of surrounds is in order.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">I have more than ill tidings to share, you see. I sensed others arriving not long ago.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Though my communions with Hydaelyn have grown infrequent, I have learned enough from Her to know these are your comrades.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">And as luck would have it, they have already reached my abode. Come, let us join them.</span>"},{"name":"THANCRED","text":"Dare I ask what happened before we arrived?"},{"name":"URIANGER","text":"May we presume this being is a native of the moon?"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Yes, they are indeed the three I sensed.</span>"},{"name":"YSHTOLA","text":"Thank goodness you are unharmed."},{"name":"YSHTOLA","text":"We did what we could to subdue the tempered before making our way here."},{"name":"YSHTOLA","text":"Not without casualties, unfortunately. Some few detonated explosives, killing themselves and others."},{"name":"YSHTOLA","text":"The contingent's healers had their hands full tending to the injured and enthralled when we took our leave."},{"name":"URIANGER","text":"Lest you wonder, Mistress Krile hath also been delivered unto their care. Serving as a conduit for Hydaelyn's power hath taken its toll, but she will recover in due course."},{"name":"YSHTOLA","text":"As for Alphinaud and Alisaie, they insisted on remaining in Garlemald while we three rushed to your aid. It appears, however, that matters here have already come to a conclusion..."},{"name":"YSHTOLA","text":"But what manner of conclusion, if I might ask? And is this the ally whom Hydaelyn bade you seek out? He is not unlike the shades of Amaurot."},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Not unlike, perhaps, but not the same. I was created by Hydaelyn, together with this place. It has ever been my duty to keep vigil over Zodiark. Or rather, it <span class=\"emphasis\">was</span> my duty...</span>"},{"name":"YSHTOLA","text":"Then Zodiark is no more!?"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">And not without consequence, I am afraid, for now the delicate weave of the star, preserved by His presence, will begin to unravel.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">If you mean to avert the Final Days, you shall have need of─</span>"},{"name":"THANCRED","text":"Are you all right!?"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">My attempts to forestall Zodiark's release have all but exhausted my strength.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">If you might allow me to rest a short while, I will share with you all I can.</span>"},{"name":"YSHTOLA","text":"Please do. You need not exert yourself on our account."},{"name":"YSHTOLA","text":"These crystals contain records of your time here, yes? May we peruse them while we wait?"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">By all means. If you would review them chronologically, might I suggest beginning with those on the upper floor?</span>"},{"name":"YSHTOLA","text":"I shall leave that to you, <span class=\"highlight\">Forename</span>, while I see what can be gleaned from the crystals on these lower levels."},{"name":"THANCRED","text":"Zodiark defeated... While He may have been in an incomplete state, that's nevertheless an impressive feat."},{"name":"THANCRED","text":"But even if you hadn't, His demise was inevitable─Fandaniel would've seen to it one way or another."},{"name":"THANCRED","text":"That said, he probably would have wielded Zodiark's power to wreak untold destruction <span class=\"emphasis\">before</span> taking his own life, making this the better of two unfavorable outcomes."},{"name":"URIANGER","text":"Dost thou suppose our host hath maintained his solitary vigil since the very beginning, without rest or relief?"},{"name":"URIANGER","text":"If so, these records comprise the sum total of his existence. We must needs handle them with care."},{"name":"YSHTOLA","text":"Pray review the records on the upper floor, and I will see if there is aught to be learned down here."},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">A moment longer, friend...</span>"},{"name":"SYSTEM","text":"As you gaze into the crystal, ancient knowledge of Zodiark flows through your mind..."},{"name":"MEMORYA04399","text":"(-Crystalline Memories-)<span class=\"highlight-purple\">Daily summary: no abnormalities detected...<br>Daily summary: no abnormalities detected...<br>Daily summary: no abnormalities detected...</span>"},{"name":"SYSTEM","text":"These appear to be records of a long, lonely vigil on the moon, dating back to the beginning of Zodiark's imprisonment."},{"name":"SYSTEM","text":"As you gaze into the crystal, knowledge of past calamities flows through your mind..."},{"name":"SYSTEM","text":"The records describe how, with each Rejoining, Zodiark's thirst for freedom grew, as did the strain on the brands."},{"name":"SYSTEM","text":"Maintaining Zodiark's imprisonment appears to tax Hydaelyn greatly..."},{"name":"SYSTEM","text":"As you gaze into the crystal, knowledge of past Rejoinings flows through your mind..."},{"name":"SYSTEM","text":"The records describe the watcher's efforts to prepare in the event Zodiark broke free from His prison."},{"name":"SYSTEM","text":"The records go on to describe maintenance carried out regularly with the “Loporrits,” though it is not clear who or what they are."},{"name":"SYSTEM","text":"As you gaze into the crystal, a record of an unexpected visitor flows through your mind..."},{"name":"SYSTEM","text":"The records note the watcher's musings when Elidibus is spotted on the moon, though clearly not for the first time."},{"name":"MEMORYB04399","text":"(-Crystalline Memories-)<span class=\"highlight-purple\">It is clear he and his brethren have a keen interest in freeing Zodiark from His prison, and yet they have made no attempt to destroy the brands. Perhaps they prefer He remain hidden from mortal eyes until the final Rejoining.</span>"},{"name":"MEMORYB04399","text":"(-Crystalline Memories-)<span class=\"highlight-purple\">Perhaps they realize we would never dare bring harm to Zodiark, so long as He remains imprisoned.</span>"},{"name":"YSHTOLA","text":"Did you learn anything of import?"},{"name":"YSHTOLA","text":"So it is as we suspected. Maintaining the brands requires a great deal of Her energy and focus─and this cost has grown higher with every Rejoining."},{"name":"YSHTOLA","text":"That would explain why contact with Her has become rather infrequent since the Seventh Umbral Calamity."},{"name":"YSHTOLA","text":"I too made a rather startling discovery..."},{"name":"YSHTOLA","text":"This heavenly body we know to be the moon was in fact created by Hydaelyn!"},{"name":"YSHTOLA","text":"When the watcher said he was created together with this place, I thought he only meant this facility... Truly, Hydaelyn's powers are far beyond anything I could have imagined."}],"reward":{"gil":1170,"items":[{"id":35686}]},"reqs":{"jobs":[{"lvl":84,"id":142}],"quests":[69934]},"next":[69936]},"partials":[{"type":"npc","id":"1039989","obj":{"i":1039989,"n":"The Watcher","l":3711,"q":2}},{"type":"npc","id":"1038876","obj":{"i":1038876,"n":"Y'shtola","l":3711,"q":1}},{"type":"item","id":"35686","obj":{"i":35686,"n":"Phrygian Weapon Coffer (IL 533)","l":1,"c":26557,"t":61}},{"type":"quest","id":"69934","obj":{"i":69934,"n":"The Martyr","g":11,"l":"Mare Lamentorum","s":552}},{"type":"quest","id":"69936","obj":{"i":69936,"n":"Helping Hands","g":11,"l":"Mare Lamentorum","s":554}}]}