{"quest":{"name":"Styled a Hero","location":"Mare Lamentorum","id":69939,"patch":6.0,"sort":557,"eventIcon":71201,"issuer":1038908,"target":1038927,"genre":11,"journal":["Livingway is eager to show you more of the moon's wonders."],"objectives":["Speak with Livingway.","Speak with the restless Loporrit.","Speak with the jubilant Loporrit while wearing your new attire.","Speak with Livingway while wearing your new attire.","Speak with the fidgeting Loporrit.","Speak with Growingway.","Speak with Growingway again."],"dialogue":[{"name":"THANCRED","text":"I hate to admit it, but...I did rather like the carrots."},{"name":"URIANGER","text":"Hmm..."},{"name":"YSHTOLA","text":"While I'm sure the Loporrits would hop at the chance to expound upon carrots in exhaustive detail, perhaps it's time we moved on?"},{"name":"COOKINGWAY","text":"Hungry for more carrots? Fear not, you can eat to your heart's content after you've seen the rest of Bestways Burrow."},{"name":"LIVINGWAY","text":"I think we've had our fill of carrots for now. Let's move on to other necessities, shall we?"},{"name":"LIVINGWAY","text":"Our clothing production is sure to impress. This way!"},{"name":"THANCRED","text":"It's hardly Sunsilk Tapestries, but perhaps we'll be pleasantly surprised."},{"name":"URIANGER","text":"Garments born of the heavens, crafted with methods ancient and forgotten. Dress befitting we who walk in shade, stewards of the esoteric..."},{"name":"YSHTOLA","text":"Do you suppose the clothes they prepared will be as grossly oversized as the carrots?"},{"name":"LIVINGWAY","text":"Here we are─the apparel production station."},{"name":"LIVINGWAY","text":"We've chosen to employ more traditional methods for this task─creation magicks!"},{"name":"LIVINGWAY","text":"Hydaelyn, in Her infinite wisdom, blessed us with the selfsame affinity for magic Her people possessed. We have other amazing talents, of course─and I know you're dying to hear about them─but I will regale you with the details another time."},{"name":"LIVINGWAY","text":"That said, we did run into a spot of trouble at first. Our magic alone was not sufficient to see our work done."},{"name":"LIVINGWAY","text":"In the end, we discovered crystallized aether was a wonderful catalyst that could provide us with the extra vis we needed."},{"name":"YSHTOLA","text":"My, how resourceful."},{"name":"LIVINGWAY","text":"Ah, the sweet sound of recognition! You will also be impressed to hear we've read all about your habit of changing attire to match your chosen profession. For the sake of efficiency, I presume? This has also been taken into account with our designs."},{"name":"LIVINGWAY","text":"But why take my word for it when you can simply try on our clothes?"},{"name":"LIVINGWAY","text":"Make yourselves known to the workers and they will see to the rest!"},{"name":"LIVINGWAY","text":"If you're worried about sizing, don't be. It should be a simple matter to adjust our concepts as required...and it <span class=\"emphasis\">will</span> be required."},{"name":"LOPORRITA04403","text":"Ah! I-It's you! One of the visitors from Etheirys! Goodness me, Mappingway wasn't kidding─<span class=\"alternative-container\"><span class=\"alternative\">you're barely taller than we are</span><span class=\"alternative\">you really <span class=\"emphasis\">are</span> smaller than the watcher</span></span>."},{"name":"LOPORRITA04403","text":"Oh, right! You're here to try on a set of clothes, yes?"},{"name":"LOPORRITA04403","text":"What would you have me fashion for you today?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"An outfit that embodies my bloodlust."},{"name":"A1","text":"Something simple, yet functional."},{"name":"A1","text":"A fashionable and refined ensemble."},{"name":"LOPORRITA04403","text":"Embodies your...what?"},{"name":"LOPORRITA04403","text":"Simple and functional. Right."},{"name":"LOPORRITA04403","text":"Fashionable... Right..."},{"name":"LOPORRITA04403","text":"Ahem. This will only take a moment."},{"name":"LOPORRITA04403","text":"There we are. All finished!"},{"name":"LOPORRITA04403","text":"A perfect fit, if I do say so myself."},{"name":"LOPORRITA04403","text":"I would be lying if I said I understand what bloodlust is, but I assume it's something you enjoy. I made certain the clothes are flexible yet sturdy enough to endure...whatever it is you plan to do while wearing them."},{"name":"LOPORRITA04403","text":"Nothing too billowy or frilly, as you can see. Also light and durable─sure to serve you well wherever your travels might take you!"},{"name":"LOPORRITA04403","text":"I'll be honest─I know nothing of fashion, let alone fashion on Etheirys. B-But I'd wager no one down there has ever worn anything like this fine ensemble. Perhaps you can start a new trend!"},{"name":"LOPORRITA04403","text":"Would you look at that. Speechless! And there I thought you may not like it."},{"name":"LOPORRITA04403","text":"If you've a mind to try something else, why not speak with my fellow artisans?"},{"name":"LOPORRITA04403","text":"I'm sure they'd be happy to oblige."},{"name":"SYSTEM","text":"You must continue wearing these garments in order to progress."},{"name":"SYSTEM","text":"You will change back to your normal garments if you move too far away. Look to your map for the garment change's area of effect."},{"name":"SYSTEM","text":"Speak with the restless Loporrit to restore or prolong the garment change."},{"name":"LOPORRITA04403","text":"Oh no! What happened to your outfit? Not to worry, I have another right here."},{"name":"LOPORRITA04403","text":"A fresh change of clothes? Say no more!"},{"name":"LOPORRITB04403","text":"Ah! N-No one said you'd be coming! Could you give me a moment to clean up my station?"},{"name":"SYSTEM","text":"You must be wearing garments provided by the restless Loporrit in order to progress."},{"name":"LOPORRITB04403","text":"Ah! N-No one said you'd be coming! Er...how can I help you?"},{"name":"LOPORRITB04403","text":"You wish to try my clothes? Really?"},{"name":"LOPORRITB04403","text":"O-Of course! It would be my honor! Did you have anything in mind?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Got anything with a little more...flair?"},{"name":"A1","text":"I'm looking for clothes with an altogether different design."},{"name":"A1","text":"Surprise me!"},{"name":"LOPORRITB04403","text":"I-I think I can handle that. Let's see..."},{"name":"LOPORRITB04403","text":"This should do!"},{"name":"LOPORRITB04403","text":"Some of my best work yet."},{"name":"LOPORRITB04403","text":"Times and tastes truly have changed. It used to be so rare for anyone to request clothing with a focus on form over function."},{"name":"LOPORRITB04403","text":"Thankfully, I had a spare concept for robes made using a different fabric. I think it looks rather fetching."},{"name":"LOPORRITB04403","text":"You're a strange one, aren't you? I honestly wasn't sure what to do when you didn't ask for anything specific."},{"name":"LOPORRITB04403","text":"I take my work seriously, however, and am never one to disappoint. That ensemble is a blend of concepts from myriad professions─all-purpose attire for the modern <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of Etheirys!"},{"name":"LOPORRITB04403","text":"It's a relatively new concept incorporating an idea that's never been tried with clothing before."},{"name":"LOPORRITB04403","text":"Fragrance! Can you smell the carrots? &lt;sniff&gt; &lt;sniff&gt; Ah, simply divine!"},{"name":"LOPORRITB04403","text":"I was worried how the concept would turn out when put to the proof, but it looks stunning on you!"},{"name":"LOPORRITB04403","text":"Won't you go and show Livingway? I'm sure she's eager to see what we've come up with."},{"name":"SYSTEM","text":"You must continue wearing these garments in order to progress."},{"name":"SYSTEM","text":"You will change back to your normal garments if you move too far away. Look to your map for the garment change's area of effect."},{"name":"SYSTEM","text":"Speak with the jubilant Loporrit to restore or prolong the garment change."},{"name":"LOPORRITB04403","text":"What happened to my concept? No matter─I can fix this!"},{"name":"LOPORRITB04403","text":"Looking for a fresh set, are we? Here you go."},{"name":"LOPORRITA04403","text":"The people of Etheirys are sure to love that concept."},{"name":"LIVINGWAY","text":"Oh? What happened to the change of wardrobe?"},{"name":"SYSTEM","text":"You must be wearing garments provided by the jubilant Loporrit in order to progress."},{"name":"LIVINGWAY","text":"My, don't we look splendid!"},{"name":"LIVINGWAY","text":"The result of much trial and error, but I know quality work when I see it."},{"name":"LIVINGWAY","text":"Shhh. You needn't speak. I can see your adoration for the moon and we Loporrits in your eyes. No doubt your friends feel the same having sampled our creations."},{"name":"THANCRED","text":"Sorry to have kept you waiting..."},{"name":"YSHTOLA","text":"They insisted we sample <span class=\"emphasis\">all</span> of their concepts ere we returned."},{"name":"URIANGER","text":"Verily, 'tis an ensemble most becoming."},{"name":"SCIONS","text":"(-Scions-)......"},{"name":"THANCRED","text":"...I think it's past time we returned these clothes."},{"name":"LIVINGWAY","text":"I was so confident our garments would meet with your approval... &lt;sigh&gt; Whatever are we doing wrong?"},{"name":"LIVINGWAY","text":"The watcher taught us that, in his time, everyone wore the same robes. To do otherwise was against social etiquette."},{"name":"LIVINGWAY","text":"We thought we could appeal to modern tastes by tailoring the robes to specific professions, but..."},{"name":"YSHTOLA","text":"Please, you mustn't be so hard on yourself. Should we resort to evacuating the people of Etheirys, they will most certainly have need of your attire."},{"name":"YSHTOLA","text":"'Tis clear you spared no effort in addressing our needs, but you must understand that we are not quite so...homogenous."},{"name":"YSHTOLA","text":"Speaking for myself, what I wear now better suits my tastes, even if it is of inferior make."},{"name":"YSHTOLA","text":"But there are others whose choices may be influenced by traditions or personal experience. Rather than make assumptions for the whole, you must consider the individual and their potential preferences."},{"name":"LIVINGWAY","text":"I fear we've underestimated the complexity and diversity of your people. &lt;sigh&gt; Even if we'd memorized every tome we received, I doubt we'd have fared much better."},{"name":"LIVINGWAY","text":"Maybe we're doing you a disservice trying to shower you with our baubles and frippery, thinking it was for your benefit when you'd be better off on your own..."},{"name":"THANCRED","text":"...There are some who might agree. People who prefer to keep others at arm's length, even when they know they shouldn't. "},{"name":"THANCRED","text":"As one such former fool, I'd like to ask you a question."},{"name":"THANCRED","text":"This plan to evacuate and escape the Final Days─did it account for the reflections of the Source as well? "},{"name":"LIVINGWAY","text":"Um... Not that I'm aware of..."},{"name":"LIVINGWAY","text":"We were born of Hydaelyn's love for Etheirys, and the salvation of the people on that star, and that star alone, has ever been our aim."},{"name":"LIVINGWAY","text":"Surely it's better to devote ourselves to saving one world than to divide our efforts across fourteen, and risk failing them all?"},{"name":"THANCRED","text":"...I suppose you're right."},{"name":"YSHTOLA","text":"Livingway, might we have leave to explore Bestways Burrow unattended? You have given us much to think about."},{"name":"LIVINGWAY","text":"Why, certainly."},{"name":"YSHTOLA","text":"Until later, then."},{"name":"URIANGER","text":"If I may, I should like to accompany thee a while longer."},{"name":"LIVINGWAY","text":"Really!?"},{"name":"LIVINGWAY","text":"I-I mean, you're more than welcome to. There was actually something I wished to speak with you about."},{"name":"LIVINGWAY","text":"Let's be off then, shall we?"},{"name":"GROWINGWAY","text":"(-Fidgeting Loporrit-)Hmmm......"},{"name":"GROWINGWAY","text":"Ahhh! M-My apologies. I wasn't trying to spy or anything."},{"name":"GROWINGWAY","text":"Everyone's been talking about the visitors come from Etheirys, and I wanted to see what all the fuss was about."},{"name":"GROWINGWAY","text":"I was excited at first, but now...now I'm worried."},{"name":"GROWINGWAY","text":"What if the people of Etheirys refuse to come? What if we can't save them!?"},{"name":"GROWINGWAY","text":"&lt;sigh&gt; It's clear we've made a mess of things."},{"name":"GROWINGWAY","text":"Oh, but wait! You still haven't visited the domiciles! Once you see them, you'll understand how wonderful the moon truly is, I'm sure of it."},{"name":"GROWINGWAY","text":"(-Growingway-)I'll be waiting for you by the teleporter near the entrance. Oh, and the name's Growingway, by the way. See you soon!"},{"name":"GROWINGWAY","text":"You're here! You're really here!"},{"name":"GROWINGWAY","text":"Thank you! Thank you so much, uh...er... Sorry, what should I call you?"},{"name":"GROWINGWAY","text":"<span class=\"highlight\">Forename Surname</span>, eh? Crikey, even your names are amazing."},{"name":"GROWINGWAY","text":"Well, <span class=\"highlight\">Forename</span>, we'll be using this teleporter to enter the residential area."},{"name":"GROWINGWAY","text":"Whenever you're ready."},{"name":"SYSTEM","text":"Proceed to the residential area?"},{"name":"GROWINGWAY","text":"Gosh, that was embarrassing. I promise to be more careful from now on."},{"name":"GROWINGWAY","text":"Since the residential quarters are closed for now, I've rerouted the teleporter to allow travel between floors instead. Hopefully it proves useful in the meantime."},{"name":"GROWINGWAY","text":"&lt;sigh&gt; A shame you couldn't see it, though. You really would've liked it."},{"name":"SYSTEM","text":"You can now travel between the upper and lower floors of Bestways Burrow via the teleporter."}],"reward":{"gil":1335,"items":[{"id":35690}]},"reqs":{"jobs":[{"lvl":84,"id":142}],"quests":[69938]},"next":[69776,69777,69778,69779,69780,69781,69782,69940]},"partials":[{"type":"npc","id":"1038908","obj":{"i":1038908,"n":"Livingway","l":3711,"q":1}},{"type":"npc","id":"1038927","obj":{"i":1038927,"n":"Growingway","l":3711,"q":2}},{"type":"item","id":"35690","obj":{"i":35690,"n":"Phrygian Leg Gear Coffer (IL 533)","l":1,"c":26561,"t":61}},{"type":"quest","id":"69938","obj":{"i":69938,"n":"A Taste of the Moon","g":11,"l":"Mare Lamentorum","s":556}},{"type":"quest","id":"69776","obj":{"i":69776,"n":"True Carrot Crimes","g":124,"l":"Mare Lamentorum","s":1801,"f":1}},{"type":"quest","id":"69777","obj":{"i":69777,"n":"Carrots: It's What's for Dinner","g":124,"l":"Mare Lamentorum","s":1810,"f":1}},{"type":"quest","id":"69778","obj":{"i":69778,"n":"A Strange New Moon","g":124,"l":"Mare Lamentorum","s":1820}},{"type":"quest","id":"69779","obj":{"i":69779,"n":"Getting to Know You","g":124,"l":"Mare Lamentorum","s":1830}},{"type":"quest","id":"69780","obj":{"i":69780,"n":"Over the Rainbow Crystal","g":124,"l":"Mare Lamentorum","s":1840}},{"type":"quest","id":"69781","obj":{"i":69781,"n":"All Fun and Games","g":124,"l":"Mare Lamentorum","s":1850}},{"type":"quest","id":"69782","obj":{"i":69782,"n":"Clothes Maketh the Man","g":124,"l":"Mare Lamentorum","s":1860}},{"type":"quest","id":"69940","obj":{"i":69940,"n":"All's Vale That Endsvale","g":11,"l":"Mare Lamentorum","s":558}}]}