{"quest":{"name":"A Harey Situation","location":"Mare Lamentorum","id":69937,"patch":6.0,"sort":555,"eventIcon":71201,"issuer":1038894,"target":1038903,"genre":11,"journal":["Thancred's dumbfounded expression suggests he is still struggling to comprehend the spectacle he has just witnessed."],"objectives":["Speak with the chipper Loporrit.","Speak with the dozing Loporrit.","Speak with the snappy Loporrit.","Speak with the snappy Loporrit again."],"dialogue":[{"name":"URIANGER","text":"Given the present crisis, Hydaelyn doubtless sought to facilitate cooperation betwixt pilot and passenger..."},{"name":"URIANGER","text":"Indeed, 'twould require a heart as hard as diamond to raise one's voice in anger to beings possessed of such profound...saccharinity."},{"name":"YSHTOLA","text":"I find Urianger's reasoning somewhat flimsy, but the crew seems amicable enough."},{"name":"THANCRED","text":"They must be the Loporrits mentioned in the watcher's records."},{"name":"THANCRED","text":"Not at all what I expected. But the watcher did bid us heed their counsel..."},{"name":"THANCRED","text":"I assume the one who gave that rousing speech was their leader, though we might have to ask about in order to track them down. Come on then, let us be about it."},{"name":"THANCRED","text":"I only saw them from a distance, but their fur was brown if that helps at all."},{"name":"URIANGER","text":"The Loporrits all appear to have set about their tasks. Whither is their leader, I wonder?"},{"name":"YSHTOLA","text":"Such a fascinating apparatus, though it's hard to believe it could house so many crew members. Even so, there is nothing else here to suggest other types of accommodation."},{"name":"SINGINGWAY","text":"Hum hum-hummm～♪"},{"name":"SINGINGWAY","text":"(-Singingway-)The leader of the crew? Not me, I'm afraid. Singingway's the name!"},{"name":"SINGINGWAY","text":"(-Singingway-)I'm in charge of the construction and maintenance of the atmospheric circulation system. Only the crispest, cleanest air for the people of Etheirys─and that's a promise!"},{"name":"SLEEPINGWAY","text":"Mlem mlem mlem... Leader...? No..."},{"name":"SLEEPINGWAY","text":"(-Sleepingway-)Sleepingway... My job is...is... Hmm. Perhaps I'd better ask..."},{"name":"LIVINGWAY","text":"Wh-What!? How in the─!?"},{"name":"LIVINGWAY","text":"When did you get here? Who let you in? Why wasn't I told!?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Take me to your leader."},{"name":"A1","text":"Were you the one giving orders earlier?"},{"name":"A1","text":"Hum hum-hummm～♪"},{"name":"LIVINGWAY","text":"Leader? Ah, yes─ahem! Look no further─I am the one you seek."},{"name":"LIVINGWAY","text":"Me? Oh, yes─of course! As the only one around here capable of doing <span class=\"emphasis\">anything</span> properly, it falls to me to take charge of the others."},{"name":"LIVINGWAY","text":"...What was that supposed to be? Your humming─if one can even call it that─is atrociously off-key! It should sound more like this!"},{"name":"LIVINGWAY","text":"As leader of the Loporrits, I cannot allow substandard attempts at musicality to go unremarked, even if you <span class=\"emphasis\">are</span> a guest. But being the magnanimous sort that I am, I'll forgive you this once."},{"name":"THANCRED","text":"Well, well. Looks like you beat us here."},{"name":"LIVINGWAY","text":"Your friends, I take it. Is this all of them?"},{"name":"LIVINGWAY","text":"A group comprised entirely of children? What must their parents be thinking?"},{"name":"LIVINGWAY","text":"This isn't a nursery, after all. Though perhaps we should build one. Or did we build one already?"},{"name":"LIVINGWAY","text":"No matter. You needn't worry your pretty little heads. All will be well, I promise."},{"name":"LIVINGWAY","text":"But goodness me, we shouldn't be standing about gawping. I must take you to meet the others."},{"name":"LIVINGWAY","text":"If you could run along back toward the entrance, you'll find a path that leads to the central platform on the upper floor."},{"name":"LIVINGWAY","text":"There's no wrong way to reach it, but it's the large, glowing ball at the center, if you should find yourselves lost."},{"name":"LIVINGWAY","text":"I shall gather the others and meet you there."},{"name":"THANCRED","text":"Well, then. Back to the upper floor it is."},{"name":"THANCRED","text":"Given their size, getting from one end of this place to the other must be exhausting. I honestly don't know how they do it."},{"name":"URIANGER","text":"'Tis astounding how the Loporrits─despite their diminutive stature─are able to maintain such gargantuan facilities."},{"name":"YSHTOLA","text":"The aetheric composition and density of this sphere is quite similar to the crystalline concepts we've seen before. It likely shares their capacity for storing memories and knowledge."},{"name":"MAPPINGWAY","text":"Visitors, at last. Welcome!"}],"reward":{"gil":1005,"items":[{"id":35688}]},"reqs":{"jobs":[{"lvl":84,"id":142}],"quests":[69936]},"next":[69938]},"partials":[{"type":"npc","id":"1038894","obj":{"i":1038894,"n":"Thancred","l":3711,"q":2}},{"type":"npc","id":"1038903","obj":{"i":1038903,"n":"Snappy Loporrit","l":3711,"q":1}},{"type":"item","id":"35688","obj":{"i":35688,"n":"Phrygian Chest Gear Coffer (IL 533)","l":1,"c":26559,"t":61}},{"type":"quest","id":"69936","obj":{"i":69936,"n":"Helping Hands","g":11,"l":"Mare Lamentorum","s":554}},{"type":"quest","id":"69938","obj":{"i":69938,"n":"A Taste of the Moon","g":11,"l":"Mare Lamentorum","s":556}}]}