{"quest":{"name":"Gateway of the Gods","location":"Garlemald","id":69931,"patch":6.0,"sort":549,"icon":101111,"eventIcon":71201,"issuer":1039940,"target":1039969,"genre":11,"journal":["Now that you've recovered, Lucia would have a word with you.","As you recount what befell you whilst Zenos was occupying your body, it becomes clear to those present that both the primal Anima and the Telophoroi are based in the Tower of Babil─as suspected─so it is there that you must go to confront them. Fortunately, contingent scouts have identified a viable route of ingress, and Lucia has a plan of attack already prepared. While others create a diversion above ground, you are to slip into the tower via an underground tunnel alongside the Scions and some few allies.","Your meeting with Lyse and company at Forum Patens to review your roles in the coming operation proceeds smoothly, with no more than the usual amount of bickering amongst the Azim Steppe delegation. So as not to attract attention, the group will need to travel separately until you reach the Enceladeum, where the entrance to the tunnel can be found.","Pipin greets you at the Enceladeum, unaware of the details of your possession but nevertheless pleased to see you recovered enough to take part in the battle to come. He directs you to the representative from Lente's Tears who will serve as your guide to the underground station, promising to send your other comrades along when they arrive.","You enter the underground station, where you are soon joined by your remaining comrades. A ruckus can be heard from above ground─your cue to board the train and infiltrate the Tower of Babil.<br><br>※To enlist your companion NPCs for this duty, speak with them near the entrance or access Duty Support via the main menu. Use the Duty Finder if you wish to complete the instance alongside fellow players.","Fighting past tempered soldiers and all manner of monstrosities, you succeed in breaching the top of the tower, where you come face-to-face with the terrifying primal known as Anima. Demonstrating your might is more fearsome than any would-be god of empire, you succeed in putting the soul of His Radiance, Varis zos Galvus, to rest at last. Now nothing stands between you and the long-awaited confrontation with the Telophoroi's commanders.","Though you catch Zenos and Fandaniel in the act, they have already harnessed much of the tower's aether and nearly succeeded in freeing Zodiark from His imprisonment. Suddenly, Krile appears, her body acting as a conduit for Hydaelyn, who is able to preserve the remaining shackles that bind Her ancient foe. For a moment, it appears that Fandaniel's plan has failed when the last of the tower's aether is exhausted, but he quickly changes tack and teleports himself and Zenos to the moon, that they might destroy the protective barrier in person. As a parting gift, they reveal that Anima, as its final act, issued an order to the tempered throughout Garlemald to fight unto their dying breath, and this diversion is enough to allow the Telophoroi to utilize their gate and make their escape. For a mercy, Hydaelyn manages to divert their aether current far from their destination, giving you a chance to travel to the moon yourself and forestall Zodiark's release.","Alphinaud and the other Scions vow to prevent the situation in Garlemald from escalating and spare the tempered a terrible fate. Meanwhile, you alone must pursue the Telophoroi to the moon, and stop them ere it is too late."],"objectives":["Speak with Lyse.","Speak with Pipin.","Wait at the destination inside the station.","Enter the Tower of Babil.","Clear the Tower of Babil.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"I realize that my sister is...eager to proceed, but please be sure that you've fully recovered before you throw caution to the wind."},{"name":"ALISAIE","text":"So, how shall we strike them down?"},{"name":"THANCRED","text":"...I suppose your experience was a bit different, though. Unlike you, I had the pleasure of being stuck with Lahabrea while he went gallivanting about doing a poor impression of me. It adds another layer to the insult, believe you me."},{"name":"URIANGER","text":"Full glad am I to see thee awake and restored to thine own flesh once more."},{"name":"YSHTOLA","text":"Hm, yes...'tis still you..."},{"name":"YSHTOLA","text":"My apologies─I realized too late that the aether emanating from the tower was distorting my perception. 'Twas likely a temporary effect, but I remain wary."},{"name":"GRAHATIA","text":"Thank heavens you're you again. Gave me quite a fright."},{"name":"ESTINIEN","text":"Whatever that was, let's not do it again, eh?"},{"name":"MAXIMA","text":"The body that you were forced to inhabit turned cold and stiff the moment you were returned to your own. Perhaps the soul it belonged to is long gone..."},{"name":"MAXIMA","text":"Let us pray it is so, for I doubt it would be better off in the care of Zenos or Fandaniel."},{"name":"LUCIA","text":"Are you well enough to make your report?"},{"name":"LUCIA","text":"This “Anima” was summoned with the corpse of Emperor Varis? Does their depravity know no bounds?"},{"name":"YSHTOLA","text":"It seems not. More to the point, we can surmise that wave of aether issued not from the Tower of Babil, but from the primal lurking within it..."},{"name":"YSHTOLA","text":"A primal whose cry rang rather more loudly in your ears than ours."},{"name":"YSHTOLA","text":"If you were taken to the tower itself, then this proves beyond a shadow of a doubt that it is the beating heart of the Telophoroi's machinations."},{"name":"LUCIA","text":"In which case, we have some highly relevant information."},{"name":"LUCIA","text":"As many of you know, ever since we dispatched troops to free the Leveilleurs, we've been developing a plan to infiltrate the tower."},{"name":"LUCIA","text":"According to Thancred and his scouts, the main structure is lousy with tempered and enemy magitek."},{"name":"LUCIA","text":"Furthermore, the road leading to it has collapsed, making it difficult to approach in numbers."},{"name":"MAXIMA","text":"Thus do we propose dividing our forces into two parties─one to distract, and one to infiltrate."},{"name":"MAXIMA","text":"The diversionary force will be comprised of the Ishgardian, Gridanian, and Lominsan delegations."},{"name":"MAXIMA","text":"They will begin the construction of bridges, to make the Telophoroi believe we are marching upon the tower."},{"name":"MAXIMA","text":"Meanwhile, the best suited of our Ala Mhigan, Ul'dahn, and Eastern comrades will use a different method of ingress."},{"name":"THANCRED","text":"Look here."},{"name":"THANCRED","text":"The facility marked in red is the Enceladeum, a vast magitek manufactory. In ruins now, of course."},{"name":"THANCRED","text":"But the freight tunnel connecting it to the erstwhile imperial palace remains intact."},{"name":"THANCRED","text":"While the Telophoroi's attention is elsewhere, our infiltration force can use it to enter the tower undetected."},{"name":"THANCRED","text":"Be aware, however, that the underground rail network remains very much operational."},{"name":"THANCRED","text":"The tempered are using it to bring supplies to the tower even now."},{"name":"ALPHINAUD","text":"...If it can carry their materiel, it can carry us too, providing we sneak aboard unseen."},{"name":"LUCIA","text":"The Scions will lead the infiltration party. Once inside, you must locate and dispatch Fandaniel and Zenos."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We will save the people of Garlemald─and those who suffer the world over."},{"name":"A1","text":"I'll have my vengeance yet."},{"name":"A1","text":"It's time we ended this, once and for all."},{"name":"ALPHINAUD","text":"Aye. Jullus and so many others have lost much to the Telophoroi. We shall ensure they lose no more."},{"name":"ALISAIE","text":"We'll get our fill─you and me both."},{"name":"ALPHINAUD","text":"Aye. There will be no more casualties of the Telophoroi's maniacal ambition."},{"name":"YSHTOLA","text":"How quickly can we enact this plan?"},{"name":"YSHTOLA","text":"Fandaniel made it quite clear that haste is a priority."},{"name":"GRAHATIA","text":"Of paramount concern, even, assuming he didn't name the tower “Babil” on a whim."},{"name":"GRAHATIA","text":"In Amon's time, it meant “gateway of the gods.” Xande used it to refer to a voidgate, but in this case, it almost certainly alludes to something altogether greater..."},{"name":"GRAHATIA","text":"...The eldest and most powerful of primals."},{"name":"LUCIA","text":"All the more reason to act now. The rest of the contingent is aware of the plan, and are ready to move at a moment's notice."},{"name":"LUCIA","text":"You are to proceed north to Forum Patens. Lyse's group will meet you there."},{"name":"YSHTOLA","text":"As ever, we are grateful for your foresight."},{"name":"YSHTOLA","text":"This is the moment we've been waiting for. Spare no effort in your preparations."},{"name":"LUCIA","text":"Lyse's party ought to have secured the tunnel by now. Rendezvous with them and make your way inside."},{"name":"LUCIA","text":"May the Fury guide you...and us all."},{"name":"MAXIMA","text":"Those not taking part in the assault will defend this camp and the airships, as well as safeguard your escape route from the tower."},{"name":"MAXIMA","text":"You need not worry about what comes after─so fight with all you have."},{"name":"CIRINA","text":"I am to accompany you into the tower. It is an honor, as ever!"},{"name":"SADU","text":"&lt;sneeze&gt; Damn these frigid lands. &lt;snort&gt;"},{"name":"MAGNAI","text":"The Sun does not <span class=\"emphasis\">sneak</span>. ...However, he will travel this path of yours, and those who walk with him will bask in his radiance."},{"name":"LYSE","text":"<span class=\"highlight\">Forename</span>! The way into the tunnel is clear. We've made sure of it."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I wish you'd made sure to bring a coat instead."},{"name":"A2","text":"Then we'd best get in there before we freeze. Especially you."},{"name":"LYSE","text":"Oh, I'll warm up when I throw a punch or two."},{"name":"LYSE","text":"Oh, the shoe will be on the other foot once we're in, believe you me. A good fight should warm us right up!"},{"name":"MAGNAI","text":"Hmph. Barely enough cloth to swaddle a newborn. Clearly, you have spent too long around this feral dog of a Dotharl."},{"name":"SADU","text":"Watch your tongue, fool, lest I feed it to the crows!"},{"name":"MAGNAI","text":"We will see who is the fool when you freeze to death. Expect me not to warm your ill-prepared hide─these furs are for myself and my Nhaama alone, should I be blessed to meet her this day."},{"name":"SADU","text":"As if any woman of worth would wish to be warmed by you, “little sun.” Should we find such a warrior within, she will bask in <span class=\"emphasis\">my</span> glorious flame."},{"name":"CIRINA","text":"Stop, both of you! Save your fire for the enemy. As for extra furs, I have plenty to spare!"},{"name":"YSHTOLA","text":"As do we."},{"name":"LYSE","text":"Hello, everyone! All set for battle, I see."},{"name":"YSHTOLA","text":"Yes, free of unnecessary encumbrances, if rather more susceptible to the cold. Let us review our strategy─quickly, if you don't mind."},{"name":"LYSE","text":"Pipin's group has gone ahead to the Enceladeum. We are to meet them there."},{"name":"LYSE","text":"We wait until the tempered's attention is drawn by our diversionary force, then we sneak onto the train. Next stop: the Tower of Babil!"},{"name":"CIRINA","text":"If any─tempered included─are injured, we Xaela will tend to them."},{"name":"CIRINA","text":"You Scions must press on, no matter what."},{"name":"THANCRED","text":"We should avoid moving as a group until we're underground, so we'll need to make our own ways to the Enceladeum. See you there."},{"name":"ALPHINAUD","text":"We'll stagger our departures so as not to raise suspicion. You go on ahead."},{"name":"ALISAIE","text":"Who could possibly be cold at a time like this? My pulse is pounding with anticipation!"},{"name":"THANCRED","text":"...I think it's time I was off. If I look at Urianger for one more moment I'm liable to freeze solid."},{"name":"URIANGER","text":"C-C-Cold? N-N-Nay, I feel nary a thing..."},{"name":"YSHTOLA","text":"Fear not─no serious wounds have gone untreated. Nor will I stand for being left behind while the rest of you rush headlong into danger, so you needn't bother suggesting it."},{"name":"GRAHATIA","text":"...And you're one-hundred percent certain you're alright? No odd specters haunting your wake? Nothing feels...tingly?"},{"name":"ESTINIEN","text":"I am unfamiliar with this route. The entrance Gaius and I used was demolished in the construction of that towering monstrosity."},{"name":"LYSE","text":"Just head north, and you'll reach the Enceladeum soon enough!"},{"name":"CIRINA","text":"The Scions are welcome to our spare furs as well! Erm, you might mention that to Urianger..."},{"name":"MAGNAI","text":"A “glorious flame”...? Nay, I would have seen it, were it so..."},{"name":"SADU","text":"I crave battle, not this insipid chatter."},{"name":"LENTESTEARSGATEKEEPER","text":"Apologies, but we need a moment more to finish our sweep of the station. Wouldn't want to leave anything to chance."},{"name":"PIPIN","text":"Hail! It's good to see you, <span class=\"highlight\">Forename</span>."},{"name":"PIPIN","text":"We heard that you collapsed, but were given only the most cursory explanation. I'm glad you've recovered─and quickly enough to take part in the operation, at that."},{"name":"PIPIN","text":"As you will have heard, we've secured the way in. Some few are to remain behind to keep your escape route clear."},{"name":"PIPIN","text":"Our comrade from Lente's Tears will lead the way into the station. I'll join you soon."},{"name":"PIPIN","text":"I will send the others to meet you in the station below."},{"name":"LENTESTEARSGATEKEEPER","text":"The station is right this way. Tread lightly, now."},{"name":"Q3","text":"Proceed to the station?"},{"name":"PIPIN","text":"This is everyone."},{"name":"CIRINA","text":"Consider the enemy well and truly distracted!"},{"name":"PIPIN","text":"Time to go."},{"name":"ALPHINAUD","text":"Our primary objective is, of course, the Telophoroi's leaders."},{"name":"ALPHINAUD","text":"But should we be presented with an opportunity to vanquish Anima, we must seize it."},{"name":"ALPHINAUD","text":"If it is indeed the force behind the towers, destroying it will deliver our allies from the Telophoroi's reign of terror."},{"name":"ALPHINAUD","text":"And I, for one, would not see the Garlean people manipulated any longer, be it by primal, Ascian, or anything else."},{"name":"LYSE","text":"Hear, hear. There's been enough of that."},{"name":"LYSE","text":"We came to help the people of Garlemald, and that's what we're going to do. Together!"},{"name":"ALPHINAUD","text":"Till the very end."},{"name":"PIPIN","text":"The train should be along any moment now. Prepare to board, everyone!"},{"name":"Q4","text":"What will you do?"},{"name":"A4","text":"Small talk."},{"name":"A4","text":"Form a party and enter the Tower of Babil."},{"name":"A4","text":"Nothing."},{"name":"ALPHINAUD","text":"I'm only too aware that our intervention may not be what many of Garlemald's people want or need right now."},{"name":"ALPHINAUD","text":"Not every tragedy can be laid at the feet of the Telophoroi. Certainly not that of Licinia and her sister."},{"name":"ALPHINAUD","text":"Nevertheless, we must follow our conscience, and mine has led me here."},{"name":"ALISAIE","text":"Much as I'd like to be the one to wipe the grin off Fandaniel's smug little face, I haven't lost sight of why we're here."},{"name":"ALISAIE","text":"Our ultimate goal is to prevent the Telophoroi from doing any further harm, no matter how."},{"name":"ALISAIE","text":"But if I <span class=\"emphasis\">do</span> get the chance to introduce my fist to his jaw─and gods, do I hope I do─I won't turn it down!"},{"name":"THANCRED","text":"We were only able to ascertain that the tunnel connects to the tower. I fear I have little to offer as to the details of the interior or present situation therein."},{"name":"THANCRED","text":"If Fandaniel is to be believed, we don't have the luxury of time to scout ahead, so we'll have to trust in your instincts. They've served us well enough thus far."},{"name":"URIANGER","text":"'Tis no meager delight to watch Alisaie and Alphinaud grow more resolute in mind and heart."},{"name":"URIANGER","text":"And remarkable though their accomplishments may be, I doubt not that they are destined for still greater things."},{"name":"URIANGER","text":"Grant them thy protection, Master Louisoix. I implore thee..."},{"name":"YSHTOLA","text":"Assuming Fandaniel intends to make Zodiark serve as a catalyst for the Final Days..."},{"name":"YSHTOLA","text":"One cannot but wonder if he willingly parted ways with the other Ascians long ago."},{"name":"YSHTOLA","text":"Surely they would not have permitted the very god they created to forestall the world's end to be used in such a way."},{"name":"GRAHATIA","text":"If Fandaniel truly is Amon, to create a gate through which a primal may pass will not be beyond him."},{"name":"GRAHATIA","text":"From what I gather, he was utterly brilliant─and utterly mad."},{"name":"ESTINIEN","text":"When Zenos murdered Varis, Gaius was upon him in an instant. Seldom have I seen such fury."},{"name":"ESTINIEN","text":"I won't pretend to know the bond they shared, but pain, fear, rage...I know them well. I know what can drive a man to drown in them."},{"name":"ESTINIEN","text":"Though his homeland may have wished for his blade, my lance will roar in its stead."},{"name":"PIPIN","text":"The train we're boarding is meant to carry supplies and armaments and the like."},{"name":"PIPIN","text":"With any luck, we can slip past the tempered as they go about loading the freight."},{"name":"LYSE","text":"It's likely that Anima, at least, will notice when we enter the tower. There's no point in trying to stay hidden after that."},{"name":"LYSE","text":"So when the time comes, I say don't overthink it, and cut a path straight through!"},{"name":"CIRINA","text":"Strange. Though this will be a more fearsome fight than any Naadam, I feel at peace..."},{"name":"CIRINA","text":"Maybe it is because I have Sadu, Magnai, and you at my side."},{"name":"CIRINA","text":"Maybe it is because we fight for all Xaela, and more peoples besides. There is but one path─that which leads to victory!"},{"name":"SADU","text":"Aye, aye, kill no man. I have not forgotten your instruction. I must settle for crushing the ironmen's toys. Their blue blood will feed my flames!"},{"name":"MAGNAI","text":"Your comrades tell me that the Telophoroi abducted you on the selfsame eve they so rudely interrupted our meal. A brazen feat that would make a Buduga proud."},{"name":"MAGNAI","text":"But even had it not ended poorly, it was a disappointment in many respects. I have decided that when we return triumphant, the Oronir will hold a far grander feast on the Azim Steppe. You have permission to attend."},{"name":"ANIMA","text":"Glory... Glory... Glory...be..."},{"name":"LENTESTEARSGATEKEEPER","text":"The area is secure. May I escort you to the top of the tower?"},{"name":"Q5","text":"Proceed to the Nethergate?"},{"name":"A5","text":"Return to the Enceladeum."},{"name":"A5","text":"Proceed to the Nethergate."},{"name":"A5","text":"Cancel."},{"name":"ALISAIE","text":"Stand there for just a moment, please."},{"name":"ALISAIE","text":"...A prayer for good luck. Now you can't possibly fail!"},{"name":"THANCRED","text":"We're moving out to rendezvous with the remainder of the contingent. Leave everything here to us."},{"name":"URIANGER","text":"Fear not for Krile. Go forth...and return, I prithee."},{"name":"YSHTOLA","text":"She channeled a dangerous amount of aether. And that's to say nothing of the teleportation magick she must have used to get here."},{"name":"YSHTOLA","text":"Yet Krile and Hydaelyn both were clearly willing to take the risk. Hmm."},{"name":"GRAHATIA","text":"As I suspected..."},{"name":"ESTINIEN","text":"We've no time for worrying over what's done. Let's go."},{"name":"KRILE","text":"..."},{"name":"ALPHINAUD","text":"If all of the tempered are affected, Jullus and his comrades likely put up quite the struggle."},{"name":"ALPHINAUD","text":"We'll find a way to save them─we must. I only pray we are not too late."},{"name":"ALPHINAUD","text":"In the meantime...may the Twelve carry you to victory."},{"name":"SYSTEM","text":"You may now enter the Tower of Babil with a party of NPC avatars. To make use of this feature, open the <span class=\"highlight\">Trust</span> interface located under <span class=\"highlight\">Duty</span> in the main menu."}],"reward":{"gil":3000,"aetherCurrent":1,"instance":80},"reqs":{"jobs":[{"lvl":83,"id":142}],"quests":[69930]},"next":[69932]},"partials":[{"type":"npc","id":"1039940","obj":{"i":1039940,"n":"Lucia","l":3710,"q":1}},{"type":"npc","id":"1039969","obj":{"i":1039969,"n":"Alphinaud","l":4024,"q":1}},{"type":"instance","id":"80","obj":{"i":80,"n":"The Tower of Babil","c":61801,"t":"Dungeons","min_lvl":83,"max_lvl":84,"min_ilvl":505}},{"type":"quest","id":"69930","obj":{"i":69930,"n":"In from the Cold","g":11,"l":"Garlemald","s":548}},{"type":"quest","id":"69932","obj":{"i":69932,"n":"A Trip to the Moon","g":11,"l":"The Nethergate","s":550}}]}