{"quest":{"name":"Heart of the Matter","location":"Mare Lamentorum","id":69943,"patch":6.0,"sort":561,"icon":101116,"eventIcon":71201,"issuer":1038946,"target":1038952,"genre":11,"journal":["Growingway is fidgeting with nervous energy, but is it from excitement or worry?","Growingway suddenly remembers where the Scions can learn more about the Final Days─the archives located on the second floor of the main plaza. He asks you to follow him as he hops off with all haste.","In a seemingly unexpected turn of bad luck, the entrance to the archives is locked. Growingway suggests you go and find whoever holds the door's key, but Y'shtola has already seen through his ruse. He soon confesses that he was tasked with distracting you, Y'shtola, and Thancred while Livingway and the other Loporrits carry out an ulterior task. With their plan now exposed, the Loporrits intend to detain you by force if necessary.","Before reinforcements can overwhelm you, the three of you split up, incapacitating any Loporrits that get in your way. Their motives are not yet clear, but you all agree Urianger must be found before the situation turns dire.","You find Urianger near the Watcher's Palace in the midst of conversation with Livingway and her companions. Their plan, it seems, was to coerce Urianger to travel back to Etheirys alone where he would assist their collaborators. He refuses, and instead begs the Loporrits be patient, for he believes the people of Etheirys will do what is right in due time. Rather than return, he pledges to remain on the moon, where he will teach the Loporrits what they need to know of Etheirys to better prepare the moon in the event an evacuation becomes necessary.","Should the worst come to the worst, you must be prepared for every eventuality. And so it is with a heavy heart Urianger bids you safe journey back to Etheirys."],"objectives":["Speak with Growingway.","Defeat the Loporrits.","Speak with Y'shtola.","Speak with Urianger."],"dialogue":[{"name":"THANCRED","text":"If some scheme was afoot, surely Urianger would be the first to see through it."},{"name":"THANCRED","text":"Then again, he does tend to give others the benefit of the doubt..."},{"name":"YSHTOLA","text":"I am beginning to grow tired of these games."},{"name":"GROWINGWAY","text":"Oh, what to do, what to do... I promised Livingway I would help, but..."},{"name":"GROWINGWAY","text":"No. I promised I'd help, so that's what I'll do!"},{"name":"GROWINGWAY","text":"The archives are on the second floor of the main plaza, the eastern wing. Follow me!"},{"name":"YSHTOLA","text":"I suspect the Loporrits are up to something, but if there is aught to be learned of the Final Days, I think it best we play along. For now, at least."},{"name":"THANCRED","text":"The architecture of this place is impressive, though more than a little confusing to navigate."},{"name":"THANCRED","text":"Is it too much to ask for clearly marked exits? Or a map, perhaps?"},{"name":"YSHTOLA","text":"What other knowledge do you suppose we could glean from their archives?"},{"name":"GROWINGWAY","text":"The archives are right through this door, but it seems to be locked."},{"name":"GROWINGWAY","text":"I guess we'll just have to go and find whoever has the key."},{"name":"YSHTOLA","text":"Growingway, enough."},{"name":"YSHTOLA","text":"If you have naught else to tell us of the Final Days, you need only say so. We can ill afford to be wasting time here, as you well know."},{"name":"YSHTOLA","text":"Did you yourselves not tell us we must act quickly?"},{"name":"GROWINGWAY","text":"Yes. Yes, we did, but..."},{"name":"GROWINGWAY","text":"The moon was to be a perfect paradise for the people of Etheirys, and we're running out of time to make everything ready for their arrival."},{"name":"GROWINGWAY","text":"We hoped you'd see the wonders we have to offer, but you've found nothing but faults and flaws in our work. Only one of you saw our potential, so you others must be kept here."},{"name":"THANCRED","text":"Ah, so that's Livingway's game. Run us about in circles and, failing that, lock us away so we can't put the plan at risk."},{"name":"THANCRED","text":"Everyone except Urianger."},{"name":"GROWINGWAY","text":"He understands what is at stake... What must be done."},{"name":"YSHTOLA","text":"I fear you've misjudged us, Growingway. Never have we decried the notion of using the moon as a means of escape."},{"name":"YSHTOLA","text":"That said, my heart breaks at the thought of abandoning Etheirys and her reflections to their doom. If there is a way to avert the Final Days, I wish to find it. We all do."},{"name":"YSHTOLA","text":"We may fail, but our efforts would never be at the expense of your plans."},{"name":"GROWINGWAY","text":"But why would you take that risk!?"},{"name":"GROWINGWAY","text":"There's no room for ifs and maybes now."},{"name":"GROWINGWAY","text":"The people of Etheirys will escape here to the moon. They'll be safe, and we'll finally get to see all their happy, smiling faces."},{"name":"GROWINGWAY","text":"I'm sorry, but we can't let you leave. We just can't."},{"name":"GROWINGWAY","text":"Do what you must, but...try not to hurt them."},{"name":"GROWINGWAY","text":"I'll be back in a moment. Don't do anything rash while I'm gone."},{"name":"THANCRED","text":"If we dally, they'll overwhelm us with sheer numbers. I say we knock these ones out, split up, and make our way to the exit."},{"name":"YSHTOLA","text":"Agreed. Let us reconvene where Argos awaits outside."},{"name":"POPMESSAGE","text":"Reinforcements have arrived!"},{"name":"POPMESSAGE","text":"Growingway returns to stop you!"},{"name":"BALLOON","text":"Seize <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>!"},{"name":"BALLOON","text":"You won't escape!"},{"name":"BALLOON","text":"S-Surrender!"},{"name":"BALLOON","text":"Ow, that hurt!"},{"name":"BALLOON","text":"We need...reinforcements..."},{"name":"BALLOON","text":"Blargh!"},{"name":"BALLOON","text":"We're not done yet!"},{"name":"BALLOON","text":"You're in for it now!"},{"name":"BALLOON","text":"We can't lose!"},{"name":"BALLOON","text":"Too...strong..."},{"name":"BALLOON","text":"Urgh!"},{"name":"BALLOON","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s too powerful...!"},{"name":"BALLOON","text":"Please, come quietly!"},{"name":"BALLOON","text":"We have to...save them..."},{"name":"THANCRED","text":"There you are. Didn't rough them up too badly, did you?"},{"name":"YSHTOLA","text":"Good. You're here."},{"name":"YSHTOLA","text":"We must hurry to the Watcher's Palace and find Urianger."},{"name":"THANCRED","text":"A declaration of hopes and aspirations... I hadn't thought of it that way before."},{"name":"THANCRED","text":"The Loporrits may be in good hands now, but that doesn't change the fact that their plan is a last resort I'd rather not employ."},{"name":"THANCRED","text":"Let's see it doesn't come to that. For the First and all the other reflections."},{"name":"YSHTOLA","text":"The Loporrits think so highly of the people of Etheirys, yet it seems this evacuation plan is the only way they know to express their adoration."},{"name":"YSHTOLA","text":"If we had been more clear in our intentions from the start, mayhap we could have avoided this wrinkle..."},{"name":"YSHTOLA","text":"Something to keep in mind in future."},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">I chanced to spy you crossing the chasm, and I feared something was amiss.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">But all is well, and more importantly, I have been given the opportunity to behold a wonderful sight.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Keep the Elpis close, and its light will be your guide.</span>"},{"name":"MAPPINGWAY","text":"There is little I can do to help stop the Final Days, but should you need to know of star traversal, look no further!"},{"name":"MAPPINGWAY","text":"Such knowledge I can offer in abundance, so do not hesitate if you find yourself wanting."},{"name":"SINGINGWAY","text":"The others will be so happy to hear Urianger is going to stay and teach us all about Etheirys."},{"name":"SINGINGWAY","text":"We'll have to be careful not to get too distracted by his lessons─there's still maintenance to carry out, after all."},{"name":"PUDDINGWAY","text":"Nice to meet you... Name's Puddingway."},{"name":"PUDDINGWAY","text":"Sorry again for all the trouble... We promise we'll do better. Honest."},{"name":"LIVINGWAY","text":"Well, that was all rather embarrassing, wasn't it? At least we're on the same page now─people <span class=\"emphasis\">and</span> Etheirys. We'll save both, or at least give it a good try."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Make sure everyone listens to Urianger, would you?"},{"name":"A1","text":"Tell Growingway I look forward to our next walk together."},{"name":"A1","text":"You Loporrits sure are an excitable bunch."},{"name":"LIVINGWAY","text":"Oh, we'll be all ears. And you know we can be!"},{"name":"LIVINGWAY","text":"I will. I'm sure he'll be glad to hear it."},{"name":"LIVINGWAY","text":"Well, it's not as if we've been waiting twelve thousand years to meet the people of Etheirys. Oh wait, we have! But that's neither here nor there. Under Urianger's tutelage, we'll strive to become more hospitable hosts, and see that the moon is fully equipped to meet the needs of its potential passengers."},{"name":"URIANGER","text":"'Twas a relief to see Livingway was pleased with my gift of ink."},{"name":"URIANGER","text":"“To serve and serve well”... Though their knowledge may be lacking, their boundless love is a blessing without peer."},{"name":"URIANGER","text":"It will be no easy task to prepare them for what must needs be done, but gladly do I embrace this duty...even if it doth necessitate that we part ways for a time."},{"name":"URIANGER","text":"Forgive me my absence, but I have the utmost faith in you. In all our fellow Scions. When next I return to Etheirys, I pray I find you all in good health and good spirits."}],"reward":{"gil":1005,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":84,"id":142}],"quests":[69942]},"next":[69944]},"partials":[{"type":"npc","id":"1038946","obj":{"i":1038946,"n":"Growingway","l":3711,"q":1}},{"type":"npc","id":"1038952","obj":{"i":1038952,"n":"Urianger","l":3711,"q":1}},{"type":"quest","id":"69942","obj":{"i":69942,"n":"Setting Things Straight","g":11,"l":"Mare Lamentorum","s":560}},{"type":"quest","id":"69944","obj":{"i":69944,"n":"Returning Home","g":11,"l":"Mare Lamentorum","s":562}}]}