{"quest":{"name":"Beyond the Depths of Despair","location":"Radz-at-Han","id":69948,"patch":6.0,"sort":566,"icon":101118,"eventIcon":71201,"issuer":1039004,"target":1039020,"genre":11,"journal":["G'raha Tia is eager to share all you have learned with your companions.","Having finished your investigation at Ruveydah Fibers, G'raha Tia would reconvene with your companions, that you might discuss all you have learned. With luck, they too will have information of their own to share.","Back at the plaza, you share your findings with your fellow Scions. They are troubled to learn that the first transformation occurred before the sky began to burn, strongly suggesting that the change could occur elsewhere without any warning whatsoever. As you ponder the implications, the satrap appears to inform you that the threat within the walls of Radz–at–Han has been quelled. No sooner has he attempted to give assurance to his people than does the young fisherman Matsya rush to the scene, exclaiming that Palaka's Stand is surrounded by fiends. Fearing for the safety of her grandson in the village, an inconsolable woman falls into a panic. Consumed by ominous black mist, she subsequently transforms into a beast before your eyes. You manage to subdue the threat, but at great cost, for in the midst of battle, Ahewann gives his life to save a young father. Devastated and demoralized by all you have witnessed, you and your companions nevertheless resolve to make for Palaka's Stand and save what souls may yet be saved.","You join Alisaie, Alphinaud, and Matsya on the road leading to Palaka's Stand, though it appears the way is barred by prowling beasts. While the twins keep Matsya safe in the shadow, you forge ahead to clear a path.","You succeed in hunting down one of the beasts that was blocking the road, and as it dissipates you hear the desperate words of the person it once was. The path is not yet clear, however, and so you must press onward, wary and ready.","You dispatch two more beasts and clear a way to Palaka's Stand. Upon your arrival, however, you and your companions are confronted with a devastating sight. Dead and wounded lie strewn about, and tortured sobs and screams fill the air.","Shaken by the tragedy unfolding before her eyes, Alisaie steels her nerves and resolves to aid the villagers who are still alive. She bids you do the same, and you set out to offer what succor you can.","To your dismay, most of the villagers you seek out are beyond saving. Resigned, you turn back to Alphinaud, ready to discuss your next plan of action.","While he laments those villagers who have lost their lives, Alphinaud fears that many more may have been transformed into beasts. If so, the carnage in Palaka's Stand is only the beginning..."],"objectives":["Speak with Y'shtola.","Speak with Alphinaud.","Survey the area and defeat any enemies that appear.","Speak with Alisaie.","Save the villagers of Palaka's Stand.","Speak with Alphinaud."],"dialogue":[{"name":"DJINABAHA","text":"Can the despair in a man's own heart consign him to such a terrible fate...?"},{"name":"GRAHATIA","text":"We were to reconvene with the others in front of Meghaduta, were we not? That should be just outside."},{"name":"GRAHATIA","text":"With any luck, they will have already returned from their own investigations."},{"name":"GRAHATIA","text":"My friend, we must take our leave. I pray that your establishment is spared further tragedy. But remember: your lives are far more precious than any wares. If you are ordered to flee, do so without hesitation."},{"name":"DJINABAHA","text":"Indeed... I thank you for your concern, and pray you two take care as well."},{"name":"THANCRED","text":"Finished your rounds and ready to share?"},{"name":"ALISAIE","text":"Damn it all... Staying calm isn't exactly my forte..."},{"name":"MATSYA","text":"We meet again. You...you do remember me, yes?"},{"name":"MATSYA","text":"You saved my skin twice over in Yedlihmad. And now I find myself turning to you for help once more... But let us tarry here no longer!"},{"name":"ALPHINAUD","text":"We must save Palaka's Stand. Whatever it takes."},{"name":"ALPHINAUD","text":"Matsya. It pains me to put you into harm's way, but I would ask your aid as well."},{"name":"MATSYA","text":"O-Of course! Palaka's Stand is not far, just down that hill."},{"name":"MATSYA","text":"But as I told His Excellency before, the path was blocked by terrible creatures. I had no choice but to turn back."},{"name":"ALPHINAUD","text":"In that case, this is what we shall do..."},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>. I ask that you take the lead and dispatch any beasts you encounter."},{"name":"ALPHINAUD","text":"Alisaie and I will keep Matsya hidden amidst the trees, and follow when the path is clear."},{"name":"ALPHINAUD","text":"There is no telling what dangers await us. Keep your eyes peeled."},{"name":"BALLOON","text":"Graaarrrrrrgh!"},{"name":"BALLOON","text":"Urghk! Graaand...maaaaaagh..."},{"name":"BALLOON","text":"Unnnghhh..."},{"name":"BALLOON","text":"Eeeeeegh! Eeeeeegh!"},{"name":"BALLOON","text":"Urkkk..."},{"name":"BALLOON","text":"It hurts... It...hurggghhh..."},{"name":"ALPHINAUD","text":"Good work, <span class=\"highlight\">Forename</span>, though I worry for Matsya..."},{"name":"MATSYA","text":"Wh-What's happened to them!?"},{"name":"ALISAIE","text":"It...it cannot be..."},{"name":"ALISAIE","text":"We must heal those we can, and quickly! I see no beasts, but stay on your guard!"},{"name":"ALPHINAUD","text":"There...you'll be fine. The pain will soon pass."},{"name":"ALISAIE","text":"His wounds are deep, but he may yet be saved. Go and help the others!"},{"name":"MATSYA","text":"When I last came here to sell my fish, everyone was so bright and cheerful. This is a nightmare..."},{"name":"YERUVVET","text":"The horror... I pray that the Sisters will see us through this calamity..."},{"name":"SYSTEM","text":"The villager has no pulse, nor do they appear to be breathing..."},{"name":"SYSTEM","text":"There is nothing you can do for this villager."},{"name":"SYSTEM","text":"The cooling body has already begun to stiffen..."},{"name":"SYSTEM","text":"The massive wounds suggest the villager was gored by a terrible beast..."},{"name":"SYSTEM","text":"This villager has been dead for some time."},{"name":"PALAKASMANC04412","text":"Have you...have you come to...help us?"},{"name":"PALAKASMANC04412","text":"Too late...too late... My family...my friends... &lt;sob&gt;"},{"name":"PALAKASMANC04412","text":"I...I am fine, thank you... Please...save the others..."},{"name":"SYSTEM","text":"Though the villager's injuries do not appear to be life-threatening, he does not respond to your efforts. His breathing grows more ragged and shallow, and his vacant eyes are those of a man who has lost the will to live..."},{"name":"PALAKASMAND04412","text":"Even if I wake...the nightmare goes on... No...leave me to sleep..."},{"name":"PALAKASMAND04412","text":"..."},{"name":"SYSTEM","text":"You call out, but the man does not respond..."},{"name":"SYSTEM","text":"This poor soul is beyond saving."},{"name":"ALPHINAUD","text":"Are these the only villagers who survived?"},{"name":"ALPHINAUD","text":"I can only hope others managed to flee. But if the rest have been turned to beasts... By the Twelve..."},{"name":"ALPHINAUD","text":"Let us do what we can to see that the damage spreads no further. And no matter what comes, we must keep our spirits high...lest we ourselves suffer a similar fate."}],"reward":{"gil":1261},"reqs":{"jobs":[{"lvl":85,"id":142}],"quests":[69947]},"next":[69949]},"partials":[{"type":"npc","id":"1039004","obj":{"i":1039004,"n":"G'raha Tia","l":3707,"q":1}},{"type":"npc","id":"1039020","obj":{"i":1039020,"n":"Alphinaud","l":3709,"q":2}},{"type":"quest","id":"69947","obj":{"i":69947,"n":"Amidst the Apocalypse","g":11,"l":"Radz-at-Han","s":565}},{"type":"quest","id":"69949","obj":{"i":69949,"n":"That We Might Live","g":11,"l":"Thavnair","s":567}}]}