{"quest":{"name":"All's Vale That Endsvale","location":"Mare Lamentorum","id":69940,"patch":6.0,"sort":558,"eventIcon":71201,"issuer":1038927,"target":1038932,"genre":11,"journal":["Growingway is keen to put his recent mishap behind him."],"objectives":["Speak with Growingway.","Speak with Growingway again.","Do a nice, big /stretch near Growingway.","Speak with Growingway and have him accompany you.","Accompany Growingway to the designated location and then speak with him.","Accompany Growingway to the second designated location and then speak with him.","Accompany Growingway to the third designated location and then speak with him.","Accompany Growingway to the fourth designated location and then speak with him.","Accompany Growingway to the fifth designated location and then speak with him.","Speak with Y'shtola."],"dialogue":[{"name":"GROWINGWAY","text":"It may not seem like it, but we've been planning for this far longer than I'd care to admit."},{"name":"GROWINGWAY","text":"Each time we woke up, we'd have long discussions about how to save as many of you as we can. Felt like everyone had an opinion on this or that."},{"name":"GROWINGWAY","text":"But the one thing we all agreed upon was that the people of Etheirys wouldn't take action to save themselves until it was far too late."},{"name":"GROWINGWAY","text":"That's why we're striving to make the moon a vibrant, magical place they'd hop at the chance to visit, rather than waiting for the flames of oblivion to get them off their tails and force them to accept our invitation."},{"name":"GROWINGWAY","text":"The residential quarters may not be up to the necessary standards just yet, but there are plenty of other places worth seeing!"},{"name":"GROWINGWAY","text":"You've already had a look around the Carrotorium, but wait until you see what's waiting for you at the east end of the burrow. Follow me!"},{"name":"GROWINGWAY","text":"Good, you're here. Through this door is Greatest Endsvale!"},{"name":"GROWINGWAY","text":"It was named as such because it's the vale to end all vales. The most beautiful forest you'll ever see."},{"name":"GROWINGWAY","text":"We understand the people of Etheirys enjoy taking leisurely walks through “natural spaces” and the like, so I'm sure you'll enjoy it."},{"name":"GROWINGWAY","text":"How about we start with a nice stroll to the fountain? This way!"},{"name":"GROWINGWAY","text":"So, what did you think of the forest? Isn't it positively pleasant? Simply sublime?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I couldn't see the forest <span class=\"emphasis\">or</span> the trees..."},{"name":"A1","text":"I didn't see any─wait. You don't mean those crystals out there are..."},{"name":"A1","text":"'Tis as transcendent as burying your face in a chocobo's plumage and taking a good, long whiff!"},{"name":"GROWINGWAY","text":"You're pulling my tail! You're in the forest right now!"},{"name":"GROWINGWAY","text":"Right you are! Our forest is made of crystals and constructs, dotting the landscape as far as the eye can see."},{"name":"GROWINGWAY","text":"You really think so? Truly?"},{"name":"GROWINGWAY","text":"Hearing you say that means more to me than you know. Personally, I'd say this place is the pride of the burrow."},{"name":"GROWINGWAY","text":"Building this place was a challenge, let me tell you. Since we were born here, we've never seen trees in person before, let alone a forest."},{"name":"GROWINGWAY","text":"The information sent by our collaborators was quite enlightening, but after much deliberation, we decided to use crystalline constructs in place of living trees."},{"name":"GROWINGWAY","text":"And thanks to our atmospheric circulation system, this place produces air as clean as that you'd find in a forest on Etheirys!"},{"name":"GROWINGWAY","text":"The fountain here behind us, powered by the rather large crystal adorning its top, plays a vital role in supplying us with fresh water."},{"name":"GROWINGWAY","text":"Much time and effort was spent making it the most spherical of spheres, and I daresay the unparalleled roundness speaks for itself."},{"name":"GROWINGWAY","text":"I enjoy nothing more than a nice, long <span class=\"highlight\">stretch</span> and a spot of relaxation whenever I come up here. You look like you could do with a stretch yourself."},{"name":"GROWINGWAY","text":"Feeling tense, <span class=\"highlight\">Forename</span>? Why not <span class=\"highlight\">stretch</span> and relax?"},{"name":"SYSTEM","text":"Growingway looks at you expectantly. Perhaps it would be best to oblige him with a quick <span class=\"highlight\">stretch</span>."},{"name":"GROWINGWAY","text":"Is...is that how people <span class=\"highlight\">stretch</span> on Etheirys? Please tell me it isn't."},{"name":"SYSTEM","text":"Growingway is bewildered by your bizarre interpretation of his instructions. Perhaps it would be best to oblige him with a tried-and-true <span class=\"highlight\">stretch</span> instead."},{"name":"GROWINGWAY","text":"That's the spirit! I feel more relaxed simply watching you."},{"name":"GROWINGWAY","text":"A sight worth the many years spent building this place."},{"name":"GROWINGWAY","text":"If it's not too much to ask... It's always been a dream of mine to take a walk through this forest with someone from Etheirys. Could we maybe...?"},{"name":"GROWINGWAY","text":"&lt;gasp&gt; You will!? Oh, be still my quivering whiskers!"},{"name":"SYSTEM","text":"Growingway is now accompanying you. Keep him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Growingway behind by entering a different area, or by speaking with him and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Growingway accompany you again, return and speak with him at the original location."},{"name":"Q2","text":"What will you do?"},{"name":"A2","text":"Speak with Growingway."},{"name":"A2","text":"Part ways with Growingway."},{"name":"A2","text":"Nothing."},{"name":"GROWINGWAY","text":"Ahhh... Nothing like a relaxing stroll to forget one's worries, eh?"},{"name":"Q2","text":"Are you sure you wish to part ways with Growingway?"},{"name":"GROWINGWAY","text":"I understand... Being Hydaelyn's chosen and all, I'm sure you have more important things to do. If you change your mind, though, I'll be over at the fountain."},{"name":"GROWINGWAY","text":"Y-You're back? You're back! I mean... <span class=\"emphasis\">Ahem</span>. It's good to see you. Looking to take a walk through the forest, are you?"},{"name":"GROWINGWAY","text":"I was thinking, <span class=\"highlight\">Forename</span>...that I could be more helpful to you by teaching you a little about the moon and what it is we do."},{"name":"GROWINGWAY","text":"When we were first created, the moon's sole purpose was to hold Zodiark, and there was absolutely <span class=\"emphasis\">nothing</span> to be found here."},{"name":"GROWINGWAY","text":"Eventually, Hydaelyn gave us our first task: furnish the moon with propulsion systems capable of facilitating travel to other stars."},{"name":"GROWINGWAY","text":"It sounds impressive, and I suppose in some respects it is, but it was only possible thanks to all the knowledge Hydaelyn shared with us. We also had <span class=\"emphasis\">a lot</span> of time to get it done. Six thousand years, give or take."},{"name":"GROWINGWAY","text":"But anyway, let's keep going."},{"name":"A3","text":"<span class=\"highlight\">Ask if you can taste the rainbow...crystal.</span>"},{"name":"GROWINGWAY","text":"What...? N-No! I'm not sure what it is you do with crystals on Etheirys, but we don't <span class=\"emphasis\">eat</span> them─and certainly not <span class=\"emphasis\">this</span> one. It's possessed of all six elements─wind, lightning, fire, earth, ice, and water. We use crystals like these to maintain the moon's elemental equilibrium."},{"name":"GROWINGWAY","text":"It's worth mentioning, though, that because of Hydaelyn's influence─being the embodiment of tranquility and stasis and all─manipulating the elements here is different than it might be on Etheirys."},{"name":"GROWINGWAY","text":"A conjuring of fire would sooner dry your clothes than singe them, for example. Put simply, the aetheric conditions are ill-suited to growth, which is why the surface is mostly barren."},{"name":"GROWINGWAY","text":"Of course, this was all necessary to keep the raging energies of Zodiark in check."},{"name":"GROWINGWAY","text":"This may come as a surprise, but we didn't begin building the habitable areas until after the propulsion systems were ready."},{"name":"GROWINGWAY","text":"Considering how long it took, I wish we'd started sooner. Who would've thought we'd need four thousand years to make all this?"},{"name":"GROWINGWAY","text":"It certainly wasn't work you dare rush, either. We had to create infrastructure and countless supporting systems, some of which wouldn't be operational until hundreds of years later."},{"name":"GROWINGWAY","text":"And then there was that brief period where our productivity came to a screeching halt─when that bizarre red satellite was sent up from Etheirys. The Allagans' mischief, I think."},{"name":"GROWINGWAY","text":"We thought maybe some new, nefarious actor was colluding with Zodiark. All we could do was stand by and brace ourselves for the worst."},{"name":"GROWINGWAY","text":"I can't tell you how relieved we were when Hydaelyn informed us of its destruction. Oh yes, there was much joyous humming that day."},{"name":"GROWINGWAY","text":"Say, do you notice anything peculiar about the treetops? I mean, apart from the fact they're massive crystals, and not trees."},{"name":"GROWINGWAY","text":"I'll give you a hint: it's the golden rings emanating from the glowing spheres."},{"name":"GROWINGWAY","text":"Along with the device fixed near the ceiling, they fulfill a role similar to our sun─and do so better, even."},{"name":"GROWINGWAY","text":"The sun and similar celestial objects in the great expanse radiate energy that is harmful to your bodies. These rings shield you from that energy while allowing you to bathe in the perfect amount of sunlight. Or rather, a close approximation of it."},{"name":"GROWINGWAY","text":"Pretty impressive, wouldn't you say? Oh, and if you look closely, you'll see different types of “trees” have ever-so-slightly different curvature! Yes indeed, this forest truly is the greatest."},{"name":"GROWINGWAY","text":"There was something else I wanted to tell you about. Uh... Oh, right."},{"name":"GROWINGWAY","text":"The propulsion systems and habitat facilities were completed around two thousand years ago, and with that, the most important features were fit for purpose."},{"name":"GROWINGWAY","text":"Which was all well and good, except we still knew absolutely nothing about the present-day people of Etheirys."},{"name":"GROWINGWAY","text":"“Why not go and visit Etheirys yourself?” you might ask. Strictly forbidden. Were our technology or knowledge of the moon's true purpose exploited for evil ends...the results could be disastrous."},{"name":"GROWINGWAY","text":"Then there were a few more Rejoinings, and it became increasingly difficult to converse with Hydaelyn."},{"name":"GROWINGWAY","text":"Fearful we might lose the ability to communicate with Her altogether, we beseeched Her to find people on Etheirys we could trust to help."},{"name":"GROWINGWAY","text":"We were quite fortunate everything worked out as it did."},{"name":"GROWINGWAY","text":"With the exception of routine inspections and maintenance, we remained asleep and waited, hopeful Hydaelyn would find someone who would help us."},{"name":"GROWINGWAY","text":"Eventually She did, and though Her power was waning, we were able to speak to them directly for a short while."},{"name":"GROWINGWAY","text":"We shared with them everything we could, including our knowledge of the heavens, and a means to travel here to the moon."},{"name":"GROWINGWAY","text":"They certainly didn't waste any time with what we taught them. No more than a few years after that, our collaborators found a means to convey messages and supplies to us from down below."},{"name":"GROWINGWAY","text":"With all the letters, books, and other resources they sent, we learned enough to start making more meaningful changes to the moon."},{"name":"GROWINGWAY","text":"And now you're here, hopefully enjoying yourself as much as I am!"},{"name":"GROWINGWAY","text":"I knew you would like Greatest Endsvale, I knew it!"},{"name":"GROWINGWAY","text":"Thank you again for coming here, by the way. I know it was just a walk through the forest, but it meant a lot to me."},{"name":"YSHTOLA","text":"There you are."},{"name":"THANCRED","text":"I take it you've already received the grand tour? A shame we missed it."},{"name":"LIVINGWAY","text":"(-???-)Growingway! I've been looking all over for you!"},{"name":"GROWINGWAY","text":"Oh! I, uh... Is this about the teleporter to the residential area?"},{"name":"LIVINGWAY","text":"No, never mind that. We have more pressing matters at hand."},{"name":"LIVINGWAY","text":"I will be calling an emergency meeting shortly, and your attendance is required."},{"name":"GROWINGWAY","text":"Really...? I can't imagine why you'd need me there, but if you insist."},{"name":"LIVINGWAY","text":"We won't be away long, so you all are more than welcome to continue looking about the burrow. Now, come along, Growingway."},{"name":"YSHTOLA","text":"Before we arrived, you seemed to be in the midst of a rousing conversation with your guide. Did you learn anything of import?"},{"name":"THANCRED","text":"They've spent twelve <span class=\"emphasis\">thousand</span> years preparing for this?"},{"name":"THANCRED","text":"With the appointed hour fast approaching, I can certainly understand their restlessness. But still..."},{"name":"YSHTOLA","text":"It remains to be seen if the people can be persuaded to evacuate when there are yet no signs of the Final Days."},{"name":"YSHTOLA","text":"What's more, the technology of this place defies imagination. I doubt there are many who would readily come to terms with living in such surroundings."},{"name":"THANCRED","text":"Whoever these collaborators are, unless they are possessed of the world's most charming personalities or a means to forcibly evacuate people, they will meet with a great deal of resistance."},{"name":"YSHTOLA","text":"Indeed. Even if faced with annihilation, the decision to forsake all one knows cannot be made lightly."},{"name":"URIANGER","text":"Forgive me, friends, but I must beg your leave. There is another matter which yet begs for mine attention."},{"name":"THANCRED","text":"Of course. We can accompany you if you like."},{"name":"URIANGER","text":"Nay, that will not be necessary. If you will excuse me."},{"name":"THANCRED","text":"Huh... What do you suppose has suddenly tickled his fancy?"},{"name":"YSHTOLA","text":"'Tis clear now that difficult decisions lie ahead of us."},{"name":"YSHTOLA","text":"Preparation for the evacuation of Etheirys is indeed crucial, but I am not yet willing to forsake our world and its reflections─and I trust I am not alone in my reticence."}],"reward":{"gil":1294},"reqs":{"jobs":[{"lvl":84,"id":142}],"quests":[69939]},"next":[69941]},"partials":[{"type":"npc","id":"1038927","obj":{"i":1038927,"n":"Growingway","l":3711,"q":2}},{"type":"npc","id":"1038932","obj":{"i":1038932,"n":"Y'shtola","l":3711,"q":1}},{"type":"quest","id":"69939","obj":{"i":69939,"n":"Styled a Hero","g":11,"l":"Mare Lamentorum","s":557}},{"type":"quest","id":"69941","obj":{"i":69941,"n":"Back to Old Tricks","g":11,"l":"Mare Lamentorum","s":559}}]}