{"quest":{"name":"Setting Things Straight","location":"Mare Lamentorum","id":69942,"patch":6.0,"sort":560,"eventIcon":71201,"issuer":1038935,"target":1038944,"genre":11,"journal":["Urianger is quite glad for your company."],"objectives":["Speak with Urianger.","Stand watch at the designated location and defeat any enemies that appear.","Stand watch at the designated location.","Speak with Urianger.","Speak with Y'shtola.","Search for Runningway at the designated location.","Speak with Y'shtola."],"dialogue":[{"name":"URIANGER","text":"I thank thee for accompanying me."},{"name":"URIANGER","text":"'Tis a simple plan, in truth. We shall not be long away from Bestways Burrow."},{"name":"URIANGER","text":"Difficult decisions must needs be made in the coming days, but I nevertheless believe we are all of one mind in our desire to save the people of Etheirys."},{"name":"URIANGER","text":"To make clear our resolve to the Loporrits, I would offer them a gift. But its making doth require a most singular ingredient."},{"name":"URIANGER","text":"Ah, an abundance of spongoi. Excellent."},{"name":"URIANGER","text":"I chanced to spy this aggregation when crossing Zodiark's erstwhile prison."},{"name":"URIANGER","text":"Using a spell taught to me by the Nu Mou, I believe these shall suffice for the gift I would fashion."},{"name":"URIANGER","text":"The magick requireth considerable concentration, however. Might I prevail upon thee to stand watch whilst I perform the incantation?"},{"name":"URIANGER","text":"..."},{"name":"SYSTEM","text":"Urianger is wholly absorbed in weaving his enchantment. Until his work is complete, he will need to be kept safe from harm..."},{"name":"SYSTEM","text":"Surveying the nearby area, you see no sign of potential threats. This would be a good opportunity to see how Urianger is faring..."},{"name":"URIANGER","text":"..."},{"name":"SYSTEM","text":"Urianger remains fixated on his work..."},{"name":"URIANGER","text":"There... 'Tis done."},{"name":"URIANGER","text":"A magicked ink, every onze as efficacious as that crafted by the Nu Mou."},{"name":"URIANGER","text":"Rare is the occasion I would conjure mine own, but is nevertheless a most useful skill."},{"name":"URIANGER","text":"The resulting product is, admittedly, possessed of no preternatural properties, but its hue is one of mine own choosing, which I pray the Loporrits will appreciate."},{"name":"LIVINGWAY","text":"(-???-)<span class=\"highlight\">Forename</span>! Urianger! Oh, thank goodness. I thought you had been eaten, or had perhaps fallen into a crater."},{"name":"LIVINGWAY","text":"Y'shtola has been looking all over for you, <span class=\"highlight\">Forename</span>. She says she needs to speak with you about something most urgent. Dire, even."},{"name":"LIVINGWAY","text":"She was also quite clear that she wishes to speak with <span class=\"highlight\">Forename</span> <span class=\"emphasis\">alone</span>. Which means, I'm afraid, you must stay behind, Urianger."},{"name":"LIVINGWAY","text":"But worry not! It just so happens we need your help with an errand─delivering a package from the Watcher's Palace to Bestways Burrow. It's quite large and heavy─perhaps even too heavy, for we poor Loporrits─and we would be ever so grateful if you could lend us a hand."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Well, I suppose I should be going, then..."},{"name":"A1","text":"How about an extra pair of hands before I go and meet with Y'shtola?"},{"name":"A1","text":"That's convenient... <span class=\"emphasis\">Suspiciously</span> convenient."},{"name":"LIVINGWAY","text":"Phew, good..."},{"name":"LIVINGWAY","text":"I-I mean, yes, very good. Let us not keep you, then. She said she would be waiting for you in Greatest Endsvale...or somewhere thereabouts. I'm sure you'll find her soon enough."},{"name":"LIVINGWAY","text":"No, no, that won't be necessary. Urianger's help should more than suffice."},{"name":"LIVINGWAY","text":"And I'm sure you don't want to risk getting on Y'shtola's bad side by keeping her waiting. She seems...prickly. Now, off with you."},{"name":"LIVINGWAY","text":"Are you insinuating I would betray the trust of Hydaelyn's chosen? Or worse─do anything to risk getting on Y'shtola's bad side!?"},{"name":"LIVINGWAY","text":"She's clearly not one to be crossed, nor made to wait. Now, off with you!"},{"name":"URIANGER","text":"Worry not, <span class=\"highlight\">Forename</span>. I shan't be long."},{"name":"THANCRED","text":"Everything is all right with Urianger, then? That's a relief."},{"name":"GROWINGWAY","text":"Oh! B-Back so soon?"},{"name":"YSHTOLA","text":"Oh, <span class=\"highlight\">Forename</span>. We thought you would be away for far longer."},{"name":"YSHTOLA","text":"A dire emergency? I said no such thing."},{"name":"YSHTOLA","text":"But as you are here, I could use your assistance with one small matter."},{"name":"YSHTOLA","text":"Runningway, a companion of Growingway's, apparently has much to tell us of the Final Days."},{"name":"YSHTOLA","text":"The problem, however, is that he is determined to live up to his name, refusing to stay still long enough for us to hold a conversation."},{"name":"THANCRED","text":"Is there anywhere he's likely to stop and rest? Or perhaps there's a way to slow him down?"},{"name":"GROWINGWAY","text":"Wh-What's the rush? I was thinking we should wait here, maybe enjoy a cold mug of carrot juice, and...no? &lt;sigh&gt; Well, if it's really that important..."},{"name":"GROWINGWAY","text":"You can try using these...balls. Of mousse flesh. Not to be confused with...the other thing."},{"name":"GROWINGWAY","text":"Ahem. Runningway's other notable feature is his incessant chatter, so you'll have no trouble finding him in a crowd. And when you do, try lobbing your balls at him."},{"name":"YSHTOLA","text":"Crude, but if it proves effective... He was here in Greatest Endsvale when last I saw him. Let us split up and find him."},{"name":"SYSTEM","text":"Search your surroundings for Runningway. You may move the camera, as well as zoom in and out. Target Runningway and throw mousse balls with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???]/[???]</span></span>."},{"name":"RUNNINGWAY","text":"Hm? Yes, I'm Runningway. Do you mind explaining why you hit me in the face with your balls... Of mousse flesh? "},{"name":"RUNNINGWAY","text":"<span class=\"emphasis\">I'm</span> highly knowledgeable about the Final Days?"},{"name":"RUNNINGWAY","text":"Hah, that's the most ridiculous thing I've heard since I woke up! Who told you that joke?"},{"name":"RUNNINGWAY","text":"As if we've got time to look into the Final Days when there's so much to do before the great voyage."},{"name":"RUNNINGWAY","text":"It's true that Hydaelyn did impart to us some knowledge of the event, but I know about as much as any other Loporrit around here. Less, probably."},{"name":"RUNNINGWAY","text":"I don't know why anyone would think it's funny to go around telling people I'm an expert, but they'd better hope I don't get my paws on them!"},{"name":"RUNNINGWAY","text":"Sorry I couldn't be of more help, but if there's nothing else, I've work to do!"},{"name":"RUNNINGWAY","text":"And I'm off!"},{"name":"THANCRED","text":"Any luck? I tried near the entrance, but there was no sign of him."},{"name":"GROWINGWAY","text":"Oh no, you caught him? I-I mean... Well done you..."},{"name":"YSHTOLA","text":"I could find neither hide nor...hair of him. How did you fare?"},{"name":"YSHTOLA","text":"So, he knows no more than the others."},{"name":"YSHTOLA","text":"Care to explain yourself, Growingway?"},{"name":"GROWINGWAY","text":"W-Well, you see... I, uh..."},{"name":"GROWINGWAY","text":"I misremembered. Yes, that's it! I misremembered. Terribly sorry about that."},{"name":"GROWINGWAY","text":"Hmmm. Afraid I'm drawing a blank, though. Try as I might, I can't remember who I was thinking of."},{"name":"THANCRED","text":"On an unrelated note, what of Urianger? I assume you spoke with him earlier, but did he say when he'll be returning?"},{"name":"THANCRED","text":"On his way to the Watcher's Palace with Livingway?"},{"name":"THANCRED","text":"Between Growingway's sudden lapse of memory and our lack of other leads, maybe our time would be better spent lending Urianger a hand."},{"name":"GROWINGWAY","text":"Wh-What!? Now hold on a moment!"},{"name":"GROWINGWAY","text":"It's all coming back to me. Yes, I remember!"},{"name":"GROWINGWAY","text":"The information you're looking for is in the archives. Yes, that's where you'll find all sorts of useful knowledge, including that pertaining to the Final Days."}],"reward":{"gil":1170,"items":[{"id":35689}]},"reqs":{"jobs":[{"lvl":84,"id":142}],"quests":[69941]},"next":[69783,69784,69785,69786,69787,69788,69789,69790,69791,69943,70052]},"partials":[{"type":"npc","id":"1038935","obj":{"i":1038935,"n":"Urianger","l":3711,"q":2}},{"type":"npc","id":"1038944","obj":{"i":1038944,"n":"Y'shtola","l":3711,"q":1}},{"type":"item","id":"35689","obj":{"i":35689,"n":"Phrygian Hand Gear Coffer (IL 533)","l":1,"c":26560,"t":61}},{"type":"quest","id":"69941","obj":{"i":69941,"n":"Back to Old Tricks","g":11,"l":"Mare Lamentorum","s":559}},{"type":"quest","id":"69783","obj":{"i":69783,"n":"A Test of Mettle","g":124,"l":"Mare Lamentorum","s":1870}},{"type":"quest","id":"69784","obj":{"i":69784,"n":"Unfortunate Fortune-telling","g":124,"l":"Mare Lamentorum","s":1880}},{"type":"quest","id":"69785","obj":{"i":69785,"n":"Dangerous Work","g":124,"l":"Mare Lamentorum","s":1890}},{"type":"quest","id":"69786","obj":{"i":69786,"n":"Material Woes","g":124,"l":"Mare Lamentorum","s":1901}},{"type":"quest","id":"69787","obj":{"i":69787,"n":"For a Greater Garden","g":124,"l":"Mare Lamentorum","s":1910}},{"type":"quest","id":"69788","obj":{"i":69788,"n":"Lone Loporrit","g":124,"l":"Mare Lamentorum","s":1920}},{"type":"quest","id":"69789","obj":{"i":69789,"n":"Alluring Allag","g":124,"l":"Mare Lamentorum","s":1930,"f":1}},{"type":"quest","id":"69790","obj":{"i":69790,"n":"Overexcited Admirer","g":124,"l":"Mare Lamentorum","s":1940}},{"type":"quest","id":"69791","obj":{"i":69791,"n":"Troubled Waters","g":124,"l":"Mare Lamentorum","s":1950}},{"type":"quest","id":"69943","obj":{"i":69943,"n":"Heart of the Matter","g":11,"l":"Mare Lamentorum","s":561}},{"type":"quest","id":"70052","obj":{"i":70052,"n":"Name That Way","g":124,"l":"Mare Lamentorum","s":1951,"f":1}}]}