{"quest":{"name":"Back to Old Tricks","location":"Mare Lamentorum","id":69941,"patch":6.0,"sort":559,"icon":101115,"eventIcon":71201,"issuer":1038931,"target":1038935,"genre":11,"journal":["By now, Thancred can tell when his friends are up to something.","Thancred suspects Urianger is keeping secrets again, and while there is no doubt your enigmatic comrade would only do so with the best of intentions, the weary bard cannot help but worry. He asks you to follow Urianger while he and Y'shtola continue to learn what they can of the Final Days.","You reach the aetheryte in the central plaza of Bestways Burrow, and spy Urianger heading out to Mare Lamentorum. What could possibly demand his attention outside?","Stepping out from the entrance to Bestways Burrow, you see Urianger making his ascent up and out to Mare Lamentorum. It would be a simple task to catch up with him, but it would perhaps be wiser to follow at a distance and see where he is heading.<br><br>※You must follow Urianger to complete this task. Return to the designated location should you become separated.","Urianger comes to an abrupt stop, and it becomes clear he has been aware of your presence for some time. The two of you have a candid conversation about Urianger's many regrets, and his aversion to keeping secrets from you and the other Scions moving forward. He then thanks you for this rare opportunity to speak so openly.","Urianger has a plan to help facilitate more forthright cooperation with the Loporrits, but he will need your help to see it through."],"objectives":["Search for Urianger at the designated location.","Search for Urianger again at the designated location.","Follow Urianger.","Speak with Urianger."],"dialogue":[{"name":"YSHTOLA","text":"The Final Days will make brave fools of us all."},{"name":"THANCRED","text":"Did Urianger seem strange to you? More so than usual, I mean."},{"name":"THANCRED","text":"I know he has a penchant for keeping his own counsel, but I'd be lying if I said I wasn't worried. Would you go and see if he's all right?"},{"name":"THANCRED","text":"Y'shtola and I will remain here and see what else we can learn about the Final Days. If you hurry, perhaps you can catch up to him."},{"name":"THANCRED","text":"Better for only one of us to go, in case it's a delicate matter."},{"name":"THANCRED","text":"Hopefully I'm overthinking things..."},{"name":"YSHTOLA","text":"Urianger usually puts more effort into concealing his clandestine endeavors. Or perhaps he's simply given up on trying to hide it, knowing we'll find out eventually."},{"name":"YSHTOLA","text":"In any case, that he acts with good intentions is plain. So please, give him the benefit of the doubt."},{"name":"SYSTEM","text":"Urianger appears to be heading towards the entrance to Bestways Burrow..."},{"name":"SYSTEM","text":"Urianger ventures off into Mare Lamentorum for reasons unknown. You must tread carefully, else he might sense your presence..."},{"name":"SYSTEM","text":"Follow Urianger from a safe distance. The objective will end in failure if you are noticed, or if you fall too far behind."},{"name":"SYSTEM","text":"Should you fail to complete the objective, you may try again by returning to the designated location."},{"name":"Q1","text":"Attempt to follow Urianger?"},{"name":"URIANGER","text":"In truth, my reason for traveling hither was to effect a plan of mine own. A plan which may pave a way forward for us all."},{"name":"URIANGER","text":"\"May,“ I say, for there is no guarantee of success. 'Tis the reason I set out alone...that failure, should it come, would be mine to bear alone."},{"name":"URIANGER","text":"Yet thou standest before me with proffered hand and open heart..."},{"name":"URIANGER","text":"'Twould be remiss of me to refuse thy amity, and so I ask─wouldst thou join in mine endeavor?"}],"reward":{"gil":1046,"items":[{"id":35691}]},"reqs":{"jobs":[{"lvl":84,"id":142}],"quests":[69940]},"next":[69942]},"partials":[{"type":"npc","id":"1038931","obj":{"i":1038931,"n":"Thancred","l":3711,"q":1}},{"type":"npc","id":"1038935","obj":{"i":1038935,"n":"Urianger","l":3711,"q":2}},{"type":"item","id":"35691","obj":{"i":35691,"n":"Phrygian Foot Gear Coffer (IL 533)","l":1,"c":26562,"t":61}},{"type":"quest","id":"69940","obj":{"i":69940,"n":"All's Vale That Endsvale","g":11,"l":"Mare Lamentorum","s":558}},{"type":"quest","id":"69942","obj":{"i":69942,"n":"Setting Things Straight","g":11,"l":"Mare Lamentorum","s":560}}]}