{"quest":{"name":"Returning Home","location":"Mare Lamentorum","id":69944,"patch":6.0,"sort":562,"eventIcon":71201,"issuer":1038953,"target":1038588,"genre":11,"journal":["Your excursion on the moon concluded, Y'shtola is keen to return to Etheirys."],"objectives":["Speak with Thancred at the Nethergate.","Speak with Lucia at Camp Broken Glass.","Speak with Krile at the Baldesion Annex.","Wait at the designated location.","Speak with Ojika Tsunjika."],"dialogue":[{"name":"THANCRED","text":"A declaration of hopes and aspirations... I hadn't thought of it that way before."},{"name":"THANCRED","text":"The Loporrits may be in good hands now, but that doesn't change the fact that their plan is a last resort I'd rather not employ."},{"name":"THANCRED","text":"Let's see it doesn't come to that. For the First and all the other reflections."},{"name":"URIANGER","text":"I need not remind you of the dangers we face, nor the countless lives at stake both in the Source and its reflections. Go with courage, my friend, and pray give the others my regards."},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">I chanced to spy you crossing the chasm, and I feared something was amiss.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">But all is well, and more importantly, I have been given the opportunity to behold a wonderful sight.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Keep the Elpis close, and its light will be your guide.</span>"},{"name":"MAPPINGWAY","text":"There is little I can do to help stop the Final Days, but should you need to traverse the stars, look no further!"},{"name":"MAPPINGWAY","text":"Such knowledge I can offer in abundance, so do not hesitate if you find yourself in need."},{"name":"SINGINGWAY","text":"The others will be so happy to hear Urianger is going to stay and teach us all about Etheirys."},{"name":"SINGINGWAY","text":"We'll have to be careful not to get too distracted by his lessons─there's still maintenance to carry out, after all."},{"name":"PUDDINGWAY","text":"Nice to meet you... Name's Puddingway."},{"name":"PUDDINGWAY","text":"Sorry again for all the trouble... We promise we'll do better. Honest."},{"name":"LIVINGWAY","text":"Well, that was all rather embarrassing, wasn't it? At least we're on the same page now─people <span class=\"emphasis\">and</span> Etheirys. We'll save both, or at least give it a good try."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Make sure everyone listens to Urianger, would you?"},{"name":"A1","text":"Tell Growingway I look forward to our next walk together."},{"name":"A1","text":"You Loporrits sure are an excitable bunch."},{"name":"LIVINGWAY","text":"Oh, we'll be all ears. And you know we can be!"},{"name":"LIVINGWAY","text":"I will. I'm sure he'll be glad to hear it."},{"name":"LIVINGWAY","text":"Well, it's not as if we've been waiting twelve thousand years to meet the people of Etheirys. Oh wait, we have! But that's neither here nor there. Under Urianger's tutelage, we'll strive to become more hospitable hosts, and see that the moon is fully equipped to meet the needs of its potential passengers."},{"name":"YSHTOLA","text":"With the Loporrits in Urianger's capable hands, we needn't worry about affairs here in our absence."},{"name":"YSHTOLA","text":"Knowing now the face of their “earthly collaborators,” there is much to discuss with Alphinaud and the others."},{"name":"YSHTOLA","text":"Let us return to the Tower of Babil. Our battle for the star will soon begin in earnest, and we must be prepared."},{"name":"YSHTOLA","text":"I'd forgotten how cold it was here in Garlemald. A testament to the Loporrits' ingenuity that I felt no such discomfort on the moon."},{"name":"THANCRED","text":"Gods, I can scarcely believe we went to the moon and back..."},{"name":"THANCRED","text":"But we'll have time to reflect on that later. Right now, we need to head back to Camp Broken Glass and deliver a thoroughly detailed report to Lucia."},{"name":"THANCRED","text":"I'd like very much to know how everyone is getting on here as well. They'd only just begun to treat the tempered prisoners when we left."},{"name":"YSHTOLA","text":"I share your curiosity, but warning our allies of the Final Days is of greater importance."},{"name":"YSHTOLA","text":"I speak not only of the contingent, of course. The heads of state of every nation must know what we have learned."},{"name":"YSHTOLA","text":"We know not when or where or in what manner the Final Days will begin to manifest, and so we must see that everyone is prepared."},{"name":"THANCRED","text":"Agreed, though we may wish to stress the importance of discretion, lest the public be sent into a panic. Not that anyone in a position of responsibility should need to be told as much, but it bears repeating."},{"name":"THANCRED","text":"Anyway, first things first. To Camp Broken Glass."},{"name":"MAXIMA","text":"<span class=\"highlight\">Forename</span>? At last, you are returned!"},{"name":"LUCIA","text":"It's good to see you all again. No worse for your lunar adventure, I hope."},{"name":"THANCRED","text":"We've done what we can for now, and believe me, we intend to tell you all about it."},{"name":"THANCRED","text":"But before we do, might you tell us what's become of Garlemald in our absence?"},{"name":"LUCIA","text":"We succeeded in subduing the tempered inside the Tower of Babil. We took many alive, but combined with those who were already in our custody, the number requiring care has grown exponentially."},{"name":"LUCIA","text":"The inclement conditions here have made it difficult─if not impossible─to treat them all here, and so we have petitioned the aid of the allied nations."},{"name":"LUCIA","text":"Some are, understandably, hesitant to proffer assistance, particularly those that were but recently subject to imperial occupation. That said, several others have agreed to grant them refuge for treatment."},{"name":"LUCIA","text":"With the assistance of your fellow Scions, we endeavor to see them safely transported and subsequently cured of their tempering."},{"name":"YSHTOLA","text":"Will all the tempered be relocated?"},{"name":"LUCIA","text":"Not all, no. We have sufficient shelter to attend to those whose treatment has begun, and enough healers have volunteered to remain until their patients have recovered."},{"name":"LUCIA","text":"Jullus is one such patient, though he is not yet fit to receive visitors."},{"name":"LUCIA","text":"Truth be told, it was a miracle he and those in his company were not harmed in the chaos. If not for Alphinaud and Alisaie's timely assistance, I daresay none of them would be with us today."},{"name":"THANCRED","text":"In light of recent developments, have the Alliance leaders come to any decisions regarding Garlemald?"},{"name":"LUCIA","text":"Given the tremendous ramifications of what has happened here, it will take time to determine what must be done. In the meantime, they intend to work with the Eastern alliance to keep a close watch over the provinces."},{"name":"LUCIA","text":"We have other news to share: shortly after Anima was defeated, we received reports that each and every tower has vanished."},{"name":"LUCIA","text":"For a mercy, the process was apparently not quite as violent as that you experienced in Thavnair. Those who were trapped within them have been rescued and are receiving treatment. To hasten this endeavor, the beast tribes have received instruction in the magicks needed to cure tempering."},{"name":"YSHTOLA","text":"Master Matoya is no doubt thrilled the mother porxie affords her so many visitors."},{"name":"LUCIA","text":"Yes, we are grateful for her ongoing efforts, as well of those of our comrades near and far."},{"name":"LUCIA","text":"As for the contingent, several of our members have been granted leave to return to their homelands after the transfer of tempered has been completed."},{"name":"MAXIMA","text":"Lucia and I will remain, along with a small force to continue offering aid to those here in Garlemald."},{"name":"MAXIMA","text":"The Empire may be no more, but there are yet those who call these lands home."},{"name":"LUCIA","text":"I believe that accounts for recent events here. So─what of the moon and the Telophoroi?"},{"name":"LUCIA","text":"The Final Days... Gods, I prayed your victory would mark the end of our troubles."},{"name":"YSHTOLA","text":"There is still much we do not know, but the Alliance leaders must be told. Would you be willing to contact them in our stead?"},{"name":"LUCIA","text":"Yes, of course. I will send word forthwith."},{"name":"LUCIA","text":"We'll also release your fellow Scions from their present duties, that they may return to Sharlayan."},{"name":"LUCIA","text":"Your energies are better spent finding a means to avert the coming apocalypse."},{"name":"MAXIMA","text":"Speaking of your fellow Scions, you will be happy to hear that Mistress Krile, though still on the mend, has been moved to the Baldesion Annex and given into Tataru's care."},{"name":"YSHTOLA","text":"Thank you. I look forward to seeing them both upon our return."},{"name":"THANCRED","text":"Let us be on our way, then."},{"name":"MAXIMA","text":"One last thing, if I may."},{"name":"MAXIMA","text":"After your confrontation with Zodiark, you said Zenos took his leave, and in all likelihood he has returned here to Garlemald."},{"name":"MAXIMA","text":"I have a mind to dispatch scouts to try and ascertain his whereabouts, but first wished to ask if you believe there is merit in doing so."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"If they found him, they would not likely live to tell the tale."},{"name":"A2","text":"If you're expecting a trail of destruction to follow, you won't find one."},{"name":"A2","text":"An admirable but futile endeavor."},{"name":"MAXIMA","text":"&lt;sigh&gt; I suppose you're right..."},{"name":"MAXIMA","text":"To dispatch good soldiers in pursuit of such a beast...would be to send them to their deaths."},{"name":"MAXIMA","text":"Aye. You are the only foe he considers worthy."},{"name":"MAXIMA","text":"And even if my men found him, who but you could even hope to bring low that monster?"},{"name":"MAXIMA","text":"Mayhap you're right..."},{"name":"MAXIMA","text":"And I suppose if anyone is to hunt him down, it must be you. Who else could even hope to bring low that monster?"},{"name":"MAXIMA","text":"Pray forget I entertained the notion."},{"name":"MAXIMA","text":"While on the subject of Zenos, the Xth Legion has made an official proclamation."},{"name":"MAXIMA","text":"They denounce the crown prince and condemn his role in the Empire's downfall."},{"name":"MAXIMA","text":"His very title has become a source of shame among his former subjects, and its continued use serves only to hinder relations with foreign nations."},{"name":"MAXIMA","text":"For this reason, he has been declared as Zenos <span class=\"emphasis\">viator</span> Galvus, outcast and enemy of Garlemald."},{"name":"YSHTOLA","text":"Fandaniel is no more, and now his own people turn against him. It seems he's naught but his bloodlust to keep him company."},{"name":"MAXIMA","text":"Better that than an army to see it sated. At any rate, I will not keep you longer. I pray you safe passage back to Sharlayan."},{"name":"LUCIA","text":"Your findings will be relayed to the Alliance leaders word for word. And should we spy anything out of the ordinary here in Garlemald, all shall be informed at once."},{"name":"MAXIMA","text":"Once my countrymen have recovered, it falls to me to tell them what's become of Zenos and the Empire."},{"name":"MAXIMA","text":"I realize there is no kindness in withholding the truth, but...it will wound them."},{"name":"TATARU","text":"Oh, it's so good to see you! And free from chilblains, I take it?"},{"name":"TATARU","text":"You'll be pleased to know everything's been kept in order since you've been away. I even brought a few useful knickknacks with me from back home."},{"name":"TATARU","text":"But no sooner had they arrived than I received word of Krile in poor health, and you on the <span class=\"emphasis\">moon</span>! If you meant to give me a fright, you succeeded."},{"name":"KRILE","text":"Welcome back, <span class=\"highlight\">Forename</span>. We were so terribly worried about you."},{"name":"KRILE","text":"Though it is plain I have caused my own fair share of worry, and for that, I apologize."},{"name":"KRILE","text":"Hydaelyn called to me that day when you entered the Tower of Babil. Her pleas were faint but desperate, and I knew at once She required a vessel to carry out Her will."},{"name":"KRILE","text":"What came after feels like a dream barely remembered. My body flowing through the Lifestream toward Garlemald..."},{"name":"KRILE","text":"When I regained consciousness, I was all aches and frostbite, exhausted of aether. So exhausted, in fact, I could only laugh, for it was in that moment I understood Raha's weariness from the Tower of Zot."},{"name":"KRILE","text":"Would that I could laugh at a time like this. Though we prevented Zodiark from being unleashed upon the world, I am curious to know what else took place there on the moon..."},{"name":"KRILE","text":"Ah, perhaps we should wait for the others to join us before you give your account."},{"name":"KRILE","text":"Let us reconvene in the main hall once they've arrived."},{"name":"KRILE","text":"For a blessing, I've recovered enough to get out of bed. Even if I hadn't, I could not well miss you recount your exploits on the moon."},{"name":"Q3","text":"Wait for your comrades to arrive?"},{"name":"ALISAIE","text":"Sorry to have kept you all waiting."},{"name":"YSHTOLA","text":"Not at all. We understand you've been quite busy."},{"name":"KRILE","text":"Will Urianger be joining us?"},{"name":"THANCRED","text":"Duty keeps him away, I'm afraid, though <span class=\"highlight\">Forename</span> can explain why better than I."},{"name":"ALPHINAUD","text":"The Final Days...as befell Amaurot."},{"name":"GRAHATIA","text":"And we are to escape via the moon? What of the Source and its reflections?"},{"name":"ESTINIEN","text":"I've no intention of standing by while the world falls to ruin."},{"name":"ESTINIEN","text":"So, how do we stop this?"},{"name":"YSHTOLA","text":"Unfortunately, we have no answers at present."},{"name":"YSHTOLA","text":"If the celestial currents have grown stagnant, as was the case in the time of Amaurot, the solution would be to alter the flow of aether throughout the entirety of the star."},{"name":"YSHTOLA","text":"The ancients accomplished this by summoning Zodiark, sacrificing half the star's population in the doing. But it should go without saying that such a sacrifice must not─cannot─be repeated."},{"name":"YSHTOLA","text":"Which leaves us with the daunting task of identifying the underlying catalyst for the Final Days, a feat which even the Amaurotines could not accomplish."},{"name":"YSHTOLA","text":"Unfortunately, we found no clues in Mare Lamentorum."},{"name":"ALPHINAUD","text":"There is still much we do not know about the catastrophe itself, let alone what may have caused it."},{"name":"ALPHINAUD","text":"The Final Days were marked by the corruption of the Amaurotines' creation magicks, but we command no such power. Which invites the question: what havoc is in store for us?"},{"name":"ALPHINAUD","text":"If we knew that much, perhaps we could draw some parallel with the events of the past, and thereby form some semblance of a plan."},{"name":"YSHTOLA","text":"Perhaps we should start with the Forum, then. Having worked with the Loporrits in secret all this time, there is surely more they can tell us."},{"name":"TATARU","text":"Forgive the interruption, but I've urgent news!"},{"name":"TATARU","text":"The Forum is holding a public assembly in the plaza outside. Some sort of announcement!"},{"name":"ALISAIE","text":"What is Father up to now?"},{"name":"KRILE","text":"There's only one way to find out."},{"name":"OJIKATSUNJIKA","text":"Krile tells me the Forum made a rather momentous announcement. So there's to be a great exodus, is there?"},{"name":"OJIKATSUNJIKA","text":"I'm reminded of my narrow escape from the Isle of Val. The realization, the running, the mixture of relief and regret after. “Why me?” I asked myself. “Why me?”"},{"name":"OJIKATSUNJIKA","text":"Why us? Why now? Why wonder─there's no use fretting over the cosmic morality or lack thereof. We're here, and we'll get through this together. And who knows, maybe my luck will rub off and grant everyone a narrow escape. There's no harm in praying for as much."},{"name":"OJIKATSUNJIKA","text":"Oh, but enough of my rambling─I'm sure you're exhausted. Your chamber awaits!"},{"name":"Q4","text":"Retire to your chamber?"}],"reward":{"gil":1501,"items":[{"id":35687}]},"reqs":{"jobs":[{"lvl":84,"id":142}],"quests":[69943]},"next":[69945]},"partials":[{"type":"npc","id":"1038953","obj":{"i":1038953,"n":"Y'shtola","l":3711,"q":1}},{"type":"npc","id":"1038588","obj":{"i":1038588,"n":"Ojika Tsunjika","l":3706,"q":5}},{"type":"item","id":"35687","obj":{"i":35687,"n":"Phrygian Head Gear Coffer (IL 533)","l":1,"c":26558,"t":61}},{"type":"quest","id":"69943","obj":{"i":69943,"n":"Heart of the Matter","g":11,"l":"Mare Lamentorum","s":561}},{"type":"quest","id":"69945","obj":{"i":69945,"n":"Skies Aflame","g":11,"l":"Old Sharlayan","s":563}}]}