{"quest":{"name":"Amidst the Apocalypse","location":"Radz-at-Han","id":69947,"patch":6.0,"sort":565,"eventIcon":71201,"issuer":1037318,"target":1039003,"genre":11,"journal":["Mihleel has information that should serve you well."],"objectives":["Accompany G'raha Tia to Kama and speak with him.","Gather information in Kama while G'raha Tia is accompanying you.","Speak with Djinabaha while G'raha Tia is accompanying you.","Speak with Kamala.","Pick up the light crate.","Deliver the crate to Nahbrifhal.","Pick up the ordinary crate.","Deliver the crate to Mahnuha.","Pick up the weighty crate.","Deliver the crate to Zeymeira.","Speak with Kamala.","Speak with Djinabaha."],"dialogue":[{"name":"GRAHATIA","text":"Thanks to Mihleel, it appears we have a new lead. Let us leave no stone unturned!"},{"name":"CUSTOMER04410","text":"Those poor merchants... Turned into frightful beasts, to the last man..."},{"name":"MIHLEEL","text":"Khalzahl made his home in Kama, a nearby residential area."},{"name":"MIHLEEL","text":"From what I gather, Khalzahl lived there since childhood and was known throughout the neighborhood."},{"name":"GRAHATIA","text":"Kama...the name is new to me. How do we get there?"},{"name":"MIHLEEL","text":"I'll write down some directions."},{"name":"MIHLEEL","text":"I cannot promise that you will find what you seek there, but if nothing else, it is a start."},{"name":"GRAHATIA","text":"Come, let's see where this lead takes us."},{"name":"SYSTEM","text":"G'raha Tia is now accompanying you. Keep him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave G'raha Tia behind by entering a different area, or by speaking with him and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have G'raha Tia accompany you again, return and speak with him at the original location."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Speak with G'raha Tia."},{"name":"A1","text":"Part ways with G'raha Tia."},{"name":"A1","text":"Nothing."},{"name":"A1","text":"<span class=\"highlight\">Ask for directions.</span>"},{"name":"GRAHATIA","text":"The residents of Kama should know more of Khalzahl's circumstances. "},{"name":"GRAHATIA","text":"If we follow Mihleel's directions, we'll be there in no time."},{"name":"Q2","text":"Are you sure you wish to part ways with G'raha Tia?"},{"name":"GRAHATIA","text":"Very well. I will return to the meyhane for the time being. When you are ready to resume the investigation, meet me there."},{"name":"GRAHATIA","text":"And with that, we're off! Let us see what we can learn about the merchant Khalzahl."},{"name":"SYSTEM","text":"G'raha Tia has yet to arrive. Be sure he is at your side before attempting to continue."},{"name":"GRAHATIA","text":"Let's see... After leaving the meyhane, we're to retrace our steps and head back towards the aetheryte plaza."},{"name":"GRAHATIA","text":"From here, we ascend the stairs..."},{"name":"GRAHATIA","text":"Ah, this must be Yuj. In which case, we should take the path leading southeast."},{"name":"GRAHATIA","text":"If we keep going this way, we should arrive in Kama before long."},{"name":"GRAHATIA","text":"Walking these unfamiliar streets is quite the adventure, is it not? I can only hope we can explore Radz–at–Han at our leisure once this crisis has passed."},{"name":"MIHLEEL","text":"Forgive me... I know nothing of this “blasphemy,” nor what caused those poor men to take on such hideous forms."},{"name":"MIHLEEL","text":"That said, I could tell that Khalzahl cared deeply for his colleagues and clients. He did not seem the sort to willingly damage the trust they placed in him."},{"name":"GRAHATIA","text":"...And this must be Kama! We've arrived at last!"},{"name":"GRAHATIA","text":"Let us begin questioning the residents without delay. No doubt someone here can tell us more about Khalzahl."},{"name":"GRAHATIA","text":"Given recent events, I imagine many are taking shelter indoors."},{"name":"GRAHATIA","text":"To see the streets so empty, I wonder if some residents have fled Radz–at–Han altogether."},{"name":"MAHTI","text":"Visitors? Now there's a surprise."},{"name":"SYSTEM","text":"You should have G'raha Tia accompanying you before proceeding with the investigation."},{"name":"MAHTI","text":"Khalzahl, you say? Yes, I've known him since he was a boy."},{"name":"MAHTI","text":"If there was ever a man who was born to be a merchant, it was him. Always early to depart and late to return, he'd spend his days procuring the finest wares and seeking out willing customers. You could say it came to him as easily as breathing."},{"name":"MAHTI","text":"Sadly, business was flagging of late. No surprise, really, what with how dangerous travel has become. He was cooped up in his house from dawn till dusk the other day─no doubt wracking his brain for a way to turn his fortunes around."},{"name":"MAHTI","text":"Then, at night, I heard the door open. I looked out to see Khalzahl sitting on a bench, his head hung low. A man with the weight of the world on his shoulders..."},{"name":"GRAHATIA","text":"I see. The situation must have been quite dire, indeed..."},{"name":"GRAHATIA","text":"Did you notice anything else out of the ordinary?"},{"name":"MAHTI","text":"Nothing to speak of. Other than the troubles with his consortium, he was the same old Khalzahl. Cordial and honest, like always."},{"name":"MAHTI","text":"These questions you are asking...has something happened to him? He wasn't caught up in that terrible incident at the bazaar, was he?"},{"name":"MAHTI","text":"I don't travel much these days, but my daughter's told me not to venture outside. Stuck in here as I am, I've heard little about these bizarre goings-on."},{"name":"GRAHATIA","text":"Rest assured, the city is safe for now, but the situation may change without warning."},{"name":"GRAHATIA","text":"I urge you: stay close to your daughter, and be prepared to take refuge should the satrap order it."},{"name":"MAHTI","text":"Yes, I shall do just that. Thank you for your concern, and pray stay safe as well."},{"name":"PARIGHA","text":"Hmmm...? Could you come back another time? I just woke up, and I'm not exactly in the mood for idle chitchat."},{"name":"PARIGHA","text":"Hmmm...? Could you come back another time? I just woke up, and I'm not exactly in the mood for idle chitchat."},{"name":"GRAHATIA","text":"Well, that's one way to avoid the panic, I suppose..."},{"name":"GRAHATIA","text":"Pardon our intrusion. You may not have noticed, but a great danger has come to Thavnair. I encourage you to stay alert, and prepare to flee the city should the situation turn dire."},{"name":"GRAHATIA","text":"But before we leave you in peace...pray allow us to ask a question or two. Did you know a local merchant named Khalzahl? If so, did you notice anything unusual about him recently?"},{"name":"PARIGHA","text":"Khalzahl? Aye, I know him. In fact, we spoke just the other day."},{"name":"PARIGHA","text":"Like many others, his business was doing poorly. Still, it seemed as though he'd managed to turn things around, thanks to a generous order from Ruveydah Fibers. Why, he was practically dancing in the streets."},{"name":"PARIGHA","text":"I haven't spoken with him since, but I assume it all went well. Djinabaha might be able to tell you more, though. As I recall, he was the one who brokered the arrangement."},{"name":"GRAHATIA","text":"Djinabaha at Ruveydah Fibers... This sounds promising."},{"name":"GRAHATIA","text":"Djinabaha at Ruveydah Fibers... Let's make a point to visit him after we've spoken with other locals."},{"name":"PARIGHA","text":"I must've been working myself too hard... I only intended to take a short nap, but when I woke up, it was already sunset. Come to think of it, hasn't the sky been red rather longer than usual?"},{"name":"A3","text":"<span class=\"highlight\">Discuss the way to Dharma.</span>"},{"name":"A3","text":"<span class=\"highlight\">Discuss Ruveydah Fibers.</span>"},{"name":"GRAHATIA","text":"From what we've heard, our man Khalzahl was truly at wits' end."},{"name":"GRAHATIA","text":"And it all came to a head at the meyhane... Perhaps his arrangement with Ruveydah Fibers did not go according to plan? I expect this Djinabaha can tell us more."},{"name":"GRAHATIA","text":"If I am not mistaken, these stairs lead to Dharma."},{"name":"GRAHATIA","text":"It is...quite the sight, the red sky above."},{"name":"GRAHATIA","text":"During the Final Days of yore, the heavens burned and the stars fell. Creation magicks run amok─that was my assumption when I saw Amaurot."},{"name":"GRAHATIA","text":"Perhaps the ancients believed the same─that the terror of a single powerful individual was the cause of their calamity."},{"name":"GRAHATIA","text":"And yet, those selfsame horrors now manifest themselves before our eyes. What could it be that sets the heavens aflame and turns ordinary men into beasts?"},{"name":"GRAHATIA","text":"They're farming silkworms... This must be Ruveydah Fibers, where we should find Djinabaha."},{"name":"DJINABAHA","text":"We must protect our wares lest the beasts come again!"},{"name":"SYSTEM","text":"Djinabaha will not speak to you alone. Return with G'raha Tia accompanying you to proceed with the investigation."},{"name":"DJINABAHA","text":"...And hurry, I say! There's no time to waste!"},{"name":"GRAHATIA","text":"Pardon me, but you are in charge of buying and selling here, yes? We have a few questions that we'd like to─"},{"name":"DJINABAHA","text":"I'm sorry, but I simply don't have time to chat."},{"name":"DJINABAHA","text":"If you haven't noticed, we have our hands full at the moment. We must carry all our wares and equipment to safety before those accursed beasts return."},{"name":"GRAHATIA","text":"In that case, might we be of assistance? Perhaps we could speak when the job is done."},{"name":"DJINABAHA","text":"...Very well."},{"name":"DJINABAHA","text":"You can start by helping us move our equipment. Ask the others what to put where."},{"name":"DJINABAHA","text":"And you can carry our fabrics."},{"name":"DJINABAHA","text":"Go through that door and speak with Kamala. She'll tell you the rest."},{"name":"DJINABAHA","text":"Remember, these textiles are our livelihood. Handle them with care."},{"name":"DJINABAHA","text":"You'll get your answers <span class=\"emphasis\">after</span> you've kept your side of the bargain. Now, off with you."},{"name":"KAMALA","text":"This area is for employees only. Out, out!"},{"name":"KAMALA","text":"What's that? You've come to <span class=\"emphasis\">help</span>!? Oh, praise be to Minduruva!"},{"name":"KAMALA","text":"Kind stranger, I welcome your assistance. On your way here, you passed three storehouses, yes?"},{"name":"KAMALA","text":"I'd like you to carry that small crate to Nahbrifhal, by the storehouse near the hatchery."},{"name":"KAMALA","text":"The crate of clothing is for Mahnuha..."},{"name":"KAMALA","text":"...And that massive crate there goes to Zeymeira by the middle storehouse. Watch your back with that one."},{"name":"KAMALA","text":"Those are all the crates we have ready. Once they've been delivered, consider your work here complete!"},{"name":"SYSTEM","text":"You will have a limited time to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"NAHBRIFHAL","text":"This is where we store all our instruments and materials for both our silkworm hatchery and weaving workshop. I would show you around, but I'm expecting a delivery any moment now."},{"name":"NAHBRIFHAL","text":"Thread, is it? Then you've come to the right place. We thank you for your aid."},{"name":"MAHNUHA","text":"This storehouse is where we keep our finished products. Carpets, curtains, assorted garments and the like. Needless to say, we keep it tightly guarded."},{"name":"MAHNUHA","text":"If you have any crates of finished products such as carpets, clothing, and the like, pray bring them here to our primary storehouse."},{"name":"MAHNUHA","text":"A crateful of clothing, is it? I can take that off your hands. Many thanks for the delivery!"},{"name":"ZEYMEIRA","text":"The crates we keep here are packed to the brim with fabrics, and it might surprise you just how heavy they can get. Do take care to lift with your legs, or you'll regret it!"},{"name":"ZEYMEIRA","text":"I say, you're quite the brawny one, aren't you? A good thing, that. Never know when you'll need to defend yourself in these unpredictable times."},{"name":"ZEYMEIRA","text":"A crateful of fabrics, is it? Exactly what I was hoping to receive. Here, let me put that away for you."},{"name":"KAMALA","text":"You've carried all the crates to the storehouses, you say? And so quickly, too! Why, I've never seen anyone so strong!"},{"name":"KAMALA","text":"I and my associates will see to the rest, so please return to Djinabaha and assure him our work is proceeding apace."},{"name":"KAMALA","text":"To tell the truth, we're grateful for this distraction. Too many terrible happenings of late. But generous souls like yourself give me hope that we may emerge from this trial even stronger. I pray we meet again in more peaceful times."},{"name":"KAMALA","text":"Pack it all up, and quickly, now! We'll not let any of our precious fabrics be trampled and torn by those beasts!"},{"name":"DJINABAHA","text":"Done as I asked, have you?"},{"name":"DJINABAHA","text":"If Kamala is satisfied with your work, then so am I. You have done us a great favor, traveler."},{"name":"GRAHATIA","text":"I, too, have delivered the instruments and apparatus entrusted to me."},{"name":"DJINABAHA","text":"You both have my thanks. With our wares safely stored away, we'll not lose any more to those fiends."},{"name":"GRAHATIA","text":"I take it that your establishment did not escape the attack unscathed?"},{"name":"DJINABAHA","text":"We did not. Thankfully, most of our workers had already left for the day. But those of us still here saw it all..."},{"name":"DJINABAHA","text":"We looked to the burning skies in confusion...and then, before we could even begin to make sense of it, a hideous creature burst through the doors, shrieking..."},{"name":"DJINABAHA","text":"We ran for our lives, but one of my colleagues was not so fortunate. He cried out─a scream of such agony, such terror─and in the next instant, he, too, sprouted fearsome claws..."},{"name":"DJINABAHA","text":"The sight of it caused another fellow to panic, and then..."},{"name":"DJINABAHA","text":"He, too, transformed..."},{"name":"DJINABAHA","text":"...I'm sorry. There was something you wanted to ask?"},{"name":"GRAHATIA","text":"Indeed. You knew the merchant Khalzahl, did you not? I believe he had some dealings with your establishment."},{"name":"DJINABAHA","text":"Khalzahl? I know him well. We'd arranged for his consortium to deliver a large shipment of fabrics, but in the end, we received a better offer, and had to turn him down."},{"name":"DJINABAHA","text":"I understand his business is struggling, but so is ours. Another of our most reliable trading partners agreed to transport the goods for a much smaller commission, and we'd have been fools to refuse."},{"name":"DJINABAHA","text":"I felt terrible for withdrawing the offer...but you must understand, we simply had no choice."},{"name":"DJINABAHA","text":"He tried to put on a brave face when I delivered the news, but his dejection and despair were plain as day. He said he'd discuss it with his associates, but I could tell he'd all but given up hope..."},{"name":"GRAHATIA","text":"Dejection...and despair."},{"name":"GRAHATIA","text":"You remember what we saw in Vanaspati, yes? Soldiers and jungle dwellers pushed to the very brink turning into beasts one after the next..."},{"name":"GRAHATIA","text":"It would seem the same phenomenon occurred here. The poor craftsmen attacked by the fiends, as well as those that witnessed it...all undergoing the change."},{"name":"GRAHATIA","text":"I suspect that everything began with Khalzahl. By all accounts, it was he who suffered from the most profound and piercing despair..."},{"name":"GRAHATIA","text":"...Wait. Could that be it? That such intense emotions were what triggered his transformation?"},{"name":"GRAHATIA","text":"Much remains unclear, but I believe we are drawing closer to an answer. At any rate, we must discuss our findings with the others."}],"reward":{"gil":1594},"reqs":{"jobs":[{"lvl":85,"id":142}],"quests":[69946]},"next":[69948]},"partials":[{"type":"npc","id":"1037318","obj":{"i":1037318,"n":"Mihleel","l":3707,"q":2}},{"type":"npc","id":"1039003","obj":{"i":1039003,"n":"Djinabaha","l":3707,"q":1}},{"type":"quest","id":"69946","obj":{"i":69946,"n":"The Blasphemy Unmasked","g":11,"l":"Radz-at-Han","s":564}},{"type":"quest","id":"69948","obj":{"i":69948,"n":"Beyond the Depths of Despair","g":11,"l":"Radz-at-Han","s":566}}]}