{"quest":{"name":"Skies Aflame","location":"Old Sharlayan","id":69945,"patch":6.0,"sort":563,"icon":101117,"eventIcon":71201,"issuer":1038969,"target":1038992,"genre":11,"journal":["Tataru is furrowing her brow in consternation.","A visibly distressed Tataru informs you of grave tidings from far-off Radz–at–Han. It would appear your fellow Scions have already assembled in the main hall to discuss the situation, and you resolve to join them as soon as you are able.","The news from Radz–at–Han is dire indeed. The heavens burn red, and unholy beasts run rampant, preying upon the people─indeed, the Final Days have come. With Krile and Tataru remaining behind to support your expedition as best they may, you prepare to depart with your companions to investigate the precise nature and extent of this calamity, and to combat it to the best of your ability.","Thavnair is truly the stuff of nightmares. More disturbing than the rampaging beasts, however, are the words of Ahewann, satrap of Radz–at–Han, who shares with you the revelation that the monstrosities that plague the city are his own countrymen, transformed by forces unknown. The largest and most fearsome of the creatures─dubbed a “blasphemy” by the local populace─has fled north after wreaking havoc on the city. The dragon Vrtra, guardian of Thavnair, and the Radiant Host have already been dispatched in pursuit, and the satrap would have you join them.","At the docks, Ahewann briefs you on the plan of attack. You and your fellow Scions are to circle to the north side of the island by boat, and hunt for the blasphemy deep within the sacred jungle of Vanaspati. Looking out over the waters, you steel yourself for the battle to come.<br><br>※To enlist your companion NPCs for this duty, speak with them near the entrance or access Duty Support via the main menu. Use the Duty Finder if you wish to complete the instance alongside fellow players.","You and your companions succeed in putting down the blasphemy, thereby eliminating the greatest threat to the people of Thavnair. There is little cause to rejoice, however, as yet more disturbing news has come to light: the ill-fated men-turned-beasts were bereft of all their aether─not only their lives, but their very souls are beyond saving. With newfound resolve to uncover the true cause of the transformations and put an end to them for good, you and your companions make to survey the area one last time before returning to Radz–at–Han.","Though the blasphemy itself has fallen, the battle against the beastly horde rages on in the skies above. Entrusting the task of defending the island from above to the dragon Vrtra─who grudgingly allows Estinien a place upon his back─you prepare to return to Radz–at–Han with your companions. There, you will reconvene with Ahewann, that you might share the knowledge you have acquired and see how the city fares.","Ahewann welcomes you back to the city, and reports with some relief that the lingering beasts that yet plagued the city have been dispatched. Though the immediate threat has passed, however, it is no time to rest easy, for there is no telling where and when the next transformation might occur..."],"objectives":["Head to the main hall.","Journey to Thavnair.","Speak with Ahewann.","Enter Vanaspati.","Speak with Ahewann."],"dialogue":[{"name":"TATARU","text":"Oh, <span class=\"highlight\">Forename</span>! I was just about to call for you."},{"name":"TATARU","text":"I'm afraid we've received another call for assistance. This one comes from Radz–at–Han..."},{"name":"TATARU","text":"The others have assembled in the main hall to discuss the situation. You must join them at once!"},{"name":"TATARU","text":"I heard all about the Final Days from Krile, but I had no idea we'd feel the impact of it this soon..."},{"name":"KRILE","text":"Ah, there you are."},{"name":"KRILE","text":"Our worst fears have come to pass. But moments ago, we received grim tidings from our contact in Radz–at–Han."},{"name":"KRILE","text":"Vile beasts have appeared as if out of nowhere, claiming one victim after the next. What's more, they say the very sky burns above them..."},{"name":"ALPHINAUD","text":"Good gods... Are the Final Days already upon us?"},{"name":"KRILE","text":"It would appear so. Sadly, that is all the information we have at present. No doubt the people of Radz–at–Han are busy fighting for their lives..."},{"name":"ALISAIE","text":"Then we must go at once! They need our help!"},{"name":"GRAHATIA","text":"Agreed. Krile, you'd best remain here with Tataru and gather what knowledge you can. You are in no condition for a long journey, I imagine."},{"name":"KRILE","text":"...Very well. Similar phenomena may have been observed elsewhere, and if so, we must know about it at once."},{"name":"KRILE","text":"Be safe out there, yes?"},{"name":"THANCRED","text":"Let us make first for Yedlihmad. We must prepare ourselves for what may lie ahead."},{"name":"ALPHINAUD","text":"We do not wield the creation magicks that the ancients did, yet still these abominations appear. Whatever could be the cause?"},{"name":"ALISAIE","text":"With the fall of the tower in Thavnair, the Hannish were beginning to enjoy a semblance of peace. And now this."},{"name":"THANCRED","text":"No similar creatures have been sighted here in Sharlayan. That said, the early signs may manifest in other regions ere long. We must be prepared for every eventuality."},{"name":"YSHTOLA","text":"In ancient times, the phenomenon was first observed in places where the celestial currents had grown weakest. 'Twould seem there is a stagnancy of aether in the skies above Radz–at–Han unbeknownst even to Vrtra."},{"name":"GRAHATIA","text":"If this calamity has indeed come to Thavnair, it is all too likely that Corvos across the strait finds itself in a similar predicament."},{"name":"GRAHATIA","text":"Even now, it remains an imperial province, and as such, it may be some time until we can ascertain the situation there. We can only hope that Krile and Tataru will be able to provide us with some insight sooner rather than later."},{"name":"ESTINIEN","text":"If the might of Vrtra is not enough to hold these fiends at bay, Radz–at–Han is in dire straits indeed. We must go at once."},{"name":"KRILE","text":"I would rather accompany you to Thavnair...but Raha's concerns are well founded. The last thing I would want is to be a burden."},{"name":"KRILE","text":"And so I will remain here with Tataru, and do all I can to gather knowledge that might serve us in the battle to come. Godsspeed in your journey, <span class=\"highlight\">Forename</span>."},{"name":"TATARU","text":"I'm glad for Krile's support. I'll also call upon Hoary Boulder and the others to assist us. They will be our eyes and ears in the field, as they have been many times before."},{"name":"ALPHINAUD","text":"So the beasts are not born of creation magicks run amok, but are rather the altered forms of the people themselves. In that sense, this manifestation of the Final Days differs from that which we witnessed in Amaurot."},{"name":"ALPHINAUD","text":"...And for the worse, I daresay. If any man, woman, or child could become a beast at any moment, there is no telling whence the next threat might come. We must exercise extreme caution."},{"name":"ALISAIE","text":"Don't worry. No matter how grim things might get, I won't lose heart. I'm ready whenever you need me."},{"name":"THANCRED","text":"If it's true that the people themselves have transformed into beasts, why, even the Radiant Host could suffer the same fate. Or us, perish the thought..."},{"name":"YSHTOLA","text":"I shall survey the environs closely as we go about our search. There may be some clue as to how we can combat this phenomenon."},{"name":"GRAHATIA","text":"Innocent souls twisted and reformed into unholy abominations. I thought I had seen the last of such nightmares with the sin eaters..."},{"name":"GRAHATIA","text":"We must act quickly, <span class=\"highlight\">Forename</span>! Every moment we tarry means another soul may be lost to this nightmare."},{"name":"ESTINIEN","text":"Usually the most dangerous foe in a wyrm's domain is the wyrm themselves. If I were Vrtra, I would be as offended as I am horrified."},{"name":"AWAHEEN","text":"Everyone has assembled, yes? I thank you for lending us your aid in our battle against the blasphemy. Let us review our plan of attack."},{"name":"AWAHEEN","text":"I would have you board this boat and circle around to the north side of the island."},{"name":"AWAHEEN","text":"There you will find a dense jungle we call Vanaspati."},{"name":"AWAHEEN","text":"It is a sacred wood, home to many temples and a number of villages."},{"name":"AWAHEEN","text":"Vrtra and the Radiant Host have gone there ahead of us."},{"name":"AWAHEEN","text":"I ask that you join them, and do all in your power to destroy this blasphemy."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Small talk."},{"name":"A1","text":"Form a party and enter Vanaspati."},{"name":"A1","text":"Nothing."},{"name":"AWAHEEN","text":"I pray we are not too late to spare the settlements within Vanaspati the fate that has befallen our city."},{"name":"AWAHEEN","text":"Once we meet with Vrtra and the Radiant Host, they should be able to tell us more of the present situation."},{"name":"HANNISHROYALGUARD","text":"Continue with the main scenario quest?"},{"name":"ALPHINAUD","text":"While Estinien and Vrtra defend Radz–at–Han from above, we on the ground must find a means to prevent these transformations...and soon."},{"name":"ALISAIE","text":"After so long, and so many sacrifices, we finally found a way to cure the tempered. But these poor souls...they vanish without a trace. Is there truly no saving them...?"},{"name":"THANCRED","text":"The stillness in the air puts me ill at ease. We must be wary."},{"name":"YSHTOLA","text":"Worry not. I can see your aether, and that of our companions. We have not suffered the fate of those unfortunate souls."},{"name":"GRAHATIA","text":"All life must end in death. Yet death, in turn, gives birth to new life─such is the flow of aether. To think that natural cycle could simply be...cut off─the very thought makes me shudder."},{"name":"AWAHEEN","text":"Our Radiant Host has eliminated the immediate threat to the city, though it pains me to know those beasts were once my own people..."},{"name":"AWAHEEN","text":"There is no telling when or where the next transformation might occur. We must remain vigilant and steel ourselves for whatever is yet to come."},{"name":"SYSTEM","text":"You may now enter Vanaspati with a party of NPC avatars. To make use of this feature, open the <span class=\"highlight\">Trust</span> interface located under <span class=\"highlight\">Duty</span> in the main menu."}],"reward":{"gil":3000,"items":[{"num":2,"id":5765,"one":1},{"num":2,"id":5766,"one":1},{"num":2,"id":5770,"one":1},{"id":5825,"one":1}],"instance":83},"reqs":{"jobs":[{"lvl":85,"id":142}],"quests":[69944]},"next":[69946]},"partials":[{"type":"npc","id":"1038969","obj":{"i":1038969,"n":"Tataru","l":3706,"q":1}},{"type":"npc","id":"1038992","obj":{"i":1038992,"n":"Ahewann","l":3707,"q":2}},{"type":"item","id":"5765","obj":{"i":5765,"n":"Honey Yellow Dye","l":30,"c":22806,"t":55}},{"type":"item","id":"5766","obj":{"i":5766,"n":"Millioncorn Yellow Dye","l":30,"c":22806,"t":55}},{"type":"item","id":"5770","obj":{"i":5770,"n":"Raisin Brown Dye","l":1,"c":22806,"t":55,"p":334}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"instance","id":"83","obj":{"i":83,"n":"Vanaspati","c":61801,"t":"Dungeons","min_lvl":85,"max_lvl":86,"min_ilvl":510}},{"type":"quest","id":"69944","obj":{"i":69944,"n":"Returning Home","g":11,"l":"Mare Lamentorum","s":562}},{"type":"quest","id":"69946","obj":{"i":69946,"n":"The Blasphemy Unmasked","g":11,"l":"Radz-at-Han","s":564}}]}