{"quest":{"name":"The Blasphemy Unmasked","location":"Radz-at-Han","id":69946,"patch":6.0,"sort":564,"eventIcon":71201,"issuer":1038992,"target":1037318,"genre":11,"journal":["Ahewann's burden is heavy indeed, yet he need not bear it alone."],"objectives":["Speak with G'raha Tia and have him accompany you.","Speak with Nuhadeen while G'raha Tia is accompanying you.","Gather information at Balshahn Bazaar while G'raha Tia is accompanying you.","Accompany G'raha Tia to the designated location and then speak with him.","Gather information at Mehryde's Meyhane while G'raha Tia is accompanying you.","Speak with Mihleel while G'raha Tia is accompanying you."],"dialogue":[{"name":"ALPHINAUD","text":"While Estinien and Vrtra defend Radz–at–Han from above, we on the ground must find a means to prevent these transformations...and soon."},{"name":"ALISAIE","text":"After so long, and so many sacrifices, we finally found a way to cure the tempered. But these poor souls...they vanish without a trace. Is there truly no saving them...?"},{"name":"THANCRED","text":"The stillness in the air puts me ill at ease. We must be wary."},{"name":"YSHTOLA","text":"Worry not. I can see your aether, and that of our companions. We have not suffered the fate of those unfortunate souls."},{"name":"GRAHATIA","text":"All life must end in death. Yet death, in turn, gives birth to new life─such is the flow of aether. To think that natural cycle could simply be...cut off─the very thought makes me shudder."},{"name":"AWAHEEN","text":"Forgive me, my friends, but I must return to Meghaduta for the time being. There, I can better manage this crisis and dispatch my troops as the situation demands."},{"name":"ALPHINAUD","text":"In that case, we shall carry out an investigation of our own here in the city."},{"name":"ALPHINAUD","text":"Mayhap the residents can tell us more about the first of the transformations, and the conditions under which it occurred."},{"name":"ALPHINAUD","text":"If we can ascertain what exactly triggered these tragic events, it may give us some insight as to a possible solution."},{"name":"ALPHINAUD","text":"Time is of the essence. Let us split into three groups that we may cover more ground."},{"name":"ALPHINAUD","text":"Alisaie and I will see to Paksa's Path. Thancred and Y'shtola, pray make for Dharma."},{"name":"ALPHINAUD","text":"I leave Artha to G'raha and you, <span class=\"highlight\">Forename</span>. Any information you can gather on the first blasphemy or the manifestation of the Final Days here in the city would be most helpful."},{"name":"ALPHINAUD","text":"When we have completed our respective inquiries, let us reconvene in front of Meghaduta, that we might share what we've learned with the satrap."},{"name":"GRAHATIA","text":"Shall we be off, then?"},{"name":"GRAHATIA","text":"Artha is home to the High Crucible of Al-Kimiya, whose alchemists forged many of our warding scales."},{"name":"GRAHATIA","text":"That seems as good a place as any to begin our investigation, don't you think? I spoke briefly with Nuhadeen, the chief alchemist there, on our last visit. He should be happy to answer our queries."},{"name":"SYSTEM","text":"G'raha Tia is now accompanying you. Keep him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave G'raha Tia behind by entering a different area, or by speaking with him and selecting the option to part ways."},{"name":"SYSTEM","text":"Should you part ways, G'raha Tia will return to his original location. Speak with him there and he will accompany you once more."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Speak with G'raha Tia."},{"name":"A1","text":"Part ways with G'raha Tia."},{"name":"A1","text":"Nothing."},{"name":"GRAHATIA","text":"Let us make for the High Crucible and speak with Nuhadeen. His discerning eye may reveal to us truths we have overlooked."},{"name":"Q2","text":"Are you sure you wish to part ways with G'raha Tia?"},{"name":"GRAHATIA","text":"Very well. I shall be waiting for you at Alzadaal's Path whenever you are ready to resume our investigation."},{"name":"GRAHATIA","text":"Ready to get back to it? Excellent!"},{"name":"SYSTEM","text":"G'raha Tia has yet to arrive. Be sure he is at your side before attempting to continue."},{"name":"NUHADEEN","text":"Hm? Forgive me, traveler, but I am rather too busy at the moment to entertain you."},{"name":"SYSTEM","text":"You should have G'raha Tia accompanying you before proceeding with the investigation."},{"name":"NUHADEEN","text":"Ahh, I remember those red eyes. You were with those “Scions” who commissioned the scales from us, yes?"},{"name":"NUHADEEN","text":"I welcome you back to the High Crucible. What brings you here in these troubling times?"},{"name":"GRAHATIA","text":"We are assisting the satrap in investigating the crisis that plagues the city. Did you happen to catch sight of any of the creatures?"},{"name":"NUHADEEN","text":"I did. As I was going about my work, I was disturbed by crashing footsteps so powerful that the very ground shook."},{"name":"NUHADEEN","text":"I rushed outside, and could not believe what I beheld. The night sky was burning..."},{"name":"NUHADEEN","text":"Suddenly, I heard panicked screams coming from the direction of Balshahn Bazaar. In the next instant, a monstrous beast poked its head out from amidst the stalls!"},{"name":"NUHADEEN","text":"A handful of the Radiant rushed to the scene, only to be sent sprawling as the fiend and its minions propelled themselves skyward."},{"name":"GRAHATIA","text":"...So the blasphemy came from the vicinity of the markets. This knowledge may prove useful. I thank you for sharing your tale."},{"name":"GRAHATIA","text":"Well, I do believe we now know where we should inquire next. To the bazaar, then."},{"name":"A3","text":"<span class=\"highlight\">Discuss the textile stalls.</span>"},{"name":"GRAHATIA","text":"According to Nuhadeen, the blasphemy came from the direction of Balshahn Bazaar. Let us inquire there to see if any of the vendors or customers can enlighten us further."},{"name":"GRAHATIA","text":"So this is Thavnairian weave...I must say, it bears a resemblance to the traditional fabrics of Corvos. Small wonder, really, given that it's just across the water."},{"name":"GRAHATIA","text":"...Not that I am much of an expert in Corvosi culture, of course. I've not had the occasion to visit my ancestral home since coming to Sharlayan, and like as not I will never reside there again."},{"name":"GRAHATIA","text":"That said, in recent days I've felt more acutely aware of my heritage...and grateful for it. It is thanks to my forebears that I inherited the Royal Eye─and with it, the wisdom of ancient Allag."},{"name":"GRAHATIA","text":"And so...well, I simply hope that my countrymen are safe. And one day, when this calamity is but a memory, I would like to see Corvos again, if only once."},{"name":"NUHADEEN","text":"After toiling days and nights to fashion your allies' warding scales, a great number of our alchemists were granted a respite."},{"name":"NUHADEEN","text":"In part because of this, the damage here at the Crucible was limited. On the other hand, we have not heard from many who were at home during the attack. We can only pray that they are safe."},{"name":"VARSRA","text":"Forgive me, but my shop's closed until further notice. Needless to say, we've more pressing concerns these days..."},{"name":"VARSRA","text":"Forgive me, but my shop's closed until further notice. Needless to say, we've more pressing concerns these days..."},{"name":"GRAHATIA","text":"We have come not in search of wares, but information concerning the enormous fiend that tore through the bazaar. Did you perchance witness anything?"},{"name":"VARSRA","text":"Afraid not, my friend. I was here the whole time, so I only saw its little minions. Made a mess of the place, they did."},{"name":"VARSRA","text":"While that was all going on, the great big one tore through the west side of the bazaar. You'd have better luck asking there."},{"name":"GRAHATIA","text":"...And with that, I do believe we've learned all we can from the bazaar. Let's take a moment to review our findings."},{"name":"VARSRA","text":"The beasts that attacked us here were scrawny little things, but they caused as much damage as that bigger one. Until the Radiant saw them off, it was all I could do to run for dear life..."},{"name":"RAHDVIRA","text":"Sisters have mercy, what is happening to the world!? What am I to do...? Is nowhere safe!?"},{"name":"RAHDVIRA","text":"Sisters have mercy, what is happening to the world!? What am I to do...? Is nowhere safe!?"},{"name":"GRAHATIA","text":"Settle down, friend. The danger has passed...at least for now. If it's not too painful to remember, could you tell us what you saw?"},{"name":"RAHDVIRA","text":"F-First I heard the screams...then a horde of ravening beasts came charging towards us!"},{"name":"RAHDVIRA","text":"One of them was huge─bigger than a marid! Throwing people about like rag dolls...and it was <span class=\"emphasis\">eating</span> them!"},{"name":"RAHDVIRA","text":"I hid. Under the counter. Saw others do the same."},{"name":"RAHDVIRA","text":"But the shrieking and wailing kept getting louder...more voices in the throng. Beasts or victims, I couldn't tell─I knew not what was happening. I still don't..."},{"name":"GRAHATIA","text":"That is enough, my good man. You were brave to share with us your tale. Many of your fellow merchants are safe. The High Crucible, too, has survived mostly unscathed. Pray stay close to your friends and loved ones, and rest your body and mind while you are able."},{"name":"GRAHATIA","text":"I suspect that is the most we can expect the people here to tell us. I think it best we find a place outside the bazaar where we might rest and review our findings."},{"name":"RAHDVIRA","text":"What nightmare is this... When will it end?"},{"name":"ZEYTAHNUR","text":"Is something the matter, traveler? If you are lost, perhaps I could be of assistance."},{"name":"ZEYTAHNUR","text":"Is something the matter, traveler? If you are lost, perhaps I could be of assistance."},{"name":"GRAHATIA","text":"Your offer is most appreciated. We are not lost, but we are in need of information. Might you know anything about the gargantuan beast that rampaged through the bazaar?"},{"name":"ZEYTAHNUR","text":"Aye, I saw it all. Though I wish I had not."},{"name":"ZEYTAHNUR","text":"I was going about my work, when all of a sudden a piercing scream cut through the air. I turned around, and there was the fiend, its massive body bursting through that entryway with the force of a tidal wave. And then it was gone, as quickly as it came..."},{"name":"GRAHATIA","text":"That is the extent of what we will learn here, I think. Shall we take a moment to consider our findings elsewhere?"},{"name":"ZEYTAHNUR","text":"Fortunate was I to be inside my shop at the time. The owner of the stall across from me was hawking his wares on the street. Suffice it to say, he wasn't so lucky..."},{"name":"GRAHATIA","text":"It might distress those still traumatized by the incident to discuss what we've learned within earshot..."},{"name":"GRAHATIA","text":"Judging by their accounts, the transformation had already occurred by the time the beast reached the bazaar."},{"name":"GRAHATIA","text":"It tore through the west side of the bazaar and headed towards the aetheryte plaza..."},{"name":"GRAHATIA","text":"In other words, the blasphemy may have first appeared in this vicinity. That being the case, the people in that meyhane can surely tell us more."},{"name":"GRAHATIA","text":"You could see the terror in the eyes of those poor merchants. Would that we could do something to allay their fears..."},{"name":"CUSTOMER04410","text":"Gods, what I wouldn't give to unsee that horrible sight!"},{"name":"CUSTOMER04410","text":"Going after that enormous beast, are you?"},{"name":"CUSTOMER04410","text":"Aye, I saw it...including the very instant that poor bastard transformed! Damn the gods for putting me there!"},{"name":"CUSTOMER04410","text":"It started over there, by the window. A few men, merchants, probably. Talking and drinking."},{"name":"CUSTOMER04410","text":"Conversation must've taken a turn for the worse. Next thing I know, their leader─I suppose he was─buries his head in his hands, and black mist was swirling about him!"},{"name":"CUSTOMER04410","text":"Then his whole body...bursts apart, and there stands a hideous, slavering beast... Massive and foul...all gaping maws and bulging eyes!"},{"name":"CUSTOMER04410","text":"His friends start shrieking, then the black mist comes again, until the change takes them too... The stuff of nightmares, I tell you..."},{"name":"GRAHATIA","text":"Nightmarish, indeed... Incidentally, do you perchance know who those merchants were?"},{"name":"CUSTOMER04410","text":"No, I'm a decorator by trade. Not much cause to mingle with their sort."},{"name":"CUSTOMER04410","text":"Saw Mihleel the barmaid chatting with them, though. She might know something."},{"name":"CUSTOMER04410","text":"By the time it was done, every last man at their table had turned into some hideous thing. The rest of us were lucky to escape with our lives..."},{"name":"RHULMEIRA","text":"Even after repairing all that damage, it'll take a while for business to pick up again..."},{"name":"RHULMEIRA","text":"Even after repairing all that damage, it'll take a while for business to pick up again..."},{"name":"RHULMEIRA","text":"You mean the blasphemy? That's what the Radiant have been calling it, anyway."},{"name":"RHULMEIRA","text":"I saw it, too. We all did. I was standing here at the counter as Mehryde poured me a drink, when suddenly there came this dreadful sound, like a pained, angry groan."},{"name":"RHULMEIRA","text":"It was unlike anything I've ever heard. I turned around in shock, and from an ominous cloud of black mist rose the creature, enormous and ghastly to behold."},{"name":"RHULMEIRA","text":"As for what happened next...to recall it sends shivers up my spine. By some stroke of fortune, I was able to slip outside before the beast got its claws on me..."},{"name":"RHULMEIRA","text":"But the sight that greeted me offered no solace─the blue sky above turned red as blood. Mehryde, myself, and the other survivors clung to each other for dear life until the Radiant Host came to our aid."},{"name":"GRAHATIA","text":"...Wait. Did I hear you correctly? The beast manifested <span class=\"emphasis\">before</span> the sky began to burn?"},{"name":"RHULMEIRA","text":"I'm certain of it. The windows here offer a clear view of the sky, and I saw nothing out of the ordinary until the beast appeared and began to rage."},{"name":"RHULMEIRA","text":"Even if you're not here to drink, why not stick around and make the place look less empty? I only ask that you mind the carpet. There may be a few bloodstains concealed beneath..."},{"name":"GRAHATIA","text":"Concerning words, to say the least. And yet, it is too soon to jump to conclusions. Let us talk to this Mihleel, and see if she might enlighten us further."},{"name":"MIHLEEL","text":"Oh...hello there. Welcome to Mehryde's Meyhane. What can we get you?"},{"name":"MIHLEEL","text":"Oh...hello there. Welcome to Mehryde's Meyhane. What can we get you?"},{"name":"GRAHATIA","text":"We have come not for libations, but rather for information. You are Mihleel, yes?"},{"name":"GRAHATIA","text":"We are investigating the so-called blasphemy on the satrap's behalf. We hear it was one of your customers─a merchant─that first underwent the transformation. What can you tell us about him?"},{"name":"MIHLEEL","text":"He...he was something of a regular here, especially of late."},{"name":"MIHLEEL","text":"Khalzahl was his name. He ran his own consortium, dealing primarily in the exports of Thavnairian specialties."},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"Where have I heard that name before...?"},{"name":"A4","text":"It's through him we met Matsya."},{"name":"GRAHATIA","text":"It definitely rings a bell. Come to think of it, didn't you meet a Khalzahl when you first came to Thavnair?"},{"name":"GRAHATIA","text":"If I recall correctly...he ran a trading operation in Yedlihmad. It was through him that the Scions were acquainted with the fisherman Matsya."},{"name":"GRAHATIA","text":"Yes, the names ring a bell. Didn't you meet them both on your first trip to Thavnair?"},{"name":"GRAHATIA","text":"If I recall correctly...Khalzahl ran a trading operation in Yedlihmad, and it was there that you made Matsya's acquaintance."},{"name":"MIHLEEL","text":"Yes...that is the same Khalzahl, no doubt. A rather successful man, from what I gather."},{"name":"MIHLEEL","text":"That said, it was clear that he had fallen on hard times of late. Those ghastly towers popping up everywhere cannot have been good for business."},{"name":"MIHLEEL","text":"Even now, with the towers gone, the collapse of the Empire has led to all sorts of problems elsewhere. The market for luxuries is surely not what it once was..."},{"name":"GRAHATIA","text":"Trying times for the head of a trading consortium, indeed..."},{"name":"MIHLEEL","text":"Khalzahl was a compassionate man. Even as his own business suffered, he did what he could to provide for the artisans, fishermen, and many others who counted on him to sell their wares."},{"name":"MIHLEEL","text":"Indeed, that was the very topic of yesterday's meeting, as far as I could hear. Yet as they discussed matters further, Khalzahl's tone grew grave and grim... It was then that...that..."},{"name":"GRAHATIA","text":"Forgive me. I would not have you recall the memory if it brings you pain. If I could, I would ask just one more thing."},{"name":"GRAHATIA","text":"Did you notice anything unusual about Khalzahl in particular? Please...anything at all!"},{"name":"MIHLEEL","text":"Sorry, nothing springs to mind. Perhaps someone else can help you."},{"name":"MIHLEEL","text":"Khalzahl lived for his work, and had no family that I know of. His employees and associates knew him best, but...they too are lost to us."},{"name":"MIHLEEL","text":"Still, perhaps his neighbors know something I do not. I can direct you to them, if you believe it would help. What do you say?"}],"reward":{"gil":1053},"reqs":{"jobs":[{"lvl":85,"id":142}],"quests":[69945]},"next":[69947]},"partials":[{"type":"npc","id":"1038992","obj":{"i":1038992,"n":"Ahewann","l":3707,"q":2}},{"type":"npc","id":"1037318","obj":{"i":1037318,"n":"Mihleel","l":3707,"q":2}},{"type":"quest","id":"69945","obj":{"i":69945,"n":"Skies Aflame","g":11,"l":"Old Sharlayan","s":563}},{"type":"quest","id":"69947","obj":{"i":69947,"n":"Amidst the Apocalypse","g":11,"l":"Radz-at-Han","s":565}}]}