{"quest":{"name":"Under His Wing","location":"Thavnair","id":69953,"patch":6.0,"sort":571,"icon":101120,"eventIcon":71201,"issuer":1039068,"target":1040360,"genre":11,"journal":["Matsya is eyeing you as if there is something he wants to say.","With Palaka's Stand having regained a moment's peace, you and your companions leave the village in the care of Nidhana, Matsya, and the alchemists. You set off towards Radz–at–Han, stopping along the way to meet Estinien.","Estinien is relieved to hear that you and the others have brought the situation at Palaka's Stand under control. For his part, the dragoon assures you that the immediate environs are free of danger. Your mind put at ease, you make for Alzadaal's Path, where Thancred awaits.","Thancred is glad of your safe return, and is pleased to inform you that the threat within the city has been likewise quelled. He further explains that the citizens have been summoned to the square, where a proclamation of great import is to be made. At your friend's behest, you promise to convey the news to those who appear uninformed as you make way for Meghaduta yourself.","You share the news of the proclamation with a young boy who had been hiding for fear of the beasts. In part out of concern for Varshahn, whom the lad considers a friend, he dashes off toward the square as you, too, continue on your way.","You deliver word of the impending proclamation to a visibly frightened youth. Though reluctant to return to the site of the recent slaughter─and deeply suspicious of any who might presume to assume leadership in Ahewann's stead─he nonetheless heads off to the square ahead of you.","As the citizens congregate before Meghaduta, Vrtra descends from the sky and reveals unto them his secret, thus fulfilling Ahewann's deepest wish and ending the long deception surrounding the satrap's true identity. The great wyrm's words resonate with the people, overcoming their initial surprise and skepticism, and give them hope for Radz–at–Han's future. This historic moment, however, is soon interrupted when Fourchenault and his colleagues from the Sharlayan Forum arrive with shocking news and an even more shocking proposal. The star they live upon is dying, and he would assist the people in escaping it to take refuge on the moon. Sharing his people's deep and abiding love for their home, Vrtra promises he will make no decision that binds them, and retreats with his guests to discuss the matter in private. Not moments after the wyrm and the Sharlayans have taken their leave, Nidhana reappears to share with you her latest theory that a force other than aether empowers the blasphemies and beasts─namely, an energy called akasa, said to be influenced by emotion alone. You ponder the implications of this potential explanation as Nidhana takes her leave and the congregated citizenry go their separate ways.","Alphinaud muses on how, despite all that has transpired, much remains a mystery to you about the underlying cause and fundamental nature of the Final Days. Is there truly no way to forestall the star's calamitous fate? If there is a way, where might such answers be found? Only one thing is certain─you and your companions will not give up hope until all possibilities have been explored."],"objectives":["Speak with Estinien.","Speak with Thancred in Radz–at–Han.","Search for townspeople who missed the announcement.","Search for more townspeople who missed the announcement.","Wait at the designated location.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"I heard that the survivors we met at the temple have all returned safely. The crisis may not have passed, but being home and among friends should do much to ease their spirits."},{"name":"ALISAIE","text":"The aroma of that chai truly is irresistible... Do you suppose Nidhana would mind if I helped myself to a cup?"},{"name":"NIDHANA","text":"Hardship is an inescapable part of life, we believe. And so our traditions teach us how we might overcome these trials. Perhaps this is why we are quick to adapt to new situations."},{"name":"TIREDMAN04416","text":"First order of business is securing food and shelter. We also must contact our friends in the city and see how they fare. Hah, no rest for the weary!"},{"name":"MATSYA","text":"As you have finished your deliveries, might I talk with you for a moment? I was curious to know...what has become of Mehvan and Qerasaf's remains."},{"name":"MATSYA","text":"Oh, thank you, friend. Surely, they will be able to rest peacefully by each other's side."},{"name":"MATSYA","text":"I and the people of Palaka's Stand will perform the rites as soon as we are able."},{"name":"MATSYA","text":"As for the child...it will not be easy for her, growing up without her parents, but I promise to do what I can. Once she is able to eat solid food, the fish I catch will help nourish her."},{"name":"ALISAIE","text":"Well, we've finished delivering the chai. I do believe everyone has a piping hot cup."},{"name":"ALPHINAUD","text":"I could almost believe there's a magick at work, how their tension fades with every sip. Let us pray that Palaka's Stand has seen the last of those transformations─at least for now."},{"name":"ALPHINAUD","text":"They are still at risk─as every village in Thavnair, like as not. Still, I trust we can leave this place in the care of our friends from the Radiant and the High Crucible. Shall we return to Radz–at–Han?"},{"name":"NIDHANA","text":"By all means, do not let us keep you further! There are still many who have need of your wisdom and strength to deliver them from this terrible calamity."},{"name":"MATSYA","text":"And I will do what I can as well! I will bring rations and supplies from Akyaali─we have plenty to spare."},{"name":"ALISAIE","text":"Then let us find Estinien and be on our way. Where did he wander off to again?"},{"name":"ALISAIE","text":"The Wakeful Torana? Near the bridge to Radz–at–Han, as I recall. Very well, then."},{"name":"NIDHANA","text":"Worry not─my colleagues and I will watch over this village when you have gone. And should my research bear any new fruit, you shall be the first to know!"},{"name":"MATSYA","text":"When you and your friends entrusted me with the child, I was beside myself with fear. In bringing her back safe, however, I realized I was capable of so much more than I ever believed."},{"name":"MATSYA","text":"Nothing could be more terrifying than that moment I faced the beasts in the jungle. But I survived. I survived...and come what may, I will survive again."},{"name":"MATSYA","text":"Without you, I never would have found the strength. I thank you, and promise to make the most of this lesson."},{"name":"ALPHINAUD","text":"I have apprised Estinien of the situation at Palaka's Stand, so we needn't have that conversation."},{"name":"ALISAIE","text":"How do you suppose the others have fared in the capital? I hope things have not been too eventful in our absence."},{"name":"ESTINIEN","text":"Alphinaud told me everything. Full glad am I to hear the people are safe."},{"name":"ESTINIEN","text":"Likewise, you will be pleased to know I found no evidence of lingering beasts in the jungle and ruins. 'Twould seem you finished off the last of them."},{"name":"ESTINIEN","text":"Trying times yet lie ahead for the people of Thavnair. Fortunately, they have a wise and benevolent satrap to shepherd them through."},{"name":"ESTINIEN","text":"Speaking of which, I received word from Thancred not a short while ago. He awaits our return to the city on Alzadaal's Path. Come."},{"name":"ALPHINAUD","text":"There is a lingering sense of desolation here, but that is much preferable to the panic and chaos we saw before."},{"name":"ALISAIE","text":"The poor old woman who became a beast said her grandson had gone to Palaka's Stand. I hope he survived..."},{"name":"ESTINIEN","text":"'Twill be a struggle for the people to come to terms with these tragedies. But they are far stronger than you may think."},{"name":"THANCRED","text":"It is good to see you safe. Given the skies, 'tis all too easy to fear the worst."},{"name":"THANCRED","text":"I am pleased to report that we've succeeded in quelling the threat here in the city. The beasts have all been felled, and the citizens are safe for now."},{"name":"THANCRED","text":"I've also heard from the Radiant that an important proclamation will be made in the city square, though they said no more than that. Might you have any idea what this is about?"},{"name":"THANCRED","text":"...So Vrtra is finally coming out from behind the curtain. I suppose we, too, should hear what he has to say."},{"name":"THANCRED","text":"To Meghaduta, then. But before that...it would appear that word of the assembly has not yet reached all the citizens."},{"name":"THANCRED","text":"If anyone along the way seems unaware, we'd best enlighten them."},{"name":"THANCRED","text":"I'm sure everyone will hear about it soon enough, but those who don't attend will be kicking themselves later for missing what's certain to be a historic moment."},{"name":"HANNISHBOYB","text":"A-Are the beasts all gone? I've been hiding, and...I'm too scared to go out and look."},{"name":"HANNISHBOYB","text":"O-Oh, that's a relief! I thought one of those beasts was going to eat me!"},{"name":"HANNISHBOYB","text":"I wonder where Varshahn is... He's the slowest runner. I hope he got away."},{"name":"HANNISHBOYB","text":"Hmm... He could be with the other people from the palace. Maybe I'll see him in the square!"},{"name":"HANNISHMAN04417","text":"L-Leave me be, please! I swear to you, my flesh tastes absolutely terrible!"},{"name":"HANNISHMAN04417","text":"...Oh, gods, what are you doing, scaring me like that? If we're not quiet, those beasts'll find us!"},{"name":"HANNISHMAN04417","text":"The square, you say?"},{"name":"HANNISHMAN04417","text":"But that's where the satrap was killed─with my very eyes I saw him crushed in that creature's maw! So many lives lost...such terrible carnage..."},{"name":"HANNISHMAN04417","text":"And you say there is someone else who would lead Radz–at–Han in his stead!? Whoever they are, if they say anything to sully the memory of our beloved satrap, I'll make them regret it!"},{"name":"ALPHINAUD","text":"It would seem the people still have lingering doubts...and I cannot blame them."},{"name":"ALPHINAUD","text":"Yet we know what strength is afforded us with one of the first brood on our side. I have faith the citizenry will come to understand and accept him in time."},{"name":"ALISAIE","text":"People are slowly making their way here, but many are still gripped by fear and doubt. Hopefully Vrtra's message of hope will resonate strongly enough with the ones willing to listen, and spread to every corner of Thavnair..."},{"name":"THANCRED","text":"Finished rounding up the stragglers? The proclamation will begin shortly─let's wait here, lest we miss something important."},{"name":"YSHTOLA","text":"Welcome back, <span class=\"highlight\">Forename</span>. Alphinaud told me everything."},{"name":"YSHTOLA","text":"I was pleased to hear that Vrtra has chosen to reveal himself at last. The people of Radz–at–Han need a strong and wise satrap more than ever."},{"name":"GRAHATIA","text":"I hear you were able to bring the situation at Palaka's Stand under control. Every life lost is a tragedy, but you should take pride in doing what you could."},{"name":"GRAHATIA","text":"When I assumed command during the earlier panic, I did so instinctively and out of necessity. 'Twas not my place to give orders, but I am glad the people heeded them."},{"name":"GRAHATIA","text":"But now they have need of a true leader─a magnanimous and just satrap who can guide them every step of the way. Fortunately, they are blessed with one such soul. If anyone can protect and guide them through this calamity, it is he."},{"name":"ESTINIEN","text":"Wyrm and man, working towards a common goal..."},{"name":"ALISAIE","text":"We have no better, safer course of action to offer them than fleeing to the moon. I know this. And yet, Vrtra and his people love their home. There must be something we can do..."},{"name":"THANCRED","text":"Their solution sits ill with me. But if life has taught me anything, it's that there is little to be gained from arguing with Sharlayans. We must take it upon ourselves to find a better way."},{"name":"YSHTOLA","text":"Even were Vrtra to acquiesce to their proposal, just how do the Sharlayans intend to transport the nation's entire populace to the moon?"},{"name":"GRAHATIA","text":"That soldier of the Radiant there─if I am not mistaken, he accompanied Ahewann to Vanaspati. Could it be that he knew Vrtra's identity all along...?"},{"name":"ESTINIEN","text":"Under normal circumstances, the Forum's proposal would be regarded as sheer madness. But when the sky burns, even madness can sound appealing."},{"name":"ESTINIEN","text":"Doubtless Vrtra is loath to abandon his home. And yet, absent other options, he cannot dismiss the option out of hand..."},{"name":"HANNISHROYALGUARD","text":"I have been entrusted with a message meant for you and your companions. When you are done speaking amongst yourselves, I would share it with you."},{"name":"ALPHINAUD","text":"As far as we have come─and after all the horrors we have seen─there is still so much we do not know about the Final Days."},{"name":"ALPHINAUD","text":"Could it be as Nidhana said? That the cause of this phenomenon is beyond our comprehension? And, if so...are we powerless to forestall it?"}],"reward":{"gil":1178},"reqs":{"jobs":[{"lvl":85,"id":142}],"quests":[69952]},"next":[69794,69796,69797,69798,69801,69802,69803,69954,70029]},"partials":[{"type":"npc","id":"1039068","obj":{"i":1039068,"n":"Matsya","l":3709,"q":1}},{"type":"npc","id":"1040360","obj":{"i":1040360,"n":"Alphinaud","l":3707,"q":1}},{"type":"quest","id":"69952","obj":{"i":69952,"n":"Simple Pleasures","g":11,"l":"Thavnair","s":570}},{"type":"quest","id":"69794","obj":{"i":69794,"n":"Quick Heels","g":122,"l":"Thavnair","s":2060}},{"type":"quest","id":"69796","obj":{"i":69796,"n":"Treasure Hunters","g":122,"l":"Thavnair","s":2110}},{"type":"quest","id":"69797","obj":{"i":69797,"n":"Curry for the Watch","g":122,"l":"Thavnair","s":2120}},{"type":"quest","id":"69798","obj":{"i":69798,"n":"My Friend the Yeti","g":122,"l":"Thavnair","s":2070}},{"type":"quest","id":"69801","obj":{"i":69801,"n":"A Pisaca's Purpose","g":122,"l":"Thavnair","s":2080}},{"type":"quest","id":"69802","obj":{"i":69802,"n":"Tea Foretell","g":122,"l":"Thavnair","s":2090}},{"type":"quest","id":"69803","obj":{"i":69803,"n":"Dreams of Venom","g":122,"l":"Thavnair","s":2100}},{"type":"quest","id":"69954","obj":{"i":69954,"n":"At World's End","g":11,"l":"Radz-at-Han","s":572}},{"type":"quest","id":"70029","obj":{"i":70029,"n":"What's in a Parent","g":122,"l":"Thavnair","s":2130,"f":1}}]}