{"quest":{"name":"Simple Pleasures","location":"Thavnair","id":69952,"patch":6.0,"sort":570,"eventIcon":71201,"issuer":1039058,"target":1039064,"genre":11,"journal":["Estinien stands in silence, a grim expression on his face."],"objectives":["Speak with Vrtra.","Speak with Nidhana.","Deliver the hot chai to the villagers.","Speak with Nidhana."],"dialogue":[{"name":"ALISAIE","text":"..."},{"name":"ALPHINAUD","text":"...May their souls be reunited one day. For that and so many other blessed possibilities, we must avert the Final Days."},{"name":"ESTINIEN","text":"You are ready, then?"},{"name":"ESTINIEN","text":"In that case, let's head to Palaka's Stand. No doubt Vrtra is awaiting us."},{"name":"YERUVVET","text":"First hordes of beasts, now a mighty wyrm... Our world grows stranger by the day..."},{"name":"VRITRA","text":"Rest easy, for all is well here."},{"name":"VRITRA","text":"Young Matsya returned with the babe safe in his arms. Owing to a warm bed, the girl hath already begun to regain her strength."},{"name":"VRITRA","text":"Less joyously received was word of the mother and father's fate, as well as that of their transformed neighbors..."},{"name":"VRITRA","text":"How many children of Thavnair must we lose to this calamity?"},{"name":"VRITRA","text":"Mothers and fathers, brothers and sisters, sons and daughters... Every death another void that can never be filled..."},{"name":"VRITRA","text":"We who survive them must carry the weight of their memory, as we strive to regain a semblance of what we have lost."},{"name":"VRITRA","text":"Qerasaf and Mehvan's babe is a child of Thavnair as well. I thank you for returning her to us safe."},{"name":"YERUVVET","text":"O, most great and merciful wyrm... I have not the words to express my gratitude..."},{"name":"YERUVVET","text":"They say that were it not for you...brave Matsya and the child would have been lost to us forever."},{"name":"YERUVVET","text":"Long had I heard the rumors that a mighty dragon had forged a pact of friendship with the satrap, but never would I have expected such a kind and gentle soul."},{"name":"VRITRA","text":"Truth in part...but not in whole."},{"name":"VRITRA","text":"I am Vrtra, and for years uncounted hath this isle served as mine abode."},{"name":"VRITRA","text":"...An isle I have ruled over as satrap, with Ahewann as my loyal servant."},{"name":"NIDHANA","text":"(-???-)Are my ears to be believed!? <span class=\"emphasis\">You</span> were the true satrap all along!?"},{"name":"ALISAIE","text":"Nidhana!? What are you doing here?"},{"name":"NIDHANA","text":"I heard from the Radiant that you had gone to help the people of Palaka's Stand in their time of need."},{"name":"NIDHANA","text":"And so I and several of my colleagues from the Great Work came to offer our services."},{"name":"MATSYA","text":"The alchemists have already brewed up some potions for Mehvan's daughter!"},{"name":"NIDHANA","text":"But enough about us─<span class=\"emphasis\">you</span> and your role are the far greater enigma!"},{"name":"NIDHANA","text":"If you were the true satrap all along, could it be that young Varshahn was...<span class=\"emphasis\">created</span>...to serve as your emissary?"},{"name":"VRITRA","text":"Thou didst suspect the boy was but a simulacrum?"},{"name":"NIDHANA","text":"A rumor has circulated for many years around the High Crucible that our most skilled alchemists were once commissioned by the satrap's family in secret to fashion a mammet indistinguishable from a living boy."},{"name":"NIDHANA","text":"Looking at Varshahn with that knowledge...I simply put two and two together."},{"name":"NIDHANA","text":"I was not alone in drawing this conclusion. But like me, they no doubt recognized that the satrap was using the simulacrum to work more closely with his people, and decided not to press the issue."},{"name":"NIDHANA","text":"I had always assumed one of Ahewann's associates was manipulating it from afar─though the truth is indeed far more surprising!"},{"name":"NIDHANA","text":"It is an honor to meet you in the flesh, Master Vrtra. Pray allow me to express my gratitude."},{"name":"NIDHANA","text":"If you had not believed in and given unto us your scales, I do not know where we would be. Thank you...from the bottom of my heart."},{"name":"VRITRA","text":"'Twas thou and thy fellow alchemists that fashioned the means to unmake the towers. You were the saviors not only of Radz–at–Han, but the star."},{"name":"NIDHANA","text":"Far too kind you are, Master Vrtra...but the star yet wants for salvation. Once more will my colleagues and I commit the knowledge and resources at our disposal to the mission of aiding the people, in this their darkest hour."},{"name":"VRITRA","text":"'Twould seem this place is in good hands. I would return to see how Radz–at–Han fares. What will you do, Scions?"},{"name":"ALPHINAUD","text":"I worry for the survivors we met at Purusa. Shall we pay them a visit before making our way back?"},{"name":"NIDHANA","text":"In that case, might I ask a favor? Nothing too burdensome, I promise. This way!"},{"name":"ALPHINAUD","text":"Curious, isn't it? The burning sky is so ominous, yet the crackling flames here are somehow...calming."},{"name":"ALISAIE","text":"What a lovely aroma... I wonder what sort of spices those are?"},{"name":"ESTINIEN","text":"Vrtra chose to reveal his identity to the villagers of Palaka's Stand before all others. A wise choice, considering the warm reception. Heh, he even seemed a little relieved..."},{"name":"ESTINIEN","text":"It remains to be seen how the people of Radz–at–Han will take the news, but if this was any indication, he need not worry."},{"name":"MATSYA","text":"Oh, <span class=\"highlight\">Forename</span>! Running through that dark jungle, there was a time when I thought all was lost! Had Master Vrtra and Estinien not arrived when they did..."},{"name":"MATSYA","text":"...No. I must focus on the good. Mehvan's precious daughter is safe and sound, and that is all that matters."},{"name":"NIDHANA","text":"Needs to simmer just a bit longer, I'd say..."},{"name":"NIDHANA","text":"In the meantime, I was hoping I might ask you a few questions. The red sky, these terrible beasts... What in the name of the Sisters is happening here in Thavnair?"},{"name":"NIDHANA","text":"Oh my, that's rather a lot to take in..."},{"name":"NIDHANA","text":"...It would seem the situation is even more grave than we suspected. Thank you, friend. My colleagues and I will use your knowledge to see if it can further our own research."},{"name":"NIDHANA","text":"...And with that, here we are! A pot of piping hot chai, brewed from my own secret recipe of spices and tea leaves, together with hearty helpings of rich milk and purest sugar!"},{"name":"NIDHANA","text":"I've made enough for everyone in the village. Might I trouble you to deliver a few cups?"},{"name":"ALPHINAUD","text":"The drink has medicinal properties, then?"},{"name":"NIDHANA","text":"Not in the least! The ingredients are quite ordinary. It's so very tasty, though, and has a way of lifting the spirits."},{"name":"NIDHANA","text":"The spicy aroma and distinctive sweetness of chai is a simple, everyday pleasure on our island. Sometimes the best medicine is the simplest."},{"name":"ALPHINAUD","text":"A lovely sentiment, Nidhana. By all means, allow us to assist."},{"name":"ESTINIEN","text":"While you lot distribute hot beverages, I'll do a sweep for errant beasts to slay─a far less arduous task, no doubt. When you've finished, look for me at the Wakeful Torana."},{"name":"ALPHINAUD","text":"I heard that the survivors we met at the temple have all returned safely. The crisis may not have passed, but being home and among friends should do much to ease their spirits."},{"name":"ALISAIE","text":"The aroma of that chai truly is irresistible... Do you suppose Nidhana would mind if I helped myself to a cup?"},{"name":"NIDHANA","text":"I would be most obliged if you could deliver a few cups of chai to the villagers. I am certain it will do much to soothe their aching bodies and heavy hearts."},{"name":"TIREDMAN04416","text":"Hm...? Wait. I know you. You were the one who saved us from those beasts back at the temple..."},{"name":"TIREDMAN04416","text":"Were it not for you─well, let's not even think about that. At times like this, we mustn't dwell on what might've been, but look to the future..."},{"name":"TIREDMAN04416","text":"But what future awaits us? How can Radz–at–Han hope to recover from this? Most of my friends are gone, and I don't know where to turn..."},{"name":"TIREDMAN04416","text":"A cup of chai? Well, if you insist..."},{"name":"TIREDMAN04416","text":"Ahhh...that aroma has a way of clearing the mind... Come to think of it, we've faced our fair share of trials in the past as well. And no matter how hard the times, we've always come together as a people united."},{"name":"TIREDMAN04416","text":"One day at a time, one step at a time─for that is all any of us can do. Yes... Back to work. Once I've finished this cup. Thank you."},{"name":"TIREDMAN04416","text":"First order of business is securing food and shelter. We also must contact our friends in the city and see how they fare. Hah, no rest for the weary!"},{"name":"NAHBSHAYRA","text":"Look at them all, lazing about! Knowing full well the beasts might strike again at any moment! Do they not realize their lives are in danger!?"},{"name":"NAHBSHAYRA","text":"Well, I, for one, intend to survive! I'm too young to die! Yes, I'll leave this island behind if I must!"},{"name":"NAHBSHAYRA","text":"But...but where would I go? Is anywhere safe these days!?"},{"name":"NAHBSHAYRA","text":"A cup of chai? Can't you see I have more important things to worry about!?"},{"name":"NAHBSHAYRA","text":"No...no, you're right. It is precisely in times like these that we must strive to remain calm and steady."},{"name":"NAHBSHAYRA","text":"I do believe I'll visit the elder and see what needs to be done. If there is any way I can aid my village and my friends, I will do it."},{"name":"NAHBSHAYRA","text":"Ahhh...how the warmth of the chai spreads through all my limbs... I can't remember the last time I've breathed so easily."},{"name":"VISHRYDE","text":"I'm sorry, I... I just want to be left alone..."},{"name":"VISHRYDE","text":"My best friend and I...we fled the village together... One of the beasts took him, and...and..."},{"name":"VISHRYDE","text":"It was all I could do to run. All the while...I could hear this monstrous voice screaming my name..."},{"name":"VISHRYDE","text":"Hmm? This is for me...?"},{"name":"VISHRYDE","text":"Ahh... We used to drink chai together often. Shared stories over steaming cups after a hard day's work."},{"name":"VISHRYDE","text":"Thank you, friend. The pain may never pass, but I must press on all the same. For his memory, and for we who must remember..."},{"name":"VISHRYDE","text":"Many thanks for the chai. It helps me to remember him as he was, cup in hand and a smile on his lips..."},{"name":"NIDHANA","text":"Thank you for delivering the chai, <span class=\"highlight\">Forename</span>. Did it help to lift the villagers' spirits?"},{"name":"NIDHANA","text":"That is heartening to hear, indeed! The Final Days show no signs of abating, but that is all the more reason that we must try to keep our composure."},{"name":"NIDHANA","text":"Our lives have been forever changed. The people we have lost will never return to us. These tragedies will long weigh on our hearts..."},{"name":"NIDHANA","text":"But we have the capacity to live with our suffering. To carry the agony till we too join the fallen in death."},{"name":"NIDHANA","text":"It is not a surrender, but a recognition. For it is only in acceptance that we find the strength to move forward."}],"reward":{"gil":886,"aetherCurrent":1,"items":[{"num":2,"id":36060}]},"reqs":{"jobs":[{"lvl":85,"id":142}],"quests":[69951]},"next":[69792,69793,69795,69799,69800,69804,69953]},"partials":[{"type":"npc","id":"1039058","obj":{"i":1039058,"n":"Estinien","l":3709,"q":1}},{"type":"npc","id":"1039064","obj":{"i":1039064,"n":"Nidhana","l":3709,"q":1}},{"type":"item","id":"36060","obj":{"i":36060,"n":"Tsai tou Vounou","l":554,"c":24417,"t":46}},{"type":"quest","id":"69951","obj":{"i":69951,"n":"Warm Hearts, Rekindled Hopes","g":11,"l":"Thavnair","s":569}},{"type":"quest","id":"69792","obj":{"i":69792,"n":"The Guardian's Shield","g":122,"l":"Thavnair","s":2001}},{"type":"quest","id":"69793","obj":{"i":69793,"n":"In Agama's Footsteps","g":122,"l":"Thavnair","s":2010,"f":1}},{"type":"quest","id":"69795","obj":{"i":69795,"n":"Radiant Patrol","g":122,"l":"Thavnair","s":2020,"f":1}},{"type":"quest","id":"69799","obj":{"i":69799,"n":"Flowers for the Family","g":122,"l":"Thavnair","s":2030}},{"type":"quest","id":"69800","obj":{"i":69800,"n":"My Father My Fisher","g":122,"l":"Thavnair","s":2040}},{"type":"quest","id":"69804","obj":{"i":69804,"n":"An Unexpected Guide","g":122,"l":"Thavnair","s":2050}},{"type":"quest","id":"69953","obj":{"i":69953,"n":"Under His Wing","g":11,"l":"Thavnair","s":571}}]}