{"quest":{"name":"Ponder, Warrant, Cherish, Welcome","location":"Elpis","id":69959,"patch":6.0,"sort":577,"eventIcon":71201,"issuer":1040014,"target":1040027,"genre":11,"journal":["Having found the wayward ambystoma, Hermes is the picture of relief."],"objectives":["Speak with Hermes.","Speak with Emet-Selch.","Speak with Meteion.","Speak with Meteion and have her accompany you.","Speak with Memnon while accompanied by Meteion.","Search for idle creations while accompanied by Meteion.","Speak with Euanthe while accompanied by Meteion.","Speak with Hermes while accompanied by Meteion."],"dialogue":[{"name":"EMETSELCH","text":"The tenet of the Words of Mitron is to create aquatic life both unique and beneficial. <span class=\"emphasis\">Aquatic</span>."},{"name":"EMETSELCH","text":"What would possess them to put this creature in the sky? And is it even aquatic to begin with...?"},{"name":"HYTHLODAEUS","text":"The ambystoma was submitted to the bureau not long ago, and I'm pleased to see it has found its way here."},{"name":"HYTHLODAEUS","text":"We'll make sure these little ones don't wander off like their adventurous fellow. Go on and lend Hermes a hand."},{"name":"METEION","text":"I'm glad they're safe! Hermes and the ambystoma!"},{"name":"SYSTEM","text":"The ambystoma stares at you unflinchingly, as if regarding something novel."},{"name":"SYSTEM","text":"Regarding it in turn, you notice that it appears to be floating, if ever so slightly."},{"name":"HERMES","text":"Well, we mustn't keep the others waiting. Let us return to Anagnorisis."},{"name":"EMETSELCH","text":"No more errant creations to distract us from matters of actual import, I trust."},{"name":"HYTHLODAEUS","text":"'Twas blissfully uneventful in your absence. The little ones were on their best behavior."},{"name":"METEION","text":"Some creations stay outside. Others stay at Ktisis. Like the ambystomas!"},{"name":"SYSTEM","text":"Perhaps it's only your imagination, but something in the creature's demeanor bespeaks proud defiance for having gone on an adventure."},{"name":"HERMES","text":"My apologies for the trouble. Owing to your kind assistance, all the ambystomas are safe and well."},{"name":"HERMES","text":"I will presently send them back to their space, if you would go on ahead to the main building."},{"name":"HERMES","text":"Upon entering, you will see a table and chairs─a meeting area. We may speak there."},{"name":"EMETSELCH","text":"Very well. Take care not to let the creatures slip away again."},{"name":"HERMES","text":"Will you be attending as well? If so, you should join the others at the building."},{"name":"HYTHLODAEUS","text":"While Emet-Selch has been accommodating thus far, he is the one who has business with Hermes. If you wish to attend, you will have to ask his permission."},{"name":"EMETSELCH","text":"Most would jump at the chance to serve in the Convocation. And yet..."},{"name":"HYTHLODAEUS","text":"Don't mind us, my friend. Please tend to Meteion."},{"name":"HERMES","text":"Forgive me. I will make it up to you, I promise."},{"name":"METEION","text":"I'm sorry, <span class=\"highlight\">Forename</span>... I didn't want─ Didn't mean─ &lt;sigh&gt;"},{"name":"METEION","text":"...A walk. Perhaps we can go for a walk?"},{"name":"METEION","text":"Hermes gets sad. When he thinks about death."},{"name":"METEION","text":"When others are sad, I'm sad too. That's how I am. How he made me."},{"name":"METEION","text":"But don't worry. I'm fine now."},{"name":"METEION","text":"So...why did you come here?"},{"name":"METEION","text":"You want to learn about Elpis and Hermes? Ooh, ooh, teach you! I can teach you!"},{"name":"METEION","text":"We could take turns! I tell you something...then you tell me something!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Sounds like fun!"},{"name":"A1","text":"Sure, why not."},{"name":"A1","text":"Sounds like a bother..."},{"name":"METEION","text":"It will be! It will be!"},{"name":"METEION","text":"Then it's settled!"},{"name":"METEION","text":"Awww... I won't be a bother. So please, <span class=\"highlight\">Forename</span>. Please!"},{"name":"METEION","text":"Hehe, you won't regret it! I'll teach you lots and lots of things!"},{"name":"METEION","text":"Um, where to start... Ah, yes! Let's talk to Memnon. He should be near the aetheryte."},{"name":"METEION","text":"I'm not good at explaining, but Memnon is. So I'll have him explain instead."},{"name":"SYSTEM","text":"Meteion is now accompanying you. Keep her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Meteion behind by entering a different area, or by speaking with her and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Meteion accompany you again, return and speak with her at the original location."},{"name":"Q2","text":"What will you do?"},{"name":"A2","text":"Talk."},{"name":"A2","text":"Part ways."},{"name":"A2","text":"Nothing."},{"name":"A2","text":"<span class=\"highlight\">Discuss the aetheryte.</span>"},{"name":"METEION","text":"Let's go and talk to Memnon. He should be near the aetheryte."},{"name":"Q3","text":"Are you sure you wish to part ways with Meteion?"},{"name":"METEION","text":"Oh, are you busy? Then I'll wait at the building."},{"name":"METEION","text":"Ah, you're back! Let's go, let's go!"},{"name":"SYSTEM","text":"Meteion has yet to arrive. Be sure she is at your side before attempting to continue."},{"name":"METEION","text":"Ah, the aetheryte. Anyone can use it to teleport anywhere!"},{"name":"METEION","text":"Well, maybe not anywhere. Not to the ground or other isles."},{"name":"METEION","text":"For that, you need teleporters. Oh, and permission!"},{"name":"MEMNON","text":"And what have we here...?"},{"name":"SYSTEM","text":"You should have Meteion accompanying you before initiating conversation."},{"name":"MEMNON","text":"And what have we here...?"},{"name":"MEMNON","text":"Though you look like a person, <span class=\"alternative-container\"><span class=\"alternative\">your aether is quite thin</span><span class=\"alternative\">you could as easily pass for a toy</span><span class=\"alternative\">you have the ears and tail of a beast</span><span class=\"alternative\">you have a remarkably large and robust physique</span><span class=\"alternative\">you have the horns and scales of a beast</span><span class=\"alternative\">you have the features of a beast</span><span class=\"alternative\">you have the ears of a beast</span></span>... I assume you are a familiar like Meteion. Is there something you need?"},{"name":"METEION","text":"This is <span class=\"highlight\">Forename</span>. Could you teach <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> about Elpis?"},{"name":"MEMNON","text":"Ah, a newly arrived familiar, is <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>? Very well, I should be glad to introduce our fair facility to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"MEMNON","text":"As you know, it is mankind's duty to make the star a better place. As part of this duty, we employ creation magicks to bring forth new life."},{"name":"MEMNON","text":"However, we cannot simply release our works into the world, for it would lead to chaos."},{"name":"MEMNON","text":"No, any and all life-forms must undergo extensive testing to determine their fitness to exist. Testing which is conducted here in Elpis."},{"name":"MEMNON","text":"Every candidate is subjected to rigorous study, in which we identify their properties, surmise what habitats might be suitable, and speculate as to the effects they may have on the environment and other species."},{"name":"MEMNON","text":"Should it be judged a beneficial addition to the star, it will be allowed to take its place in the world."},{"name":"MEMNON","text":"The two of you, too, were created with the hope of making the star a better place. So heed your masters well and be good, do you hear?"},{"name":"METEION","text":"We will, Memnon, we will. Thanks for the lesson!"},{"name":"METEION","text":"You had a turn. Now I get a turn!"},{"name":"METEION","text":"Where did you come from?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"From a place far, far away."},{"name":"A4","text":"From a place facing a great threat."},{"name":"A4","text":"From the Crystarium...I guess?"},{"name":"METEION","text":"Hmmm, then I probably don't know it. I don't know much about other places."},{"name":"METEION","text":"Th-There's such a place? I had no idea..."},{"name":"METEION","text":"Crys...tarium? I've never heard of it."},{"name":"METEION","text":"But this place is important to you. I can feel it."},{"name":"METEION","text":"Oh, my power! I haven't told you about it."},{"name":"METEION","text":"A creation. Let's find a creation. One not being watched. Then I'll explain my power!"},{"name":"A5","text":"<span class=\"highlight\">Discuss the spriggans.</span>"},{"name":"METEION","text":"Let's find a creation. One not being watched. Then I'll explain my power!"},{"name":"METEION","text":"...Spriggans? What are spriggans?"},{"name":"METEION","text":"Oh no, we call them oreiai. If there's many. If it's just one, we say oreias!"},{"name":"METEION","text":"Though they're cute, they can be naughty."},{"name":"METEION","text":"Sometimes, they run off with concept crystals. And Hermes has to run after them!"},{"name":"MEMNON","text":"The desire to learn is a good thing. I wish you well in your endeavors, my dear familiar."},{"name":"BALAENICEPSREX","text":"..."},{"name":"METEION","text":"Oh! This creation is perfect!"},{"name":"METEION","text":"But...I don't remember seeing it before. Perhaps it's new?"},{"name":"METEION","text":"Anyway, I'll try reading its mind. That's my power!"},{"name":"METEION","text":"Hmmm... I can't read it. Or maybe...there's nothing to read?"},{"name":"METEION","text":"Wait... Please, wait... I'll try again. With you this time..."},{"name":"METEION","text":"Greetings! Can you hear me?"},{"name":"METEION","text":"This is my power. I can read the emotions of those around me, and project my emotions to others in return."},{"name":"METEION","text":"I am not actually speaking to you in your mind. Rather, you are converting my emotions into words and intention─a process performed subconsciously by intelligent life-forms."},{"name":"METEION","text":"This ability is vital to my mission, for it allows me to interact with intelligent beings even should they communicate via unknown languages or other nonverbal means."},{"name":"METEION","text":"As a consequence, I am clumsy at speaking..."},{"name":"METEION","text":"Yet though I struggle to express myself in this fashion, Hermes wants me to speak as much as possible, for everyone has thoughts and feelings that they may wish to hide..."},{"name":"METEION","text":"I harbor an affection for you. One that is difficult to define."},{"name":"METEION","text":"Aside from the fact that you share common traits with us, your thoughts are complex. Prismatic. They draw me in, and leave me wanting to know more."},{"name":"METEION","text":"Out of respect for your privacy, I will refrain from using my power when speaking with you. Nevertheless, I want you to know that I wish to be your friend."},{"name":"METEION","text":"Did you...hear me?"},{"name":"METEION","text":"Heh heh, good! Now it's my turn again! So...what are you good at?"},{"name":"Q6","text":"What will you say?"},{"name":"A6","text":"Fighting."},{"name":"A6","text":"Crafting."},{"name":"A6","text":"Gathering."},{"name":"A6","text":"Playing."},{"name":"A6","text":"It's a secret!"},{"name":"METEION","text":"Ooh, fighting! That must mean you're strong!"},{"name":"METEION","text":"Hermes is strong too. But he doesn't like to fight. Even when creations fight him."},{"name":"METEION","text":"Oh, not creating...but crafting? Putting things together with your hands..."},{"name":"METEION","text":"That sounds like fun! I can't use creation magicks. But maybe I can learn to craft!"},{"name":"METEION","text":"Ooh, gathering! I like gathering too!"},{"name":"METEION","text":"What do you gather? Where do you go? How do you get there? Do you fly too!?"},{"name":"METEION","text":"Playing? I'm still not sure what that means..."},{"name":"METEION","text":"Hermes says, “Let's play.” But then he goes for a walk. Or looks at creations. It's fun, but no different from work."},{"name":"METEION","text":"Ooh, a secret! That's something you want to hide! Just leave it to me..."},{"name":"METEION","text":"There! I've blocked it out. I can't block everything─not strong feelings. But that wasn't too strong."},{"name":"METEION","text":"I-I think we might be bothering it..."},{"name":"METEION","text":"Let's keep going. We'll go and see Euanthe next. She's usually in a small building. One on the west row."},{"name":"METEION","text":"Let's go and see Euanthe. She's usually in a small building. One on the west row."},{"name":"BALAENICEPSREX","text":"..."},{"name":"EUANTHE","text":"Well now, I don't believe I've seen you before."},{"name":"EUANTHE","text":"Well, well, if it isn't Meteion. I see you've brought a friend today."},{"name":"METEION","text":"Greetings, Euanthe! Um, an apple. Could you make me an apple?"},{"name":"METEION","text":"The kind Hermes likes. Covered in syrup. I want to share it with <span class=\"highlight\">Forename</span>!"},{"name":"EUANTHE","text":"Oh, candied apple? Hermes is certainly partial to them, but you know you can't eat, Meteion. You weren't made to do so."},{"name":"METEION","text":"B-But I like it too..."},{"name":"EUANTHE","text":"It may seem that way, but it's due to your ability to share others' feelings. You've taken Hermes's likes for your own."},{"name":"EUANTHE","text":"In any case, I can't prepare an apple right now, but I'll bring one for Hermes soon. I promise."},{"name":"METEION","text":"I'm sorry, <span class=\"highlight\">Forename</span>... I wanted to show you my favorite thing. Then I could ask about yours. But I failed..."},{"name":"Q7","text":"What will you do?"},{"name":"A7","text":"Tell her what you like."},{"name":"A7","text":"Say nothing."},{"name":"METEION","text":"Ooh, that's what you like? Yes... Yes, I can feel it! Your joy and happiness!"},{"name":"METEION","text":"And it makes me happy too! Thanks for sharing it with me, <span class=\"highlight\">Forename</span>!"},{"name":"METEION","text":"Well, we've walked and talked a lot. Maybe Hermes has finished talking too. Shall we go and see?"},{"name":"METEION","text":"Well, we've walked and talked a lot. Maybe Hermes has finished talking too. Shall we go and see?"},{"name":"METEION","text":"I hope Hermes isn't sad anymore..."},{"name":"EUANTHE","text":"Between you and me, Hermes's eating habits are atrocious. We may not be reliant upon food to the extent that our smaller creations are, but our diets eventually catch up with us."},{"name":"EUANTHE","text":"If we don't consume the requisite balance of nutrients, we grow weak and lethargic. Yet Hermes consumes candied apples as if they were a staple..."},{"name":"EMETSELCH","text":"What, back already? Pity. A bit longer and we might have snuck away without you..."},{"name":"HYTHLODAEUS","text":"Ah, excellent timing. 'Twas a refreshing constitutional, I hope?"},{"name":"HERMES","text":"Is Meteion still outside?"},{"name":"HERMES","text":"There you are. I can see the fresh air has done Meteion good."},{"name":"METEION","text":"<span class=\"highlight\">Forename</span> wanted to learn about you and Elpis. So I taught <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>!"},{"name":"METEION","text":"About this place. About my power. About your favorite food!"},{"name":"HERMES","text":"I'm not sure if that last one will be of any use..."},{"name":"HERMES","text":"But I do appreciate your keeping Meteion company. While you were away, I finished speaking with our guests."},{"name":"EMETSELCH","text":"Finished? Hardly. You requested time to consider the invitation, so we have no choice but to occupy ourselves with an inspection of your work."},{"name":"HERMES","text":"My apologies..."},{"name":"HERMES","text":"It has been decided that Emet-Selch and Hythlodaeus will accompany me as I tend to my duties."},{"name":"HERMES","text":"If you wish to learn more, perhaps you would like to come too?"},{"name":"EMETSELCH","text":"I'm compelled to remind you that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is in no way associated with the Convocation. We simply chanced to meet at Propylaion."},{"name":"EMETSELCH","text":"There is no guarantee that the matters we discuss will remain private."},{"name":"HERMES","text":"I do not mind. To see the joy <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> presence brings Meteion, I cannot imagine our mysterious friend harbors malicious intent."},{"name":"METEION","text":"<span class=\"highlight\">Forename</span> is kind. Really, truly! <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> taught me as much as I taught <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>!"},{"name":"METEION","text":"You're coming, of course? To watch Hermes? You're bound to learn lots and lots!"}],"reward":{"gil":1564,"items":[{"id":35698}]},"reqs":{"jobs":[{"lvl":86,"id":142}],"quests":[69958]},"next":[69812,69813,69814,69816,69817,69818,69819,69960]},"partials":[{"type":"npc","id":"1040014","obj":{"i":1040014,"n":"Hermes","l":3713,"q":1}},{"type":"npc","id":"1040027","obj":{"i":1040027,"n":"Hermes","l":3713,"q":2}},{"type":"item","id":"35698","obj":{"i":35698,"n":"Ironwood Chest Gear Coffer (IL 539)","l":1,"c":26559,"t":61}},{"type":"quest","id":"69958","obj":{"i":69958,"n":"In Search of Hermes","g":11,"l":"Elpis","s":576}},{"type":"quest","id":"69812","obj":{"i":69812,"n":"The Ore the Merrier","g":125,"l":"Elpis","s":3101}},{"type":"quest","id":"69813","obj":{"i":69813,"n":"A Colorful Concept","g":125,"l":"Elpis","s":3110}},{"type":"quest","id":"69814","obj":{"i":69814,"n":"Digestive Problems","g":125,"l":"Elpis","s":3120}},{"type":"quest","id":"69816","obj":{"i":69816,"n":"Sweet Temptations","g":125,"l":"Elpis","s":3140}},{"type":"quest","id":"69817","obj":{"i":69817,"n":"Breaking the Eyes","g":125,"l":"Elpis","s":3150}},{"type":"quest","id":"69818","obj":{"i":69818,"n":"Kick Some Asp","g":125,"l":"Elpis","s":3160}},{"type":"quest","id":"69819","obj":{"i":69819,"n":"Clutch Devastation","g":125,"l":"Elpis","s":3170}},{"type":"quest","id":"69960","obj":{"i":69960,"n":"Lives Apart","g":11,"l":"Elpis","s":578}}]}