{"quest":{"name":"At World's End","location":"Radz-at-Han","id":69954,"patch":6.0,"sort":572,"eventIcon":71201,"issuer":1040372,"target":1040382,"genre":11,"journal":["The Radiant Host soldier has a message for the Scions of the Seventh Dawn."],"objectives":["Speak with the Radiant Host soldier.","Speak with the Radiant Host soldier again.","Speak with the Radiant Host soldier.","Speak with the Radiant Host soldier again.","Speak with Mihleel.","Speak with Y'shtola.","Speak with Thancred."],"dialogue":[{"name":"ALPHINAUD","text":"No matter what my father and the Forum say, giving up and abandoning this place cannot be our only recourse!"},{"name":"ALISAIE","text":"We have no better, safer course of action to offer them than fleeing to the moon. I know this. And yet, Vrtra and his people love their home. There must be something we can do..."},{"name":"THANCRED","text":"Their solution sits ill with me. But if life has taught me anything, it's that there is little to be gained from arguing with Sharlayans. We must take it upon ourselves to find a better way."},{"name":"YSHTOLA","text":"Even were Vrtra to acquiesce to their proposal, just how do the Sharlayans intend to transport the nation's entire populace to the moon?"},{"name":"GRAHATIA","text":"That soldier of the Radiant there─if I am not mistaken, he accompanied Ahewann to Vanaspati. Could it be that he knew Vrtra's identity all along...?"},{"name":"ESTINIEN","text":"Under normal circumstances, the Forum's proposal would be regarded as sheer madness. But when the sky burns, even madness can sound appealing."},{"name":"ESTINIEN","text":"Doubtless Vrtra is loath to abandon his home. And yet, absent other options, he cannot dismiss the option out of hand..."},{"name":"HANNISHROYALGUARD","text":"Greetings, honored Scions of the Seventh Dawn. I have a message from His Excellency the satrap."},{"name":"HANNISHROYALGUARD","text":"“Brave Scions. You have my gratitude for aiding my people in this most trying of times."},{"name":"HANNISHROYALGUARD","text":"“Alas, matters here at Meghaduta prevent me from meeting you all in person."},{"name":"HANNISHROYALGUARD","text":"“As a token of mine appreciation, I have arranged for a feast to be held in your honor. May it nourish you in preparation for the trials ahead.”"},{"name":"HANNISHROYALGUARD","text":"...Such are the words of Master Vrtra. The feast he speaks of awaits you at Mehryde's Meyhane. Pray make your way there whenever your business here is done."},{"name":"ALPHINAUD","text":"We thank you for your kindness. Indeed, I was hoping we might find a place to discuss our next course of action, and that seems an ideal venue."},{"name":"HANNISHROYALGUARD","text":"Ah, and to you, <span class=\"highlight\">Forename Surname</span>. There is someone we had hoped to introduce to you in particular."},{"name":"HANNISHROYALGUARD","text":"While I am loath to detain you further, might you spare a moment of your time?"},{"name":"ALISAIE","text":"A personal invitation, knowing full well your services are in the highest demand right now? This must be important. Worry not─we'll save some food for you, so take all the time you need."},{"name":"HANNISHROYALGUARD","text":"Thank you, friend. Whenever you are ready, please join me in the aetheryte plaza. I shall go on ahead."},{"name":"HANNISHROYALGUARD","text":"Access to the aetheryte you see there has been restricted to a select few ever since the tower first appeared."},{"name":"HANNISHROYALGUARD","text":"We sincerely apologize for the inconvenience, but it was deemed too dangerous to permit the free movement of visitors at a time of emergency─a risk we could not take."},{"name":"HANNISHROYALGUARD","text":"In light of recent developments, however, the satrap has decided that such restrictions would only hinder our efforts to combat the Final Days."},{"name":"HANNISHROYALGUARD","text":"As such, I would encourage you to attune with the aetheryte before proceeding along the corridor."},{"name":"HANNISHROYALGUARD","text":"Ah, you must be wondering what this place is."},{"name":"HANNISHROYALGUARD","text":"You stand in the Hall of the Radiant Host, from where our leadership oversees all of Radz–at–Han's military operations."},{"name":"HANNISHROYALGUARD","text":"Sundrop, our destination, lies just ahead."},{"name":"SHIRABAHT","text":"Ah, so <span class=\"emphasis\">you're</span> the one I've heard so much about?"},{"name":"RESIDENTOFFICER","text":"Wait, I know you! Ah, but forgive me. Idle chatter can wait."},{"name":"LIMSARESIDENTOFFICIAL","text":"<span class=\"highlight\">Forename</span>! We've been waiting for you!"},{"name":"ULDAHMILITARYATTACHE","text":"Well, look who we have here! Word of your deeds in Radz–at–Han has reached the sultanate, so you know."},{"name":"ALAMHIGOMILITARYATTACHE","text":"The liberator of Ala Mhigo is always a welcome sight. If I can be of service in any way, just ask."},{"name":"ISHGARDRESIDENTOFFICER","text":"...Hm? Ah, sorry...I was─ Oh, <span class=\"highlight\">Forename Surname</span>! Ishgard remembers, let there be no doubt. The Fury favors us this day, that we may stand in the presence of a true hero."},{"name":"DOMANRESIDENTOFFICER","text":"To think I would meet Doma's savior here, in this distant land..."},{"name":"HANNISHROYALGUARD","text":"Welcome to Sundrop. Without further ado, allow me to introduce you to─"},{"name":"SHIRABAHT","text":"Oho! So you're the famous <span class=\"highlight\">Forename Surname</span>, eh? I knew it the moment you stepped through the door! You've the look of one who's walked through hell!"},{"name":"HANNISHROYALGUARD","text":"Shirabaht, please! You are speaking to the satrap's honored guest and a savior of our people. Can you not show a modicum of respect? "},{"name":"SHIRABAHT","text":"What disrespect is there in paying a fellow warrior a compliment? We're all friends here, or will be soon enough."},{"name":"SHIRABAHT","text":"More formally, then, for the benefit of my countryman. It is a pleasure to have you with us, O great champion of Eorzea, Scion of the Seventh Dawn, Warrior of Light, and all-round good egg, I'm sure."},{"name":"Q1","text":"What will you ask?"},{"name":"A1","text":"What is this place?"},{"name":"A1","text":"Who are you?"},{"name":"A1","text":"This talk of eggs reminds me I'm late for dinner..."},{"name":"SHIRABAHT","text":"I hear you've been to Kugane, where you'll have seen all sorts of foreign embassies and whatnot."},{"name":"SHIRABAHT","text":"Well, we've got them here in Radz–at–Han, too. Other lands send delegates to oversee trade and diplomatic dealings. Then there are military matters to discuss, which is why all these officers are stationed here in Sundrop."},{"name":"SHIRABAHT","text":"A fool with too many scars and knees that ache in the winter! The name's Shirabaht, and I attend to business here. As for what sort of business, how can I put it...?"},{"name":"SHIRABAHT","text":"Radz–at–Han welcomes delegates from other lands to oversee trade and diplomatic dealings. Then there are military matters to discuss, which is why all these officers are stationed here in Sundrop."},{"name":"SHIRABAHT","text":"Bahahaha! A <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> after my own heart! I like that!"},{"name":"SHIRABAHT","text":"Don't you worry─I'll keep it short. There's just a thing or two we'd like you to remember. First of all, about the room you're standing in now..."},{"name":"SHIRABAHT","text":"Radz–at–Han welcomes delegates from other lands to oversee trade and diplomatic dealings. Then there are military matters to discuss, which is why all these officers are stationed here in Sundrop."},{"name":"SHIRABAHT","text":"I imagine you're more than familiar with each of the nations they represent, yes?"},{"name":"SHIRABAHT","text":"We've got representatives from Doma..."},{"name":"SHIRABAHT","text":"Ul'dah and Ala Mhigo..."},{"name":"SHIRABAHT","text":"Limsa Lominsa..."},{"name":"SHIRABAHT","text":"Gridania..."},{"name":"SHIRABAHT","text":"And last─but never let it be said least─Ishgard. They're the eyes, ears, and mouths that bridge the distance between Radz–at–Han and their respective homelands."},{"name":"SHIRABAHT","text":"We've used this brief respite to share the details of our plight with our overseas counterparts."},{"name":"SHIRABAHT","text":"And wouldn't you know it, all of their leaders requested a few words from you specifically. You're a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> in high demand, eh?"},{"name":"SHIRABAHT","text":"And so, would you mind regaling us with your own account? Indulge us before you indulge yourself."},{"name":"LIMSARESIDENTOFFICIAL","text":"I thank you for the report. The conditions under which men are turned to beasts, the aetheric anomalies you have observed...you have given us much to consider."},{"name":"LIMSARESIDENTOFFICIAL","text":"It is concerning that the first transformation apparently occurred before the skies turned red. 'Tis contrary to what one would expect..."},{"name":"ISHGARDRESIDENTOFFICER","text":"Thankfully, the information you conveyed to Lucia upon your return from the moon has already proved invaluable."},{"name":"ISHGARDRESIDENTOFFICER","text":"As soon as reports of the calamity here in Thavnair reached the Grand Company of Eorzea and our Far Eastern allies, our leaders knew at once that the Final Days were indeed upon us. They began taking steps to assess the extent of the phenomenon's spread."},{"name":"ISHGARDRESIDENTOFFICER","text":"Our agents were able to confirm that, for the time being, the skies burn only over the Bounty, including this island and Corvos."},{"name":"ISHGARDRESIDENTOFFICER","text":"Alas, that is of little comfort..."},{"name":"RESIDENTOFFICER","text":"Aye. All throughout allied lands, there have been reports of people transforming into hideous beasts."},{"name":"RESIDENTOFFICER","text":"From what little we have learned, these incidents are similar in nature to that involving the merchant Khalzahl."},{"name":"RESIDENTOFFICER","text":"As was the case here, the victims underwent the change prior to the heavens being set ablaze."},{"name":"RESIDENTOFFICER","text":"And so, while the burning skies have yet to manifest beyond the Bounty, the transformations do not appear to be subject to any similar restriction. If anyone anywhere overcome by despair can turn, then nowhere is safe!"},{"name":"SHIRABAHT","text":"That's about the size of it. Speaking of which, we ought to give these creatures a name, don't you think?"},{"name":"SHIRABAHT","text":"Here in Radz–at–Han, we've taken to calling the first to change─which tend to be the biggest─“blasphemies.”"},{"name":"RESIDENTOFFICER","text":"As fitting a name as any. To ensure clarity in future communications, we shall urge our comrades to adopt this terminology."},{"name":"ULDAHMILITARYATTACHE","text":"Our leaders have taken measures to deal with the threat, to the best of our abilities."},{"name":"ALAMHIGOMILITARYATTACHE","text":"Aye. Each nation has assembled their own groups of elite soldiers to put down these so-called blasphemies and their spawn as and when they appear."},{"name":"ALAMHIGOMILITARYATTACHE","text":"At the same time, they are doing all in their power to put the people's minds at ease, and prevent panic and fear from spreading."},{"name":"ALAMHIGOMILITARYATTACHE","text":"That said...brave souls with the strength and fortitude to fell these terrible fiends are not easily found."},{"name":"DOMANRESIDENTOFFICER","text":"Just so. And it is for that very reason that we turn to you."},{"name":"DOMANRESIDENTOFFICER","text":"Pray lend us your strength, and help us to slay the blasphemies that plague our homelands!"},{"name":"SHIRABAHT","text":"Now, now...you don't have to give your reply before dinner. I should also mention that each blasphemy seems to possess wildly different characteristics. What works well against one may serve you poorly against another."},{"name":"SHIRABAHT","text":"So before you go rushing off to save everyone's day, have a word with the delegates. They'll tell you what to expect."},{"name":"SHIRABAHT","text":"...And with that, I do believe our friend here has a feast to attend. Spare a thought for us while you're tucking into all that fine cuisine, eh?"},{"name":"SYSTEM","text":"You have gained access to the role quests for Endwalker! A separate quest line and story is now available for tank, melee DPS, physical ranged DPS, magical ranged DPS, and healer roles."},{"name":"SYSTEM","text":"To undertake these quests, speak with any of the delegates in Sundrop, and agree to help defeat the blasphemies that plague their respective homelands."},{"name":"SHIRABAHT","text":"Thanks for taking the time to stop by. You're free to talk with our delegates more if the mood strikes you, or head off to your banquet if you've had your fill of words for the day."},{"name":"SHIRABAHT","text":"Ridding the lands of blasphemies is an important task, to be sure, but one that's best done on a full belly and a good night's rest, if you ask me. Do take care of yourself, you hear?"},{"name":"HANNISHROYALGUARD","text":"Pray forgive Shirabaht her rudeness. She can be a bit...boisterous at times, but it is simply her nature."},{"name":"HANNISHROYALGUARD","text":"Anyway, my apologies for keeping you from your hard-earned rest. You will be rejoining your companions, yes? Do you know the way to the meyhane?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I know Radz–at–Han like the back of my hand!"},{"name":"A2","text":"I have a terrible sense of direction."},{"name":"HANNISHROYALGUARD","text":"Glad to hear you're becoming familiar with our fair city. You'll be pleased to hear that all drinks are on the house, so order whatever suits your fancy."},{"name":"HANNISHROYALGUARD","text":"Truly? A remarkable weakness for such a well-traveled adventurer. Anyway, you can either use the Aethernet, or go by foot via the aetheryte plaza."},{"name":"HANNISHROYALGUARD","text":"From there, cross through Balshahn Bazaar and continue down the passage. You'll find yourself right in front of the meyhane."},{"name":"HANNISHROYALGUARD","text":"When you arrive, pray request the drink of your choice. Mehryde says that, tonight, it's on the house."},{"name":"HANNISHROYALGUARD","text":"And with that, I must return to my post. On behalf of all the Radiant Host, I thank you and your friends once more for lending your strength and courage to Radz–at–Han in our time of need."},{"name":"HANNISHROYALGUARD","text":"We shall endeavor to fight the good fight to the end, that we might honor Ahewann's legacy and serve Master Vrtra well. You have my word that your efforts will not be in vain."},{"name":"ALPHINAUD","text":"Forgive me for not waiting to make a toast. My throat was utterly parched..."},{"name":"ALISAIE","text":"I know I must eat to regain my strength, but between you and me, I don't have much of an appetite."},{"name":"THANCRED","text":"The threat here has been quelled, but our job's only just begun..."},{"name":"YSHTOLA","text":"Good you could join us. Mihleel over there will be happy to take your order."},{"name":"GRAHATIA","text":"How was your meeting with the Radiant? I would love to hear more..."},{"name":"ESTINIEN","text":"I'm overdue for a good meal."},{"name":"MIHLEEL","text":"Welcome! When the satrap asked us to entertain a party of honored guests, I was wondering who it might be... This is a lovely surprise, to say the least."},{"name":"MIHLEEL","text":"By the way, I heard all about Khalzahl from your friend G'raha Tia. I understand there was nothing that could be done, but...I was heartened to hear he meant us no harm."},{"name":"MIHLEEL","text":"I cannot thank you enough for dispatching the beasts. As the smallest token of our thanks, your food and drink tonight are Mehryde's treat. Speaking of which, what shall I start you off with?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"A piping hot mug of chai, please."},{"name":"A3","text":"A glass of your finest local spirits!"},{"name":"A3","text":"Water. Just water."},{"name":"MIHLEEL","text":"As you wish. Pray join your friends, and I will bring you your drink."},{"name":"MIHLEEL","text":"Your drink is on its way. Please, have a seat."},{"name":"YSHTOLA","text":"Welcome back. Whatever did the Radiant want with you, pray tell?"},{"name":"YSHTOLA","text":"Our allies have sent military delegates? That's news to me. Mind sharing the details?"},{"name":"ALPHINAUD","text":"The Final Days─how far has the phenomenon spread, and how does it manifest itself in each land? I must reach out to my friends in each nation and find out all I can."},{"name":"ALISAIE","text":"Ahhh...!"},{"name":"ALISAIE","text":"Well, I suppose I do feel better on a full stomach, after all. Burning skies? Blasphemies? Not if I've got anything to say about it!"},{"name":"YSHTOLA","text":"If the Forum truly has been spurred to action by Hydaelyn's prophecy, then is it not odd that the Antitower was entrusted to Master Matoya, who bears them no love?"},{"name":"YSHTOLA","text":"No doubt She has a reason for this, and I would know what it is..."},{"name":"GRAHATIA","text":"Nothing like a feast to lift the spirits. I trust you enjoyed yourself as well?"},{"name":"ESTINIEN","text":"Beasts and blasphemies may be running amok in nearby lands outside the influence of Radz–at–Han and the alliance. If so, I may need to go hunting."},{"name":"THANCRED","text":"Now, then...is there anything we've forgotten to mention? Are your arms and armor in good order?"},{"name":"THANCRED","text":"In that case, it's time we each attended to our tasks. And when you arrive on the First, give my regards to Ryne. Tell her I miss her."}],"reward":{"gil":1261},"reqs":{"jobs":[{"lvl":85,"id":142}],"quests":[69953]},"next":[69638,69644,69650,69656,69662,69805,69806,69807,69808,69809,69810,69811,69955]},"partials":[{"type":"npc","id":"1040372","obj":{"i":1040372,"n":"Radiant Host Soldier","l":3707,"q":1}},{"type":"npc","id":"1040382","obj":{"i":1040382,"n":"Thancred","l":3707,"q":1}},{"type":"quest","id":"69953","obj":{"i":69953,"n":"Under His Wing","g":11,"l":"Thavnair","s":571}},{"type":"quest","id":"69638","obj":{"i":69638,"n":"Shrouded in Peril","g":184,"l":"Radz-at-Han","s":101,"f":1}},{"type":"quest","id":"69644","obj":{"i":69644,"n":"Far from Free","g":185,"l":"Radz-at-Han","s":201,"f":1}},{"type":"quest","id":"69650","obj":{"i":69650,"n":"Storm Clouds Brewing","g":186,"l":"Radz-at-Han","s":301,"f":1}},{"type":"quest","id":"69656","obj":{"i":69656,"n":"Seeds of Disquiet","g":187,"l":"Radz-at-Han","s":401,"f":1}},{"type":"quest","id":"69662","obj":{"i":69662,"n":"Our Aching Souls","g":188,"l":"Radz-at-Han","s":501,"f":1}},{"type":"quest","id":"69805","obj":{"i":69805,"n":"A Bond Eternal","g":120,"l":"Radz-at-Han","s":2140}},{"type":"quest","id":"69806","obj":{"i":69806,"n":"A Gift of Flowers","g":120,"l":"Radz-at-Han","s":2150}},{"type":"quest","id":"69807","obj":{"i":69807,"n":"Tidings from Afar","g":120,"l":"Radz-at-Han","s":2160}},{"type":"quest","id":"69808","obj":{"i":69808,"n":"The Pangs of Hunger","g":120,"l":"Radz-at-Han","s":2170}},{"type":"quest","id":"69809","obj":{"i":69809,"n":"Silks for a Babe","g":120,"l":"Radz-at-Han","s":2180}},{"type":"quest","id":"69810","obj":{"i":69810,"n":"Hungry Hungry Hamsa","g":120,"l":"Radz-at-Han","s":2190}},{"type":"quest","id":"69811","obj":{"i":69811,"n":"Operation Ring Retrieval","g":120,"l":"Radz-at-Han","s":2200}},{"type":"quest","id":"69955","obj":{"i":69955,"n":"Return to the Crystarium","g":11,"l":"Radz-at-Han","s":573}}]}