{"quest":{"name":"Hope Upon a Flower","location":"The Crystarium","id":69956,"patch":6.0,"sort":574,"icon":101121,"eventIcon":71201,"issuer":1039992,"target":1039996,"genre":11,"journal":["Ryne wears a look of steely resolve.","Having bid Ryne farewell, you return to your mission in the First─consulting Elidibus regarding the Final Days. To that end do you seek out the Crystarium gatekeep, who should admit you to the Ocular as before.","Inside the Umbilicus, you use your borrowed spirit vessel to activate the Allagan console, which locates Elidibus's imprisoned essence and projects his image into the chamber. Though your erstwhile foe declares that the star is now yours to fight for, bound as ever by duty, he agrees to share his knowledge. To your surprise, it was none other than Fandaniel who shed light upon the phenomenon of the Final Days, and thence dedicated himself to devising a countermeasure. Prior to joining the Convocation, he served as the chief of Elpis─a facility for the evaluation of creations─and was known as Hermes. Perhaps inspired by an impossible memory of you in that ancient time and place, Elidibus suggests that you travel to Elpis in the past. At his instruction, you open a pathway to your destination, and step into the portal. The magick consumes Elidibus's essence once and for all, and he goes to join his beloved brethren as you journey to your distant destination in search of salvation.","After hurtling through the rift, you safely arrive in what you assume is the past, albeit in a transparent form. Setting aside that problem for now, you begin exploring your surrounds.","As Elidibus had forewarned, you are unable to interact with the people present. From snatches of their conversation, however, you establish that you are indeed in the past, more specifically in a facility called Propylaion. Having learned all you can here, you decide to continue your exploration outside, and make your way to the exit.","As you try to open the door, the inconceivable happens: two new arrivals emerge from the teleportation device, and who should they turn out to be but Hythlodaeus and Emet-Selch. Due to their talent for seeing souls, they readily catch sight of you, and at his companion's insistence, Emet-Selch augments your aether and adjusts your size. Now proportional to your surrounds and able to be heard, you inform your new old friends of your desire to seek out Hermes, and they are taken aback to learn that your purpose is the same as theirs. Hythlodaeus offers to serve as your guide, and together you head outside.","Stepping through the door, your breath catches in your throat as you take in the impossibly beautiful scenery of the testing ground of creation at heavens' edge: Elpis.","Hythlodaeus explains that Elpis is where living beings and certain arcane entities are brought for in-depth observation and research. Thus your search for answers in the past begins, but to what manner of future the path may lead, none can yet say..."],"objectives":["Speak with the Crystarium gatekeep.","Explore the facility.","Examine the door.","Speak with Hythlodaeus."],"dialogue":[{"name":"RYNE","text":"You're headed to the Umbilicus to consult with Elidibus, right?"},{"name":"RYNE","text":"I'll do some consulting of my own and speak with Lyna. Decide how we might best prepare for the Final Days."},{"name":"RYNE","text":"So it's farewell for now, but we'll see each other again. I'm certain of it."},{"name":"RYNE","text":"We lived through the Flood and the tyranny of the Lightwardens. We're survivors. Do what you need to do, and know that we will too."},{"name":"CRYSTALGATEKEEPER","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, welcome back!"},{"name":"CRYSTALGATEKEEPER","text":"The captain has told me all. Give the word, and I will show you to the Ocular."},{"name":"Q1","text":"Proceed to the Ocular?"},{"name":"CRYSTALGATEKEEPER","text":"Still have unfinished business in the Ocular? If so, let me know."},{"name":"Q2","text":"Travel to Elpis?"},{"name":"SYSTEM","text":"The man stands dutifully by the aetheryte-like device. A guide for this facility, in all likelihood."},{"name":"SYSTEM","text":"You attempt to get the man's attention, but if he sees or hears you, he gives absolutely no indication."},{"name":"SYSTEM","text":"As Elidibus warned, it appears your form is intangible..."},{"name":"PROPYLAIONSTAFF","text":"..."},{"name":"SYSTEM","text":"The remarkably large man wears a black robe and a half mask─much like the phantoms you encountered in Mare Lamentorum and the recreated Amaurot..."},{"name":"SYSTEM","text":"It would seem you have made it to your destination."},{"name":"SYSTEM","text":"You gesticulate wildly and shout all manner of greetings and obscenities, but the man does not so much as glance in your general direction..."},{"name":"SOLON","text":"..."},{"name":"PROPYLAIONUSER04420","text":"This <span class=\"emphasis\">is</span> the right place, yes? Propylaion?"},{"name":"SYSTEM","text":"Judging by the woman's words, this facility is called “Propylaion.”"},{"name":"SYSTEM","text":"You attempt to gently prod the woman to attract her attention, but feel nothing─and it seems neither does she."},{"name":"PROPYLAIONUSER04420","text":"Very well, let's wait a while."},{"name":"SYSTEM","text":"The device is reminiscent of an aetheryte. Perhaps it is possible to attune with it..."},{"name":"SYSTEM","text":"Despite attempting to channel and focus your energies, you fail to attune with the device. You can only assume it operates differently."},{"name":"SYSTEM","text":"You suspect this door leads outside. But how to open it...?"},{"name":"EMETSELCH","text":"In case you didn't know, it's rude to stare. Stop."},{"name":"Q3","text":"Continue with the main scenario quest?"},{"name":"HYTHLODAEUS","text":"This is hardly my first time here, but the scenery never fails to take my breath away. Why, it feels as if you could reach out and touch the heavens!"},{"name":"HYTHLODAEUS","text":"Now then, to begin our guided tour... Perhaps you already know these things, but for the sake of thoroughness, I shall start with the basics."},{"name":"HYTHLODAEUS","text":"Using concepts to give shape to aether, creation magicks allow us to bring forth anything we desire, be it inanimate objects or living beings."},{"name":"HYTHLODAEUS","text":"Anyone may conceive of concepts, but they must all undergo evaluation at the Bureau of the Architect."},{"name":"HYTHLODAEUS","text":"As part of that process, living beings and certain arcane entities may be sent here to Elpis for in-depth observation and study."},{"name":"HYTHLODAEUS","text":"Heh heh, a fascinating facility, isn't it? I daresay you will enjoy touring it with us."}],"reward":{"gil":1438},"reqs":{"jobs":[{"lvl":86,"id":142}],"quests":[69955]},"next":[69957]},"partials":[{"type":"npc","id":"1039992","obj":{"i":1039992,"n":"Ryne","l":2951,"q":2}},{"type":"npc","id":"1039996","obj":{"i":1039996,"n":"Hythlodaeus","l":3713,"q":2}},{"type":"quest","id":"69955","obj":{"i":69955,"n":"Return to the Crystarium","g":11,"l":"Radz-at-Han","s":573}},{"type":"quest","id":"69957","obj":{"i":69957,"n":"Petalouda Hunt","g":11,"l":"Elpis","s":575}}]}