{"quest":{"name":"Warm Hearts, Rekindled Hopes","location":"Thavnair","id":69951,"patch":6.0,"sort":569,"icon":101119,"eventIcon":71201,"issuer":1039047,"target":1039056,"genre":11,"journal":["Alisaie is gazing out intently between the trees.","As she surveyed the dense jungle, Alisaie caught sight of someone being pursued by a great beast. Whether or not that person is Mehvan remains to be seen, but regardless, you must give chase.","The figure Alisaie spied was indeed Mehvan, but before you and the twins can slay her pursuer, the beast seizes the poor woman and casts her into the dark waters, along with her infant child. Without hesitation, you dive into the water after the pair.","You find Mehvan and know at once she has drawn her last breath. With yet another tragedy weighing heavy on your heart, you cast about the water for her child.","Mehvan's infant daughter appears to have miraculously survived the plunge. To save the child from drowning, however, you must swim to the surface and seek Alphinaud's aid.","Alphinaud attempts to tend to the babe with his healing magicks, but soon concludes that she will need a warm bed and rest in order to survive. In that moment, you are beset by yet more terrible beasts. Entrusting the child's safe return to an anxious-yet-determined Matsya, you and your companions prepare for battle.","Alphinaud takes stock of your current situation, observing that─for what small comfort it might offer─the ill-fated Qerasaf and Mehvan perished without being transformed into beasts themselves, meaning their souls will return to the aetherial sea. Having done all that can be done, you and your companions prepare to move on."],"objectives":["Survey the designated location.","Rescue Mehvan.","Search for Mehvan's baby.","Have Alphinaud tend to the baby.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"We must go after them at once!"},{"name":"MATSYA","text":"Wh-What!? Was that Mehvan!?"},{"name":"ALISAIE","text":"Over there! My view was blocked by the trees, but I'm sure I saw someone being chased by a beast!"},{"name":"ALISAIE","text":"<span class=\"highlight\">Forename</span>, go with Matsya and search along the river! Alphinaud and I will circle around from the south!"},{"name":"MATSYA","text":"We've reached the Font of Maya... Maybe they're hiding in the ruins?"},{"name":"SYSTEM","text":"Mehvan's lifeless body floats before you, battered and broken. Her death no doubt came swiftly."},{"name":"SYSTEM","text":"Her infant daughter, however, is nowhere to be seen..."},{"name":"SYSTEM","text":"There is nothing more you can do for the ill-fated Mehvan. Her child, however, may yet be saved..."},{"name":"SYSTEM","text":"You take the babe into your arms. If she yet lives, you cannot tell, but she will surely not survive unless you carry her to the surface at once."},{"name":"SYSTEM","text":"It is too late for Mehvan, but perhaps not for her child..."},{"name":"ALISAIE","text":"So? Where are they!?"},{"name":"MATSYA","text":"Oh no, no, no... Wh-What do we do? What do we do!?"},{"name":"ALPHINAUD","text":"Did you find Mehvan and the child!?"},{"name":"ALPHINAUD","text":"Damn it all..."},{"name":"ALPHINAUD","text":"You have the child!? Let me see her!"},{"name":"ALISAIE","text":"..."},{"name":"ESTINIEN","text":"Go. I will keep watch until your work is done."},{"name":"ALPHINAUD","text":"We have done what we can. 'Tis for the villagers of Palaka's Stand to perform the funeral rites."},{"name":"ALPHINAUD","text":"If nothing else, Mehvan and Qerasaf died as they lived─as themselves, and not as beasts. Their souls will find peace in the aetherial sea."},{"name":"ALPHINAUD","text":"To think the day would come when even that smallest of solaces would be this comforting..."}],"reward":{"gil":1178},"reqs":{"jobs":[{"lvl":85,"id":142}],"quests":[69950]},"next":[69952]},"partials":[{"type":"npc","id":"1039047","obj":{"i":1039047,"n":"Alisaie","l":3709,"q":1}},{"type":"npc","id":"1039056","obj":{"i":1039056,"n":"Alphinaud","l":3709,"q":1}},{"type":"quest","id":"69950","obj":{"i":69950,"n":"When All Hope Seems Lost","g":11,"l":"Thavnair","s":568}},{"type":"quest","id":"69952","obj":{"i":69952,"n":"Simple Pleasures","g":11,"l":"Thavnair","s":570}}]}