{"quest":{"name":"When All Hope Seems Lost","location":"Thavnair","id":69950,"patch":6.0,"sort":568,"eventIcon":71201,"issuer":1039028,"target":1039036,"genre":11,"journal":["Matsya cannot help but fear the worst."],"objectives":["Speak with Yeruvvet.","Speak with Alisaie.","Search for the villagers of Palaka's Stand.","Aid the villager woman.","Speak with Matsya.","Defeat the beasts at Purusa.","Speak with Alphinaud."],"dialogue":[{"name":"MATSYA","text":"If Mehvan fled deeper into the jungle, she and her child are in grave danger! Wh-Whatever are we to do!? Gods have mercy!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You must try to stay calm, Matsya."},{"name":"A1","text":"You cannot let fear consume you..."},{"name":"A1","text":"Do you want to turn into a beast like the others?"},{"name":"MATSYA","text":"But...how can I at a time like this? They could be dead!"},{"name":"MATSYA","text":"So...if I allow myself to be overcome by this fear, I, too, might become a beast? I am not sure I understand, but I will do my best..."},{"name":"MATSYA","text":"Fear...consume me? What are you talking about?"},{"name":"MATSYA","text":"Then...I, too, could become a beast? I...I understand. I think."},{"name":"MATSYA","text":"M-Me? A beast? What are you talking about!?"},{"name":"MATSYA","text":"Gods... So that is what causes it? Then I have no choice...I must keep my fear in check."},{"name":"ALISAIE","text":"I've seen to the wounded. How did the two of you fare? Did you find your friends?"},{"name":"ALISAIE","text":"...I see. In that case, let us help you find the mother and child."},{"name":"ALPHINAUD","text":"Before we leave, we must ensure the village will be safe in our absence."},{"name":"ALPHINAUD","text":"Alisaie and I will patrol the area and search for more beasts."},{"name":"ALPHINAUD","text":"Would you and Matsya speak with Elder Yeruvvet? Pray explain to him the situation, and join us as soon as you are able."},{"name":"ALISAIE","text":"We <span class=\"emphasis\">will</span> save Mehvan and her child. We can do that much for Qerasaf..."},{"name":"MATSYA","text":"&lt;sniff&gt; It will not be easy... But I will tell the elder about Qerasaf..."},{"name":"YERUVVET","text":"I am heartened to see you both safe, but what of the family?"},{"name":"MATSYA","text":"We found Qerasaf, b-but...he..."},{"name":"YERUVVET","text":"Say no more. I understand. We have lost another of our dear friends..."},{"name":"YERUVVET","text":"Qerasaf may be gone, but there is still hope for Mehvan and their child. Please find them, I beg of you!"},{"name":"YERUVVET","text":"And if, in your search, you come across anyone else who escaped the slaughter, pray tell them what has happened."},{"name":"YERUVVET","text":"I will do my best to keep the villagers safe...and their spirits high."},{"name":"MATSYA","text":"Come, let us rejoin your friends at once!"},{"name":"YERUVVET","text":"Qerasaf and Mehvan married only three summers ago. The day their daughter was born...I had never seen them so happy. They did not deserve this─none of these people did."},{"name":"ALPHINAUD","text":"We encountered no beasts during our patrol, thankfully."},{"name":"MATSYA","text":"Where might Mehvan have run off to? Think, Matsya, think!"},{"name":"ALISAIE","text":"I'm pleased to report that the vicinity appears to be beast-free─no doubt thanks to your earlier efforts."},{"name":"ALISAIE","text":"And with that, let us resume our search for your friend and her child. Where should we begin, Matsya?"},{"name":"MATSYA","text":"If we follow Ksiroda south, we will arrive at Purusa, a temple. It is a sacred place where people go to commune with the divinities."},{"name":"MATSYA","text":"It's possible that Mehvan sought shelter there, and perhaps other villagers as well..."},{"name":"ALISAIE","text":"Then it's settled. Matsya, stay close to me, all right?"},{"name":"ALISAIE","text":"You two, take the lead. Keep an eye out for beasts and anyone in need of help."},{"name":"ALPHINAUD","text":"Very well. We make for Purusa, as quickly as we are able. With me!"},{"name":"SUFFERER04414","text":"Th-Thank you... I thought I was done for..."},{"name":"SUFFERER04414","text":"Hm? Mehvan? She is a friend of mine, too, but I have not seen her..."},{"name":"SUFFERER04414","text":"She must still be out there somewhere, trying to avoid the beasts. And with her child, gods... Worry not for me─I can make my way back to the village on my own!"},{"name":"MATSYA","text":"<span class=\"highlight\">Forename</span>, wait! Purusa lies just up ahead, but something terrible has happened!"},{"name":"MATSYA","text":"The beasts have come, and many have already been killed!"},{"name":"MATSYA","text":"Alphinaud and Alisaie have gone to do what they can, but there are so, so many─more than I could count. You must be ready..."},{"name":"MATSYA","text":"I...I am fine. I will be safe hiding here. Please, you must help those people!"},{"name":"ALPHINAUD","text":"Remain calm, and do not wander off! I will tend to the wounded."},{"name":"ALISAIE","text":"Stay strong! We'll keep you safe─I promise!"},{"name":"BALLOON","text":"Graaaghhhaggghhhrrr..."},{"name":"BALLOON","text":"No... No... Gragnghhh... "},{"name":"BALLOON","text":"Aieeeaaaaaagh!"},{"name":"BALLOON","text":"Urk... Urgh..."},{"name":"POPMESSAGE","text":"The villager transforms into a beast and lunges towards you!"},{"name":"BALLOON","text":"S-Someone...<br>heeeaaarlggghhhp."},{"name":"BALLOON","text":"No... Please...naaarrrghhh..."},{"name":"BALLOON","text":"He...help...help meaaarrrghhh..."},{"name":"ALPHINAUD","text":"There you are! How fare the others?"},{"name":"ALPHINAUD","text":"...I see. You've seen to all the beasts in sight? In that case, let's have everyone gather in front of the temple."}],"reward":{"gil":1261},"reqs":{"jobs":[{"lvl":85,"id":142}],"quests":[69949]},"next":[69951]},"partials":[{"type":"npc","id":"1039028","obj":{"i":1039028,"n":"Matsya","l":3709,"q":1}},{"type":"npc","id":"1039036","obj":{"i":1039036,"n":"Alphinaud","l":3709,"q":1}},{"type":"quest","id":"69949","obj":{"i":69949,"n":"That We Might Live","g":11,"l":"Thavnair","s":567}},{"type":"quest","id":"69951","obj":{"i":69951,"n":"Warm Hearts, Rekindled Hopes","g":11,"l":"Thavnair","s":569}}]}