{"quest":{"name":"Travelers at the Crossroads","location":"Elpis","id":69965,"patch":6.0,"sort":583,"icon":101124,"eventIcon":71201,"issuer":1040101,"target":1040109,"genre":11,"journal":["Hythlodaeus wishes to discuss plans for the remainder of your visit.","After a brief discussion with Hythlodaeus and Emet-Selch, it is decided that you will move on to visit a new part of Elpis. Hythlodaeus asks that you follow him back towards Anagnorisis.","The next stop on your journey is Notoneus, where a teleporter awaits to send you to another of Elpis's floating islands. It seems, however, that permission to use the device freely will only be granted in the presence of Hythlodaeus.","After using the teleporter, you find yourself whisked upwards to Kallimelios Zephyros, where a close encounter with an ambulatory shark leads to a chance meeting with an eerily familiar woman. Venat, as she is called, recognizes the mark of her own magick upon you, and quickly deduces your origin as a traveler from the future. Intrigued by the possibilities, the former Azem asks that you favor her with the details of your quest, while Emet-Selch vows to ascertain your identity and purpose.","Before continuing the conversation begun near the teleporter, Venat requests that you aid her in tracking down a concept crystal that was spirited away by an oreias. Suspecting the creature may have dropped it somewhere in the forest, she directs you to search the southern reaches of Kallimelios Zephyros.","You come across a crystal on the ground, seemingly discarded without a care for its condition. This is almost certainly the object Venat was searching for.","You deliver the crystal to Venat, who applauds your knack for finding lost items. Even though she no longer holds the seat of Azem, it seems she shares your passion for travel, as well as helping those in need. You wonder, as Venat clearly suspects, if this meeting was more fate than chance..."],"objectives":["Speak with Hythlodaeus.","Speak with Hythlodaeus again.","Speak with Venat.","Search for the concept crystal.","Deliver the concept crystal to Venat."],"dialogue":[{"name":"EMETSELCH","text":"...I don't know what answer he's searching for, or if it is within our power to give it. But I believe he would make a fine Fandaniel, and that if he rejects us out of hand, we will all be lesser for it."},{"name":"HYTHLODAEUS","text":"Where to now? If there is anywhere you would like to visit before we leave, I should be glad to show you the way..."},{"name":"EMETSELCH","text":"Hermes has not yet outright refused his position with the Convocation─merely postponed the decision."},{"name":"EMETSELCH","text":"As such, I may as well resume my assessment. If we cannot accompany him, then I will content myself with questioning his colleagues."},{"name":"HYTHLODAEUS","text":"Ever the pragmatist. Then allow me to remain your humble guide."},{"name":"HYTHLODAEUS","text":"And what of you, <span class=\"highlight\">Forename</span>? Will you continue along with us?"},{"name":"HYTHLODAEUS","text":"Wonderful! Our fellowship travels on unbroken. I say we explore another part of Elpis, and see what new encounters there are to be had."},{"name":"HYTHLODAEUS","text":"If you would follow me, we will first head back towards Anagnorisis. "},{"name":"EMETSELCH","text":"Didn't we part ways with Hermes not far from here? Given the size of Elpis, I expect our paths will cross again before long..."},{"name":"HYTHLODAEUS","text":"From here, we follow the path northwards to Notoneus."},{"name":"HYTHLODAEUS","text":"There we will find one of the neus which facilitate travel between the islands of Elpis."},{"name":"HYTHLODAEUS","text":"First-time travelers must be accompanied by someone with the requisite permission─which I have previously been granted. We only need use the device together once, and henceforth you will have leave to use it freely."},{"name":"HYTHLODAEUS","text":"Shall we?"},{"name":"EMETSELCH","text":"Unless the need is pressing, I won't be tracking Hermes with my aetherial sight. 'Tis poor manners to spy on someone's comings and goings in such a fashion. So don't ask."},{"name":"EMETSELCH","text":"Social conventions notwithstanding, perceiving aether requires deliberate and intense concentration, and we otherwise keep our eyes on the corporeal world."},{"name":"HYTHLODAEUS","text":"Here we are: Notoneus. This neus will take us to Kallimelios Zephyros, the western island."},{"name":"HYTHLODAEUS","text":"That's it right there, looming large over us."},{"name":"HYTHLODAEUS","text":"Step this way, and we can soon admire the view from above!"},{"name":"EMETSELCH","text":"And there I thought you were a harmless stray familiar..."},{"name":"EMETSELCH","text":"As far as I'm concerned, this nebulous talk of future this and changing history that can wait. First, I mean to find out exactly who you are and what you hope to achieve here."},{"name":"HYTHLODAEUS","text":"The future... <span class=\"emphasis\">Our</span> future. I am deathly curious to hear more."},{"name":"Q1","text":"Proceed to Kallimelios Zephyros?"},{"name":"VENAS","text":"My apologies, but before we move along, a colleague has tasked me with a matter which I'd rather not leave unresolved."},{"name":"VENAS","text":"It involves finding a certain concept-engraved crystal...and the quick-fingered oreias which made off with it."},{"name":"HYTHLODAEUS","text":"An oreias, you say? I think we might have seen the culprit before being distracted by that business with the shark. Would you like us to follow its aetherial trail?"},{"name":"HYTHLODAEUS","text":"That would, of course, lead us only to the oreias─there is no guarantee that it hasn't dropped or stashed away the crystal you seek."},{"name":"VENAS","text":"Please! Even that much would be enormously helpful. While you are hunting down the thief, I can follow behind and scour the forest floor just in case."},{"name":"VENAS","text":"Could I ask you to join the search? I would appreciate another pair of eyes to cover the land to the west of here..."},{"name":"VENAS","text":"Many thanks! There's a small bridge leading into Poieten Oikos─let us meet up there once we've exhausted our efforts."},{"name":"EMETSELCH","text":"The problem you present is vexing enough without adding the old Azem into the equation."},{"name":"EMETSELCH","text":"&lt;sigh&gt; And she wonders why these lines upon my brow grow deeper, when she herself wields the hammer and chisel..."},{"name":"HYTHLODAEUS","text":"The Azems, both mentor and student, are a force to be reckoned with. I find them a delight, personally, but they have a habit of making Emet-Selch look as if he bit down on a sour grape."},{"name":"VENAS","text":"Our last searcher returns. I am afraid the oreias no longer had the crystal, nor was I able to find it as I followed in its wake."},{"name":"VENAS","text":"I don't suppose you fared any better...?"},{"name":"VENAS","text":"The crystal! Well done!"},{"name":"VENAS","text":"Wonderful! Now I can focus on your tale without that missing concept nagging at my mind. Have you always had a knack for finding things?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I've often been asked to do so."},{"name":"A2","text":"Traveling and searching go hand in hand."},{"name":"VENAS","text":"Oho! You too? Some of us seem destined to always be searching. For ourselves and for others."},{"name":"VENAS","text":"You travel often, then? It seems we have something in common."},{"name":"VENAS","text":"Long ago, when I held the seat of Azem, I was forever trekking back and forth across the star in search of answers to people's problems."},{"name":"VENAS","text":"Naturally, the need for such journeys has lessened considerably since I entrusted the position to my whimsical successor..."},{"name":"VENAS","text":"Yet I am still eager to come running should an old acquaintance or new interest require my personal attention."},{"name":"VENAS","text":"That is what brings me to Elpis, in fact. Many times has my presence been requested; my opinions sought concerning the habitat of this or that creation."},{"name":"VENAS","text":"Agreeing to help locate that missing crystal was a minor distraction...which now promises to become a major revelation! How strange and wonderful it is the way one thing leads to another. Wouldn't you agree?"}],"reward":{"gil":1152},"reqs":{"jobs":[{"lvl":87,"id":142}],"quests":[69964]},"next":[69966]},"partials":[{"type":"npc","id":"1040101","obj":{"i":1040101,"n":"Hythlodaeus","l":3713,"q":1}},{"type":"npc","id":"1040109","obj":{"i":1040109,"n":"Venat","l":3713,"q":2}},{"type":"quest","id":"69964","obj":{"i":69964,"n":"Verdict and Execution","g":11,"l":"Elpis","s":582}},{"type":"quest","id":"69966","obj":{"i":69966,"n":"A Past, Not Yet Come to Pass","g":11,"l":"Elpis","s":584}}]}