{"quest":{"name":"Verdict and Execution","location":"Elpis","id":69964,"patch":6.0,"sort":582,"eventIcon":71201,"issuer":1040088,"target":1040100,"genre":11,"journal":["Hermes appears solemn and sorrowful."],"objectives":["Speak with Doros.","Speak with Hermes.","Face down the lykaon and its fireballs.","Stand in front of the lykaon and keep its attention.","Speak with Emet-Selch."],"dialogue":[{"name":"EMETSELCH","text":"The prodigal familiar returns, and after causing all manner of trouble while we were in our meeting, I'm sure."},{"name":"HYTHLODAEUS","text":"Were you able to get some rest? Please, do not hesitate to let us know if you're feeling tired─I worry we might exhaust your scarce reserves of aether."},{"name":"METEION","text":"I'm glad Hermes saw the flowers. Thank you, <span class=\"highlight\">Forename</span>."},{"name":"METEION","text":"It will help...I hope. Today will be difficult for him."},{"name":"HERMES","text":"An all-too-brief interlude, perhaps, but it is time I attend to my next task."},{"name":"HERMES","text":"As Emet-Selch and Hythlodaeus are aware, we reached a verdict regarding the fate of the lykaones."},{"name":"HERMES","text":"Seven were created for observation..."},{"name":"HERMES","text":"...And all seven must be unmade."},{"name":"HERMES","text":"Doros has followed the correct protocols, and, as chief overseer, I can find no fault in his judgment."},{"name":"HERMES","text":"The lykaones would disrupt the natural order, ravaging and consuming other species until they themselves starve and perish. They cannot be released into the wild, and they cannot be allowed to remain here in Elpis."},{"name":"HERMES","text":"I intend to petition the Bureau of the Architect to have the concept preserved as a restricted-purpose hazardous life-form. Hythlodaeus has pledged to support me in this endeavor."},{"name":"HERMES","text":"Yet whatever the bureau decides, the existing lykaones have served their purpose..."},{"name":"HERMES","text":"Doros has already isolated the creatures, and is preparing to carry out the necessary measures."},{"name":"HERMES","text":"I will join him forthwith. It is my duty to witness the...conclusion...to this study."},{"name":"EMETSELCH","text":"If you are resolved, then we have but to accompany you."},{"name":"HERMES","text":"Of course. Let us be off, then. We return to the main isle."},{"name":"HERMES","text":"Doros! Are you hurt!? What happened here!?"},{"name":"DOROS","text":"They...they caught me off guard..."},{"name":"DOROS","text":"I had them bound with aetherial shackles. But they became frenzied, even more so than usual, and broke free..."},{"name":"DOROS","text":"I was able to stop four. The other three escaped..."},{"name":"HYTHLODAEUS","text":"...I see them. Two have taken to the air above the Twelve Wonders."},{"name":"EMETSELCH","text":"The last is up ahead, lurking in the fields."},{"name":"EMETSELCH","text":"You and <span class=\"highlight\">Forename</span> handle that one. The pair in the sky, you can leave to me."},{"name":"HERMES","text":"...If this is how it must end, then so be it."},{"name":"HYTHLODAEUS","text":"I will render assistance to Emet-Selch, unneeded though it is."},{"name":"HERMES","text":"Meteion, you are to stay here with Doros."},{"name":"METEION","text":"But, Hermes!"},{"name":"HERMES","text":"The lykaones must be reverted. I would spare you their pain. And mine."},{"name":"HERMES","text":"This is my burden, not yours. But if you are intent on helping, then please, follow my lead."},{"name":"METEION","text":"Stay with Hermes, <span class=\"highlight\">Forename</span>. He will need someone...when the time comes..."},{"name":"DOROS","text":"Never mind my wounds, they are easily healed. It is the lykaones which concern me..."},{"name":"HERMES","text":"I appreciate your help...and lament that it is necessary."},{"name":"HERMES","text":"There it is─our quarry. Within striking distance at present...but if it feels threatened, it may well flee beyond our reach."},{"name":"HERMES","text":"Here is my plan. You will approach slowly, in full view, and draw the lykaon's attention."},{"name":"HERMES","text":"Now, I warn you: its abilities are as fiery as its temperament. Once it spots you, it will unleash orbs of flame..."},{"name":"HERMES","text":"But fear not. By my measure, you are more than equal to the task. Withstand the onslaught for a few brief moments, and that will give me time to catch it unawares."},{"name":"HERMES","text":"...Ready? Then let us begin!"},{"name":"HERMES","text":"A few moments is all I require. Just make sure that you command its attention!"},{"name":"POPMESSAGE","text":"The lykaon unleashes an orb of pure flame!"},{"name":"POPMESSAGE","text":"The lykaon manifests more fiery spheres!"},{"name":"HERMES","text":"Not quite yet! Stand your ground a little longer!"},{"name":"HYTHLODAEUS","text":"It has been quite an exciting visit for you thus far. Oh, you weren't injured, were you? Good, good."},{"name":"EMETSELCH","text":"The other lykaones have been taken care of."},{"name":"EMETSELCH","text":"The incident is resolved, and life in Elpis continues as normal...or ends, as the case may be."},{"name":"EMETSELCH","text":"Rationally speaking, I understand Hermes's argument. No matter how well deserved the rest, there is a pang of sadness when a colleague leaves us."},{"name":"EMETSELCH","text":"Yet never has a departure caused me such grief as Hermes appears to feel. What must it be like to experience such torment...?"}],"reward":{"gil":1102,"items":[{"id":35699}]},"reqs":{"jobs":[{"lvl":86,"id":142}],"quests":[69963]},"next":[69965]},"partials":[{"type":"npc","id":"1040088","obj":{"i":1040088,"n":"Hermes","l":3713,"q":1}},{"type":"npc","id":"1040100","obj":{"i":1040100,"n":"Emet-Selch","l":3713,"q":1}},{"type":"item","id":"35699","obj":{"i":35699,"n":"Ironwood Hand Gear Coffer (IL 539)","l":1,"c":26560,"t":61}},{"type":"quest","id":"69963","obj":{"i":69963,"n":"A Sentimental Gift","g":11,"l":"Elpis","s":581}},{"type":"quest","id":"69965","obj":{"i":69965,"n":"Travelers at the Crossroads","g":11,"l":"Elpis","s":583}}]}