{"quest":{"name":"A Past, Not Yet Come to Pass","location":"Elpis","id":69966,"patch":6.0,"sort":584,"eventIcon":71201,"issuer":1040109,"target":1040115,"genre":11,"journal":["Venat is in a cheerful mood."],"objectives":["Speak with Venat.","Speak with Venat again.","Speak with Venat once more.","Speak with Ismene.","Speak with Venat.","Search for Timaios.","Speak with Venat."],"dialogue":[{"name":"EMETSELCH","text":"The problem you present is vexing enough without adding the old Azem into the equation."},{"name":"EMETSELCH","text":"&lt;sigh&gt; And she wonders why these lines upon my brow grow deeper, when she herself wields the hammer and chisel..."},{"name":"HYTHLODAEUS","text":"The Azems, both mentor and student, are a force to be reckoned with. I find them a delight, personally, but they have a habit of making Emet-Selch look as if he bit down on a sour grape."},{"name":"VENAS","text":"Thank you again for your timely help. Now then, 'tis time I returned this stolen property."},{"name":"VENAS","text":"If you would go on ahead to my accommodation, I will join you as soon as I have attended to that task."},{"name":"VENAS","text":"Follow the path straight ahead to the building at the top of the slope. I have the entire place to myself, so we can speak without fear of being disturbed or overheard."},{"name":"EMETSELCH","text":"Yes, this will be far more comfortable than interrogating you on the side of the road."},{"name":"HYTHLODAEUS","text":"You needn't be nervous around Venat─those white robes mark her as one of fair and impartial reasoning."},{"name":"HYTHLODAEUS","text":"Aside from the emissary, Elidibus, such garb is worn only by those who have stepped down from public office to serve as advisors. Whatever you have to say, she will listen without judgment."},{"name":"VENAS","text":"Welcome to my temporary abode. Please, make yourself at home while I put on some tea."},{"name":"VENAS","text":"Shall we begin our investigations, then?"},{"name":"VENAS","text":"I am acquainted with Hermes, of course, but only as a visitor received by the chief overseer of Elpis. Of the man himself, I know only that which is common knowledge."},{"name":"VENAS","text":"Thus I suggest we fall back on the tried-and-true method of conversing with the locals. The observers who live here can surely tell us more of Hermes and Meteion, and I have a good idea of where we might begin..."},{"name":"ISMENE","text":"Ah, there's nothing like enjoying the fresh air after being cooped up inside writing reports."},{"name":"VENAS","text":"See you the woman standing in front of yonder building? Her name is Ismene."},{"name":"VENAS","text":"She is the one who made arrangements for my stay in Elpis, and from what I recall, she has held her position here for quite some time. Chances are she can provide us with some insights."},{"name":"VENAS","text":"Go and ask your questions. I will help with drawing out answers if need be, but I leave the choice of topic up to you."},{"name":"VENAS","text":"Let us speak with Ismene. You know more of this coming calamity, so I think it best that you lead the conversation."},{"name":"ISMENE","text":"Questions? For me? Well, I suppose I have no other pressing duties at the moment..."},{"name":"SYSTEM","text":"The following event cannot be skipped. You may wish to cancel any pending Duty Finder registrations."},{"name":"Q1","text":"Begin asking questions?"},{"name":"VENAS","text":"Greetings, Ismene. My friend here is desperately curious about Chief Hermes, and I was wondering if you might indulge <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"ISMENE","text":"Certainly, Mistress Venat. Anything to be of service!"},{"name":"ISMENE","text":"What do you wish to know?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"What kind of person is Hermes?"},{"name":"A2","text":"What are Hermes's interests?"},{"name":"ISMENE","text":"Well, I can only answer from my own experience, but..."},{"name":"ISMENE","text":"I would describe him as a quiet man─reserved, you might say─and occasionally somewhat poor with his choice of words."},{"name":"ISMENE","text":"His reticent nature, however, does not prevent him from carrying out his duties as chief overseer."},{"name":"ISMENE","text":"The man is a walking archive when it comes to life-forms. He can discuss any species in incredible detail, and is the leading authority on concepts with the power of flight."},{"name":"ISMENE","text":"...His interests?"},{"name":"ISMENE","text":"Well, he is an authority on flying life-forms, and has expansive knowledge of living creatures in general. Is that what you wished to know...?"},{"name":"VENAS","text":"How would you describe him as a person? As a colleague?"},{"name":"ISMENE","text":"He is a quiet man─reserved, you might say─and occasionally somewhat poor with his choice of words."},{"name":"ISMENE","text":"His reticent nature, however, does not prevent him from carrying out his duties as chief overseer."},{"name":"ISMENE","text":"I hope that answers your question. Was there anything else?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"How long has Meteion been here?"},{"name":"A3","text":"Do you know of Meteion's abilities?"},{"name":"ISMENE","text":"I cannot rightly say... As the chief's personal creation, Meteion has not been subjected to observation and study like other concepts."},{"name":"VENAS","text":"So one day, she was simply there. And what do you make of her abilities?"},{"name":"ISMENE","text":"I understand that she is a highly unusual familiar, able to read emotions and communicate directly with one's mind. Exactly how she was created with that talent, however, is a mystery to me."},{"name":"ISMENE","text":"It's no secret that she is a highly unusual familiar. Of late, the chief often makes his rounds with her, like a mother hen raising her chick."},{"name":"ISMENE","text":"I understand that she is able to read emotions and communicate directly with one's mind. Exactly how she was created with that talent, however, is a mystery to me."},{"name":"ISMENE","text":"My apologies. I wish I could explain her nature in more depth, but I've not had occasion to discuss it with Chief Hermes."},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"Do you wish you knew him better?"},{"name":"A4","text":"Do you trust him?"},{"name":"ISMENE","text":"The chief may not be the most gregarious individual, but he engages with us as is necessary for everyone to perform their duties. I wouldn't want to intrude upon his privacy for the sake of curiosity..."},{"name":"ISMENE","text":"Though if you wish to learn more about Meteion, you could try speaking with Timaios─another expert in the creation of flying concepts."},{"name":"ISMENE","text":"He should be conducting his observations on the banks of the stream, somewhere to the east. Oh, and, uh, unless you take a particular joy in rambling discourse, I suggest you keep your questions concise."},{"name":"ISMENE","text":"I...beg your pardon? I've known Chief Hermes for many years. Though I cannot say we are close, he has never withheld information to the detriment of our duties, if that is what you mean...?"},{"name":"VENAS","text":"Forgive us, we seem to have veered slightly off course here. Is there perhaps someone else who could tell us more about Meteion?"},{"name":"ISMENE","text":"That would be Timaios. He has a similar expertise with flying concepts, and is more than eager to discuss the subject."},{"name":"ISMENE","text":"You'll find him conducting his observations on the banks of the stream, somewhere to the east. Oh, and, uh, unless you take a particular joy in rambling discourse, I suggest you keep your questions concise."},{"name":"VENAS","text":"We shall keep that in mind. Thank you for your patience and your insight."},{"name":"ISMENE","text":"Think nothing of it. If there is aught else you need during your stay, please, do not hesitate to ask."},{"name":"VENAS","text":"Come, <span class=\"highlight\">Forename</span>, I think we've taken enough of Ismene's time."},{"name":"ISMENE","text":"You are a familiar, yes? Belonging to Mistress Venat? You couldn't have been blessed with a finer master."},{"name":"VENAS","text":"Our investigation is off to a fine start, wouldn't you agree?"},{"name":"VENAS","text":"From here, I propose that we split up. I shall continue making inquiries with the resident observers, if you could track down the colleague Ismene mentioned."},{"name":"VENAS","text":"Given how you steered that previous conversation, 'tis plain you need no assistance from me."},{"name":"VENAS","text":"While I did feel compelled to interject once or twice during that previous conversation, you seem more than capable of drawing forth the answers you seek."},{"name":"VENAS","text":"Although I felt compelled to take the reins of that previous conversation, your, uh, “fearless” style of interrogation will eventually lead you to the answers you seek."},{"name":"VENAS","text":"All I ask is that you watch your footing around the stream! We can meet back here once you've finished speaking with this Timaios."},{"name":"VENAS","text":"I will start from one side of the compound and make my way through, speaking to as many people as I can. We should have plenty to discuss upon your return."},{"name":"TIMAIOS","text":"Yes, yes, I am Timaios, but please keep your voice down. You'll startle the birds."},{"name":"SYSTEM","text":"The following event cannot be skipped. You may wish to cancel any pending Duty Finder registrations."},{"name":"Q5","text":"Begin asking questions?"},{"name":"TIMAIOS","text":"...So, what is it you wished to speak about?"},{"name":"Q6","text":"What will you say?"},{"name":"A6","text":"Is it true you're an expert on flying creations?"},{"name":"A6","text":"What do you think of Chief Hermes's flying creations?"},{"name":"TIMAIOS","text":"A fellow enthusiast, are you? Well, settle in, and we can discuss the finer points of this fascinating craft!"},{"name":"TIMAIOS","text":"My deep and abiding love of avian artistry can be traced back to when I was but a young boy, stricken by the transcendent beauty of a glorious, golden-feathered creature my father had designed. It was then and there that I vowed to one day surpass that masterpiece..."},{"name":"SYSTEM","text":"Timaios launches into a rambling and unstoppable discourse..."},{"name":"TIMAIOS","text":"...And thus did I secure an observer's role here in Elpis, and at last realize my childhood ambition. Here, the dreams I once dreamed are an everyday reality, in which I find fulfillment through the research and creation of new flying life-forms!"},{"name":"TIMAIOS","text":"An abridged recounting of events, as was doubtless to your disappointment. Is there any specific part you would like me to expound upon...?"},{"name":"TIMAIOS","text":"...Hm? You were hoping for my opinion on Chief Hermes's creations? Then why didn't you say so!?"},{"name":"TIMAIOS","text":"Chief Hermes's work? A worthy subject, indeed..."},{"name":"TIMAIOS","text":"Those beings which soar through the clouds, majestic and graceful, are ever a favorite of creators. Even now, with so many varieties in existence, the flood of newly imagined concepts continues unabated."},{"name":"TIMAIOS","text":"What sets the chief's creations apart, however, is how they benefit from his boundless knowledge of the celestial realm."},{"name":"TIMAIOS","text":"Birds that climb so high that they disappear from view. Others which traverse the boundless sky in moments, and all without riding the currents..."},{"name":"TIMAIOS","text":"I know of none save he who can conceive of such marvels. Even we who prize elegance of form above all else are dumbfounded by his genius."},{"name":"Q7","text":"What will you say?"},{"name":"A7","text":"Why not mimic his process?"},{"name":"A7","text":"Meteion, too, is a marvel, then?"},{"name":"TIMAIOS","text":"What!? You mean <span class=\"emphasis\">plagiarize</span>!?"},{"name":"TIMAIOS","text":"Now, see here. When I take up the threads of creation and begin to weave, I must do so in the belief that I am giving birth to something beautiful. If, in my heart, I knew I was appropriating another's inspiration..."},{"name":"SYSTEM","text":"Timaios launches into a rambling and unstoppable diatribe..."},{"name":"TIMAIOS","text":"...And such an unconscionable, disgraceful act would be deserving of the utmost scorn!"},{"name":"TIMAIOS","text":"Therefore, despite my admiration for Meteion as a concept, I have made a conscious effort not to delve too deeply into the inner workings of her nature."},{"name":"TIMAIOS","text":"My opinion on that matter would be superficial at best..."},{"name":"TIMAIOS","text":"Despite my admiration for Meteion as a concept, I have never delved too deeply into the inner workings of her nature."},{"name":"TIMAIOS","text":"I know that she has a gift for communicating via emotions, but otherwise, her abilities are a mystery to me."},{"name":"TIMAIOS","text":"If Chief Hermes should choose to submit Meteion's concept to the Bureau of the Architect, then will the design be registered for public scrutiny. Analyzing a colleague's creation before that step is...frowned upon, to say the least."},{"name":"TIMAIOS","text":"Of course, if he came to me─a fellow artisan─looking for advice, that would be an entirely different story."},{"name":"Q8","text":"What will you say?"},{"name":"A8","text":"Do you know of dynamis and entelechies?"},{"name":"A8","text":"I could tell you more of Meteion's nature, if you like...?"},{"name":"TIMAIOS","text":"Dynamis and...entelechies?"},{"name":"TIMAIOS","text":"Those terms do sound vaguely familiar... Was there not a flower made here in Elpis which exhibited properties of one or the other?"},{"name":"TIMAIOS","text":"It must have been <span class=\"emphasis\">centuries</span> since I last heard anyone speak of such things. Has there been a resurgence in interest?"},{"name":"TIMAIOS","text":"No, no, no! Did I not just explain how that was frowned upon!? I couldn't possibly circumvent conventional practice by..."},{"name":"TIMAIOS","text":"...Hm. Unless you were sharing such information in the hopes of receiving a constructive opinion...on the application of advanced creation techniques...then I would be practically obligated to..."},{"name":"SYSTEM","text":"Timaios launches into a rambling and unstoppable deluge of justifications..."},{"name":"TIMAIOS","text":"...So you see, ethically I have no choice but to allow you to disclose Meteion's lesser-known qualities!"},{"name":"TIMAIOS","text":"Dynamis...and entelechies?"},{"name":"TIMAIOS","text":"Those terms do sound vaguely familiar... Was there not a flower made here in Elpis which exhibited properties of one or the other?"},{"name":"TIMAIOS","text":"It must have been <span class=\"emphasis\">centuries</span> since I last heard anyone speak of such things. And you know how they relate to Meteion and her design?"},{"name":"TIMAIOS","text":"Then why bring up the subject? I'm flattered that you sought my insight, but I cannot afford to neglect my duties for the sake of idle chatter."},{"name":"TIMAIOS","text":"Now, I really must return to my observations. Surely you have your own tasks to attend to?"},{"name":"TIMAIOS","text":"As I said, I have work to be getting on with. If you wish to speak more, you'll have to wait until I've finished for the day."},{"name":"VENAS","text":"Back already? That was quick work. You were obviously clever enough to head off any of that “rambling” Ismene mentioned."},{"name":"VENAS","text":"Ah, good timing. I finished my own investigations not long ago."},{"name":"VENAS","text":"At last! You were gone so long I was beginning to wonder if you'd slipped into the stream and banged your head, or something equally unfortunate."},{"name":"VENAS","text":"So, have you any new findings to share?"},{"name":"VENAS","text":"I see. Even an expert in the field had little understanding of Meteion's capabilities, let alone an awareness of dynamis."},{"name":"VENAS","text":"My questions resulted in much the same answers. Hermes's colleagues view Meteion as his personal project, and could provide no details beyond those which you just told me."},{"name":"VENAS","text":"Which leads me to believe that the only person with any significant knowledge of dynamis is Hermes himself."},{"name":"VENAS","text":"Yes, we've made some progress here...but more information is needed if we are to reach any definitive conclusions."}],"reward":{"gil":1321},"reqs":{"jobs":[{"lvl":87,"id":142}],"quests":[69965]},"next":[69832,69834,69837,69840,69841,69967]},"partials":[{"type":"npc","id":"1040109","obj":{"i":1040109,"n":"Venat","l":3713,"q":2}},{"type":"npc","id":"1040115","obj":{"i":1040115,"n":"Venat","l":3713,"q":2}},{"type":"quest","id":"69965","obj":{"i":69965,"n":"Travelers at the Crossroads","g":11,"l":"Elpis","s":583}},{"type":"quest","id":"69832","obj":{"i":69832,"n":"Small Size Advantage","g":125,"l":"Elpis","s":5101}},{"type":"quest","id":"69834","obj":{"i":69834,"n":"Naughty Little Ones","g":125,"l":"Elpis","s":5120}},{"type":"quest","id":"69837","obj":{"i":69837,"n":"What's in a Name?","g":125,"l":"Elpis","s":5150}},{"type":"quest","id":"69840","obj":{"i":69840,"n":"To Name a Tale","g":125,"l":"Elpis","s":5180}},{"type":"quest","id":"69841","obj":{"i":69841,"n":"Meaningful Measurements","g":125,"l":"Elpis","s":5190}},{"type":"quest","id":"69967","obj":{"i":69967,"n":"Witness to the Spectacle","g":11,"l":"Elpis","s":585}}]}