{"quest":{"name":"Witness to the Spectacle","location":"Elpis","id":69967,"patch":6.0,"sort":585,"eventIcon":71201,"issuer":1040115,"target":1040128,"genre":11,"journal":["Venat is musing over your recent findings."],"objectives":["Speak with Venat.","Speak with the Peripeteia archivist.","Speak with the Peripeteia archivist again.","Speak with the approachable archivist.","Speak with the unhurried observer.","Speak with Venat."],"dialogue":[{"name":"ISMENE","text":"You are a familiar, yes? Belonging to Mistress Venat? You couldn't have been blessed with a finer master."},{"name":"VENAS","text":"At present, the strongest link we have to the Final Days is the power of dynamis...and the entelechies which can control it."},{"name":"VENAS","text":"Yet most scholars are only vaguely aware of these terms, let alone study them in any depth. Except for Hermes, it seems."},{"name":"VENAS","text":"Thus I am inclined to stay our current course, and learn all we can about the chief overseer and his familiar."},{"name":"VENAS","text":"And on that subject, was there aught else of note you can tell me about Meteion? Aside from her unorthodox method of communication?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"There are more like her. She has sisters..."},{"name":"A1","text":"She and her sisters were created to journey to the stars and search for intelligent life."},{"name":"VENAS","text":"...I rather wish you had mentioned that earlier. In any event, would you care to elaborate?"},{"name":"VENAS","text":"So these siblings of hers now travel the great expanse in search of deeper meaning..."},{"name":"VENAS","text":"Thank you. Though the mystery at hand remains unresolved, I feel you've touched upon a vital clue─one we should keep in mind as we continue."},{"name":"VENAS","text":"Next, I propose we take ourselves to Peripeteia Krystalline, not far from here. Just follow the path to the west."},{"name":"VENAS","text":"This tower and the one further along are both part of Peripeteia Krystalline, the facility where they archive all of Elpis's observational and testing records."},{"name":"VENAS","text":"Despite how they appear from the outside, the interior is actually a vast area of magically interconnected spaces, which...while fascinating, is not the reason we are here, is it?"},{"name":"VENAS","text":"I shall cut my architectural lesson short, and see what those two archivists have to share."},{"name":"VENAS","text":"If you could find someone to speak with over at the other tower, I shall join you there anon."},{"name":"VENAS","text":"How odd that I should suggest this approach without a second thought..."},{"name":"VENAS","text":"You've come from a time and place that is dramatically different. Yet here we are, working side by side─or apart, as the situation demands─with barely a word of explanation required."},{"name":"VENAS","text":"No matter the centuries which separate us, we are of the same star. We share a connection. And I hope that together, we might find the answers you seek."},{"name":"PERIPETEIASTAFFA04431","text":"You have questions for me? Certainly! Just a moment while I conclude my current appointment..."},{"name":"PERIPETEIASTAFFA04431","text":"...Indeed. So if you could provide a comprehensive log of those behaviors, we should then have sufficient data for our official records."},{"name":"PERIPETEIASTAFFA04431","text":"Now, what was it you wished to speak with me about?"},{"name":"PERIPETEIASTAFFA04431","text":"...The chief overseer's “personal research project”? And by that, I assume you mean Meteion?"},{"name":"PERIPETEIASTAFFA04431","text":"Such undocumented studies are difficult to track. After all, hardly a day goes past without seeing a researcher trailed by one creation or another..."},{"name":"PERIPETEIASTAFFA04431","text":"I'm afraid I cannot tell you exactly when Meteion appeared. Only that she now spends much of her time at Chief Hermes's side."},{"name":"PERIPETEIASTAFFA04431","text":"Although... I do recall an interesting tale my dearest Galene shared with me..."},{"name":"PERIPETEIASTAFFA04431","text":"...Ah. Galene is my partner, and a fellow researcher here in Elpis."},{"name":"PERIPETEIASTAFFA04431","text":"She was returning late one night when she caught sight of Chief Hermes sending Meteion heavensward. A host of them."},{"name":"PERIPETEIASTAFFA04431","text":"For several days, she would speak of that scene with wonder, describing it as one of the most beautiful spectacles she had ever witnessed."},{"name":"VENAS","text":"That sounds like a story I should like to hear."},{"name":"PERIPETEIASTAFFA04431","text":"Mistress Venat! I thought you had already returned to the surface!"},{"name":"PERIPETEIASTAFFA04431","text":"Permit me to thank you again for your invaluable contribution to our concept placement proposal."},{"name":"VENAS","text":"Pray do not mention it. As you say, my original plan was to leave after that task, but I have since become engrossed with Chief Hermes's research."},{"name":"VENAS","text":"Would you favor me with a retelling of this sight which so delighted your Galene?"},{"name":"PERIPETEIASTAFFA04431","text":"Of course. Or you could hear it from her lips directly, if you prefer?"},{"name":"PERIPETEIASTAFFA04431","text":"At present, she should be observing a subject in Metabaseos Thalassai."},{"name":"PERIPETEIASTAFFA04431","text":"She does enjoy her time there, watching the sea creatures hunt and play; gazing upon the salty waters of the world's oceans, recreated in such sublime detail."},{"name":"PERIPETEIASTAFFA04431","text":"I imagine you must find similar joy in indulging your boundless curiosity, Mistress Venat..."},{"name":"PERIPETEIASTAFFA04431","text":"Even though such pursuits must continually and regretfully delay your return to the star."},{"name":"VENAS","text":"...Indeed they do."},{"name":"PERIPETEIASTAFFA04431","text":"'Tis a rest well deserved and long overdue, I should think. How greatly have we prospered for the wisdom you accumulated during your travels as Azem."},{"name":"PERIPETEIASTAFFA04431","text":"And what would Elpis be without your earlier academic work? The theories you developed served as the basis of many techniques still in use today."},{"name":"PERIPETEIASTAFFA04431","text":"Man is a creature of contemplation, but none embody that nature with as much enduring passion as you! Aye, I daresay there is not a soul alive more worthy of a return. I shall rejoice the day you depart on your final journey."},{"name":"VENAS","text":"...I will be honored."},{"name":"VENAS","text":"Well, shall we take this opportunity to meet with Galene in person?"},{"name":"PERIPETEIASTAFFA04431","text":"Then allow me to reconfigure the door to the archives here."},{"name":"PERIPETEIASTAFFA04431","text":"It will take you up to the skyway, and spare you the need to avoid hostile concepts on the ground."},{"name":"VENAS","text":"That would be most helpful, thank you."},{"name":"VENAS","text":"The other archivists said naught we hadn't already heard, but this story of Galene's sounds promising..."},{"name":"PERIPETEIASTAFFA04431","text":"I have opened the path to the skyway."},{"name":"PERIPETEIASTAFFA04431","text":"Once you pass through the door, simply walk straight across to the next tower and ask for admittance to the upper tier."},{"name":"PERIPETEIASTAFFA04431","text":"Upon arriving at the upper tier, walk straight across the skyway, and you will find yourself at the entrance to Metabaseos Thalassai."},{"name":"PERIPETEIASTAFFA04431","text":"Galene will be eager to share her tale with you, I am sure."},{"name":"VENAS","text":"The tower ahead is still part of Peripeteia Krystalline. We will need to ask for passage through to the upper tier."},{"name":"PERIPETEIASTAFFA04431","text":"Do you need to return to the skyway?"},{"name":"Q2","text":"Move to the skyway?"},{"name":"PERIPETEIASTAFFB04431","text":"Mistress Venat! Just passing through...?"},{"name":"PERIPETEIASTAFFB04431","text":"Then allow me to prepare the path. If you need further assistance, there is always an observer or two out on the upper skyway."},{"name":"VENAS","text":"That door leads into the Thalassai, but perhaps we can trouble this person for assistance with finding Galene."},{"name":"PERIPETEIASTAFFB04431","text":"Passing through to Metabaseos Thalassai? Allow me to link the door to the upper skyway..."},{"name":"Q3","text":"Move to the upper skyway?"},{"name":"METABASEOSSTAFF04431","text":"...Mistress Venat!? I was not told to expect─ We would have prepared an official welcome!"},{"name":"VENAS","text":"Please, there is no need for fanfare. I only wish to speak with Galene, if that might be arranged...?"},{"name":"METABASEOSSTAFF04431","text":"Yes! Galene! Of course! I will inform her immediately."},{"name":"METABASEOSSTAFF04431","text":"Ah, but she may be engaged in a testing phase. You could be in for something of a wait... Should I let her know your business is urgent?"},{"name":"VENAS","text":"That won't be necessary. This lovely view will keep us occupied until she is ready to receive us."},{"name":"VENAS","text":"So, another piece of the puzzle falls into place."},{"name":"VENAS","text":"From what we've learned thus far, I think we can safely conclude that Hermes hasn't been revealing the details of his research to others."},{"name":"VENAS","text":"Which suggests that either someone will appropriate his discoveries and make use of them...or that Hermes himself will have a hand in causing the Final Days."},{"name":"VENAS","text":"Since we have no reason yet to suspect the former, we should consider the latter the more likely possibility. Proceeding under that assumption, our next step should be to divine why─or even if─he might desire such a terrible fate for our star."}],"reward":{"gil":1194,"items":[{"id":35697}]},"reqs":{"jobs":[{"lvl":87,"id":142}],"quests":[69966]},"next":[69835,69843,69846,69848,69850,69851,69968]},"partials":[{"type":"npc","id":"1040115","obj":{"i":1040115,"n":"Venat","l":3713,"q":2}},{"type":"npc","id":"1040128","obj":{"i":1040128,"n":"Venat","l":3713,"q":2}},{"type":"item","id":"35697","obj":{"i":35697,"n":"Ironwood Head Gear Coffer (IL 539)","l":1,"c":26558,"t":61}},{"type":"quest","id":"69966","obj":{"i":69966,"n":"A Past, Not Yet Come to Pass","g":11,"l":"Elpis","s":584}},{"type":"quest","id":"69835","obj":{"i":69835,"n":"Floating Like Clouds","g":125,"l":"Elpis","s":5130}},{"type":"quest","id":"69843","obj":{"i":69843,"n":"Woken by the Familiar","g":125,"l":"Elpis","s":6110}},{"type":"quest","id":"69846","obj":{"i":69846,"n":"Very Familiar Carrots","g":125,"l":"Elpis","s":6140}},{"type":"quest","id":"69848","obj":{"i":69848,"n":"A Most Succulent Name","g":125,"l":"Elpis","s":6160}},{"type":"quest","id":"69850","obj":{"i":69850,"n":"Taking the Minutes: Ktisis Hyperboreia","g":125,"l":"Elpis","s":6180}},{"type":"quest","id":"69851","obj":{"i":69851,"n":"Terror on Two Legs","g":125,"l":"Elpis","s":6190}},{"type":"quest","id":"69968","obj":{"i":69968,"n":"Worthy of His Back","g":11,"l":"Elpis","s":586}}]}