{"quest":{"name":"Worthy of His Back","location":"Elpis","id":69968,"patch":6.0,"sort":586,"eventIcon":71201,"issuer":1040128,"target":1040129,"genre":11,"journal":["Venat has a new course of investigation in mind."],"objectives":["Survey the area from the vantage point.","Speak with Venat.","Speak with Venat again."],"dialogue":[{"name":"VENAS","text":"I should like to visit the site from which Hermes sent forth the Meteia. If we are fortunate, we might find some hint of what drives this research of his."},{"name":"VENAS","text":"Galene said she spotted them in the southeast, rising from an isle she could see from the edge."},{"name":"VENAS","text":"If we stand at that same vantage point, it should not prove too difficult to locate the isle in question. Let's take a look, shall we?"},{"name":"VENAS","text":"Now, if I were conducting some mystery research, where would I go...?"},{"name":"VENAS","text":"...Ah. What about that one?"},{"name":"VENAS","text":"Have you the means to fly? 'Tis quite a distance away."},{"name":"VENAS","text":"Hm. Inconvenient, but hardly an insurmountable problem."},{"name":"VENAS","text":"To me, Argos!"},{"name":"VENAS","text":"My friend, would you mind creating a double to carry <span class=\"highlight\">Forename</span> here over to that island?"},{"name":"ARGOS","text":"..."},{"name":"VENAS","text":"Stubborn creature. There is no place on this great star we have not together traveled, and still he remains obstinate in the presence of strangers."},{"name":"VENAS","text":"Argos has rather exacting standards, I'm afraid."},{"name":"VENAS","text":"What? You've ridden him before...? Ah─your “before” meaning my “after.” Not at all confusing, that."},{"name":"VENAS","text":"Interesting. 'Tis certainly not unthinkable..."},{"name":"VENAS","text":"But speaking of the here and now, the quick solution is for us to face off in a sparring match."},{"name":"VENAS","text":"Demonstrate to him that you are capable of holding your own against me in battle, and you should convince Argos that you are worthy of his back."},{"name":"VENAS","text":"And besides, I might even teach you a thing or two into the bargain."},{"name":"VENAS","text":"You seem doubtful. But useful lesson or not, it will certainly be a moment to remember─a memory of the distant past to cherish!"},{"name":"VENAS","text":"What say you, traveler out of time?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Choose your battlefield!"},{"name":"A1","text":"I will do what I must."},{"name":"A1","text":"And if this memory turns out to be a bad one...?"},{"name":"VENAS","text":"I admire your confidence!"},{"name":"VENAS","text":"I had a feeling you might say something like that. Know that you “must” give a good showing, however!"},{"name":"VENAS","text":"That's up to you, isn't it? If a loss would sting, then you had better win!"},{"name":"VENAS","text":"Clear your mind and prepare your weapons. I will await you at the clearing over yonder."},{"name":"SYSTEM","text":"The entity is identical to the one you encountered in Mare Lamentorum...except <span class=\"emphasis\">this</span> Argos is pointedly ignoring you."},{"name":"VENAS","text":"Shall we begin? Be warned: I'll not go easy on you!"},{"name":"SYSTEM","text":"You must be a Disciple of War or Magic of level 87 or above to proceed."},{"name":"VENAS","text":"Argos will soon have us standing on the very spot where the Meteia made their departure into the night sky. With luck, we will learn something of Hermes's intentions."},{"name":"VENAS","text":"My hope is that we find no connection─no festering wish for oblivion. Then we might have Hermes and his considerable expertise working for us, rather than against us."}],"reward":{"gil":2292},"reqs":{"jobs":[{"lvl":87,"id":142}],"quests":[69967]},"next":[69969]},"partials":[{"type":"npc","id":"1040128","obj":{"i":1040128,"n":"Venat","l":3713,"q":2}},{"type":"npc","id":"1040129","obj":{"i":1040129,"n":"Venat","l":3713,"q":2}},{"type":"quest","id":"69967","obj":{"i":69967,"n":"Witness to the Spectacle","g":11,"l":"Elpis","s":585}},{"type":"quest","id":"69969","obj":{"i":69969,"n":"A Flower upon Your Return","g":11,"l":"Elpis","s":587}}]}