{"quest":{"name":"Their Greatest Contribution","location":"Elpis","id":69961,"patch":6.0,"sort":579,"icon":101123,"eventIcon":71201,"issuer":1040050,"target":1040069,"genre":11,"journal":["Emet-Selch appears to be deep in thought.","On account of his conversance with the celestial, Emet-Selch believes that Hermes would be a welcome addition to the Convocation─assuming he is inclined to join. For now, you settle in for more observation as the chief overseer of Elpis goes about his work.","Having inspected the ampelos to his satisfaction, Hermes will next look in on a creature that is reportedly having problems─the charybdis. To that end, you make your way to the northern edge of Philomythes Notos.","You learn that a third-generation charybdis is unable to fly due to its aetheric balance leaning strongly towards water. Though the observer in charge wishes to revert the specimen and its kind, having deemed them a lost cause, Hermes is loath to give up on them, and offers to transform in order to guide the creature skyward. The proposal is met with shock and dismay, for transforming in public is considered vainglorious and unseemly. While Hermes seems willing to bear the shame if it means saving the creatures, Emet-Selch is not wholly convinced. It is then that Hythlodaeus conceives of a solution. For this, he sends Emet-Selch off with the charybdis, while you and the others remain to assist him with the necessary preparations.","Wearing a conspiratorial grin, Hythlodaeus reveals to you his grand plan: having Emet-Selch assist the charybdis. For your part, you are tasked with going to the man and making the initial plea. With the chat mode in <span class=\"highlight\">Say</span>, say “I have a favor to ask” to indicate to Emet-Selch that you have a request.","As you had been warned, Emet-Selch is disinclined to cooperate, but persistence is the key. With the chat mode in <span class=\"highlight\">Say</span>, say “Please, Emet-Selch” to batter the man's bulwark of petulant defiance.","Beneath the combined weight of your incessant nagging, Emet-Selch finally caves and agrees to assist the charybdis. As he tends to the creature, you enjoy a quiet conversation with Hythlodaeus, who speaks of Emet-Selch and their mutual friend with great fondness and admiration. The tale draws to a close just as the charybdis appears to find its wings, and Hythlodaeus bids you signal to Emet-Selch that he may return to the ground. A simple /wave should do the trick.","While the observer is impressed that the charybdis can in fact fly, he remains of the opinion that it would be better to simply have their concept adjusted. Hermes, however, is adamant that they continue to be given a chance to prove themselves a worthy addition to the star, and his underling acquiesces before taking his leave. With that, Hermes declares all his present tasks complete, and you set off together back to Anagnorisis.","In observing Hermes performing his duties, you have gained some insight into the workings of Elpis, but thus far have uncovered no clear connection to the Final Days. For the sake of the star and all you hold dear, you must keep searching for clues."],"objectives":["Speak with Hermes.","Speak with Hermes again.","Speak with Hythlodaeus.","With the chat mode in <span class=\"highlight\">Say</span>, enter “I have a favor to ask” to Emet-Selch.","With the chat mode in <span class=\"highlight\">Say</span>, enter “Please, Emet-Selch” to Emet-Selch.","/wave to Emet-Selch from the edge of the isle.","Speak with Emet-Selch."],"dialogue":[{"name":"HYTHLODAEUS","text":"Never before had I heard of dynamis or entelechies. I can only assume the Elpis flower was submitted to the bureau before I joined."},{"name":"METEION","text":"Entelechy or no, we're friends! In thinness!"},{"name":"HERMES","text":"All appears to be well. This shouldn't take long."},{"name":"EMETSELCH","text":"Not that I or anyone else would be able to make use of it even if we knew..."},{"name":"EMETSELCH","text":"But it irks me to discover that there is an entirely different form of energy─and <span class=\"emphasis\">no one told me</span>."},{"name":"EMETSELCH","text":"That personal annoyance aside, Hermes's knowledge is undeniably impressive. Given that there are none among the Fourteen who specialize in the celestial, he would be a welcome addition."},{"name":"EMETSELCH","text":"Assuming he can be persuaded to join, that is. I still can't understand his hesitation..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Why did you join the Convocation?"},{"name":"A1","text":"What do you specialize in?"},{"name":"HYTHLODAEUS","text":"Oho, you wish to know why Emet-Selch was chosen for the Convocation? I should be glad to share the tale!"},{"name":"HYTHLODAEUS","text":"Ahem. It began when..."},{"name":"EMETSELCH","text":"Not. Another. Word."},{"name":"EMETSELCH","text":"Lest you've forgotten, we're to learn about Hermes. Not me. My misspent youth is not your concern."},{"name":"HYTHLODAEUS","text":"(I'll tell you the tale when we're away from sensitive ears.)"},{"name":"EMETSELCH","text":"&lt;sigh&gt; What now?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I want to learn about the Convocation."},{"name":"A2","text":"Actually...never mind."},{"name":"EMETSELCH","text":"Hmmm... If you would accompany us, I suppose you should at least know that much."},{"name":"EMETSELCH","text":"The Convocation of Fourteen is a governing body that determines myriad policies. Our goal is to ensure that all is right in creation, that our star may know a brighter future."},{"name":"EMETSELCH","text":"As the name suggests, the council is comprised of fourteen offices, each of which is held by an individual chosen for their surpassing abilities."},{"name":"EMETSELCH","text":"Depending on the office, one is required to either be an authority in a certain field, or possess skills that would facilitate the performance of their stipulated duties."},{"name":"EMETSELCH","text":"The former category includes Mitron, specialist in aquatic life; Loghrif, specialist in terrestrial life and husbandry..."},{"name":"EMETSELCH","text":"Halmarut, specialist in fungal and plant life; Emmerololth, specialist in medicine and healing..."},{"name":"EMETSELCH","text":"And Lahabrea, specialist in creation magicks, who has brought forth phantom beings of the highest complexity."},{"name":"EMETSELCH","text":"As for the latter category, there is Altima, advocate of the arts; Igeyorhm, champion of enlightenment and rhetoric; Pashtarot, preserver of discipline and order..."},{"name":"EMETSELCH","text":"Emet-Selch, keeper of the aetherial realm─or “Underworld” in the vernacular; Fandaniel, pursuer of extant phenomena..."},{"name":"EMETSELCH","text":"And Azem, traveler of the world and counselor to the people."},{"name":"EMETSELCH","text":"...What? Should I be revealing such details to you? Don't be silly. Even children know this much, and you would do well to remember it all."},{"name":"EMETSELCH","text":"Then why did you bother me!? &lt;sigh&gt; Honestly, I'm beginning to think you were created for the sole purpose of trying my patience..."},{"name":"HERMES","text":"My apologies for the wait. I have inspected the ampelos to my satisfaction."},{"name":"HERMES","text":"All is well with the creature, and I daresay it won't be long ere it is released unto the world."},{"name":"HERMES","text":"Another creation, however, reportedly isn't faring so well─the charybdis."},{"name":"HERMES","text":"That is what we shall tend to next."},{"name":"HERMES","text":"If you would follow me, my friends, we shall return to the main isle and head north."},{"name":"EMETSELCH","text":"A serpentine bird...or a winged snake?"},{"name":"HYTHLODAEUS","text":"There is a slight difference in aetheric balance between these charybdises."},{"name":"HYTHLODAEUS","text":"By this, it may be assumed that they aren't the original creations, but their offspring."},{"name":"METEION","text":"Why is this one blue and shiny...?"},{"name":"ANAGNORISISSTAFF04425","text":"Uwaaah! ...Oh, forgive me, I thought another member of the Convocation had come. This is turning out to be an eventful day..."},{"name":"HERMES","text":"I understand there is a problem with one of the charybdis."},{"name":"ANAGNORISISSTAFF04425","text":"Yes, that's right."},{"name":"ANAGNORISISSTAFF04425","text":"As you know, the charybdis is based on a sea creature. Owing to adjustments to enhance its affinity to wind, it is capable of flight."},{"name":"ANAGNORISISSTAFF04425","text":"The specimens created from the concept could all fly without issue, but a problem arose in subsequent generations."},{"name":"ANAGNORISISSTAFF04425","text":"This third-generation creature was born with an aetheric balance leaning strongly towards water. Its aquatic origin reasserting itself, it would seem..."},{"name":"ANAGNORISISSTAFF04425","text":"The result being its affinity to wind is diminished, and it cannot fly. No matter what we try, we can't get it to rise even the slightest bit."},{"name":"ANAGNORISISSTAFF04425","text":"For such change to manifest in so few generations... I fear they are too unstable. Flawed."},{"name":"ANAGNORISISSTAFF04425","text":"With your permission, I will revert the creatures, and recommend to the bureau that the concept be revised."},{"name":"HERMES","text":"...With its aetheric balance leaning towards water, the charybdis would indeed struggle to manipulate wind."},{"name":"HERMES","text":"Yet it is too early to conclude that it cannot fly. Having failed at first, it may simply have developed a fear."},{"name":"HERMES","text":"I shall transform and fly with it, helping it to manipulate wind until it finds its wings."},{"name":"ANAGNORISISSTAFF04425","text":"What!? Y-You needn't go to such lengths..."},{"name":"EMETSELCH","text":"You don't know? &lt;sigh&gt; But of course not..."},{"name":"EMETSELCH","text":"Transformation is an art in which one manipulates a vast quantity of aether to construct another body around oneself."},{"name":"EMETSELCH","text":"In practice, this allows one to assume any conceivable form, and thereby transcend the limits of one's flesh."},{"name":"EMETSELCH","text":"Yet convenient though it may be, transforming in the presence of others is considered vainglorious in the extreme. As uncouth and unseemly as running about robeless. Shameful."},{"name":"EMETSELCH","text":"Am I to understand you make a habit of this?"},{"name":"HERMES","text":"N-Nothing of the sort. It's just that, when transformed, I can wield the wind and fly."},{"name":"HERMES","text":"It may seem excessive, but what is our shame next to the lives of these creatures?"},{"name":"HERMES","text":"They deserve a chance, and we owe it to them to do all in our power!"},{"name":"EMETSELCH","text":"Be that as it may..."},{"name":"HYTHLODAEUS","text":"Hmmm..."},{"name":"HYTHLODAEUS","text":"Yes, I believe I have a solution. Emet-Selch─may I trouble you to move that charybdis away from its fellows? Somewhere out of sight."},{"name":"HYTHLODAEUS","text":"Meanwhile, I'd like the rest of you to help me prepare here."},{"name":"EMETSELCH","text":"What mischief are you scheming now?"},{"name":"HYTHLODAEUS","text":"No mischief, I assure you. I would but spare you the need to report to your colleagues that Hermes committed an indiscretion."},{"name":"HYTHLODAEUS","text":"So have a little faith, and run along."},{"name":"EMETSELCH","text":"I trust you don't mind?"},{"name":"EMETSELCH","text":"Well? Are your preparations for the scheme that is clearly not a scheme complete?"},{"name":"HERMES","text":"Hythlodaeus is a man of ideas. I wonder what he has thought up this time..."},{"name":"METEION","text":"We must help the charybdis to fly. Or else they will all die!"},{"name":"ANAGNORISISSTAFF04425","text":"Such bother when we could simply begin anew... But I shall defer to the chief overseer."},{"name":"HYTHLODAEUS","text":"Emet-Selch is out of sight? Good. Let's speak of the plan."},{"name":"HYTHLODAEUS","text":"It's a stroke of genius, really: we have Emet-Selch train the charybdis!"},{"name":"HYTHLODAEUS","text":"Aside from being able to fly untransformed, he can readily see aether currents."},{"name":"HYTHLODAEUS","text":"And with his adept spellcraft, he can also employ suitable wind magicks to guide the creature along."},{"name":"HERMES","text":"While he is indeed capable of all you described, it is not his duty. I am loath to trouble him with it."},{"name":"HYTHLODAEUS","text":"Don't be! As I mentioned, it would also be for his own sake. With that settled, let's begin at once!"},{"name":"HYTHLODAEUS","text":"<span class=\"highlight\">Forename</span>─I want you to go to Emet-Selch. Tell him that you have a favor to ask."},{"name":"HYTHLODAEUS","text":"He will be disinclined to cooperate at first, but you mustn't be discouraged. With our friend, the trick is to be unflaggingly persistent."},{"name":"HYTHLODAEUS","text":"Off you go, now, and good luck!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase containing the words “I have a favor to ask” to indicate to Emet-Selch that you have a request."},{"name":"HYTHLODAEUS","text":"The rest of us will be right behind you. We wouldn't think to miss the fun!"},{"name":"HERMES","text":"With apologies to Emet-Selch, but this may be the best approach. Let us work together to win him over! "},{"name":"METEION","text":"I'll persist too!"},{"name":"ANAGNORISISSTAFF04425","text":"M-Me...? Uh...perhaps it's best if I watched from afar..."},{"name":"SAYTODO","text":"I have a favor to ask"},{"name":"EMETSELCH","text":"Well? Are your preparations for the scheme that is clearly not a scheme complete?"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase containing the words “I have a favor to ask” to indicate to Emet-Selch that you have a request."},{"name":"EMETSELCH","text":"Oh no you don't! I'm not lifting a finger!"},{"name":"EMETSELCH","text":"Ugh. I don't know what Hythlodaeus is up to, and I will <span class=\"emphasis\">not</span> be made to know. I refuse!"},{"name":"SYSTEM","text":"If Hythlodaeus is to be believed, relentless insistence may serve to wear down the ever-weary Emet-Selch..."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase containing the words “Please, Emet-Selch” to plead with Emet-Selch."},{"name":"SAYTODO","text":"Please, Emet-Selch"},{"name":"EMETSELCH","text":"You may tell Hythlodaeus he can contrive another brilliant solution─one that doesn't involve me!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase containing the words “Please, Emet-Selch” to plead with Emet-Selch."},{"name":"HYTHLODAEUS","text":"If I didn't know better, I'd say Emet-Selch is enjoying himself. Not that he'd ever deign to admit it."},{"name":"HERMES","text":"It's flying... It's really flying, as if it were born to do so... Thank goodness..."},{"name":"METEION","text":"Look, <span class=\"highlight\">Forename</span>! Look how well the charybdis flies!"},{"name":"SYSTEM","text":"The charybdis appears to be the subject of Emet-Selch's undivided attention. You may need to <span class=\"highlight\">wave</span> rather forcefully in his general direction to remind him that you and the others exist."},{"name":"SYSTEM","text":"Emerging from his reverie, Emet-Selch notices you, and begins to descend with the charybdis..."},{"name":"HERMES","text":"I have no words to express my gratitude. Thanks to you, the charybdis has learned to fly."},{"name":"HYTHLODAEUS","text":"And <span class=\"highlight\">Forename</span> and I could relax and have a pleasant chat."},{"name":"EMETSELCH","text":"I'm sure you did."},{"name":"EMETSELCH","text":"The creature needed some small assistance at first, but soon it was flying more or less on its own. I doubt you will need to repeat the lesson."},{"name":"ANAGNORISISSTAFF04425","text":"That was truly impressive!"},{"name":"ANAGNORISISSTAFF04425","text":"I witnessed it all from afar─the charybdis flies!"},{"name":"HERMES","text":"Indeed. With this, we've proven that even a creature with skewed aetheric balance is capable of flight."},{"name":"HERMES","text":"Though we helped it to achieve this, the charybdis is a herd animal. They may well aid their struggling kin in like fashion if and when the need arises."},{"name":"HERMES","text":"Keeping this in mind, I bid you continue observing them."},{"name":"ANAGNORISISSTAFF04425","text":"If that is what you want..."},{"name":"ANAGNORISISSTAFF04425","text":"But if I may say so, rather than hoping an idealistic possibility comes to pass, would it not be simpler to have the concept adjusted? That way, we could guarantee that anomalies such as this specimen are never born in the first place."},{"name":"HERMES","text":"These creatures are already here. We will spare no effort in giving them a chance to survive."},{"name":"ANAGNORISISSTAFF04425","text":"As you wish, Chief. As you wish."},{"name":"METEION","text":"Hermes..."},{"name":"HERMES","text":"I'm fine. Don't worry."},{"name":"HERMES","text":"Well, that concludes all of my present tasks."},{"name":"HERMES","text":"Let us return to Anagnorisis for now."},{"name":"HYTHLODAEUS","text":"I thoroughly enjoyed myself─at the end most of all!"},{"name":"HERMES","text":"Now you've seen what I do. Was it everything you were expecting...?"},{"name":"METEION","text":"All the creations are happy. That makes me happy too!"},{"name":"EMETSELCH","text":"...What? Want to apologize for forcing me to help, do you?"},{"name":"EMETSELCH","text":"Save your breath. You didn't force me to do anything─I merely chose the most expeditious way to have done with an impediment to our business."}],"reward":{"gil":1312,"items":[{"id":35700}]},"reqs":{"jobs":[{"lvl":86,"id":142}],"quests":[69960]},"next":[69815,69820,69821,69822,69823,69962,70043]},"partials":[{"type":"npc","id":"1040050","obj":{"i":1040050,"n":"Emet-Selch","l":3713,"q":1}},{"type":"npc","id":"1040069","obj":{"i":1040069,"n":"Emet-Selch","l":3713,"q":1}},{"type":"item","id":"35700","obj":{"i":35700,"n":"Ironwood Leg Gear Coffer (IL 539)","l":1,"c":26561,"t":61}},{"type":"quest","id":"69960","obj":{"i":69960,"n":"Lives Apart","g":11,"l":"Elpis","s":578}},{"type":"quest","id":"69815","obj":{"i":69815,"n":"Nothing to Sneeze At","g":125,"l":"Elpis","s":3130}},{"type":"quest","id":"69820","obj":{"i":69820,"n":"Second Guest","g":125,"l":"Elpis","s":3180}},{"type":"quest","id":"69821","obj":{"i":69821,"n":"Labors of My Fruit","g":125,"l":"Elpis","s":3190}},{"type":"quest","id":"69822","obj":{"i":69822,"n":"I Order You to Relax","g":125,"l":"Elpis","s":4101}},{"type":"quest","id":"69823","obj":{"i":69823,"n":"We'll Meet Again","g":125,"l":"Elpis","s":4110}},{"type":"quest","id":"69962","obj":{"i":69962,"n":"Aether to Aether","g":11,"l":"Elpis","s":580}},{"type":"quest","id":"70043","obj":{"i":70043,"n":"Touring Anagnorisis, Part I","g":125,"l":"Elpis","s":4111,"f":1}}]}