{"quest":{"name":"A Flower upon Your Return","location":"Elpis","id":69969,"patch":6.0,"sort":587,"icon":101125,"eventIcon":71201,"issuer":1040129,"target":1040135,"genre":11,"journal":["Venat has Argos and his double at heel.","Having proven yourself to him, Argos is now willing to lend you his back. Venat suggests you move over to the edge to give your mounts a better launching point.","Argos delivers you and Venat to the isle, where at first you find nothing out of the ordinary. Venat suggests a glimpse into the past, which reveals to you a conversation wherein Meteion reports to Hermes on the progress of her star-faring sisters. The chief overseer's vow to accept their discoveries with an open mind gives no impression that he might desire an apocalyptic end to the world─indeed, you return to the larger island intent on recruiting his help in solving the mystery of the Final Days.","Venat directs your search for Hermes to Ktisis Hyperboreia─the largest facility in Elpis. The path to this facility lies to the north of Poieten Oikos, where a teleporter will transport you to Ethoseletikos Boreas.","You have arrived in Ethoseletikos Boreas. Venat stands nearby with further instructions.","The former Azem gives you directions to Ktisis Hyperboreia, before setting off for the facility herself. It seems all you need do is follow the road to the crossroads, then turn left...","You meet with Venat at the door to the facility, but just as you make to venture inside, you come face-to-face with Emet-Selch and Hythlodaeus. After hearing the results of their investigations, you realize that all have arrived at much the same conclusions with regards to the chief overseer and his research. It is then agreed that if the true nature of the Final Days is to be understood, you will need to enlist the aid of Hermes himself."],"objectives":["Approach Argos.","Speak with Venat.","Travel from northerly Zephyrneus to southerly Boreneus.","Speak with Venat.","Speak with Venat again."],"dialogue":[{"name":"VENAS","text":"Let us move over to the edge before mounting, shall we?"},{"name":"VENAS","text":"That will allow Argos to catch the currents rising up from below, and give us a smooth ride over to the isle."},{"name":"VENAS","text":"Climb onto Argos's back and we can be off. ...You know, I honestly cannot remember the last time he carried anyone but me."},{"name":"SYSTEM","text":"Argos motions to his back with his muzzle. You've been given the go-ahead to hop on!"},{"name":"Q1","text":"Ride Argos to the isle?"},{"name":"SYSTEM","text":"Argos launches into the air with a powerful leap!"},{"name":"VENAS","text":"Isn't this pleasant? Argos certainly seems to think so."},{"name":"VENAS","text":"Now, what was the name of that tree...?"},{"name":"VENAS","text":"Noe...something... Ah! Noetophoreon! Quite a striking specimen, is it not?"},{"name":"VENAS","text":"Brace yourself for the landing─I wouldn't want you tumbling off at the last moment."},{"name":"VENAS","text":"There are any number of places where Hermes might be in Elpis..."},{"name":"VENAS","text":"But we could do worse than to look in Ktisis Hyperboreia, the largest facility. It stands in Ethoseletikos Boreas, the northern isle."},{"name":"VENAS","text":"I wonder, <span class=\"highlight\">Forename</span>─for an institution which claims to studiously research every species destined for release into the world, did you not question how they find room for them all on so few islands?"},{"name":"VENAS","text":"The answer lies within Ktisis itself. I touched upon the practice before back at the archives, where a vast area is stitched together out of multiple conceptual spaces. The same holds true for the interior of this facility and its magically constructed environs."},{"name":"VENAS","text":"'Tis there, within those sprawling habitats, that the chief overseer and most of Elpis's observers conduct the bulk of their work."},{"name":"VENAS","text":"Come, the simplest route is via the neus north of Poieten Oikos..."},{"name":"SYSTEM","text":"This appears to be the teleporter Venat told you about."},{"name":"SYSTEM","text":"Motes of light yet hang in the air, suggesting the device was but recently activated..."},{"name":"Q2","text":"Proceed to Ethoseletikos Boreas?"},{"name":"VENAS","text":"Ah, good, the neus acknowledged you as my guest. You should now have the authority to use it as you wish."},{"name":"VENAS","text":"As for the way to Ktisis Hyperboreia, we follow this path, then turn left at the crossroads."},{"name":"VENAS","text":"Here we are: the grandest research facility in Elpis."},{"name":"VENAS","text":"We should head inside and ask after Hermes's whereabouts..."},{"name":"HYTHLODAEUS","text":"(-???-)Hermes is at another facility...as we have just discovered."},{"name":"HYTHLODAEUS","text":"Furthermore, we've confirmed that his studies into dynamis, as well as his creation of Meteion, were entirely private pursuits."},{"name":"HYTHLODAEUS","text":"No one else we spoke with appeared to possess the chief's depth of knowledge on the subject, and neither did we hear any tales of stolen research."},{"name":"HYTHLODAEUS","text":"Which means that if Hermes himself harbors no desire to bring down an apocalypse, then he might be recruited to help prevent one..."},{"name":"HYTHLODAEUS","text":"...Or so sayeth the illustrious Emet-Selch."},{"name":"EMETSELCH","text":"According to your story, the Fourteen divined the connection between the celestial currents and the Final Days, but were never able to pinpoint the root cause of the calamity."},{"name":"EMETSELCH","text":"With our people's greatest minds─not to mention Hythlodaeus's sharp eyes─committed to the pursuit of a solution, such an outcome seems...inconceivable."},{"name":"EMETSELCH","text":"The only possible explanation is if the nature of the catalyst was so inexplicable that even we failed to perceive it."},{"name":"EMETSELCH","text":"And what better fits that description than the invisible, intangible dynamis?"},{"name":"HYTHLODAEUS","text":"Which in turn, leads us to our next question: how did Hermes, in his role as Fandaniel, not recognize the subject of his own research?"},{"name":"HYTHLODAEUS","text":"We must assume that he either knew and was unable to help, or that he was otherwise prevented from identifying the cause in the first place. At this juncture, all we can do is speculate."},{"name":"EMETSELCH","text":"To be clear, the Convocation does not tolerate acts of deception or malice. We are practiced at perceiving truth, and would have known had Fandaniel lied to us."},{"name":"EMETSELCH","text":"Hermes has no conscious wish for the world to end. Of that, I am certain."},{"name":"VENAS","text":"It seems there is more to the tale after all."},{"name":"VENAS","text":"We conducted an investigation of our own, you see..."},{"name":"EMETSELCH","text":"How comforting... We seem to have reached the exact same conclusion."},{"name":"EMETSELCH","text":"I see no reason to delay further. 'Tis time we brought Hermes into the fold, as it were."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Thank you for your understanding."},{"name":"A3","text":"..."},{"name":"EMETSELCH","text":"Save your thanks. I did not say I believed your ridiculous story."},{"name":"EMETSELCH","text":"This does not mean I believe your ridiculous story."},{"name":"EMETSELCH","text":"But as Emet-Selch, I have a duty to examine any potential threat to our existence. No matter how ludicrous or personally offensive I may find it."}],"reward":{"gil":1025},"reqs":{"jobs":[{"lvl":87,"id":142}],"quests":[69968]},"next":[69833,69836,69838,69839,69842,69844,69845,69847,69849,69970,70047]},"partials":[{"type":"npc","id":"1040129","obj":{"i":1040129,"n":"Venat","l":3713,"q":2}},{"type":"npc","id":"1040135","obj":{"i":1040135,"n":"Venat","l":3713,"q":1}},{"type":"quest","id":"69968","obj":{"i":69968,"n":"Worthy of His Back","g":11,"l":"Elpis","s":586}},{"type":"quest","id":"69833","obj":{"i":69833,"n":"Take to the Skies","g":125,"l":"Elpis","s":5110}},{"type":"quest","id":"69836","obj":{"i":69836,"n":"Familiar vs. Familiar","g":125,"l":"Elpis","s":5140}},{"type":"quest","id":"69838","obj":{"i":69838,"n":"Siren Flower","g":125,"l":"Elpis","s":5160}},{"type":"quest","id":"69839","obj":{"i":69839,"n":"Searching for Eidos","g":125,"l":"Elpis","s":5170}},{"type":"quest","id":"69842","obj":{"i":69842,"n":"Specializing in Sharks","g":125,"l":"Elpis","s":6101}},{"type":"quest","id":"69844","obj":{"i":69844,"n":"The Abyss Stares Back","g":125,"l":"Elpis","s":6120}},{"type":"quest","id":"69845","obj":{"i":69845,"n":"Rolling Bryons Gather No Moss","g":125,"l":"Elpis","s":6130}},{"type":"quest","id":"69847","obj":{"i":69847,"n":"Flight of the Charybdis","g":125,"l":"Elpis","s":6150}},{"type":"quest","id":"69849","obj":{"i":69849,"n":"The Perks of Being a Lost Flower ","g":125,"l":"Elpis","s":6170,"f":1}},{"type":"quest","id":"69970","obj":{"i":69970,"n":"Hunger in the Garden","g":11,"l":"Elpis","s":588}},{"type":"quest","id":"70047","obj":{"i":70047,"n":"An Expected Guest","g":125,"l":"Elpis","s":6191,"f":1}}]}