{"quest":{"name":"Aether to Aether","location":"Elpis","id":69962,"patch":6.0,"sort":580,"eventIcon":71201,"issuer":1040071,"target":1040084,"genre":11,"journal":["Something seems to be weighing on Hermes's mind."],"objectives":["Search for Hermes.","Speak with Meteion and have her accompany you.","Search for Doros while accompanied by Meteion.","Speak with Meteion."],"dialogue":[{"name":"EMETSELCH","text":"I'm tired. Leave me be."},{"name":"HYTHLODAEUS","text":"I thoroughly enjoyed myself─at the end most of all!"},{"name":"METEION","text":"All the creations are happy. That makes me happy too!"},{"name":"HERMES","text":"Tell me, <span class=\"highlight\">Forename</span>. In the course of watching me, have you learned aught of value?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Nothing so far, but I'm hopeful that will change."},{"name":"A1","text":"Dynamis─dynamis seemed promising."},{"name":"A1","text":"I'm not sure what I'm looking for, but I don't think I've found it yet..."},{"name":"HERMES","text":"I see... If you told me what it is you seek, I would be able to better accommodate you."},{"name":"HERMES","text":"Dynamis, you say? Curious that such an obscure phenomenon should be of interest to you."},{"name":"HERMES","text":"If only my work were more interesting... Nevertheless, I'm still indebted to you for keeping Meteion company. If there is aught I might do, you need but ask."},{"name":"ANAGNORISISSTAFF04426","text":"Chief Hermes, what good fortune to find you here."},{"name":"HERMES","text":"Is something the matter?"},{"name":"ANAGNORISISSTAFF04426","text":"The lykaon─I'm afraid it's done it again."},{"name":"ANAGNORISISSTAFF04426","text":"No sooner did we release one for observation than it set upon the nearby okyupetes, slaughtering them."},{"name":"HERMES","text":"Was the creature hungry? Or somehow provoked?"},{"name":"ANAGNORISISSTAFF04426","text":"I had just fed them myself, and the okyupetes were keeping a wide berth. It is the nature of the lykaon that is to blame. Their innate viciousness."},{"name":"ANAGNORISISSTAFF04426","text":"Temperament aside, it is an outstanding creation, perfect in form and function."},{"name":"ANAGNORISISSTAFF04426","text":"Though it may not be suited for release, I've no doubt that the bureau will accept its concept for preservation."},{"name":"ANAGNORISISSTAFF04426","text":"In any case, there's no point in postponing the inevitable. Doros will revert them all once the paperwork is in order."},{"name":"HERMES","text":"Where is the scene of the incident?"},{"name":"ANAGNORISISSTAFF04426","text":"Just off the path to the Twelve Wonders. As you make your way, you should see it on the left. I don't know if Doros is still there, however."},{"name":"METEION","text":"H-Hermes! Wait!"},{"name":"EMETSELCH","text":"If this is part of his work, then I would observe. We follow."},{"name":"EMETSELCH","text":"A fearsome beast, this lykaon... But where is it now?"},{"name":"HYTHLODAEUS","text":"The okyupete is no easy prey. With its hooves and horns, it was designed to be formidable even on land."},{"name":"HYTHLODAEUS","text":"Yet they didn't stand a chance against the lykaon..."},{"name":"METEION","text":"It's heavy... Hermes's pain..."},{"name":"HERMES","text":"The lacerations and burns are unmistakable. A lykaon was indeed responsible."},{"name":"HERMES","text":"But the creature is nowhere to be seen. Doros must have taken it away."},{"name":"HERMES","text":"The man makes his base at the Twelve Wonders. I shall go and seek him out there."},{"name":"HYTHLODAEUS","text":"Emet-Selch and I will search the area for good measure. Just to make sure the lykaon did not escape."},{"name":"HERMES","text":"My thanks. Let us meet at the Twelve Wonders when you have finished."},{"name":"HERMES","text":"I will go on ahead. Please follow with <span class=\"highlight\">Forename</span>."},{"name":"METEION","text":"Come, come. It's down this path and over the bridge."},{"name":"METEION","text":"There it is─the Twelve Wonders. Hermes is looking for Doros. Let's look for Doros too!"},{"name":"METEION","text":"He's a man with long, blond hair...I think. I'll know him when I see him!"},{"name":"SYSTEM","text":"Meteion is now accompanying you. Keep her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Meteion behind by entering a different area, or by speaking with her and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Meteion accompany you again, return and speak with her at the original location."},{"name":"Q2","text":"What will you do?"},{"name":"A2","text":"Talk."},{"name":"A2","text":"Part ways."},{"name":"A2","text":"Nothing."},{"name":"METEION","text":"Come on, let's find Doros. He's a man with long, blond hair...I think!"},{"name":"Q3","text":"Are you sure you wish to part ways with Meteion?"},{"name":"METEION","text":"All right! I'll wait in front of the Twelve Wonders."},{"name":"METEION","text":"Ready to look for Doros again? Let's go, let's go!"},{"name":"SYSTEM","text":"Meteion has yet to arrive. Be sure she is at your side before attempting to continue."},{"name":"THETWELVEWONDERSSTAFFA04426","text":"...Hm? May I help you?"},{"name":"SYSTEM","text":"You recall that you do not actually know what Doros looks like. You should have Meteion accompanying you before initiating conversation."},{"name":"THETWELVEWONDERSSTAFFA04426","text":"...Hm? If you're with Meteion, then I assume you're on an errand for Hermes. What can I do for you?"},{"name":"METEION","text":"S-Sorry, wrong person! We're looking for Doros..."},{"name":"THETWELVEWONDERSSTAFFA04426","text":"Ah, I see. We do have similar hair, so people often mistake us from afar. I hope you find him soon."},{"name":"THETWELVEWONDERSSTAFFA04426","text":"Don't worry, you're hardly the first ones to mistake me for Doros, and you certainly won't be the last."},{"name":"THETWELVEWONDERSSTAFFB04426","text":"Once I get back and record today's results, I should finally be able to put that report to bed..."},{"name":"THETWELVEWONDERSSTAFFB04426","text":"Once I get back and record today's results, I should finally be able to put that report to bed..."},{"name":"METEION","text":"Not Doros! His hair is long, but the color is wrong."},{"name":"THETWELVEWONDERSSTAFFB04426","text":"...Doros? I think he returned a short while ago."},{"name":"SYSTEM","text":"You recall that you do not actually know what Doros looks like. You should have Meteion accompanying you before initiating conversation."},{"name":"METEION","text":"Doros! That's Doros!"},{"name":"DOROS","text":"Well now, if it isn't Meteion. What brings you here?"},{"name":"HERMES","text":"Ah, I thought I heard familiar voices!"},{"name":"HERMES","text":"I didn't realize you two had decided to help me search for Doros. Thank you."},{"name":"HERMES","text":"You're in charge of the lykaones, I believe. Where are they now?"},{"name":"DOROS","text":"(-Doros-)Out in the fields in restraints. Frenzied as they were, I couldn't well return them to Ktisis."},{"name":"DOROS","text":"(-Doros-)Once I've submitted my report, I'll see them reverted without delay."},{"name":"HYTHLODAEUS","text":"It's as he says. The beasts are indeed quite ferocious."},{"name":"DOROS","text":"(-Doros-)Y-You're one of the Fourteen! Wh-What brings you here!?"},{"name":"EMETSELCH","text":"Nothing you need concern yourself with. As you were."},{"name":"HERMES","text":"We've heard the news─that a lykaon slaughtered okyupetes. As the observer in charge, you are of the opinion that they are not fit to be released?"},{"name":"DOROS","text":"(-Doros-)Aye, I am. Their abnormal aggression and exceptional strength makes for a highly problematic combination."},{"name":"DOROS","text":"(-Doros-)It matters not where they are released. Lykaones would threaten other species and upset the natural order."},{"name":"HERMES","text":"Could it be that the specimens observed are an outlier?"},{"name":"DOROS","text":"(-Doros-)Highly unlikely. We've created a good many of them; all exhibited the same tendencies."},{"name":"DOROS","text":"(-Doros-)Even when we used Kairos to begin with a fresh slate, their behavior was unchanged."},{"name":"EMETSELCH","text":"Kairos...?"},{"name":"DOROS","text":"(-Doros-)A memory reconfiguration system. The chief himself created it."},{"name":"DOROS","text":"(-Doros-)It allows us to erase or alter memories, that we may observe creations in different environmental conditions without needing to remake them from scratch."},{"name":"EMETSELCH","text":"Quite impressive...and potentially dangerous. Depending on the intensity of the aetheric emissions, Pashtarot may wish to have words with you."},{"name":"HERMES","text":"Rest assured I've kept all values within prescribed limits. And to prevent misuse, its applications are limited to those authorized by the chief overseer."},{"name":"HERMES","text":"Do not misunderstand. To manipulate a subject's memories is an intrusive act I deeply abhor. But it is still preferable to execution."},{"name":"DOROS","text":"(-Doros-)Come now, Chief, let's not be so melodramatic! What was born of aether is simply being reduced to its original state."},{"name":"DOROS","text":"(-Doros-)I know the distinctions concern you, but we mustn't lose sight of the bigger picture─making rational choices for the sake of a more prosperous star."},{"name":"DOROS","text":"(-Doros-)If a creation cannot be properly studied even with the aid of Kairos, we remake it. If a creation is deemed a detrimental existence, we unmake it. 'Tis all for the greater good, and none question the necessity of such routine processes."},{"name":"HERMES","text":"I understand these things, I do. I would never think to unleash a clear and undeniable threat unto the world."},{"name":"HERMES","text":"Yet insignificant though their individual lives may be next to all creation, it is all the lykaones have."},{"name":"HERMES","text":"Before we seal their fates, we owe it to these beings to exhaust all options. To ensure that nothing has been overlooked."},{"name":"DOROS","text":"(-Doros-)If you insist. Let me provide you with a full report, and we may take it from there."},{"name":"HYTHLODAEUS","text":"Would it be possible for us to attend the discussion? That Emet-Selch may better carry out his duties."},{"name":"HERMES","text":"By all means."},{"name":"HERMES","text":"Pray show them to the meeting room."},{"name":"HERMES","text":"We have a duty to the star, this I know. But it doesn't mean we don't also have a responsibility to the lives we bring into existence here."},{"name":"METEION","text":"To man, other beings are just things. To be used and controlled. Like magic."},{"name":"METEION","text":"That's what Hermes told me once..."}],"reward":{"gil":851,"items":[{"id":35701}]},"reqs":{"jobs":[{"lvl":86,"id":142}],"quests":[69961]},"next":[69963]},"partials":[{"type":"npc","id":"1040071","obj":{"i":1040071,"n":"Hermes","l":3713,"q":1}},{"type":"npc","id":"1040084","obj":{"i":1040084,"n":"Meteion","l":3713,"q":1}},{"type":"item","id":"35701","obj":{"i":35701,"n":"Ironwood Foot Gear Coffer (IL 539)","l":1,"c":26562,"t":61}},{"type":"quest","id":"69961","obj":{"i":69961,"n":"Their Greatest Contribution","g":11,"l":"Elpis","s":579}},{"type":"quest","id":"69963","obj":{"i":69963,"n":"A Sentimental Gift","g":11,"l":"Elpis","s":581}}]}