{"quest":{"name":"No Job Too Small","location":"Labyrinthos","id":69978,"patch":6.0,"sort":596,"eventIcon":71201,"issuer":1039733,"target":1039761,"genre":11,"journal":["Alphinaud is resisting the urge to pat himself on the back."],"objectives":["Speak with Alisaie.","Gather information in Sharlayan Hamlet.","Search for the behatted rabbit."],"dialogue":[{"name":"ALISAIE","text":"Though Bahamut is long gone, the internment hulks are far from safe."},{"name":"ALISAIE","text":"It could be much worse, of course. They won't have to fight their way past Meracydian dragons, nor is there any danger the elder primal might be summoned again."},{"name":"ALISAIE","text":"Even so, I daresay there are still a fair few Allagan creations and contraptions remaining to bar our friends' way. I only hope that Grandfather watches over them."},{"name":"ALISAIE","text":"Well, I'm all for relying on the power of friendship, but we're now left with the rare luxury of having nothing to do. There must be something that requires our attention!"},{"name":"THANCRED","text":"First the Telophoroi, and now the Final Days. Heh─no one can accuse the Ilsabard contingent of backing down from a challenge!"},{"name":"THANCRED","text":"Of course, they weren't all so committed to the cause when we first set out."},{"name":"THANCRED","text":"But after seeing the example set by you, Alphinaud, and the others, the change was palpable. They couldn't help but believe."},{"name":"URIANGER","text":"What serendipitous irony that the remnants of the Seventh Umbral Calamity would become the keys to mankind's salvation. Never more certain have I been that Master Louisoix watcheth over us from the aetherial sea..."},{"name":"YSHTOLA","text":"I'm confident that even the deadliest of Allagan defense mechanisms are no match for our allies."},{"name":"YSHTOLA","text":"At this rate, some of them might soon have as many accomplishments to their names as a certain Warrior of Light."},{"name":"GRAHATIA","text":"Time and time again, it seems that Allagan something-or-other are either the cause of or the solution to our problems."},{"name":"GRAHATIA","text":"Hmm... To think the selfsame materials that once launched Dalamud will now be used to help ferry mankind to the moon. There's a poetry in that."},{"name":"ESTINIEN","text":"...Considering how much of a fuss he made at the time, I don't see why he takes every opportunity to bring it up. It was just firewood."},{"name":"KOKKOLDANKKOL","text":"'Preciate you doin' all this, but I ain't gettin' me hopes up just yet!"},{"name":"ALPHINAUD","text":"Though our friends are searching for refined adamantite and sacred relics, we will only know if they meet your requirements once they have arrived."},{"name":"ALPHINAUD","text":"In the meantime, is there aught else we might do to be of service?"},{"name":"KOKKOLDANKKOL","text":"Ha! You've already done more than enough!"},{"name":"KOKKOLDANKKOL","text":"If I had to say, though, I could use someone who knows a thing or two about Allagan technology..."},{"name":"KOKKOLDANKKOL","text":"You there! The lad with the red eyes n' matchin' hair! You seem to know more than the average scholar!"},{"name":"ALPHINAUD","text":"Ha! If only Master Kokkol knew how right he was. While he and G'raha establish a rapport, why don't we help with preparations for the great exodus?"},{"name":"ALPHINAUD","text":"Indeed, this would mean going above and beyond the terms of our arrangement─but I propose this not to curry favor."},{"name":"ALPHINAUD","text":"As confident as I am that we will succeed, we must be ready for every eventuality. This would also be an opportunity to familiarize ourselves with the logistics of traversing the great expanse. And if nothing else, it beats twiddling our thumbs while we wait for the adamantite."},{"name":"KOKKOLDANKKOL","text":"Well, ain't you a bunch of helpful buggers? If you've a mind to lend a hand, I know where you ought to go."},{"name":"KOKKOLDANKKOL","text":"Sharlayan Hamlet is lousy with researchers and scholarly types, busyin' themselves preparin' for the exodus. Pah! That lot need all the help they can get!"},{"name":"ALPHINAUD","text":"Well, then! Off we go!"},{"name":"GRAHATIA","text":"I shall endeavor to provide Master Kokkol with whatever information he should require!"},{"name":"KOKKOLDANKKOL","text":"I'll admit, without refined adamantite, I ain't got a bloody clue how else I could get the aetherburner performin' any better! If you lot don't come up with the goods, we're buggered!"},{"name":"ALPHINAUD","text":"In order to protect the secrets of the Central Circuit, the researchers must navigate a bewildering maze of paperwork before they are permitted to return to the surface."},{"name":"ALPHINAUD","text":"I suppose it's no different than any other aspect of Sharlayan society. We do love our bureaucracy. It's very much a mirror of the city above, which is perhaps how it came to be called Sharlayan Hamlet."},{"name":"THANCRED","text":"As surprised as I was to learn the Forum planned to send <span class=\"emphasis\">everyone</span> to the moon, I can't imagine how the commonfolk must feel about it."},{"name":"URIANGER","text":"Do my senses deceive me? In the shadow of yon corner..."},{"name":"URIANGER","text":"Hmm. One can but hope this leadeth not to mischievous undertakings."},{"name":"YSHTOLA","text":"What a quaint little settlement this is. A shame it is hidden underground."},{"name":"ESTINIEN","text":"I don't mind a bit of heavy lifting, but I draw the line at paperwork. So much as wave a sheaf of documents at me and I'll put my lance through it."},{"name":"ALISAIE","text":"From what I can tell, a lot of the people actually live down here."},{"name":"ALISAIE","text":"I don't know how much help we can offer, but I daresay they'll benefit from some of that “fresh inspiration” Scholarch Montichaigne mentioned."},{"name":"ALISAIE","text":"Let's start by asking around, ideally without getting in anyone's way!"},{"name":"ALPHINAUD","text":"Let's meet by the aetheryte once our work is done."},{"name":"SILKENGRIN","text":"Oh, um, hullo. Are you one of the new helpers?"},{"name":"SILKENGRIN","text":"Working on the aetherburner? Oh dear... I hear things have come to a standstill on that front."},{"name":"SILKENGRIN","text":"Even so, I'd choose that over my current duties. Checking and loading samples, day in, day out. It's tiring, thankless work..."},{"name":"SILKENGRIN","text":"Still, no one'll be cross if I misplace a few legumes or what have you. The Forum's got enough on their plate as it is, what with deciding who gets to board the ark and when. Lot of powerful people have “opinions” about that."},{"name":"SILKENGRIN","text":"My heart goes out to Master Fourchenault and the others. Hardly get a moment's rest, I expect. Do they even have time to sleep?"},{"name":"SILKENGRIN","text":"It's a race against time to prepare for the great exodus, but with everyone in such a rush, we're bound to make mistakes."},{"name":"STEADYCURRENT","text":"Helping with the ark? Even with all the power Master Kokkol's managed to squeeze out of the aetherburner, it's still not enough, apparently."},{"name":"STEADYCURRENT","text":"And now I hear the Final Days have arrived. Horrible creatures running rampant all over... &lt;sigh&gt; If only we'd begun the exodus sooner."},{"name":"STEADYCURRENT","text":"People are dying, and there'll be no end to it if we don't fulfill our duties."},{"name":"STEADYCURRENT","text":"But we will. We've spent years preparing for this moment. Believe in the plan, and all will be well."},{"name":"STEADYCURRENT","text":"If the aetherburner isn't up to snuff, we'll have to begin the exodus sooner than planned so we can make as many trips as possible."},{"name":"STEADYCURRENT","text":"Might fail to meet the projected targets, too. If so, we'll be faced with some hard choices about what to leave behind. And who..."},{"name":"PAULTISANNE","text":"Offering to help? That's very kind, but I should be able to organize the rest of the documents by myself."},{"name":"PAULTISANNE","text":"It's mostly lists of the things we'll need once we arrive on the moon, and then whichever star we choose as our new home. My duties largely concern the maintenance of living conditions, so I'll be a lot busier after we depart."},{"name":"PAULTISANNE","text":"I hear that our lunar collaborators have come down to assist in our efforts. I'm looking forward to finally meeting them in person, after having communicated with them in such a limited capacity thus far."},{"name":"PAULTISANNE","text":"To be perfectly honest, I've not even the slightest idea what they look like! I do hope they're not enormous, looming giants... Why, I would much prefer something small and fluffy, like that behatted rabbit that ran by..."},{"name":"PAULTISANNE","text":"Come to think of it, rabbits don't normally wear hats, do they? Or run on their back paws? Hmm... Perhaps it was an escaped sample."},{"name":"URIANGER","text":"'Twould appear the Loporrits have infiltrated Sharlayan's most heavily guarded facility. How, I know not."},{"name":"GROWINGWAY","text":"Crikey! I wasn't expecting to see <span class=\"emphasis\">you</span> here, <span class=\"highlight\">Forename</span>!"},{"name":"GROWINGWAY","text":"I'm sorry I didn't have a chance to say good-bye. And for, uh, having those other Loporrits attack you. Terrible misunderstanding, that."},{"name":"GROWINGWAY","text":"Not to worry, though, as all have since recovered from the rather savage beating you administered. They bear you no ill will! Well, perhaps a little, on account of the savagery, but time heals all wounds! Most, anyway."},{"name":"SINGINGWAY","text":"Hum hum-hummm～♪<br>What joy to sample the delights of Etheirys!"},{"name":"COOKINGWAY","text":"How marvelous it is to see you again! You'll be pleased to hear I've learned much since our fascinating discussion at the Carrotorium."},{"name":"COOKINGWAY","text":"It's all thanks to Urianger, you see. He's taught me the finer points of cooking, which, despite my name, I knew very little about. So many dishes, so many hard-to-pronounce words!"},{"name":"COOKINGWAY","text":"Actually, I was rather hoping he'd show me how to bake an Archon loaf. They're quite popular, I hear, though it doesn't sound like it contains any flavor to speak of. Still, if that's the sort of thing your kind enjoys, I shall make enough to last the whole journey!"},{"name":"LIVINGWAY","text":"Fancy meeting you here, <span class=\"highlight\">Forename</span>!"},{"name":"LIVINGWAY","text":"Our friends in the Forum brought us to see their teeny-tiny toy boat, which was quite impressive considering they didn't use any creation magicks."},{"name":"LIVINGWAY","text":"What we're really interested in is Etheirys itself, though we now find ourselves in a sort of funny, underground, miniaturized version of it."},{"name":"LIVINGWAY","text":"We were hoping the Forum would give us a guided tour, but it appears they're rather preoccupied. Honestly! All that time to prepare, and they're still not ready!"},{"name":"LIVINGWAY","text":"I suppose we'll just have to show ourselves around. Or at least, that's what we were planning to do until we chanced upon Urianger and your good self!"},{"name":"LIVINGWAY","text":"Since you're both dawdling about, engaging in idle chitchat, perhaps you could show us a few points of interest! Won't that be fun?"}],"reward":{"gil":776},"reqs":{"jobs":[{"lvl":88,"id":142}],"quests":[69977]},"next":[69862,69864,69865,69866,69869,69979]},"partials":[{"type":"npc","id":"1039733","obj":{"i":1039733,"n":"Alphinaud","l":3708,"q":1}},{"type":"npc","id":"1039761","obj":{"i":1039761,"n":"Livingway","l":3708,"q":1}},{"type":"quest","id":"69977","obj":{"i":69977,"n":"Going Underground","g":11,"l":"Old Sharlayan","s":595}},{"type":"quest","id":"69862","obj":{"i":69862,"n":"Seeing Red","g":121,"l":"Labyrinthos","s":8101}},{"type":"quest","id":"69864","obj":{"i":69864,"n":"Herbicidal Tendencies","g":121,"l":"Labyrinthos","s":8103}},{"type":"quest","id":"69865","obj":{"i":69865,"n":"Let the Good Times Troll","g":121,"l":"Labyrinthos","s":8104,"f":1}},{"type":"quest","id":"69866","obj":{"i":69866,"n":"Apple-y Ever After","g":121,"l":"Labyrinthos","s":8105}},{"type":"quest","id":"69869","obj":{"i":69869,"n":"The Case of the Missing Gleaner","g":121,"l":"Labyrinthos","s":8106}},{"type":"quest","id":"69979","obj":{"i":69979,"n":"Wise Guides","g":11,"l":"Labyrinthos","s":597}}]}