{"quest":{"name":"Hunger in the Garden","location":"Elpis","id":69970,"patch":6.0,"sort":588,"eventIcon":71201,"issuer":1040136,"target":1040138,"genre":11,"journal":["Hythlodaeus is eager to find Hermes."],"objectives":["Travel from easterly Boreneus to Euroneus.","Speak with Hythlodaeus.","Search for Hermes in the Hungering Gardens.","Speak with Hythlodaeus."],"dialogue":[{"name":"EMETSELCH","text":"Do not approach me, do not speak to me, and do not dare presume to treat me as a friend. I am merely carrying out my duty."},{"name":"VENAS","text":"How lovely─our merry duo has become a quartet."},{"name":"VENAS","text":"Past disagreements are no reason to reject collaboration in the here and now. I commend Emet-Selch for his practicality."},{"name":"HYTHLODAEUS","text":"I think the time for leisurely exploration is past. If I might have a moment to adjust my vision..."},{"name":"HYTHLODAEUS","text":"...There he is. On the next isle over. Meteion is with him."},{"name":"HYTHLODAEUS","text":"Hermes appears to be in the midst of an observational study, but I suggest we hurry over before they venture elsewhere."},{"name":"HYTHLODAEUS","text":"Head straight down the path─we can teleport to Misopses Euros from the device at the bottom of the slope."},{"name":"SYSTEM","text":"This appears to be the teleporter to Misopses Euros."},{"name":"Q1","text":"Proceed to Misopses Euros?"},{"name":"EMETSELCH","text":"What, you expect me to praise you and your progress? On the contrary, I'm simply surprised you made it this far."},{"name":"EMETSELCH","text":"Then again, even with you slowing her down, there is no denying that Venat is an accomplished researcher. Her wealth of wisdom and experience is unmatched, and her achievements in creation magicks─in any field, frankly─are nothing short of extraordinary."},{"name":"EMETSELCH","text":"Though the singular brilliance which sets her apart can make her motives somewhat impenetrable at times..."},{"name":"EMETSELCH","text":"As her student and successor puts it, she is a force of nature, at once so close...and at the same time, so very distant."},{"name":"VENAS","text":"Misopses Euros is interesting in that it is the only region in Elpis which lacks a researcher hub."},{"name":"VENAS","text":"This is largely due to the nature of its observation sites, within which they let loose creatures anticipated to be unruly and dangerous."},{"name":"VENAS","text":"I have also heard tell that the area is kept deliberately sparse in the event that─ Well, let us just say that no one should live near the neus which provides access to a certain...facility."},{"name":"HYTHLODAEUS","text":"They are close by, within the Hungering Gardens. That would be the circular enclosure you see just up ahead."},{"name":"EMETSELCH","text":"Well, then, <span class=\"highlight\">Forename</span>─make yourself useful and bring Hermes out here to us."},{"name":"EMETSELCH","text":"If I were to go, he would assume I was only there to press him on the Fandaniel matter. Of all of us present, you stand the best chance at convincing him to put aside his work for the moment."},{"name":"HYTHLODAEUS","text":"But the creations in there are not exactly─"},{"name":"HYTHLODAEUS","text":"Hmm, then again, perhaps <span class=\"highlight\">Forename</span> can handle them... <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> did survive a bout with Venat, after all!"},{"name":"HYTHLODAEUS","text":"Off you go to find Hermes, but do be prepared to come to blows with the garden's denizens!"},{"name":"HYTHLODAEUS","text":"Someone needs to go into the Hungering Gardens to speak with Hermes, and it seems Emet-Selch has nominated you for the task!"},{"name":"METEION","text":"<span class=\"highlight\">Forename</span>? Where did you come from?"},{"name":"POPMESSAGE","text":"Botanical abominations bear down upon you with ravenous intent!"},{"name":"HERMES","text":"<span class=\"highlight\">Forename</span>, what are you doing here! I thought you were keeping Hythlodaeus and Emet-Selch company?"},{"name":"HERMES","text":"...An “important matter.” And unrelated to my decision on Fandaniel, you say?"},{"name":"HERMES","text":"Then, yes, I will come. As soon as my work here is finished."},{"name":"HERMES","text":"It will not be long, I promise, but you should really wait outside the garden with the others. This is no place for idle exploration."},{"name":"HERMES","text":"You needn't be concerned for our safety. Meteion and I are protected by a ward which conceals our presence from the creatures."},{"name":"METEION","text":"We're taking notes! We'll talk later?"},{"name":"EMETSELCH","text":"...What is that ghastly odor?"},{"name":"VENAS","text":"I was prepared to swoop in if need be, but 'tis clear you have faced your fair share of monstrous opponents."},{"name":"HYTHLODAEUS","text":"You spoke with Hermes, then?"},{"name":"HYTHLODAEUS","text":"...And were briefly entangled with the denizens of the Hungering Gardens as well, I see─or should I say, smell."},{"name":"HYTHLODAEUS","text":"I cannot speak for certain Convocation members, but I for one am impressed with your fortitude! Well done indeed!"},{"name":"HYTHLODAEUS","text":"Now that you've convinced Hermes to confer with us, let us pray that things will soon take a turn for the better."},{"name":"HYTHLODAEUS","text":"For as fascinating as it would be to meet the Emet-Selch who would recreate Amaurot in the depths of the ocean, I think it best for all concerned if such tragic events never came to pass."},{"name":"HYTHLODAEUS","text":"Be it in our future or your past─assuming yours is not truly written in stone. Naive hope that that is..."}],"reward":{"gil":856},"reqs":{"jobs":[{"lvl":87,"id":142}],"quests":[69969]},"next":[69971]},"partials":[{"type":"npc","id":"1040136","obj":{"i":1040136,"n":"Hythlodaeus","l":3713,"q":1}},{"type":"npc","id":"1040138","obj":{"i":1040138,"n":"Hythlodaeus","l":3713,"q":1}},{"type":"quest","id":"69969","obj":{"i":69969,"n":"A Flower upon Your Return","g":11,"l":"Elpis","s":587}},{"type":"quest","id":"69971","obj":{"i":69971,"n":"Words without Sound","g":11,"l":"Elpis","s":589}}]}