{"quest":{"name":"Follow, Wander, Stumble, Listen","location":"Elpis","id":69972,"patch":6.0,"sort":590,"eventIcon":71201,"issuer":1040148,"target":1040151,"genre":11,"journal":["Hythlodaeus has a suggestion."],"objectives":["Search for Meteion while accompanied by Emet-Selch.","Continue searching for Meteion while accompanied by Emet-Selch.","Survey the area while accompanied by Emet-Selch.","Survey the next area while accompanied by Emet-Selch.","Speak with Emet-Selch."],"dialogue":[{"name":"EMETSELCH","text":"A frantic search will avail us little. We must be clever about this..."},{"name":"VENAS","text":"In the Final Days, aether is twisted by the invasion of dynamis from beyond the star, its progress intensified by feelings of fear and despair and anguish..."},{"name":"VENAS","text":"Nay, I like not the picture which emerges with these latest pieces."},{"name":"HERMES","text":"My apologies, I... We should focus on the task at hand."},{"name":"HYTHLODAEUS","text":"Correct me if I'm wrong, but Meteion renders herself invisible by matching her aetheric density to that of her surroundings, does she not?"},{"name":"HYTHLODAEUS","text":"If so, could we not then disrupt her concealment with a surfeit of aether? Much how Emet-Selch solidified your presence when first we met you!"},{"name":"EMETSELCH","text":"Don't be absurd. I can hardly channel aether to a recipient whose whereabouts are hidden from me."},{"name":"HYTHLODAEUS","text":"Which is why we must all work together."},{"name":"HYTHLODAEUS","text":"<span class=\"highlight\">Forename</span> will continue the search in the same manner as before, but this time with you in tow. Once <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> ascertains Meteion's likely location, you proceed to reveal our wayward familiar with a swift aetherial downpour!"},{"name":"VENAS","text":"Very clever. And thankfully, she has made herself easier to capture by fleeing towards Lethe."},{"name":"VENAS","text":"Assuming she is made visible, it should prove no great feat to herd her into a corner."},{"name":"HYTHLODAEUS","text":"Then we have our plan. <span class=\"highlight\">Forename</span> and Emet-Selch will be our tracker and trapper respectively, while we others predict and obstruct Meteion's avenues of escape."},{"name":"HYTHLODAEUS","text":"Emet-Selch and I will keep an eye on each other's aether to help coordinate our efforts. Let us be about it!"},{"name":"EMETSELCH","text":"...Well, it seems we are partners for the time being. Let us return to where we last saw Meteion and pick up the trail from there."},{"name":"EMETSELCH","text":"I will keep myself in a state of preparedness, ready to rain down aether at a moment's notice─meaning it falls to <span class=\"emphasis\">you</span> to keep the way clear."},{"name":"SYSTEM","text":"Emet-Selch is now accompanying you. Keep him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Emet-Selch behind by entering a different area, or by speaking with him and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Emet-Selch accompany you again, return and speak with him at the original location."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Talk."},{"name":"A1","text":"Part ways."},{"name":"A1","text":"Nothing."},{"name":"EMETSELCH","text":"Now, did Meteion go straight ahead towards the pier...or did she stray from the path somewhere?"},{"name":"EMETSELCH","text":"As the only one who can hear her voice, you will need to take the lead."},{"name":"Q2","text":"Are you sure you wish to part ways with Emet-Selch?"},{"name":"EMETSELCH","text":"Aren't <span class=\"emphasis\">you</span> the one who went to all the trouble of traveling into the past to avert an impending apocalypse? But fine, fine, be my guest! I will await you at the entrance to Lethe."},{"name":"EMETSELCH","text":"The would-be savior of Etheirys past and future returns. After <span class=\"emphasis\">you</span>, my good hero."},{"name":"SYSTEM","text":"Emet-Selch has yet to arrive. Be sure he is at your side before attempting to continue."},{"name":"SYSTEM","text":"You should have Emet-Selch accompanying you before you attempt to reveal Meteion."},{"name":"SYSTEM","text":"You calm your mind, your senses questing for any hint of Meteion's presence..."},{"name":"SYSTEM","text":"...But you fail to hear her voice. She must be elsewhere."},{"name":"EMETSELCH","text":"Nothing this way? We try another route, then."},{"name":"METEION","text":"(-Meteion-)Why can't I fly? Are my functions being restricted!?"},{"name":"METEION","text":"(-Meteion-)Hide─yes, I'll just have to hide, then. Where no one can find me..."},{"name":"SYSTEM","text":"Meteion's anguished voice heads towards the water's edge..."},{"name":"EMETSELCH","text":"She went into the lake!? As if this wasn't tiresome enough..."},{"name":"EMETSELCH","text":"Well, at least that open expanse should make her easier to find. We won't lose her this time!"},{"name":"A2","text":"<span class=\"highlight\">Discuss the water's edge.</span>"},{"name":"EMETSELCH","text":"Ugh. The indignation, to drag my robe through the water. Hythlodaeus better not breathe a word of this to Azem..."},{"name":"EMETSELCH","text":"Still, mild humiliation will be the least of our concerns if we fail to get our hands on Meteion!"},{"name":"EMETSELCH","text":"We should be able to reach the bottom of this drop by climbing down the rocks at the water's edge."},{"name":"EMETSELCH","text":"Do not even <span class=\"emphasis\">think</span> of dragging me over the falls. Final Days or no, if I end up drenched from head to toe, I swear I will feed you to a remora."},{"name":"METEION","text":"Not here... I'm not here... Please..."},{"name":"EMETSELCH","text":"By that rock, is she? Very well!"},{"name":"METEION","text":"What? Why can't I hide!?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"There's no need to run, Meteion!"},{"name":"A3","text":"We will hear your report, good or bad!"},{"name":"METEION","text":"<span class=\"highlight\">Forename</span>...? What are you saying? Everything is so faint..."},{"name":"METEION","text":"I'm sorry... I'm not strong enough. Stay away. I'm begging you..."},{"name":"METEION","text":"Don't make me say it. It will break him. His poor, fragile heart..."},{"name":"EMETSELCH","text":"Now we have a chance."},{"name":"EMETSELCH","text":"Once the others are in position, the two of us can herd her into their midst!"},{"name":"A4","text":"<span class=\"highlight\">Discuss the neus.</span>"},{"name":"EMETSELCH","text":"Keep after Meteion! Hythlodaeus and I will coordinate our movements!"},{"name":"EMETSELCH","text":"Is this neus not in use? It seems to have been left to the mercy of the elements..."},{"name":"EMETSELCH","text":"Either way, it bears no trace of Meteion's essence. We move on!"},{"name":"SYSTEM","text":"You should have Emet-Selch accompanying you before attempting to herd Meteion towards Hythlodaeus and the others."},{"name":"EMETSELCH","text":"There! I see her!"},{"name":"EMETSELCH","text":"Now, where to close the trap...?"},{"name":"HYTHLODAEUS","text":"..."},{"name":"VENAS","text":"If all Hermes means to do is listen to Meteion's report, then it is his right to do so."},{"name":"VENAS","text":"But once he receives the answers to his question, what then? The fate of the world may very well hinge upon the choice he makes in that moment...and we must be there when he makes it."},{"name":"EMETSELCH","text":"Why, Hermes? Why could you not leave well enough alone!?"},{"name":"EMETSELCH","text":"Will these answers assuage the pain you feel when a creation is returned to aether?"},{"name":"EMETSELCH","text":"Had you never cast your accursed question to the distant stars, you may have one day learned to be at peace upon this one..."}],"reward":{"gil":1109},"reqs":{"jobs":[{"lvl":87,"id":142}],"quests":[69971]},"next":[69973]},"partials":[{"type":"npc","id":"1040148","obj":{"i":1040148,"n":"Hythlodaeus","l":3713,"q":1}},{"type":"npc","id":"1040151","obj":{"i":1040151,"n":"Emet-Selch","l":3713,"q":1}},{"type":"quest","id":"69971","obj":{"i":69971,"n":"Words without Sound","g":11,"l":"Elpis","s":589}},{"type":"quest","id":"69973","obj":{"i":69973,"n":"Caging the Messenger","g":11,"l":"Elpis","s":591}}]}