{"quest":{"name":"Words without Sound","location":"Elpis","id":69971,"patch":6.0,"sort":589,"eventIcon":71201,"issuer":1040140,"target":1040147,"genre":11,"journal":["Emet-Selch seems content to stay where he is."],"objectives":["Search the area for Meteion.","Search for Meteion beneath the Hungering Gardens.","Search for Meteion north of the Hungering Gardens.","Search for Meteion east of the Hungering Gardens.","Speak with Hermes."],"dialogue":[{"name":"HYTHLODAEUS","text":"Hm? Why am I always so forward thinking? I simply wish to enjoy all that life has to offer!"},{"name":"VENAS","text":"I was prepared to swoop in if need be, but 'tis clear you have faced your fair share of monstrous opponents."},{"name":"EMETSELCH","text":"Hermes said he would not be long, yes? Then we shall wait here until he emerges..."},{"name":"EMETSELCH","text":"Ugh, this is an exercise in futility... You have to be the one to find her, <span class=\"highlight\">Forename</span>! Follow her voice!"},{"name":"HYTHLODAEUS","text":"If I cannot perceive her aether, what else have I to offer but my rousing support!? Ahh, Hermes truly is a master of his craft..."},{"name":"VENAS","text":"I've strained my senses to their limits, but found nothing. You must calm your mind, that you might hear it─that you might <span class=\"emphasis\">feel</span> her silent voice!"},{"name":"HERMES","text":"Meteion! Where are you!? Please, answer me! What has happened to you? To your sisters...?"},{"name":"SYSTEM","text":"You calm your mind, your senses questing for any hint of Meteion's presence..."},{"name":"SYSTEM","text":"...But you fail to hear her voice. She must be elsewhere."},{"name":"METEION","text":"(-Meteion-)It seeps...into my mind... Our voices... Reporting..."},{"name":"METEION","text":"(-Meteion-)No, no! Hermes mustn't hear them! I have to run...to hide..."},{"name":"SYSTEM","text":"Meteion's anguished voice grows distant as the source seems to flee down the slope..."},{"name":"SYSTEM","text":"You strain to catch even the faintest whisper, but fail to hear Meteion's voice. She must be elsewhere..."},{"name":"METEION","text":"(-???-)Greetings...and salutations..."},{"name":"METEION","text":"Commencing report..."},{"name":"METEION","text":"Oh...oh no, we can't tell them that! We must run... Run far away!"},{"name":"METEION","text":"Please... Don't follow me..."},{"name":"SYSTEM","text":"Meteion's anguished voice fades as you sense her climbing to the top of the ridge..."},{"name":"METEION","text":"(-Meteion-)How...? How did it come to this...?"},{"name":"METEION","text":"(-Meteion-)Is this the reason we traveled to the stars? Why we sought out other life-forms?"},{"name":"METEION","text":"(-Meteion-)Is this it? Is this the answer!? No, it cannot be...it cannot be!"},{"name":"SYSTEM","text":"Meteion's anguished voice drifts away to the south..."},{"name":"METEION","text":"(-???-)Compiling report for dissemination to Hermes and all peoples of Etheirys..."},{"name":"METEION","text":"Processing expedition data... Preparing profiles on intelligent civilizations..."},{"name":"METEION","text":"Formulating answers to the question..."},{"name":"METEION","text":"Finalizing report..."},{"name":"METEION","text":"No, <span class=\"highlight\">Forename</span>... You mustn't listen!"},{"name":"METEION","text":"It's wrong...it's all wrong..."},{"name":"SYSTEM","text":"Meteion's anguished voice flees towards the lake..."},{"name":"EMETSELCH","text":"Any sign of Meteion?"},{"name":"EMETSELCH","text":"Panicked and confused... Which will make it all the more difficult to predict her movements."},{"name":"VENAS","text":"Hermes. What do you make of this situation?"},{"name":"HERMES","text":"The Meteia are linked to a single mind─a shared consciousness which connects them across any distance. I suspect something has happened which disrupted its usual harmony..."},{"name":"VENAS","text":"How might we access this shared consciousness of theirs?"},{"name":"HERMES","text":"Much as you would approach any sentient being: directly."},{"name":"HERMES","text":"In the Meteia's case, that means speaking to any incarnation within physical reach."},{"name":"VENAS","text":"So unless we can track down the Meteion we just lost, we have no means to communicate with them..."},{"name":"VENAS","text":"No way of knowing what befell her sisters; no way to provide directions or guidance."},{"name":"EMETSELCH","text":"Then we had best set our musings aside, and concentrate on how we might find her!"},{"name":"EMETSELCH","text":"A frantic search will avail us little. We must be clever about this..."},{"name":"HYTHLODAEUS","text":"'Tis a shame there is no registered concept we could use to create another Meteion. Assuming of course we could link her to the shared mind! But no, if it were a viable solution, Hermes would have surely suggested it..."},{"name":"VENAS","text":"In the Final Days, aether is twisted by the invasion of dynamis from beyond the star, its progress intensified by feelings of fear and despair and anguish..."},{"name":"VENAS","text":"Nay, I like not the picture which emerges with these latest pieces."},{"name":"HERMES","text":"Oh, my dear Meteion... What did you witness out there that frightened you so?"},{"name":"HERMES","text":"Why do you seek to keep it from us? How terrible could it possibly be...?"}],"reward":{"gil":1109},"reqs":{"jobs":[{"lvl":87,"id":142}],"quests":[69970]},"next":[69972]},"partials":[{"type":"npc","id":"1040140","obj":{"i":1040140,"n":"Emet-Selch","l":3713,"q":1}},{"type":"npc","id":"1040147","obj":{"i":1040147,"n":"Hermes","l":3713,"q":1}},{"type":"quest","id":"69970","obj":{"i":69970,"n":"Hunger in the Garden","g":11,"l":"Elpis","s":588}},{"type":"quest","id":"69972","obj":{"i":69972,"n":"Follow, Wander, Stumble, Listen","g":11,"l":"Elpis","s":590}}]}