{"quest":{"name":"Wise Guides","location":"Labyrinthos","id":69979,"patch":6.0,"sort":597,"eventIcon":71201,"issuer":1039762,"target":1040397,"genre":11,"journal":["Try as he might, Urianger cannot free himself of the Loporrits."],"objectives":["Speak with Singingway.","Head to the designated location and survey the wotsit.","Survey the designated location and defeat any enemies that appear.","Speak with Growingway.","Speak with Urianger.","Speak with Singingway."],"dialogue":[{"name":"LIVINGWAY","text":"If you're too busy to show us the sights, we'll find other ways to keep ourselves amused, don't you worry."},{"name":"GROWINGWAY","text":"Crikey! I wasn't expecting to see <span class=\"emphasis\">you</span> here, <span class=\"highlight\">Forename</span>!"},{"name":"GROWINGWAY","text":"I'm sorry I didn't have a chance to say good-bye. And for, uh, having those other Loporrits attack you. Terrible misunderstanding, that."},{"name":"GROWINGWAY","text":"Not to worry, though, as all have since recovered from the rather savage beating you administered. They bear you no ill will! Well, perhaps a little, on account of the savagery, but time heals all wounds! Most, anyway."},{"name":"SINGINGWAY","text":"Hum hum-hummm～♪<br>What joy to sample the delights of Etheirys!"},{"name":"COOKINGWAY","text":"How marvelous it is to see you again! You will be pleased to hear I've learned much since our fascinating discussion at the Carrotorium."},{"name":"COOKINGWAY","text":"It's all thanks to Urianger, you see. He's taught me the finer points of cooking, which, despite my name, I knew very little about. So many dishes, so many hard-to-pronounce words!"},{"name":"COOKINGWAY","text":"Actually, I was rather hoping he'd show me how to bake an Archon loaf. They're quite popular, I hear, though it doesn't sound like it contains any flavor to speak of. Still, if that's the sort of thing your kind enjoys, I shall make enough to last the whole journey!"},{"name":"URIANGER","text":"A tour of Labyrinthos? Hmm... An unexpected, yet prudent suggestion..."},{"name":"URIANGER","text":"Given the similarities betwixt this artificial environment and Bestways Burrow, 'twould be in our best interests to have the Loporrits acquaint themselves with those conditions deemed optimal by their Sharlayan collaborators."},{"name":"URIANGER","text":"I fear, however, that continued reliance upon my limited knowledge would risk narrowing, rather than broadening, their perspectives. Mayhap thou art better suited to lead this venture?"},{"name":"SINGINGWAY","text":"What a marvelous idea! Might we begin with that great, big wotsit over yonder?"},{"name":"URIANGER","text":"Ah, yes. The wotsit. I shall leave its explanation to <span class=\"highlight\">Forename</span>. &lt;chuckle&gt;"},{"name":"URIANGER","text":"The Loporrits' technical expertise doth far outstrip our own. We would be wise to allow them to form their own conclusions as to the function of the various apparatus, rather than offer uninformed suppositions of our own."},{"name":"URIANGER","text":"Unless, that is, unbeknownst to me, thou art possessed of surpassing knowledge concerning the construction and operation of advanced Sharlayan─ahem─wotsits?"},{"name":"LIVINGWAY","text":"Considering Singingway and Growingway's specialties, I expect them to pay full attention to your explanations, which I am sure will be most informative!"},{"name":"GROWINGWAY","text":"My word! What magnificent architecture! Such immaculate curvature!"},{"name":"GROWINGWAY","text":"I'll have to make several adjustments to my work if I'm to match this degree of craftsmanship! I shall leave no corner unrounded!"},{"name":"COOKINGWAY","text":"This is all very intriguing, I'm sure, but where are the food preparation stations? The, uh...what was your word for it...kitchens?"},{"name":"COOKINGWAY","text":"That reminds me─ Puddingway, our newly appointed chief of pudding research (a discipline he himself founded after sampling Urianger's delights), has gone in search of Etheirys's ultimate sweet treat. Well, provided it's a pudding, as that's all he ever talks about these days. Have you seen him?"},{"name":"SINGINGWAY","text":"Goodness me! To build something so large without creation magicks...is positively stupendous!"},{"name":"SINGINGWAY","text":"Perhaps you could direct our attention to its most important features?"},{"name":"SINGINGWAY","text":"Splendid! The perfect spot from which to view this astonishing apparatus!"},{"name":"SYSTEM","text":"Search the apparatus for points of potential interest. You may move the camera as well as zoom in and out. Target an area and inspect it with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"SINGINGWAY","text":"Well, if I were to hazard a guess, water drawn from underground─presumably with some other mechanism─is purified here and stored in that tower before being distributed elsewhere."},{"name":"SINGINGWAY","text":"I'm right, aren't I?"},{"name":"SINGINGWAY","text":"I knew it! A design brilliant in its simplicity. I daresay it would take only a moment to install in even the harshest of environments. For us Loporrits, that is!"},{"name":"LIVINGWAY","text":"Indeed, securing a reliable source of water is of the utmost importance for any fledgling settlement."},{"name":"SINGINGWAY","text":"We have read, however, that peoples of Etheirys sometimes make their homes in arid deserts and such. How are they able to survive?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Many settlements in Thanalan are built near an oasis."},{"name":"A1","text":"Areas near waterfalls are common sites for villages in Gyr Abania."},{"name":"SINGINGWAY","text":"So wherever you choose to live, you're never far from water..."},{"name":"GROWINGWAY","text":"Oh dear... I worry we won't be able to procure the necessary amount!"},{"name":"GROWINGWAY","text":"We can provide enough water to keep them from drying out completely, but it would appear they rely on it far more than we'd anticipated!"},{"name":"SINGINGWAY","text":"Hmm... A few adjustments may be in order, once we've calculated the average rate of consumption per individual..."},{"name":"SINGINGWAY","text":"It may also be worth learning more about how exactly they obtain their water in the first place."},{"name":"URIANGER","text":"Master Alphinaud spoke of the machinery responsible for that feat during our journey through Logistikon Alpha, did he not?"},{"name":"URIANGER","text":"Mayhap the Loporrits will share his appreciation for the engineering marvel."},{"name":"SINGINGWAY","text":"Oh, yes! That sounds absolutely splendid!"},{"name":"URIANGER","text":"We must journey beyond the sanctuary of Sharlayan Hamlet. I shall lead the way."},{"name":"GROWINGWAY","text":"Y-You mean we'll have to brave the untamed wilderness!?"},{"name":"LIVINGWAY","text":"A valid concern indeed. We could not help but notice the many dangerous-looking creatures with big, nasty teeth lurking beyond the safe confines of this settlement."},{"name":"LIVINGWAY","text":"Were we not escorted here by burly custodians, I dread to think what would have become of us!"},{"name":"URIANGER","text":"Regrettably, to many a hungry predator with the aforementioned big, nasty teeth, Loporrits may appear to be a potential and rather appetizing source of sustenance..."},{"name":"URIANGER","text":"Might I impose upon thee to assist in securing safe passage to Logistikon Alpha?"},{"name":"URIANGER","text":"For my part, I shall act as escort to Livingway and Cookingway. I entrust Singingway and Growingway to thy care."},{"name":"URIANGER","text":"A more valiant protector they could not wish for. Godsspeed."},{"name":"SINGINGWAY","text":"If it's all the same to you, I'd rather not be eaten by some horrid beastie."},{"name":"SINGINGWAY","text":"Come along, Growingway. To the water extraction wotsit!"},{"name":"GROWINGWAY","text":"I've a feeling the way forward is not as clear as we'd like... Could you go and take a look?"},{"name":"SINGINGWAY","text":"Perhaps you could tell the local beasties we're not nearly as delicious as we might appear!?"},{"name":"SINGINGWAY","text":"I say! That fiend had a mind to feast on roasted Loporrit!"},{"name":"GROWINGWAY","text":"Th-Thank you so m-much..."},{"name":"GROWINGWAY","text":"I really hope this water extraction wotsit is worth these harrowing experiences!"},{"name":"GROWINGWAY","text":"All part of the fun, some might say, but I'd rather not be burnt to a crisp, if it's all the same to you!"},{"name":"LIVINGWAY","text":"You've done well to see those two here safely. They can be a bit skittish at the best of times, so I'm pleasantly surprised they didn't run off and get themselves killed!"},{"name":"GROWINGWAY","text":"That was all very exciting, but I'd rather not do it again... Wait. How exactly were we planning to head back later?"},{"name":"SINGINGWAY","text":"Let's get moving! That building looks nice and solid and <span class=\"emphasis\">safe</span>!"},{"name":"COOKINGWAY","text":"I couldn't help noticing a distinct lack of carrots along the way. Or many of the other vegetables I was expecting to see, though I did catch a glimpse of some sort of bipedal tomato charging about. Must be my imagination."},{"name":"URIANGER","text":"My friends, I bid you welcome to Logistikon Alpha."},{"name":"URIANGER","text":"Our destination doth lie at the lift's top. Pray, follow me."},{"name":"URIANGER","text":"On this occasion, 'twould behoove us to seek the counsel of those qualified to describe the workings of the apparatus. They may also be in possession of schematics or other useful documentation, should the Loporrits request them."},{"name":"URIANGER","text":"As the Forum's esteemed guests, 'tis unlikely that they would be refused, yet thou knowest as well as I the changeable dispositions of Sharlayan bureaucrats."},{"name":"LIVINGWAY","text":"As I understand, places like Labyrinthos are the exception, rather than the rule. You don't <span class=\"emphasis\">all</span> build enormous, underground living spaces like this, surely?"},{"name":"GROWINGWAY","text":"That was <span class=\"emphasis\">terrifying</span>, but at least the scenery was more pleasant than wossname...Garlemald! As a first impression of Etheirys, it was far from favorable."},{"name":"GROWINGWAY","text":"Anyway, onwards and upwards! Quite literally, as is the case here!"},{"name":"COOKINGWAY","text":"Forgive me for asking, but are we any closer to the kitchens? Come to think of it, why am I even here? Atmospheric manipulators are hardly my area of expertise."},{"name":"SINGINGWAY","text":"Marvelous! Simply marvelous! So, this is where the magic─or science, rather─takes place! The perfect environment to sustain life, artificially created!"},{"name":"SINGINGWAY","text":"The knowledge we'll gain here will be essential when we start looking for new stars for your kind to inhabit. Apparently, most of them don't even have air for you to breathe!"},{"name":"SINGINGWAY","text":"You're all very lucky that Etheirys just so happens to provide everything you need to thrive. Or did mankind turn out the way they are because of the available resources, I wonder?"},{"name":"SINGINGWAY","text":"Either way, it's nothing short of miraculous! And I cannot wait to see more of it!"}],"reward":{"gil":1074,"items":[{"id":35710}]},"reqs":{"jobs":[{"lvl":88,"id":142}],"quests":[69978]},"next":[69980]},"partials":[{"type":"npc","id":"1039762","obj":{"i":1039762,"n":"Urianger","l":3708,"q":1}},{"type":"npc","id":"1040397","obj":{"i":1040397,"n":"Singingway","l":3708,"q":1}},{"type":"item","id":"35710","obj":{"i":35710,"n":"Chondrite Leg Gear Coffer (IL 545)","l":1,"c":26561,"t":61}},{"type":"quest","id":"69978","obj":{"i":69978,"n":"No Job Too Small","g":11,"l":"Labyrinthos","s":596}},{"type":"quest","id":"69980","obj":{"i":69980,"n":"Agriculture Shock","g":11,"l":"Labyrinthos","s":598}}]}