{"quest":{"name":"Going Underground","location":"Old Sharlayan","id":69977,"patch":6.0,"sort":595,"icon":101128,"eventIcon":71201,"issuer":1039701,"target":1039740,"genre":11,"journal":["Fourchenault's ability to maintain a stiff upper lip is being sorely tested.","Alphinaud's proposal to aid the Forum in improving their starship in exchange for being allowed to borrow it for some unspecified undertaking was, surprisingly, accepted by the majority. Fourchenault, who was on the losing side of the vote, now finds himself forced to comply with the wishes of the Forum and guide the Scions to the secret location where the ark is undergoing its final adjustments.","The descent into the lower reaches of Labyrinthos begins at the Archeion, though you are required to obtain permission to ride the lift before proceeding farther. Having seen to the arrangements, Fourchenault leads the way to the Medial Circuit.","You follow Fourchenault past the many and varied facilities of the Medial Circuit, before arriving at Logistikon Alpha.","Alphinaud regales you with a tale from his childhood in which his father taught him the fundamentals of precipitation. Though somewhat unrelated to your present endeavor, the anecdote serves to remind you that relations between Alphinaud and Fourchenault were not always as strained as they have been in recent years...","You ride the lift down to the Central Circuit, where the Forum's greatest secrets are apparently kept. Despite the many hurdles you were required to overcome to even set foot here, Fourchenault permits you free rein of the area. However, as time is of the essence, you decide that you had best save your wandering for another time.","Fourchenault explains that the aetherburner is being constructed in a nearby location under the supervision of one Kokkol Dankkol. He then leads the way down the path, followed closely by your fellow Scions.","After finally rousing Kokkol Dankkol from his pondering, the eccentric engineer explains that in order to render the ark capable of achieving the required speeds, he must obtain large quantities of refined adamantite. Though you are no stranger to seeking out rare materials, this particular alloy is believed to be found only in certain highly coveted Allagan artifacts, such as those hidden in the depths of Dalamud's shards. Given the inherent risk in venturing inside these sites, Kokkol has refrained from sending gleaners to procure the adamantite. Luckily for him and the Scions, you have an extensive network of able-bodied warriors ready and willing to undertake such expeditions. With an impromptu linkpearl conversation, Alphinaud arranges for quantities of the metal to be delivered from every corner of the world─along with a Far Eastern relic or two from Othard─which should resolve Kokkol's predicament.","With so many visitors expected to be pouring into Sharlayan in the near future, Krile decides to return to the surface to make the necessary arrangements. She also hints that she may have her own means of acquiring refined adamantite, but decides to keep her source a secret for the time being."],"objectives":["Speak with Fourchenault outside the Archeion.","Speak with Fourchenault again.","Speak with Alphinaud.","Speak with Hester.","Speak with Fourchenault.","Speak with Kokkol Dankkol.","Speak with Krile."],"dialogue":[{"name":"ALPHINAUD","text":"As Father seems so eager to help, maybe we can have him educate us about the aetherburner."},{"name":"ALISAIE","text":"While I very much take issue with the Forum's approach to selecting whom to save and when, they're not wrong for wanting to minimize potential conflicts."},{"name":"ALISAIE","text":"Fortunately, if this plan of ours actually works, the great exodus itself will become entirely unnecessary..."},{"name":"THANCRED","text":"My affinity for espionage may have earned me the title of Archon, but I was completely unaware of the Forum's plans. There may have been clues here and there, had I been of a mind to look for them...but contemplating that possibility only serves to further wound my pride."},{"name":"THANCRED","text":"Not that anyone could have realistically surmised that their brilliant stratagem was to build a giant ship, fly to the moon─a still-larger vessel in truth─and use that to travel to another star. Even now, the whole idea seems positively absurd when spoken aloud."},{"name":"URIANGER","text":"Of late, I have seen no sign of the Loporrits..."},{"name":"URIANGER","text":"This being their first opportunity to experience the wonders of Sharlayan, the potential for misadventure is nigh infinite..."},{"name":"YSHTOLA","text":"I'm a little vexed that we've yet to learn of the Forum's replacement for the Antitower, though I expect that in time, they'll share that too with us─and with Master Matoya, if they've any sense."},{"name":"GRAHATIA","text":"The further we pursue the mysteries of the universe, the more I struggle to comprehend the fortuitous nature of time itself."},{"name":"GRAHATIA","text":"We measure and quantify it based on observations of celestial bodies, such as the sun and moon, but from your account it is unclear whether the ancients viewed time in a similar manner..."},{"name":"GRAHATIA","text":"I mention this because while Venat knew the Final Days would reoccur at a defined point in the future, she presumably had no way of knowing exactly when."},{"name":"GRAHATIA","text":"Even so, the completion of the Forum's preparations to escape to the moon aligning so closely with the advent of the Final Days is surely no coincidence..."},{"name":"ESTINIEN","text":"Perhaps if Midgardsormr were still alive─in the traditional sense, that is─he could have offered to help the vessel attain the necessary speeds."},{"name":"ESTINIEN","text":"Then again, there's no guarantee his contribution would make enough of a difference to matter."},{"name":"KRILE","text":"Phew... I'll admit, bringing up the issue of the Forum's incomplete ark was more than a little daunting."},{"name":"KRILE","text":"They were, to their credit, quite open about the current state of affairs. What was even more surprising, though, was when they took Alphinaud up on his offer!"},{"name":"FOURCHENAULT","text":"As instructed, I shall take you to see the aetherburner."},{"name":"FOURCHENAULT","text":"Meet me outside the Archeion. I trust you can make your own way there."},{"name":"ALPHINAUD","text":"So the ark is being built in Labyrinthos. Hardly surprising. Where else could they conceal such a massive undertaking..."},{"name":"ALPHINAUD","text":"Where once we were refused entry, we are now welcomed as guests..."},{"name":"ALISAIE","text":"It seems so long ago we first set foot here."},{"name":"THANCRED","text":"Some would surely object to the Forum allowing “foreign elements” to have the run of their secret facilities. We should count ourselves lucky."},{"name":"URIANGER","text":"Among the many and varied documents sent to the moon, I did chance upon several inventories made in the Archeion."},{"name":"URIANGER","text":"Mayhap the Forum believed such records would provide insight into the intricacies of clerical duties. Regardless, the Loporrits did not consider them worthy of more than a cursory glance."},{"name":"YSHTOLA","text":"That we have been granted permission to enter the lower levels is proof of our increased standing. Would that they had been willing to confide in us sooner..."},{"name":"GRAHATIA","text":"It has been many moons since I last visited Labyrinthos. As vast as the archives were back then, they've only continued to grow in the days since."},{"name":"ESTINIEN","text":"I don't understand the appeal of reshaping it to look like the world above. Make your peace with what it is, or go outside if that's what you prefer."},{"name":"KRILE","text":"Do they intend to carry everything in the Archeion to the moon? They said they'd started loading scientific records and biological samples, but do they really need <span class=\"emphasis\">all</span> of it?"},{"name":"FOURCHENAULT","text":"Our destination lies in the lower levels."},{"name":"FOURCHENAULT","text":"The Forum, in its wisdom, has granted you access to the Archeion's lift."},{"name":"FOURCHENAULT","text":"Step inside and have Ophilyne take you to the Medial Circuit."},{"name":"OPHILYNE","text":"You wish to use the lift, yes?"},{"name":"Q1","text":"Proceed to the Medial Circuit?"},{"name":"FOURCHENAULT","text":"I have sent your associates ahead to Logistikon Alpha, on the other side of Meryall Agronomics."},{"name":"FOURCHENAULT","text":"Actually...there is something I have been meaning to..."},{"name":"FOURCHENAULT","text":"...No, never mind. It can wait. Let us attend to the matter at hand."},{"name":"ALPHINAUD","text":"We are to wait here while our father arranges for us to use the next lift."},{"name":"ALPHINAUD","text":"“Here” being Logistikon Alpha, where the atmospheric conditions of Labyrinthos are regulated."},{"name":"ALPHINAUD","text":"Water is drawn from underground and dispersed as vapor, stimulating the formation of artificial clouds and rain."},{"name":"ALPHINAUD","text":"By manipulating the temperature and air circulation, they are able to create the ideal environment for the growth and preservation of the biological samples kept here."},{"name":"ALISAIE","text":"Hold on. How do you know so much about it?"},{"name":"ALPHINAUD","text":"Why, Father brought me here as a child."},{"name":"ALISAIE","text":"What!? And left me behind!?"},{"name":"ALPHINAUD","text":"Actually, <span class=\"emphasis\">you're</span> the one who left <span class=\"emphasis\">me</span> behind, when you went off somewhere with Grandfather."},{"name":"ALPHINAUD","text":"The night before, I'd been asking Father how clouds are made, so he decided to show me. It was fascinating─I peppered him with questions the entire time."},{"name":"URIANGER","text":"'Tis all too easy to take for granted the many interweaving aspects of the natural world. To grow inured to the wondrous."},{"name":"URIANGER","text":"But having gained an understanding of the complex mechanisms employed by the Loporrits in recreating a similar environment, I have come to view such processes in a new light."},{"name":"URIANGER","text":"The subterranean gardens of Labyrinthos, the lunar prison forged to contain the ancient Zodiark, the habitations built for all mankind 'neath the moon's surface... Each unique, yet undeniably similar."},{"name":"FOURCHENAULT","text":"'Tis no mere coincidence."},{"name":"FOURCHENAULT","text":"Ever since Hydaelyn unfolded to us the grim fate that awaits Etheirys, every essential resource we could spare has been delivered to Labyrinthos, in preparation for the great exodus. But that is not all..."},{"name":"FOURCHENAULT","text":"It is also a testing ground for the technologies that will allow us to settle on distant stars."},{"name":"FOURCHENAULT","text":"Though the Loporrits have endeavored to make the moon inhabitable, that is not our final destination. Mankind must learn to propagate life where there is none, to thrive where all is barren."},{"name":"FOURCHENAULT","text":"Alas, time is not on our side."},{"name":"FOURCHENAULT","text":"I have arranged for you all to enter the Central Circuit. It is there that most of our preparations for the great exodus are carried out, the construction of the ark among them."},{"name":"FOURCHENAULT","text":"Though our plans have been made public, access remains highly restricted. You, however, will not be subject to said restrictions, and will have free rein to come and go as you please. Such was the will of the Forum, after all."},{"name":"ALPHINAUD","text":"We will prove ourselves worthy of their trust. <span class=\"emphasis\">Your</span> trust."},{"name":"FOURCHENAULT","text":"Then let us proceed."},{"name":"HESTER","text":"By decree of the Forum, the Scions of the Seventh Dawn are permitted to enter the Central Circuit."},{"name":"Q1","text":"Proceed to the Central Circuit?"},{"name":"ALPHINAUD","text":"This is it... The Central Circuit!"},{"name":"ALISAIE","text":"Please tell me we're almost there... Or is there <span class=\"emphasis\">another</span> underground level we have to reach? The Even-more-central Circuit, perhaps?"},{"name":"THANCRED","text":"The farther down we travel, the more expansive the sky above becomes, artificial though it is."},{"name":"THANCRED","text":"Would that the heavens elsewhere could be so idyllic..."},{"name":"URIANGER","text":"The temperate environment here is not unlike that of Bestways Burrow, though the diverse vegetation doth produce a far more complex bouquet of aromas. A welcome difference indeed, for I have grown weary of the scent of carrots..."},{"name":"YSHTOLA","text":"I imagine the secrets kept here would be of great benefit to mine own research, but I will refrain from indulging my curiosity for the time being."},{"name":"GRAHATIA","text":"The sooner we can get a look at this aetherburner of theirs, the sooner we can start working out how to improve it!"},{"name":"ESTINIEN","text":"I have no idea what makes Alphinaud so confident we can solve this problem of theirs. Relentless optimism, I presume. A not-unwelcome trait in a youth...but less so in a gambler. Aye─let us resolve never to let him set foot in the Gold Saucer."},{"name":"KRILE","text":"We might finally have the chance to commune directly with Hydaelyn...provided we somehow manage to succeed where Sharlayan's finest engineers have failed. Still, it won't hurt to have a look!"},{"name":"HESTER","text":"Do you wish to enter the Central Circuit?"},{"name":"FOURCHENAULT","text":"The aetherburner is being constructed not far from here."},{"name":"FOURCHENAULT","text":"Overseeing the work is Kokkol Dankkol, after whom the forge is named."},{"name":"FOURCHENAULT","text":"Once the necessary introductions have been made, I shall leave you with him to discuss the particulars. This way."},{"name":"ALPHINAUD","text":"Perhaps you'd like to break the ice?"},{"name":"ALISAIE","text":"Is he...talking to himself?"},{"name":"THANCRED","text":"For a closely guarded secret, you can see practically everything from outside, even with the magical barrier surrounding it..."},{"name":"URIANGER","text":"Surely the Forum hath already petitioned the aid of the Loporrits, given their familiarity with such technologies..."},{"name":"YSHTOLA","text":"While many of the facilities within the Central Circuit seem to be visible from the upper levels, the more secretive work must be carried out behind closed doors."},{"name":"GRAHATIA","text":"He hasn't even realized we're here... Or perhaps he <span class=\"emphasis\">has</span> realized, but just doesn't care."},{"name":"ESTINIEN","text":"I was expecting the Skysteel Manufactory, but instead I find the village smithy..."},{"name":"KRILE","text":"He looks lost in thought, although it seems he's hit something of a stumbling block..."},{"name":"FOURCHENAULT","text":"This is the man we seek. Do try not to startle him..."},{"name":"ALPHINAUD","text":"There are no oaths or contracts binding the members of the Ilsabard contingent, and in many ways, it was even more loosely organized than the Crystal Braves."},{"name":"ALPHINAUD","text":"Nevertheless, I knew none would refuse this call to arms. Truly, we have been blessed with trustworthy and dependable allies."},{"name":"ALISAIE","text":"Though Bahamut is long gone, the internment hulks are far from safe."},{"name":"ALISAIE","text":"It could be much worse, of course. They won't have to fight their way past Meracydian dragons, nor is there any danger the elder primal might be summoned again."},{"name":"ALISAIE","text":"Even so, I daresay there are still a fair few Allagan creations and contraptions remaining to bar our friends' way. I only hope that Grandfather watches over them."},{"name":"ALISAIE","text":"Well, I'm all for relying on the power of friendship, but we're now left with the rare luxury of having nothing to do. There must be something that requires our attention!"},{"name":"THANCRED","text":"First the Telophoroi, and now the Final Days. Heh─no one can accuse the Ilsabard contingent of backing down from a challenge!"},{"name":"THANCRED","text":"Of course, they weren't all so committed to the cause when we first set out."},{"name":"THANCRED","text":"But after seeing the example set by you, Alphinaud, and the others, the change was palpable. They couldn't help but believe."},{"name":"URIANGER","text":"What serendipitous irony that the remnants of the Seventh Umbral Calamity would become the keys to mankind's salvation. Never more certain have I been that Master Louisoix watcheth over us from the aetherial sea..."},{"name":"YSHTOLA","text":"I'm confident that even the deadliest of Allagan defense mechanisms are no match for our allies."},{"name":"YSHTOLA","text":"At this rate, some of them might soon have as many accomplishments to their names as a certain Warrior of Light."},{"name":"GRAHATIA","text":"Time and time again, it seems that Allagan something-or-other are either the cause of or the solution to our problems."},{"name":"GRAHATIA","text":"Hmm... To think the selfsame materials that once launched Dalamud will now be used to help ferry mankind to the moon. There's a poetry in that."},{"name":"ESTINIEN","text":"...Considering how much of a fuss he made at the time, I don't see why he takes every opportunity to bring it up. It was just firewood."},{"name":"KOKKOLDANKKOL","text":"'Preciate you doin' all this, but I ain't gettin' me hopes up just yet!"},{"name":"KRILE","text":"It's times like these we're reminded of how famous─or infamous─Alphinaud has become. Who'd have thought he could achieve so much with a single linkpearl conversation!"},{"name":"KRILE","text":"As we're expecting rather a lot of visitors in the near future, I'd best return to the surface and inform the relevant parties."},{"name":"KRILE","text":"I also have a contact of my own that might be worth a try..."},{"name":"ALPHINAUD","text":"Oh? And who might that be?"},{"name":"KRILE","text":"That's for me to know and you to find out!"},{"name":"KRILE","text":"And on that note, I leave matters here in your capable hands. Best of luck!"}],"reward":{"gil":1797,"items":[{"id":35708}]},"reqs":{"jobs":[{"lvl":88,"id":142}],"quests":[69976]},"next":[69978]},"partials":[{"type":"npc","id":"1039701","obj":{"i":1039701,"n":"Fourchenault","l":3706,"q":1}},{"type":"npc","id":"1039740","obj":{"i":1039740,"n":"Krile","l":3708,"q":1}},{"type":"item","id":"35708","obj":{"i":35708,"n":"Chondrite Chest Gear Coffer (IL 545)","l":1,"c":26559,"t":61}},{"type":"quest","id":"69976","obj":{"i":69976,"n":"Outside Help","g":11,"l":"Garlemald","s":594}},{"type":"quest","id":"69978","obj":{"i":69978,"n":"No Job Too Small","g":11,"l":"Labyrinthos","s":596}}]}