{"quest":{"name":"A §trαnge New World","location":"Ultima Thule","id":69989,"patch":6.0,"sort":607,"eventIcon":71201,"issuer":1039853,"target":1039769,"genre":11,"journal":["Try as he might, Alphinaud can find no sign of Thancred."],"objectives":["Speak with Alphinaud.","Gather information at the vitrified fort.","Speak with Alphinaud.","Speak with Estinien.","Speak with Alisaie."],"dialogue":[{"name":"ALISAIE","text":"It's so dark. I can barely see anything..."},{"name":"URIANGER","text":"Didst thou witness what became of Thancred? So quickly was I overcome by Meteion's malevolence that I saw naught of their altercation."},{"name":"YSHTOLA","text":"We were clearly no match for Meteion, yet we survived unscathed. But how...?"},{"name":"GRAHATIA","text":"If Meteion should strike again with such overwhelming force, I honestly don't know how we are to oppose her."},{"name":"ESTINIEN","text":"There is a dizzying, disorienting feeling about this place. As if I could lose my footing at any moment... We must be careful."},{"name":"LIVINGWAY","text":"Don't hesitate to make the most of the provisions node. There's no telling what you might run into out there, or if anything we have to offer might help, but I'd personally rather brave the unknown with a full pack than an empty one."},{"name":"ALPHINAUD","text":"We're fortunate this place can support life...albeit barely, I suspect, given the torpid, stale quality of the air..."},{"name":"ALPHINAUD","text":"But never mind that. We must find Thancred. Let's begin our search from the prow of the ship. It seems as good a direction as any."},{"name":"ALPHINAUD","text":"Try not to stray too far, lest we lose sight of one another."},{"name":"ALISAIE","text":"I see no one else in this barren waste, do you? Then why do I feel like we're not alone...like there's another presence with us. Something dark...and mournful..."},{"name":"URIANGER","text":"These remains have long since turned to ash...and yet, they retain their form."},{"name":"YSHTOLA","text":"There is a structure here in front of me, yes? A tower of some sort, partially melted? Hmm. In a strange twist of fate, it seems our perception of this place is not so different as it would be elsewhere."},{"name":"YSHTOLA","text":"The world as I used to see it... It feels as though I am dreaming while awake. This is more than the faded memory Meteion led us to believe."},{"name":"GRAHATIA","text":"What was this, I wonder...?"},{"name":"ESTINIEN","text":"This...this cannot be real."},{"name":"ALPHINAUD","text":"Ruins. But of what, I wonder?"},{"name":"ALPHINAUD","text":"Perhaps we can find something to help us understand the nature of this place. A relic, an inscription, anything..."},{"name":"ALPHINAUD","text":"Be careful, <span class=\"highlight\">Forename</span>. I cannot shake the feeling we're being watched. Gods, you don't think there are ghosts here...do you?"},{"name":"SYSTEM","text":"The metallic pillar has been partially melted, likely sometime in the distant past."},{"name":"SYSTEM","text":"The damage does not appear to have been inflicted deliberately. Rather, it calls to mind the indiscriminate destruction often wrought in the heat of battle..."},{"name":"GRAHATIA","text":"Look here─this part is relatively intact."},{"name":"GRAHATIA","text":"The intricate design of the top suggests it is man-made, though its builders were surely not men as we conceive of them."},{"name":"GRAHATIA","text":"Having said that, I swear I have seen this pattern before..."},{"name":"GRAHATIA","text":"I know this pattern. But from where...?"},{"name":"ESTINIEN","text":"I thought this hill might afford a better view of our surroundings... A poor decision in hindsight."},{"name":"ESTINIEN","text":"Besides the light from the ship, all is shrouded in darkness. If Thancred is here, I'd never know it."},{"name":"ESTINIEN","text":"From what I can tell, we are near the edge of an island─if you can call it that─surrounded by floating debris."},{"name":"ESTINIEN","text":"Have care should you decide to climb higher. Were you to fall, you might well tumble through the great expanse for all eternity."},{"name":"ALPHINAUD","text":"Were you able to find anything?"},{"name":"ALPHINAUD","text":"As I feared. And still no trace of Thancred."},{"name":"ALISAIE","text":"There's nothing but emptiness as far as the eye can see, which, unfortunately, isn't very far."},{"name":"ALISAIE","text":"Though I can't help but suspect that someone...or <span class=\"emphasis\">something</span> is here."},{"name":"ALISAIE","text":"There are times when I sense it drawing close...and then a chill washes over me, leaving me exhausted."},{"name":"ALISAIE","text":"Leaving me with feelings of death and anguish..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I think I might see something over there..."},{"name":"A1","text":"I felt it too when I was near that thing..."},{"name":"ALISAIE","text":"What are you talking about? There's nothing there."},{"name":"YSHTOLA","text":"Before we jump to any conclusions, perhaps we should search elsewhere."},{"name":"ALPHINAUD","text":"Agreed. We've found only more questions when we are in desperate need of answers."},{"name":"ESTINIEN","text":"There's a fair stretch of terrain from the ship's port side we've yet to explore."},{"name":"ALPHINAUD","text":"Let us try searching there, then."},{"name":"ESTINIEN","text":"<span class=\"highlight\">Forename</span>. A word, before we join the others."},{"name":"ESTINIEN","text":"You see them too, don't you? The dragons."},{"name":"ESTINIEN","text":"As I thought. Their presence is tenuous at best, but there's no mistaking it."},{"name":"ESTINIEN","text":"No doubt your bond with Midgardsormr, and mine with Nidhogg, is what allows us to perceive them."},{"name":"ESTINIEN","text":"Could these apparitions be related to the dragons that now live on Etheirys?"},{"name":"ESTINIEN","text":"...Bah. Better to leave such conjecture to the others. In any case, we must be careful. We may soon find dragons they can see as well."},{"name":"ESTINIEN","text":"Hmm... Death and anguish. What happened to them, I wonder?"},{"name":"ALPHINAUD","text":"Look there! Are those...are those ghosts, do you think?"},{"name":"URIANGER","text":"Surely, mine eyes deceive me. This cannot be possible."},{"name":"YSHTOLA","text":"My sight may have been restored after a fashion, but I fear what I see cannot be trusted..."},{"name":"YSHTOLA","text":"It's as if Meteion herself has etched these images upon my heart. I doubt not that such a feat is within her power, given that she constructed this sanctuary herself."},{"name":"GRAHATIA","text":"Dragons... 'Tis true they are not of our world. But to find them in a prison of despair..."},{"name":"ESTINIEN","text":"It seems these dragons have yet to succumb completely to the darkness of this place. Meaning the others should see them as well."}],"reward":{"gil":1123,"items":[{"num":2,"id":5810,"one":1},{"num":2,"id":5812,"one":1},{"num":2,"id":5813,"one":1},{"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":89,"id":142}],"quests":[69988]},"next":[69990]},"partials":[{"type":"npc","id":"1039853","obj":{"i":1039853,"n":"Alphinaud","l":3712,"q":1}},{"type":"npc","id":"1039769","obj":{"i":1039769,"n":"Alisaie","l":3712,"q":1}},{"type":"item","id":"5810","obj":{"i":5810,"n":"Lotus Pink Dye","l":30,"c":22812,"t":55}},{"type":"item","id":"5812","obj":{"i":5812,"n":"Plum Purple Dye","l":30,"c":22812,"t":55}},{"type":"item","id":"5813","obj":{"i":5813,"n":"Regal Purple Dye","l":30,"c":22812,"t":55}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"69988","obj":{"i":69988,"n":"Unto the Heavens","g":11,"l":"Old Sharlayan","s":606}},{"type":"quest","id":"69990","obj":{"i":69990,"n":"On Burdεned ωings","g":11,"l":"Ultima Thule","s":608}}]}