{"quest":{"name":"Sage Council","location":"Labyrinthos","id":69981,"patch":6.0,"sort":599,"icon":101129,"eventIcon":71201,"issuer":1040401,"target":1040436,"genre":11,"journal":["Urianger appears to be tallying the Loporrits in preparation for an imminent departure.","With all Loporrits present and accounted for, Urianger insists that the group return to Sharlayan Hamlet, so as to be ready when the time comes to take flight. Seeing the wisdom in this, they reluctantly agree, despite their niggling curiosity about every aspect of Etheirys.","An overwhelmed Growingway is distressed by how the Loporrits' efforts to create a hospitable environment pale in comparison to your star's natural beauty. As he bemoans his failure to complete his life's duty, Thancred arrives and mentions that Labyrinthos's people are feeling none too confident about their own work. Recognizing an opportunity to address both issues, Urianger suggests that Growingway offer counsel to one such researcher based on his expertise in constructing lunar environments─and the Loporrit hesitantly says that he will try.","The troubled researcher doubts whether his design for the ship's gravitational systems is good enough to keep its contents and passengers anchored throughout the exodus. Happily, Growingway has a number of insights to offer on this matter, and the pair are soon engaged in deep conversation. With one success now assured, Urianger asks that you seek out additional distressed souls who might benefit from the Loporrits' counsel.","You speak with a number of Sharlayan Hamlet's residents, who show varying degrees of distress over the impending crisis. Those who stand to find reassurance in the Loporrits' experience are sent to Urianger, to be paired with appropriate members of the delegation.","Urianger is pleased by the number of people who have turned up to receive counsel, and asks that you wait and see how the Loporrits get on. Your presence is sure to encourage them.","Thanks to Urianger's skill in pairing the right Loporrit with the right person, many are soon joyfully engaged in conversation with Sharlayans. To his surprise, however, the next to arrive seeking assistance are Wilfsunn and Bloewyda─father and mother to none other than the dearly departed Moenbryda. Overcome by emotion, Urianger has naught but stammered apologies to offer them at first, though it soon transpires that they do not blame him in the least for their daughter's death, and have in fact been worrying over him much as they would their own child since they fell out of touch. At last, Urianger tearfully accepts Bloewyda's embrace, and affirms that he can feel Moenbryda's spirit with him, even now.","Urianger insists that he is fine, and in fact feels grateful to have met Wilfsunn and Bloewyda again now that he has come into his own alongside his fellow Scions. Moenbryda would surely smile to see the man he has become."],"objectives":["Speak with Growingway.","Speak with the troubled researcher.","Seek out troubled souls in Sharlayan Hamlet.","Speak with Urianger.","Wait at the destination.","Speak with Urianger."],"dialogue":[{"name":"LIVINGWAY","text":"Where have you and Cookingway been!? If the two of you have been engaged in pursuits of an educational nature, you should've taken me, too! I am the leader, after all."},{"name":"GROWINGWAY","text":"Oh...there you are. &lt;yawn&gt; Have the others finished talking about rain-making wotsits yet?"},{"name":"SINGINGWAY","text":"Not to rub it in, but we had the most fantastic time while you were away! Urianger was able to obtain all manner of meteorological data for us to pore over. I'll be sure to put my newfound knowledge to good use once we return to the moon."},{"name":"SINGINGWAY","text":"It's my duty to make your journey as comfortable as possible, though there's no telling how long it will be. A hundred years? A thousand? Hmm... Probably closer to five thousand, give or take."},{"name":"COOKINGWAY","text":"Mmm, muffins... I wonder if this is how Puddingway felt the first time Urianger made pudding?"},{"name":"COOKINGWAY","text":"Though I'm not sure that actually <span class=\"emphasis\">was</span> pudding, come to think of it. Something about it seemed a bit...off..."},{"name":"URIANGER","text":"<span class=\"highlight\">Forename</span>. I trust thy time at Meryall Agronomics did...&lt;cough&gt;...bear fruit?"},{"name":"URIANGER","text":"Our own efforts, too, were rewarded─we now possess an embarrassment of educational riches."},{"name":"URIANGER","text":"No doubt our guests' relentless pursuit of knowledge could occupy them─and us─for a fortnight. Alas, time is of the essence."},{"name":"URIANGER","text":"Let us return to Sharlayan Hamlet forthwith. I shall gladly attend to each and every Loporrit there, should further questions within my power to answer arise."},{"name":"GROWINGWAY","text":"Aw..."},{"name":"URIANGER","text":"The Loporrits want for activities and stimulation, but I struggle to conceive of how to busy them whilst we wait..."},{"name":"LIVINGWAY","text":"Oh, no, there was nowhere in particular I was hoping to go."},{"name":"LIVINGWAY","text":"I simply wish to see, hear, feel, and think as much as I possibly can while we're here... Hmm? What is that look for? What did I say?"},{"name":"SINGINGWAY","text":"That was ever so delightful! And with this much information, I can fine-tune the moon's environs for your people's comfort! It's surprisingly tricky to estimate the appropriate temperature settings for beings so lacking in fur..."},{"name":"COOKINGWAY","text":"Why did I not ask Jebke how to make carrot muffins!? We could have had baked goods bursting with happiness..."},{"name":"GROWINGWAY","text":"Siiigh..."},{"name":"GROWINGWAY","text":"Yes, <span class=\"highlight\">Forename</span>, that was indeed me verbalizing a sigh to express my emotional state. Do you want to know why?"},{"name":"GROWINGWAY","text":"Because I saw the reconstructed environmental data for Etheirys at Logistikon Alpha, that's why!"},{"name":"GROWINGWAY","text":"A forest so lovely, and so...so...<span class=\"emphasis\">leafy</span>. Are all of your forests like that?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"The Black Shroud is quite leafy indeed, and a place of utmost tranquility."},{"name":"A1","text":"They're verdant, at least. The trees of Dravania stand particularly proud."},{"name":"A1","text":"You should see the forests of the First─one was purple!"},{"name":"GROWINGWAY","text":"Gasp! Gasp, I say!"},{"name":"GROWINGWAY","text":"With a star so wonderful, it comes as no surprise that you're reluctant to leave it behind. I was a fool to think otherwise─to assume that the moon was something worth being proud of."},{"name":"GROWINGWAY","text":"How ridiculous we must seem to you. Trying so hard, yet achieving so little..."},{"name":"URIANGER","text":"Not at all. Thy works are no less worthy for their uniqueness."},{"name":"THANCRED","text":"(-???-)I thought I heard tiny voices."},{"name":"URIANGER","text":"Thancred!"},{"name":"URIANGER","text":"How didst thou fare?"},{"name":"THANCRED","text":"Oh, I was able to glean a fair bit from the researchers while helping to move their cargo."},{"name":"THANCRED","text":"Preparations have proceeded without interruption here, despite news of the coming end. We have the Forum's leadership to thank for that."},{"name":"THANCRED","text":"That doesn't mean people aren't worried, though. Quite the opposite."},{"name":"THANCRED","text":"Knowing disaster could strike at any moment, they hurry to complete their work, equally aware that a single error could be the difference between life and death. And we can hardly tell them there's no cause for concern..."},{"name":"URIANGER","text":"Perhaps not... Though aided by our goodly Growingway, we may yet find other ways to lighten their burden."},{"name":"GROWINGWAY","text":"M-Me!? Be of use to...to <span class=\"emphasis\">people</span>? I'm honored that you would think me so capable, but I'm not sure that I'm up to the challenge..."},{"name":"URIANGER","text":"Nevertheless, I believe in thee."},{"name":"GROWINGWAY","text":"If you say so, I... I suppose it can't hurt to try."},{"name":"THANCRED","text":"I passed someone moping in the western plaza that looked to be in need of a helping paw. Perhaps you might start with him?"},{"name":"URIANGER","text":"'Tis as good a place as any. Come."},{"name":"THANCRED","text":"You'd best go with them. I don't think Urianger misjudged him, but Growingway does look like he could use some emotional support."},{"name":"THANCRED","text":"I still have work to complete elsewhere. I trust that I won't return to find any Loporrits in tears..."},{"name":"WORRIEDRESEARCHER04445","text":"Oh... Can I help you?"},{"name":"WORRIEDRESEARCHER04445","text":"...It is you who would help me? Is my anxiety truly so obvious?"},{"name":"URIANGER","text":"A burden shared is a burden eased. Pray, tell us of thy troubles."},{"name":"WORRIEDRESEARCHER04445","text":"Those little fellows do look like good listeners..."},{"name":"WORRIEDRESEARCHER04445","text":"I'm an engineer, you see. And what they say of the ship─that it's the sum of decades of Sharlayan ingenuity, that it's built with peerless Allagan technology─is all true, but..."},{"name":"WORRIEDRESEARCHER04445","text":"I know─I <span class=\"emphasis\">know</span>─that none of that's a guarantee."},{"name":"WORRIEDRESEARCHER04445","text":"We've never before launched a star-faring vessel─let alone flown it in the great expanse. All the tests we've run have been on the ground!"},{"name":"WORRIEDRESEARCHER04445","text":"Only operational personnel and cargo will be aboard for the first voyage, but even so... If it fails us then, what can we do? And if it doesn't, it could fall apart on the next flight, or the one after that..."},{"name":"WORRIEDRESEARCHER04445","text":"We've done everything we can to prevent that from happening, but it hardly matters. We thought the aetherburner's design was flawless, too, and look how that turned out..."},{"name":"URIANGER","text":"Thou art familiar with these most daunting technologies, and thus dost thou hold the power to allay his fears."},{"name":"GROWINGWAY","text":"Oh! I, er...I'm not sure about that, but, well..."},{"name":"GROWINGWAY","text":"Maybe you could tell me if there are any aspects of the ship's design that you're especially worried about?"},{"name":"WORRIEDRESEARCHER04445","text":"Our ability to walk about and perform our tasks, for one. I've devised a means by which to employ Gravity─a spatiotemporal spell─to regulate the environment, but what if it's not strong enough? What if everyone floats away and begins crashing into things as soon as we've left the star?"},{"name":"GROWINGWAY","text":"Aha, gravitation! Maybe I can be of help after all!"},{"name":"GROWINGWAY","text":"Up there is not so different from down here, you see. The same rules apply, and if you consider them as part of one great big cosmos rather than separate places..."},{"name":"URIANGER","text":"I suspect both parties shall find comfort in this conversation."},{"name":"URIANGER","text":"Yet if Thancred's tale be true, still others would benefit from insights born of experience."},{"name":"URIANGER","text":"Might I prevail upon the Loporrits to attend them?"},{"name":"LIVINGWAY","text":"An excellent idea, if I do say so myself! There is naught we'd like more than to ease the hearts of the fine people of Etheirys─and learn more about them while we're at it."},{"name":"URIANGER","text":"Full glad am I to hear it. Gather thy companions and bring them hither."},{"name":"URIANGER","text":"<span class=\"highlight\">Forename</span>, thou hast a gift for finding souls in need of succor."},{"name":"URIANGER","text":"Pray seek thee out the distressed and the apprehensive, and inform them that help is at hand."},{"name":"URIANGER","text":"I shall await them here, that I might introduce each to a suitable Loporrit."},{"name":"LIVINGWAY","text":"Oh, I do so look forward to that. A place for every Loporrit, and every Loporrit in their place!"},{"name":"URIANGER","text":"The Final Days doubtless weigh heavy upon the minds of many in Sharlayan Hamlet, pillars of the exodus as they are."},{"name":"URIANGER","text":"Pray, bring them hither."},{"name":"GROWINGWAY","text":"Yes, precisely! However, it would also be prudent to have a redundant system in the event of failure..."},{"name":"WORRIEDRESEARCHER04445","text":"Thank heavens I asked you!"},{"name":"PERSONONE04445","text":"By the gods, my chest is tight... Am I dying? Is this what dying feels like?"},{"name":"PERSONONE04445","text":"Oh! Do pardon me─I didn't see you there. There is no cause for concern, I assure you. "},{"name":"PERSONONE04445","text":"No cause for concern...even though we may need to depart at any moment...and if the hull I designed buckles under the strain, the entire vessel may explode on launch, claiming countless lives and dooming all mankind...but that is highly unlikely! Yes, yes, highly unlikely... Highly..."},{"name":"PERSONONE04445","text":"...Our visitors can help me triple check for structural flaws, you say? Why, that would be wonderful! I'm breathing more easily already."},{"name":"PERSONTWO04445","text":"......"},{"name":"PERSONTWO04445","text":"...Hm?"},{"name":"PERSONTWO04445","text":"Consult our collaborators? I suppose that would be more effective than sitting here brooding."},{"name":"PERSONTWO04445","text":"I'm attempting to calculate how much cargo we can consolidate into fewer trips, should the aetherburner make our original estimates unfeasible─but there are simply too many variables. I feel as if my brow will turn inside out..."},{"name":"PERSONTWO04445","text":"But perhaps our lunar associates will have more insight into how much weight constitutes <span class=\"emphasis\">too</span> much weight for our purposes. Thank you for letting me know."},{"name":"PERSONTHREE04445","text":"Just leave me to my misery... The Forum can appoint someone else..."},{"name":"PERSONTHREE04445","text":"&lt;sigh&gt; I apologize─I simply don't know what to do. How am I supposed to pilot the ark if I'm already falling apart under the pressure?"},{"name":"PERSONTHREE04445","text":"You know a starship pilot that I might speak with? Truly?"},{"name":"PERSONTHREE04445","text":"Well, then, there's no time to waste! They can help me prepare for this monumental task..."},{"name":"PERSONFOUR04445","text":"...What am I thinking about? The medical facilities on the ship, of course."},{"name":"PERSONFOUR04445","text":"I designed them with the assistance of our sages and chirurgeons, but to imagine every illness or injury that one might face in that great expanse is beyond any of us. To say nothing of the effects that living out there indefinitely might have on the body..."},{"name":"PERSONFOUR04445","text":"...The crew from the moon! Why did I not think of that?"},{"name":"PERSONFIVE04445","text":"Blasted assistants! Where have they gone off to at a time like this?"},{"name":"PERSONFIVE04445","text":"Beg pardon, but I have not the time for idle chitchat. I need to reconfirm that aether levels are consistent throughout the vessel's machinery, and it seems I shall have to do so single-handedly! I swear, when I find those assistants of mine..."},{"name":"PERSONFIVE04445","text":"...The Loporrits are willing to help? Why didn't you say so?"},{"name":"PERSONFIVE04445","text":"At least <span class=\"emphasis\">they</span> won't moan about how they “checked two dozen times already” and “haven't slept in weeks.” Lazy sods..."},{"name":"PERSONSIX04445","text":"...My face? What's wrong with my─ Ow! Perhaps I am a bit tense."},{"name":"PERSONSIX04445","text":"I was tasked with ensuring that the proper fauna─and <span class=\"emphasis\">only</span> the proper fauna─are brought with us to the moon. However, the suitability of a few species is still under debate, and I can hardly make the decision myself when I know so little about the environment up there..."},{"name":"PERSONSIX04445","text":"Including the Loporrits in our discussions is a wonderful idea! I absolutely will, thank you! Perhaps their biology itself might offer some clue, as well..."},{"name":"PERSONSEVEN04445","text":"Fifty-six bunches of weeds in the ground,<br>Fifty-six bunches of weeds.♪<br>Rip one out, add to the mound,<br>Fifty-five bunches of weeds in the─"},{"name":"PERSONSEVEN04445","text":"Eep! I-I'm not neglecting my duties, I swear!"},{"name":"PERSONSEVEN04445","text":"I was in need of a little break, you see, but then I found myself unable to relax at all, so I went on a walk, and then I noticed these weeds, and..."},{"name":"PERSONSEVEN04445","text":"...Pleasant conversation partners <span class=\"emphasis\">and</span> oh-so fuzzy? Goodness me, that does sound like a much better way to relax!"},{"name":"PERSONEIGHT04445","text":"Have you heard anything of what's on the moon?"},{"name":"PERSONEIGHT04445","text":"I have no doubt that we can make it up there, but the “searching for a new star” part of the plan sounds awfully vague to me."},{"name":"PERSONEIGHT04445","text":"I asked the Forum, but they will only tell us that our collaborators “have everything under control.” Forgive me, but I don't feel particularly safe wandering through the sea of stars on gods-know-what made by gods-know-who!"},{"name":"PERSONEIGHT04445","text":"You mean to say that I can speak with them directly!? Amazing! I hope they like questions..."},{"name":"PERSONNINE04445","text":"Concerns? Nay, there's no point in worrying at this stage. It'll only make the work go that much the slower."},{"name":"SYSTEM","text":"This woman seems to be coping well."},{"name":"PERSONNINE04445","text":"All we can do is keep at it."},{"name":"PERSONTEN04445","text":"Aha...haha! The end of the world is nigh, yet the work goes no faster! Schedules are such temperamental things─feasible one moment, utter bollocks the next!"},{"name":"PERSONTEN04445","text":"And yet...I've never felt so alive!"},{"name":"SYSTEM","text":"This one is beyond your help. Only sleep can save her now."},{"name":"PERSONTEN04445","text":"I can't stop now─I've got my second wind! Or my second-second wind... Hahaha!"},{"name":"PERSONELEVEN04445","text":"You! Yes, you, you idiot! Have you seen an envelope lying about?"},{"name":"PERSONELEVEN04445","text":"This imbecile refuses to give me the alchemic I ordered without that bloody slip of parchment!"},{"name":"PERSONELEVEN04445","text":"Unless your friends have a spell to make me remember where I dropped my damned envelope, I doubt they'll be more help than you... And you've wasted enough of my time already!"},{"name":"SYSTEM","text":"It would be unfortunate for all involved to inflict this man upon the Loporrits."},{"name":"PERSONELEVEN04445","text":"Did I drop it on the path? Did I leave it at home? Why in the seven blasted hells can I never find things when I need them!?"},{"name":"PERSONTWELVE04445","text":"Apologies, but I am awaiting a delivery. Whatever it is will have to wait."},{"name":"SYSTEM","text":"It seems this gleaner is too busy to chat, for his benefit or otherwise."},{"name":"PERSONTWELVE04445","text":"If it's urgent, you had best ask a different gleaner."},{"name":"PERSONTHIRTEEN04445","text":"Is anything bothering me? Well, I've been loading cargo for bells now, so my back feels like a voidsent's played it as a piano. My feet and knees as drums and cymbals, too."},{"name":"SYSTEM","text":"This gleaner seems fine, if in need of a break."},{"name":"PERSONTHIRTEEN04445","text":"Ah, sitting. From the mightiest emperor to the lowliest peasant, who doesn't enjoy a good sit?"},{"name":"PERSONFOURTEEN04445","text":"How might I help you?"},{"name":"PERSONFOURTEEN04445","text":"My, what a lovely idea!"},{"name":"PERSONFOURTEEN04445","text":"I too noticed people becoming...rather tense, so I rushed out to pluck some fresh and fragrant tea leaves! Now I need only track down a hundred or so cups..."},{"name":"PERSONFOURTEEN04445","text":"But don't you worry─I can manage. I hope your plan to cheer everyone up goes well!"},{"name":"SYSTEM","text":"This woman is doing better than you are!"},{"name":"PERSONFOURTEEN04445","text":"When plucked early, this particular cultivar's leaves are redolent with a scent that clears the mind and soothes the soul. Precisely what my hardworking colleagues need."},{"name":"PERSONFIFTEEN04445","text":"Worries, worries... No, I believe I'm fine, thank you! I've been confiding in my colleagues, and it's helped a lot. Can't recommend it enough."},{"name":"SYSTEM","text":"This researcher already has the support she needs."},{"name":"PERSONFIFTEEN04445","text":"It's a stressful time, of course, but having colleagues I can count on makes all the difference."},{"name":"GROWINGWAY","text":"<span class=\"highlight\">Forename</span>! He said... He said he was glad we spoke! And he thanked me..."},{"name":"GROWINGWAY","text":"&lt;sniff&gt; It was all worth it after all, wasn't it? E-Even the mistakes we made. Because now, we can tell them what not to do..."},{"name":"WORRIEDRESEARCHER04445","text":"Growingway has been a godssend. I can look upon what we've built with clarity now."},{"name":"URIANGER","text":"Behold, <span class=\"highlight\">Forename</span>..."},{"name":"URIANGER","text":"Through thine efforts, word hath spread throughout Labyrinthos."},{"name":"URIANGER","text":"Verily, to a far greater number than we anticipated. Livingway doth gather more Loporrits as we speak."},{"name":"URIANGER","text":"I shall assign each in accordance with their skills, that new bonds of friendship might be forged."},{"name":"URIANGER","text":"Should greater matters require not thine attentions...watch over them, I prithee."},{"name":"URIANGER","text":"I pray that Livingway is joyed to see so many heartened souls when she doth return."},{"name":"THANCRED","text":"Remind me to invite Urianger for a drink, when we have a moment to breathe. We're long overdue for one."},{"name":"THANCRED","text":"We can raise a glass to Moenbryda."},{"name":"LIVINGWAY","text":"I was so busy asking questions about Etheirys that I never thought to ask more about Urianger..."},{"name":"LIVINGWAY","text":"I'd like to, but where would I begin?"},{"name":"GROWINGWAY","text":"I assure you that my fellow Loporrits are equally excited to have this opportunity. They were humming the whole way here!"},{"name":"SINGINGWAY","text":"We spent so long gazing at this star. Wondering, and hoping... But to be here now, to walk among the people, to be a part of their lives and know that we've made a difference... It's so much more than I ever dreamed."},{"name":"COOKINGWAY","text":"Goodness me, I've never felt like there was too <span class=\"emphasis\">little</span> time before! There are so many people to talk to, so many things to learn..."},{"name":"WILFSUNN","text":"The classical Roegadyn language isn't so different from Eorzean. Did you ever wonder why we named our daughter “moon's bride”?"},{"name":"WILFSUNN","text":"When I first held her, the moon was shining silver and full─the whole world seemed aglow. I knew it had chosen her─that she would be a beacon of that selfsame light."},{"name":"WILFSUNN","text":"Of course, we'd later hear our fair share of jokes about how we ought to have gone for “sun” instead, with how bright and stubborn she was. But fiery as my Moenbryda was, she was always kind. Kind and gentle."},{"name":"BLOEWYDA","text":"Oh... You must be one of the Scions, correct?"},{"name":"BLOEWYDA","text":"Thank you for caring for my daughter. The time she spent with you was all too short, but I know she was proud to have you as comrades."},{"name":"BLOEWYDA","text":"Urianger is too, I'm sure. And I certainly feel better for knowing he has good friends to look after him. See that he comes home from time to time, will you?"},{"name":"URIANGER","text":"Oh, <span class=\"highlight\">Forename</span>... Be assured that I am fine. I am..."},{"name":"URIANGER","text":"Full glad to see them, too, after so very long. Gladder still that it was in your company. As difficult as it was to accept their kindness, 'twould have been far harder had I faced them alone..."}],"reward":{"gil":1244,"items":[{"id":35711}]},"reqs":{"jobs":[{"lvl":88,"id":142}],"quests":[69980]},"next":[69982]},"partials":[{"type":"npc","id":"1040401","obj":{"i":1040401,"n":"Urianger","l":3708,"q":1}},{"type":"npc","id":"1040436","obj":{"i":1040436,"n":"Urianger","l":3708,"q":2}},{"type":"item","id":"35711","obj":{"i":35711,"n":"Chondrite Foot Gear Coffer (IL 545)","l":1,"c":26562,"t":61}},{"type":"quest","id":"69980","obj":{"i":69980,"n":"Agriculture Shock","g":11,"l":"Labyrinthos","s":598}},{"type":"quest","id":"69982","obj":{"i":69982,"n":"Hither and Yarns","g":11,"l":"Labyrinthos","s":600}}]}