{"quest":{"name":"Agriculture Shock","location":"Labyrinthos","id":69980,"patch":6.0,"sort":598,"eventIcon":71201,"issuer":1040400,"target":1040400,"genre":11,"journal":["Cookingway is eager for a change of venue, or at the very least, a change of wotsit."],"objectives":["Speak with Cookingway and have him accompany you.","Speak with Jebke while accompanied by Cookingway.","Accompany Cookingway to the vineyard and then speak with him.","Accompany Cookingway to the orange grove and then speak with him.","Accompany Cookingway to the pumpkin field and then speak with him.","Accompany Cookingway to the lemon grove and then speak with him.","Speak with Jebke while accompanied by Cookingway.","Speak with Cookingway."],"dialogue":[{"name":"URIANGER","text":"On this occasion, 'twould behoove us to seek the counsel of those qualified to describe the workings of the apparatus. They may also be in possession of schematics or other useful documentation, should the Loporrits request them."},{"name":"URIANGER","text":"As the Forum's esteemed guests, 'tis unlikely that they would be refused, yet thou knowest as well as I the changeable dispositions of Sharlayan bureaucrats."},{"name":"LIVINGWAY","text":"As I understand, places like Labyrinthos are the exception, rather than the rule. You don't <span class=\"emphasis\">all</span> build enormous, underground living spaces like this, surely?"},{"name":"GROWINGWAY","text":"That was <span class=\"emphasis\">terrifying</span>, but at least the scenery was more pleasant than wossname...Garlemald! As a first impression of Etheirys, it was far from favorable."},{"name":"GROWINGWAY","text":"Anyway, onwards and upwards! Quite literally, as is the case here!"},{"name":"SINGINGWAY","text":"I should like to study this primitive yet nevertheless intriguing contraption a while longer, if I may. That the Sharlayans were able to build something of this complexity with their limited knowledge and resources is most impressive!"},{"name":"COOKINGWAY","text":"This is all very wonderful, I'm sure, but I was rather hoping to learn more about your nourishment provision facilities. In other words, where is the food?"},{"name":"URIANGER","text":"I believe both the knowledge and consumables you seek may be found at Meryall Agronomics."},{"name":"URIANGER","text":"As I imagine Singingway and the others intend to study every conceivable facet of this apparatus, wouldst thou be so kind as to escort our visiting culinarian?"},{"name":"COOKINGWAY","text":"Yes, that sounds much more interesting! Hopefully, I'll be able to see firsthand some of the delicacies Urianger was telling me about."},{"name":"COOKINGWAY","text":"Even his incredibly vivid─if a bit too verbose─descriptions cannot compare to sampling them myself. Not to mention Etheirys will soon be no more...so I must learn all I can while there is still time!"},{"name":"COOKINGWAY","text":"Let us brook no further delay!"},{"name":"URIANGER","text":"'Twould appear I have inadvertently taken upon myself the more demanding duty─entertaining three inquisitive Loporrits to thy one. Yet be that as it may, 'twill be my pleasure to impart what little knowledge I possess to our would-be saviors."},{"name":"COOKINGWAY","text":"This is the place, yes? The heady aroma was enough to guide me here, and I've spotted several of the fruit and vegetables featured in our compendium!"},{"name":"COOKINGWAY","text":"I'd dearly love to try some, but I read that those who help themselves to a farmer's crops without permission are often caught and put into pies!"},{"name":"COOKINGWAY","text":"Perhaps you could ask whoever's in charge if they would be willing to part with a few samples?"},{"name":"SYSTEM","text":"Cookingway is now accompanying you. Keep him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Cookingway behind by entering a different area, or by speaking with him and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Cookingway accompany you again, return and speak with him at the original location."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Talk."},{"name":"A1","text":"Part ways."},{"name":"A1","text":"Cancel."},{"name":"COOKINGWAY","text":"I suppose if they did put me in a pie, I could just eat my way out. Wait, they get quite hot inside, don't they? On second thought, let's stick to the plan for now."},{"name":"Q2","text":"Are you sure you wish to part ways with Cookingway?"},{"name":"COOKINGWAY","text":"Oh. Something else to attend to? It's all right, I'll wait here. Patiently...and hungrily."},{"name":"COOKINGWAY","text":"Sampling foodstuffs is the very reason I wanted to visit Etheirys!"},{"name":"SYSTEM","text":"Cookingway has yet to arrive. Be sure he is at your side before attempting to continue."},{"name":"JEBKE","text":"&lt;sigh&gt; What a fine mess this is..."},{"name":"SYSTEM","text":"You should have Cookingway accompanying you before attracting Jebke's attention."},{"name":"JEBKE","text":"&lt;sigh&gt; What a fine mess this is..."},{"name":"JEBKE","text":"Ah, it's you, the one who climbed down the mineshaft!"},{"name":"JEBKE","text":"I'd show you around if I could, but I'm rushed off my feet preparing for the exodus."},{"name":"JEBKE","text":"And I'm not the only one. We've all got to find ways to do what we do down here up there─first on the moon, then on whichever star the Forum decides will become our new home."},{"name":"JEBKE","text":"It's all so sudden...so unreal..."},{"name":"COOKINGWAY","text":"Don't you <span class=\"emphasis\">want</span> to go to the moon?"},{"name":"JEBKE","text":"Well, it's better than waiting for the Final Days to claim us..."},{"name":"JEBKE","text":"But no matter how carefully it's all planned, we'll never be able to take every variety of flora and fauna with us."},{"name":"JEBKE","text":"Even the ones we <span class=\"emphasis\">can</span> take may not survive in their new environment. So many species, doomed to extinction..."},{"name":"JEBKE","text":"Sorry, that's not what you came to talk about, is it?"},{"name":"COOKINGWAY","text":"Nothing quite so dire, I assure you. We merely wish to sample a little of your produce, if we may?"},{"name":"JEBKE","text":"By all means, help yourselves."},{"name":"COOKINGWAY","text":"Much appreciated, my good fellow!"},{"name":"COOKINGWAY","text":"So, where to begin?"},{"name":"COOKINGWAY","text":"As Urianger informs me, the key to exquisite cuisine lies in selecting only the very best ingredients."},{"name":"JEBKE","text":"I've an enormous list of seeds, saplings, and whatnot to take to the Central Circuit. But I suppose that means anything not on the list is to be left behind... What a waste."},{"name":"COOKINGWAY","text":"Oh! I know what these are! Grapes, yes?"},{"name":"COOKINGWAY","text":"Let's see if they are as delicious as they look..."},{"name":"COOKINGWAY","text":"So sweet, so sour! The taste is much like a ripe philosopher's carrot...and yet the texture is entirely different."},{"name":"COOKINGWAY","text":"The contrast between the outer skin and the fruit within is most peculiar, though far from unpleasant. Yes, I think I'll try another..."},{"name":"COOKINGWAY","text":"Well, that's certainly given me food for thought, though in a far less visceral manner than any philosopher's carrot... But tell me, what is your opinion of grapes?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"I'd brave an erupting volcano for a choice bunch!"},{"name":"A3","text":"Meh."},{"name":"A3","text":"Ghastly things. I'd rather eat rancid gigantoad eyeballs."},{"name":"COOKINGWAY","text":"Yes, they are rather moreish, aren't they? And from what I've read, quite versatile, too. Something about people stepping on them to make intoxicating beverages, as I recall."},{"name":"COOKINGWAY","text":"Meh? An expression of indifference, I assume. In all fairness, our compendium did note they are valued more as an ingredient for spirituous beverages rather than as a fruit for regular consumption."},{"name":"COOKINGWAY","text":"How odd! No accounting for taste, is there?"},{"name":"COOKINGWAY","text":"Anyway, that's enough about grapes for the time being. On to the next treat!"},{"name":"COOKINGWAY","text":"Orange by name, orange by nature!"},{"name":"COOKINGWAY","text":"What came first, the fruit or the color? Who cares? Let's eat!"},{"name":"COOKINGWAY","text":"Mmm... Yes, that's... Mmm!"},{"name":"COOKINGWAY","text":"Equal parts sweet and sour, as with the grapes, yet nothing alike. Hmm... I may have to consult Urianger about expanding my vocabulary. I simply cannot find the words to describe it!"},{"name":"COOKINGWAY","text":"Perhaps what I'm looking for is, “bitter.” This is all very complicated, you know. So many flavors, so many choices... And each individual with their own personal preferences..."},{"name":"COOKINGWAY","text":"Now I see why you all turned your noses up at the idea of eating nothing but carrots! Marvelous though they still are in my estimation─let no one say I said otherwise!"},{"name":"COOKINGWAY","text":"Ah, but speaking of carrots, I've yet to sample any of the vegetables. Let's see what's in that field over there!"},{"name":"COOKINGWAY","text":"That color...that texture... Are they some sort of enormous, round carrots?"},{"name":"COOKINGWAY","text":"No? In any case, proper nomenclature is less of a concern than the taste..."},{"name":"COOKINGWAY","text":"Blech! It's so hard and flavorless, I may as well be chewing a piece of wood! That all but confirms it─these are nothing more than misbegotten failures masquerading as goodly carrots!"},{"name":"DELOYS","text":"Stop, stop, stop! Can't you see these are pumpkins!?"},{"name":"DELOYS","text":"And no one with any sense would try eating them raw! You're supposed to cook them first!"},{"name":"COOKINGWAY","text":"Do you not find it an awful bother?"},{"name":"DELOYS","text":"Far from it! Cooking is a joy unto itself."},{"name":"DELOYS","text":"And what's more, it broadens the range of ingredients that we may safely eat."},{"name":"DELOYS","text":"But above all else, cooking allows us to draw out the full potential of our produce. Pumpkin stew has been one of my favorite dishes for as long I can remember!"},{"name":"COOKINGWAY","text":"Then perhaps even these hard blocks of plant matter can become as delicious as the orange I sampled..."},{"name":"COOKINGWAY","text":"I wonder, though, if there is anything even <span class=\"emphasis\">more</span> delicious... How about that yellow fruit over yonder?"},{"name":"COOKINGWAY","text":"What a wondrous fragrance! With luck, it'll have a flavor to match."},{"name":"COOKINGWAY","text":"As I've no idea how these are eaten, I'll just bite into it!"},{"name":"COOKINGWAY","text":"Hnnnggghhh!"},{"name":"COOKINGWAY","text":"My...tongue... Is this...poison!?"},{"name":"COOKINGWAY","text":"A lemon? You mean it's <span class=\"emphasis\">supposed</span> to taste like this!?"},{"name":"COOKINGWAY","text":"How can something so similar to an orange be so revolting?"},{"name":"COOKINGWAY","text":"Ack... It may be some time before my palate recovers from this ordeal. As such, I had best call an end to this round of sampling. Let's say our farewells and return to the others."},{"name":"COOKINGWAY","text":"Good grief... I fear that lemon has irrevocably ruined my sense of taste..."},{"name":"JEBKE","text":"No room for these either..."},{"name":"JEBKE","text":"Finished, have you? I trust you found something to your liking."},{"name":"COOKINGWAY","text":"I'm rather enamored with the grapes and oranges. Less so the pumpkin, though I learned the hard way they're not to be eaten raw."},{"name":"COOKINGWAY","text":"Then there was the lemon. The <span class=\"emphasis\">deceiver</span>. I still feel so violated..."},{"name":"JEBKE","text":"Haha! First time, was it?"},{"name":"JEBKE","text":"I'd hate for you to leave with a bad taste in your mouth─in more ways than one─so I'll give you this lemon muffin I baked. If this doesn't change your opinion, nothing will!"},{"name":"COOKINGWAY","text":"More lemon!? Have I not suffered enough?"},{"name":"COOKINGWAY","text":"Nevertheless, it would be remiss of me to spurn this opportunity to─oof, bit of sick came up there─learn more of your inscrutable ways."},{"name":"COOKINGWAY","text":"Very well, lemon muffin! Do your worst!"},{"name":"COOKINGWAY","text":"..."},{"name":"COOKINGWAY","text":"This...is..."},{"name":"COOKINGWAY","text":"...DELICIOUS!"},{"name":"COOKINGWAY","text":"Although I still detect a hint of lemon, it complements the sweetness of the dough to create a perfect harmony!"},{"name":"COOKINGWAY","text":"I never would've guessed its vile bitterness could be utilized so elegantly. My good chap, this is simply breathtaking!"},{"name":"JEBKE","text":"See? We rarely use lemon in its natural state, but it has a starring role in all sorts of recipes, and the same is true for many other ingredients."},{"name":"JEBKE","text":"It comes down to making the most of the resources at our disposal. And sometimes, that can even be the difference between life and death."},{"name":"JEBKE","text":"I know we won't be able to take every species with us. No doubt the Forum agonized over what was worth preserving...and what will be consigned to history. Hard choices, but make them we must if we're to survive."},{"name":"COOKINGWAY","text":"Such strength of will... Now I know what Hydaelyn sees in your kind."},{"name":"COOKINGWAY","text":"Mankind, the Loporrits─we were both born from the accumulated knowledge of the ancients."},{"name":"COOKINGWAY","text":"They learned all there is to learn about the nature of sentient life and the fates of the stars themselves."},{"name":"COOKINGWAY","text":"Once a civilization has fulfilled the basic requirements for survival, it will inevitably seek to eliminate all forms of negativity and achieve perfection."},{"name":"COOKINGWAY","text":"And therein lies its folly...and its downfall."},{"name":"COOKINGWAY","text":"For perfection is an unattainable ideal. 'Tis the paradox of the immaculate carrot."},{"name":"COOKINGWAY","text":"Yet civilizations since time immemorial have deemed the pursuit of perfection as “progress.” They pay no heed to the costs incurred in their futile quest, and all too often become the architects of their own demise, their dreams forever unfulfilled."},{"name":"COOKINGWAY","text":"What, then, is the alternative? The answer lies in knowing that our existence can never be perfect. To be content with what we have and make the most of it."},{"name":"COOKINGWAY","text":"When life gives you lemons, make lemon muffins!"},{"name":"JEBKE","text":"Err...pardon my Eorzean, but what in the seven hells are you on about? And who are you, anyway?"},{"name":"COOKINGWAY","text":"Cookingway, at your service! I'm here to help prepare for the trip to the moon!"},{"name":"COOKINGWAY","text":"And once you get there, you'll be able to try my carrots. I've been growing all different kinds!"},{"name":"COOKINGWAY","text":"But don't worry, there'll be room for your crops too. We'll work together to preserve as many of Etheirys's species as possible, if you're up to the challenge."},{"name":"JEBKE","text":"Yes, of course! I look forward to it."},{"name":"COOKINGWAY","text":"Well, this has all been highly productive. Probably. Let's go and see if Urianger and the others have run out of machinery to inspect, shall we?"},{"name":"JEBKE","text":"So he's one of the Forum's lunar collaborators... Not quite what I was expecting, but he seems a decent sort."},{"name":"JEBKE","text":"I'm glad he enjoyed the lemon muffin, too. Hopefully the next time he has one, he won't be compelled to wax poetic about the meaning of life and the immaculate carrot again."},{"name":"URIANGER","text":"By Cookingway's broad grin, I assume your excursion was a roaring success?"},{"name":"LIVINGWAY","text":"Where have you and Cookingway been!? If the two of you were engaged in pursuits of an educational nature, you should've taken me, too! I am the leader, after all."},{"name":"GROWINGWAY","text":"Oh...there you are. &lt;yawn&gt; Have the others finished talking about rain-making wotsits yet?"},{"name":"SINGINGWAY","text":"Not to rub it in, but we had the most fantastic time while you were away! Urianger was able to obtain all manner of meteorological data for us to pore over. I'll be sure to put my newfound knowledge to good use once we return to the moon."},{"name":"SINGINGWAY","text":"It's my duty to make your journey as comfortable as possible, though there's no telling how long it will be. A hundred years? A thousand? Hmm... Probably closer to five thousand, give or take."},{"name":"COOKINGWAY","text":"That was most enlightening, especially the part with the lemon muffin."},{"name":"COOKINGWAY","text":"Actually, I was wondering, do you know of any other places famed for their cuisine?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"Limsa Lominsa is home to the Culinarians' Guild...and many less-than-savory establishments."},{"name":"A4","text":"The Far East has oodles of noodles."},{"name":"COOKINGWAY","text":"Would that I had time to visit... &lt;sigh&gt; The more I learn of Etheirys, the more I wish we could spare it from the Final Days."},{"name":"COOKINGWAY","text":"Alas, Hydaelyn's orders are to flee, not to resist. If only there was some other way..."}],"reward":{"gil":1584},"reqs":{"jobs":[{"lvl":88,"id":142}],"quests":[69979]},"next":[69981]},"partials":[{"type":"npc","id":"1040400","obj":{"i":1040400,"n":"Cookingway","l":3708,"q":1}},{"type":"quest","id":"69979","obj":{"i":69979,"n":"Wise Guides","g":11,"l":"Labyrinthos","s":597}},{"type":"quest","id":"69981","obj":{"i":69981,"n":"Sage Council","g":11,"l":"Labyrinthos","s":599}}]}