{"quest":{"name":"Bonds of Adamant(ite)","location":"Labyrinthos","id":69984,"patch":6.0,"sort":602,"eventIcon":71201,"issuer":1040455,"target":1040478,"genre":11,"journal":["Kokkol Dankkol is, as usual, worked up over the aetherburner."],"objectives":["Wait at the destination.","Speak with Alphinaud.","Speak with Fourchenault at Aporia.","Speak with Clarilaine.","Speak with Fourchenault.","Proceed to the entrance of Thaumazein.","Speak with Fourchenault."],"dialogue":[{"name":"GRAHATIA","text":"I did thoroughly brief Kokkol on refined adamantite's history. I only volunteered to go to the reactor because I had finished and there was little else to do."},{"name":"GRAHATIA","text":"Hopefully that dispels any misapprehensions that I was kicked out for prattling on..."},{"name":"KOKKOLDANKKOL","text":"&lt;sigh&gt; I do trust you to deliver on your promise, I do. Only..."},{"name":"KOKKOLDANKKOL","text":"I hate waitin'! I want that adamantite, and I want it <span class=\"emphasis\">now</span>!"},{"name":"GRAHATIA","text":"We...er, share your impatience, I assure you. Is there truly nothing else we can assist with in the meantime?"},{"name":"KOKKOLDANKKOL","text":"I wish! This sittin' about's unbearable. Pity the Forum frowns on recreational explosions..."},{"name":"KOKKOLDANKKOL","text":"Well, so long as they can't prove it was premeditated. Get you gone─I've mistakes to make!"},{"name":"GRAHATIA","text":"...In that case, I suppose I should go and return the key to the reactor. I'll have one more look to make sure that nothing has gone wrong. Unintentionally or otherwise."},{"name":"GRAHATIA","text":"I'm certain there are better uses for <span class=\"emphasis\">your</span> time, however. I will join you in Sharlayan Hamlet anon!"},{"name":"KOKKOLDANKKOL","text":"Any smoke risin' from the building behind me will be entirely unrelated to what I <span class=\"emphasis\">didn't</span> say, got it?"},{"name":"SYSTEM","text":"If you wait here, your companions are bound to turn up sooner or later..."},{"name":"Q1","text":"Await your companions?"},{"name":"ALISAIE","text":"I had no idea how massive a weight it was until he lifted it off my shoulders... But more importantly, his words were an affirmation that the path we walk is the right one."},{"name":"ALISAIE","text":"A part of me might have been satisfied so long as my family and friends survived the Final Days. But to save this star is what we <span class=\"emphasis\">all</span> want most, and if those same people believe that I can help see it done, who am I to say otherwise?"},{"name":"ALISAIE","text":"Come what may, I will fight for this world of ours until the very end."},{"name":"THANCRED","text":"If I never see another crate again, it will be too soon."},{"name":"URIANGER","text":"Unaided, we Scions could never have gathered such a bounty. Refined adamantite, relics sacred and ancient alike..."},{"name":"URIANGER","text":"I find myself quite overcome."},{"name":"YSHTOLA","text":"Lyse sent a letter along with Gridania's contribution. It seems she traveled there to aid in their adamantite recovery."},{"name":"YSHTOLA","text":"Evidently, journeying to Gridania was quite the trial. As was getting into the Dalamud shard. As was reaching its depths..."},{"name":"YSHTOLA","text":"I suspect she will have few kind words to say about the Allagans when next we meet."},{"name":"GRAHATIA","text":"I cannot wait to see what our friends from the Ironworks do with the ship!"},{"name":"ESTINIEN","text":"The time has come to claim our prize. Are you prepared?"},{"name":"KRILE","text":"I apologize for not informing you earlier of Erenville's involvement. He was something of a contingency plan."},{"name":"KRILE","text":"Thank goodness we had him and his fellow gleaners to hand, though. It would have been monstrously difficult to locate Cid and transport the Hannish delegation here otherwise..."},{"name":"TATARU","text":"&lt;cough&gt; My throat hurts from directing so many people to Labyrinthos...but that only proves we got our money's worth!"},{"name":"ALPHINAUD","text":"We've finally managed to clear the harbor, which means the rest is in the engineers' capable hands."},{"name":"ALPHINAUD","text":"Meanwhile, Father has issued to us an invitation."},{"name":"ALPHINAUD","text":"As was agreed, he will reveal the means by which Hydaelyn may be contacted."},{"name":"ALPHINAUD","text":"We are to meet him at Aporia when we're ready. Given the vital knowledge She holds, I suggest we leave without delay."},{"name":"ALPHINAUD","text":"It transpires, however, that the Forum's method for speaking with Her is not without risks. I am curious to hear what those might entail─but regardless, be warned."},{"name":"TATARU","text":"Most of those who arrived with the adamantite have offered to stay and see to any remaining tasks that need doing."},{"name":"TATARU","text":"The Forum has already asked for my assistance in overseeing the process, so you needn't worry about a thing!"},{"name":"ALPHINAUD","text":"Thank you, Tataru. We're off to Aporia, then!"},{"name":"TATARU","text":"I don't want any of you getting hurt─but I do hope you'll wring as much information out of Hydaelyn as you can. For all we know, this is the one and only opportunity we'll get."},{"name":"FOURCHENAULT","text":"<span class=\"highlight\">Forename</span>. I have already shown the others inside."},{"name":"FOURCHENAULT","text":"You will want to speak with Clarilaine. She has the key to the lift, and can send you down after me."},{"name":"CLARILAINE","text":"You're with Master Fourchenault, yes? Just step inside the lift here."},{"name":"Q2","text":"Descend to the lower levels?"},{"name":"CLARILAINE","text":"You are welcome to use the lift whenever you like."},{"name":"FOURCHENAULT","text":"From here, we proceed to the heart of Labyrinthos, and its most closely guarded secret─Thaumazein."},{"name":"FOURCHENAULT","text":"It marks the beginning and end of our efforts─whence we delved to seek audience with the star, and whence we will embark on our journey to the heavens."},{"name":"FOURCHENAULT","text":"This way, if you please."},{"name":"FOURCHENAULT","text":"I bid you welcome to Thaumazein. Direct your attention toward its center to behold the ark over which we have long labored."},{"name":"FOURCHENAULT","text":"As you can see, 'twas designed as a medium-sized craft, the better to reduce fuel consumption. Miniaturizing magicks have been applied to its interior to ensure that the thrust-to-weight ratio does not place too great a limitation on its freight capacity."},{"name":"FOURCHENAULT","text":"The aetherburner, as you know, has been removed for further modification, but we shall reattach it soon enough."},{"name":"FOURCHENAULT","text":"I have received word that Kokkol and several of your allies are working on it with an intense fervor."},{"name":"ALPHINAUD","text":"They are sure to see it done. 'Twas by their expertise that many a prior disaster was averted."},{"name":"ALPHINAUD","text":"If anything, I fear they will not afford us much time for speaking with Hydaelyn ere they finish..."},{"name":"FOURCHENAULT","text":"Point taken. Let us move on. I must warn you again, however, that even with the benefit of our device, to treat with Her is not a simple feat."},{"name":"ALPHINAUD","text":"To think how many generations labored for this end...and that we aim higher still."},{"name":"ALPHINAUD","text":"We must spare no preparation─and that means speaking with Hydaelyn, no matter the cost."},{"name":"ALISAIE","text":"I can well imagine the zeal with which they're working on the aetherburner, and all I can say is that I'm glad we have something to do other than get in their way."},{"name":"ALISAIE","text":"Once it's ready, we'll see to it that the ship is put to good use!"},{"name":"THANCRED","text":"I doubt this is what Erenville meant when he said that there remains much we do not know, but I still can't believe everything that was hidden underneath the city this entire time."},{"name":"URIANGER","text":"'Twould seem enchantments most advanced have been woven into the ship's very bones. Wilfsunn and Bloewyda were doubtless called upon for their expertise in teleportation magicks..."},{"name":"YSHTOLA","text":"We must learn of Hydaelyn's greater plan. We can only hope that She also knows the current location of Meteion..."},{"name":"YSHTOLA","text":"...And we can do neither if we do not focus on whatever trial awaits us within."},{"name":"GRAHATIA","text":"It was the Allagans who first combined the mechanical and aetherial sciences into a revolutionary discipline."},{"name":"GRAHATIA","text":"Given that this ship is nothing short of a technological marvel in that precise vein, Allagan salvage should suit it well."},{"name":"ESTINIEN","text":"You feel it too, don't you? The ship is impressive, but it pales in comparison to the vast primordial power beneath our feet..."},{"name":"KRILE","text":"If meeting Hydaelyn proves difficult even for the Forum, then perhaps I─"},{"name":"KRILE","text":"Oh, 'tis an unformed idea at this phase, I'm afraid. I will duly inform you if anything comes of it."},{"name":"FOURCHENAULT","text":"I have done what I can to impress upon you the gravity of what lies ahead."},{"name":"FOURCHENAULT","text":"Are you prepared?"}],"reward":{"gil":1414,"aetherCurrent":1,"items":[{"id":35707}]},"reqs":{"jobs":[{"lvl":88,"id":142}],"quests":[69983]},"next":[69854,69855,69985]},"partials":[{"type":"npc","id":"1040455","obj":{"i":1040455,"n":"Kokkol Dankkol","l":3708,"q":2}},{"type":"npc","id":"1040478","obj":{"i":1040478,"n":"Fourchenault","l":3708,"q":2}},{"type":"item","id":"35707","obj":{"i":35707,"n":"Chondrite Head Gear Coffer (IL 545)","l":1,"c":26558,"t":61}},{"type":"quest","id":"69983","obj":{"i":69983,"n":"Once Forged","g":11,"l":"Labyrinthos","s":601}},{"type":"quest","id":"69854","obj":{"i":69854,"n":"Leveilleur Philanthropy","g":119,"l":"Old Sharlayan","s":7120}},{"type":"quest","id":"69855","obj":{"i":69855,"n":"Sandwiches and Pretzels","g":119,"l":"Old Sharlayan","s":7130}},{"type":"quest","id":"69985","obj":{"i":69985,"n":"Her Children, One and All","g":11,"l":"Labyrinthos","s":603}}]}