{"quest":{"name":"Unto the Heavens","location":"Old Sharlayan","id":69988,"patch":6.0,"sort":606,"icon":101130,"eventIcon":71201,"issuer":1038588,"target":1039852,"genre":11,"journal":["Ojika Tsunjika is ready to send you off with a smile.","The time is come at last for you and the Scions to embark on your mission to Ultima Thule. After offering you a few words of wisdom, Ojika Tsunjika bids you farewell as you make for Thaumazein.","With all gathered at Thaumazein, Fourchenault unveils the <span class=\"emphasis\">Ragnarok</span>, which will bear you and the other Scions unto Ultima Thule. The gathering is interrupted by the arrival of Sicard, who has brought with him representatives of the world's myriad beast tribes. The reason for their presence, as Livingway explains, is to use the power of primal summoning to convert the Mothercrystal's energy into a form that can be transported to the ship's engines─for contrary to common belief, it is in fact possible to summon deiform beings without risk of being tempered. In light of this revelation, all present are willing to go along with the plan, and so the beastmen take their leave to prepare for the ritual.<br><br>As the beastmen contingent departs, Wilfsunn steps forward to offer you and the Scions teleportation devices he created for your mission. Designed to be used in tandem, they will teleport the Scions back to the ship in the event of an emergency. With no other matters left undone, Livingway boards the ship, and Fourchenault bids you do the same.","The <span class=\"emphasis\">Ragnarok</span> trembles as its various components whir to life. With a boisterous command, the thrusters are engaged and the ship takes off into the great expanse.","It does not take long to arrive at Ultima Thule, but no sooner do you enter her domain than Meteion manifests on the ship's bridge. A battle of words ensues, but is cut short when Meteion brings her power to bear, suffocating you and the Scions effortlessly. You fall to your knees, gasping for air. The last thing you see is Thancred charging at Meteion before the world fades to black.<br><br>You awake seemingly none the worse for wear, but with one less of your number than before─Thancred is nowhere to be seen. Thinking that he may have pursued Meteion, you and the others make ready to disembark.","Atmospheric readings show Ultima Thule is capable of sustaining life, though the strange and unnerving surrounds give very much the opposite impression. Nevertheless, the hunt for Meteion can now begin in earnest. But first, you must discover the whereabouts of Thancred."],"objectives":["Speak with Fourchenault at Thaumazein.","Speak with Aeglyffe.","Speak with Livingway."],"dialogue":[{"name":"OJIKATSUNJIKA","text":"I suppose this is where we part ways. For now, at least."},{"name":"OJIKATSUNJIKA","text":"Would that I had sage words of wisdom to share ere you depart... Mayhap the teachings of Galuf Baldesion will suffice?"},{"name":"OJIKATSUNJIKA","text":"\"Surrender not to anger or hatred,“ he said. ”Look beyond them, and there find true strength.“"},{"name":"OJIKATSUNJIKA","text":"What one sees beyond is open to interpretation, I think, but for me, it would be the things I cherish most in life. Things I believe are worth fighting for."},{"name":"OJIKATSUNJIKA","text":"Something to consider as you venture unto the sea of stars."},{"name":"OJIKATSUNJIKA","text":"The others are already off to Thaumazein. Best not keep them waiting, eh?"},{"name":"ALPHINAUD","text":"Let us hear what Father has to say."},{"name":"ALISAIE","text":"They said work on the ark is finished, but you certainly wouldn't know by looking at it."},{"name":"THANCRED","text":"I wasn't expecting quite so many people to be seeing us off."},{"name":"URIANGER","text":"That even Wilfsunn and Bloewyda should be in attendance is most unexpected, but I am nonetheless heartened by their presence."},{"name":"YSHTOLA","text":"This is the pinnacle of aetherochemistry. A synthesis of modern innovation and the ancient wisdom of Allag. The ark's engine appears to be capable of processing condensed aether in quantities I never thought possible."},{"name":"GRAHATIA","text":"So this is the ship that will bear us unto Ultima Thule..."},{"name":"ESTINIEN","text":"For so many to see us off like this seems wholly unnecessary. Still...I'll not begrudge them for wishing us well."},{"name":"LIVINGWAY","text":"The ark is missing one last─but very crucial─component before we are ready to take off. It should be arriving shortly."},{"name":"EMMANELLAIN","text":"It's troubling enough that that brute Sicard left without warning, leaving me to carry all those cumbersome containers, but that he failed to be present to send you off is absurd. What could possibly be more deserving of his attention at a time like this?"},{"name":"KRILE","text":"Quite the turnout, wouldn't you say? Then again, who wouldn't want to be present for a once-in-a-lifetime event?"},{"name":"TATARU","text":"I'll send word to the Alliance leaders the very moment the ship takes off. Obviously they couldn't be here, but I'm sure they'll be cheering for you every step of the way."},{"name":"WILFSUNN","text":"Moenbryda has been on my mind more often of late. How different her life might have been if not for our research into teleportation magicks. Perhaps she would never have gained an interest in aetherological studies..."},{"name":"WILFSUNN","text":"But to abandon our work out of misplaced guilt for who she could have been would be a disservice to the memory of who she was."},{"name":"WILFSUNN","text":"Nay, it was <span class=\"emphasis\">because</span> of her that we found the resolve to carry on. And now we stand at the edge of a new frontier, with a ship ready to bear you unto the distant stars and beyond. This ark is as much her accomplishment as it is ours. I regret nothing."},{"name":"BLOEWYDA","text":"We were quite fortunate the Loporrits' hyperhopper was based on principles similar to those of aetherology. Integrating it with the ark's existing systems might well have been impossible otherwise."},{"name":"BLOEWYDA","text":"We may have Sharlayan's wealth of knowledge at our disposal, but theirs is technology far beyond anything we have ever studied."},{"name":"BLOEWYDA","text":"You are familiar with teleportation magicks, yes? The momentary conversion of the body into aether that it may travel via the Lifestream from one physical point to another."},{"name":"BLOEWYDA","text":"Their hyperhopper enables transport through a similar method─but not one involving the Lifestream. Rather, it utilizes highly condensed aether to create an aetherial current of its own!"},{"name":"BLOEWYDA","text":"This current is exponentially faster and more powerful than the naturally occurring ones to which we are accustomed. So much so, in fact, that aetherial conversion of the physical form is not a prerequisite for traversal."},{"name":"BLOEWYDA","text":"If you are concerned about side effects, such as aetherial sickness, you needn't be. You should emerge at your destination hale and whole...in theory. At the very least, I can assure you it is safer than the experimental aetherytes you used to reach Radz–at–Han."},{"name":"HOARYBOULDER","text":"Though our fellow Scions couldn't be here, they wanted me to tell you that, no matter what calamity may befall us, they will never give up, and neither should you."},{"name":"HOARYBOULDER","text":"No matter how far you may go, we will be with you in spirit. No matter how dark it may seem, your light will shine and endure."},{"name":"COULTENET","text":"It is no easy thing to say “leave the star to us.” But we must, and we will. As proud members of the Scions, we have a duty to uphold."},{"name":"COULTENET","text":"And we needn't do so alone. Those dark days when we were driven from the Rising Stones and hunted as traitors are a thing of the past. We have allies in abundance now."},{"name":"COULTENET","text":"Which is to say, you needn't worry about us. Go forth in the knowledge that the Scions will labor without rest in your absence."},{"name":"ERENVILLE","text":"First the great exodus, and now this...it seems there's no end to our work."},{"name":"ERENVILLE","text":"In truth, more than a few gleaners were distressed to learn that their earlier efforts were for nothing. It was no easy task convincing them that the new plan was for the best, I can tell you that."},{"name":"ERENVILLE","text":"I can't tell you every man believes this is the wisest course, but I can say that all will be forgiven if you deliver us from the coming doom. And if you don't, well, at least you won't get the earful I certainly will."},{"name":"VARSHAHN","text":"Man is said to fear what he does not know, yet you would venture unto the greatest of unknowns."},{"name":"VARSHAHN","text":"I say to you, <span class=\"alternative-container\"><span class=\"alternative\">daughter</span><span class=\"alternative\">son</span></span> of man, that you need not fear. So long as man shares a bond with dragonkind, so too does he share our kinship with the heavens, and our ancient home amidst the stars infinite."},{"name":"VARSHAHN","text":"I pray you go forth, and prove this bond of ours, tempered and tested, shall endure unbroken for a thousand thousand years."},{"name":"NIDHANA","text":"Mistress Krile tells me your investigation into my theories on akasa─and its relation to the Final Days─has made clear the source of our woes."},{"name":"NIDHANA","text":"I am elated to know my work was of some benefit, but I could not have shared it had you not rescued me from the tower that day."},{"name":"NIDHANA","text":"I yet owe you a great debt, one I may never fully repay. But I shall try nonetheless!"},{"name":"NIDHANA","text":"Not only through my research, but through my desire to see you succeed, which I believe may influence the akasa in our favor, small though the effect may be. Yes, so long as we have hope, there is a chance we may influence the outcome of this calamity."},{"name":"ALPHINAUD","text":"The <span class=\"emphasis\">Ragnarok</span>... And thus does Grandfather's legacy live on."},{"name":"ALPHINAUD","text":"We mustn't waste any more time. Let us board, and set out for Ultima Thule!"},{"name":"ALISAIE","text":"Mother, Father... Grandfather."},{"name":"ALISAIE","text":"We <span class=\"emphasis\">will</span> save this star and return home. I promise..."},{"name":"THANCRED","text":"Venturing quite literally into the unknown, we have to be ready for anything."},{"name":"THANCRED","text":"As I said before, whatever awaits us there, we will survive. We <span class=\"emphasis\">must</span>."},{"name":"URIANGER","text":"I am most grateful Wilfsunn and Bloewyda have devised a contingency should the need to flee arise, though I pray it shall not."},{"name":"URIANGER","text":"We must needs strive for victory to the last, that Etheirys and her people survive, and that her champions return home. Without exception."},{"name":"YSHTOLA","text":"Primal summoning...as it was intended... I never dared to consider they could be invoked without the danger of tempering."},{"name":"YSHTOLA","text":"Change has come quickly to this star, and greater change yet awaits in the days to come. All the more reason we must not fail."},{"name":"GRAHATIA","text":"So, the stage is set. I can but hope we are prepared to play our parts when we arrive on Ultima Thule."},{"name":"GRAHATIA","text":"The key, I suspect, may lie with Hydaelyn's parting message to us."},{"name":"GRAHATIA","text":"“Darkness and Light. Despair and hope. As goes one, so goes the other.” Knowing Meteion wields the power of despair, we must bring to bear hope in equal measure."},{"name":"ESTINIEN","text":"I'd rather not spend any longer mulling over strategy."},{"name":"ESTINIEN","text":"None of us are strangers to despair. If that is the source of her power, we are ready for it."},{"name":"FOURCHENAULT","text":"Ameliance will not be joining us, I'm afraid. She could not bear to watch our children embark on so perilous a mission."},{"name":"FOURCHENAULT","text":"Make no mistake─I feel the same. I cannot tell you how many times I had to step away from my duties, so distracted by thoughts of all the ways it could go wrong..."},{"name":"FOURCHENAULT","text":"Even now a part of me wants to drag them away and forbid─ ...Well. Not that they would listen. So I will see them off with pride in my heart and a prayer on my lips."},{"name":"FOURCHENAULT","text":"For my children, and for this star they love so dearly, you must prevail."},{"name":"CID","text":"The <span class=\"emphasis\">Ragnarok</span> is a collaborative effort in every sense."},{"name":"CID","text":"The culmination of knowledge from the world's greatest minds, both past and present. Without question the greatest ship ever built."},{"name":"NERO","text":"The world cannot end now, not when we've but scratched the surface of the Loporrits' technological know-how."},{"name":"NERO","text":"So run along now, and do what it is you vaunted heroes do best. The world shall tremble before my genius soon enough, assuming you're able to prevent its destruction, that is."},{"name":"BIGGS","text":"I'll have to remember to thank Tataru for her timely provisions of food and drink. Poor Wedge would've long since given up from exhaustion otherwise."},{"name":"BIGGS","text":"But now the rest is up to you. Come back safe, all right?"},{"name":"WEDGE","text":"You haven't forgotten anything, have you? No repairs or commissions? A delivery from retainers, perhaps? ...No?"},{"name":"WEDGE","text":"Well! If there's nothing else, have a safe journey!"},{"name":"EMMANELLAIN","text":"So <span class=\"emphasis\">that</span> was the covert operation Sicard was assigned? Hmph! No doubt he thinks we were all impressed by the way he barged in here, beastmen in tow, hero of the hour."},{"name":"EMMANELLAIN","text":"He leaves me with no choice but to give you the most spectacular of farewells. Yes, a display of such jubilance my arms may very well fall to pieces."},{"name":"AEGLYFFE","text":"If you would come this way, I will direct you to the bridge."},{"name":"SYSTEM","text":"Upon boarding the <span class=\"emphasis\">Ragnarok</span>, several cutscenes will play in sequence."},{"name":"SYSTEM","text":"It is recommended that you set aside sufficient time to view these scenes in their entirety."},{"name":"Q1","text":"Are you prepared to board the <span class=\"emphasis\">Ragnarok</span>?"},{"name":"ALPHINAUD","text":"It is as Livingway said. I can breathe well enough, but something about this place feels...wrong."},{"name":"ALISAIE","text":"It's so dark. I can barely see anything..."},{"name":"URIANGER","text":"Didst thou witness what became of Thancred? So quickly was I overcome by Meteion's malevolence that I saw naught of their altercation."},{"name":"YSHTOLA","text":"We were clearly no match for Meteion, yet we survived unscathed. But how...?"},{"name":"GRAHATIA","text":"If Meteion should strike again with such overwhelming force, I honestly don't know how we are to oppose her."},{"name":"ESTINIEN","text":"There is a dizzying, disorienting feeling about this place. As if I could lose my footing at any moment... We must be careful."},{"name":"LIVINGWAY","text":"I can't guarantee it will be of help in these strange surrounds, but I've readied a provisions node in case of emergency."},{"name":"LIVINGWAY","text":"Of course, if you encounter any <span class=\"emphasis\">real</span> danger here, I expect you to return to the <span class=\"emphasis\">Ragnarok</span> at once."}],"reward":{"gil":1509},"reqs":{"jobs":[{"lvl":89,"id":142}],"quests":[69987]},"next":[69989]},"partials":[{"type":"npc","id":"1038588","obj":{"i":1038588,"n":"Ojika Tsunjika","l":3706,"q":5}},{"type":"npc","id":"1039852","obj":{"i":1039852,"n":"Livingway","l":3712,"q":1}},{"type":"quest","id":"69987","obj":{"i":69987,"n":"Friends Gathered","g":11,"l":"Old Sharlayan","s":605}},{"type":"quest","id":"69989","obj":{"i":69989,"n":"A §trαnge New World","g":11,"l":"Ultima Thule","s":607}}]}