{"quest":{"name":"Friends Gathered","location":"Old Sharlayan","id":69987,"patch":6.0,"sort":605,"eventIcon":71201,"issuer":1039818,"target":1038588,"genre":11,"journal":["Though delighted by your patronage, Tataru is ready to send you on your way."],"objectives":["Speak with Krile.","Speak with Thancred.","Speak with Y'shtola.","Speak with Alisaie.","Speak with Alphinaud.","Speak with Ojika Tsunjika."],"dialogue":[{"name":"TATARU","text":"I realize you've still got lots to do before you depart, so I won't keep you any longer."},{"name":"TATARU","text":"I do hope you can find a moment for yourself, and that the others can as well. They said they were returning to the Baldesion Annex, though I doubt they stayed for long."},{"name":"TATARU","text":"If you decide to go looking for them, I'd suggest speaking with Krile first. I'm sure they would have told her their plans."},{"name":"TATARU","text":"Be sure to stop by the boutique if you find yourself in need of more equipment!"},{"name":"KRILE","text":"You're back. I take it you received your gift from Tataru?"},{"name":"KRILE","text":"It was a surprise long in the making, with many, many long hours of fretting to get everything just right. I'm glad to see it realized, and with great success."},{"name":"KRILE","text":"If you're looking for the others, though, they've already taken their leave."},{"name":"KRILE","text":"Y'shtola, Thancred, and Urianger have gone to the Last Stand for a bite to eat."},{"name":"KRILE","text":"Alisaie and G'raha Tia, meanwhile, thought their time would be better spent poring over books at Noumenon."},{"name":"KRILE","text":"As for Alphinaud and Estinien, well... They've elected to pay a visit to the Leveilleur estate, though Estinien seemed somewhat reluctant to go."},{"name":"KRILE","text":"I'm sure they would all be glad for your company if you've a mind to seek them out."},{"name":"KRILE","text":"Should you be feeling peckish, I'd suggest heading to the Last Stand before Y'shtola and the others finish eating. But above all else, it would be foolish to run headlong into battle a fatigued mess, so do remember to get a good night's sleep."},{"name":"KRILE","text":"I've a few matters to attend to myself before you and the others depart for Ultima Thule. But rest assured, Tataru and I will keep everything in order while you're all away."},{"name":"YSHTOLA","text":"Try as she might, Tataru had no chance of standing between you and a hearty meal. Don't worry, we saved some for you."},{"name":"URIANGER","text":"Hast thou perchance had opportunity to partake of the rainbow pudding? Owing to its striking flavor and somewhat garish appearance, 'tis quite popular. Indeed, so popular that the Last Stand's stock hath been entirely exhausted."},{"name":"URIANGER","text":"I should hope, at the very least, Puddingway did sup upon this most delectable of desserts."},{"name":"THANCRED","text":"<span class=\"highlight\">Forename</span>! Come to make our trio a quartet, have you?"},{"name":"THANCRED","text":"Please, have a seat, and we'll see about getting you a drink."},{"name":"THANCRED","text":"You can always count on your friends to help you maintain perspective. A pity mine take a perverse pleasure in it."},{"name":"THANCRED","text":"I'd like to think I give as good as I get─though I'd fare better with the occasional assist from our consummate nodder."},{"name":"THANCRED","text":"But it's all in good fun. And I wouldn't have it any other way."},{"name":"URIANGER","text":"I say, <span class=\"highlight\">Forename</span>, whence came this─hic!─simulacrum that standeth beside thee?"},{"name":"URIANGER","text":"...I see falsely? But Y'shtola and Thancred, but moments ago, employed the selfsame doubling magick..."},{"name":"URIANGER","text":"All right, then─hic!─keep thy secrets..."},{"name":"YSHTOLA","text":"Leaving so soon? I suppose it's for the best...if you'd rather not explore the bottom of a bottle with Urianger."},{"name":"YSHTOLA","text":"I daresay the others would welcome your company as well. If you can find them, that is."},{"name":"YSHTOLA","text":"In any case, as long as you make the most of your time, then that is all that matters."},{"name":"YSHTOLA","text":"We will remain here a while longer. At the very least, until Urianger finds his legs again."},{"name":"GRAHATIA","text":"&lt;snore&gt;"},{"name":"ESTINIEN","text":"What...? Surely this isn't the first time you've seen me without my armor."},{"name":"SYSTEM","text":"You try speaking with Alisaie, but she is fast asleep."},{"name":"ALISAIE","text":"Gods, I didn't realize I was so tired. One moment I was resting my eyes, and the next..."},{"name":"ALISAIE","text":"I should go and get some air. Maybe a quick bout of training. But not sleep. I'll sleep when I'm dead."},{"name":"GRAHATIA","text":"That's enough reading for one day. As we don't know how long we'll be away, I'd best return these books before we depart."},{"name":"GRAHATIA","text":"And eat. I'm absolutely famished. What about you?"},{"name":"GRAHATIA","text":"I see... Perhaps I'll stop at the Last Stand on my way back."},{"name":"KRILE","text":"If nothing else, these two seem to be in good spirits. Still, I'll see them back to the annex for some proper rest, even if I have to drag them by the ears."},{"name":"ALPHINAUD","text":"A few of our comrades decided to remain a while in Sharlayan after making their deliveries. Did you happen to pass any on your way here?"},{"name":"ESTINIEN","text":"All that remains is to return to the annex and give my armor one last polish. I expect Alphinaud has maintenance to carry out on those...floating things of his, too."},{"name":"OJIKATSUNJIKA","text":"Welcome back, <span class=\"highlight\">Forename</span>! Returned to catch a final few winks before embarking on your mission, I presume?"},{"name":"OJIKATSUNJIKA","text":"You'll be happy to know your chambers have been cleaned, and fresh linens laid out."},{"name":"OJIKATSUNJIKA","text":"I pray you enjoy the sweetest dreams on this final night before the big day..."},{"name":"Q1","text":"Retire to your chambers?"}],"reward":{"gil":1595},"reqs":{"jobs":[{"lvl":89,"id":142}],"quests":[69986]},"next":[69988]},"partials":[{"type":"npc","id":"1039818","obj":{"i":1039818,"n":"Tataru","l":3706,"q":1}},{"type":"npc","id":"1038588","obj":{"i":1038588,"n":"Ojika Tsunjika","l":3706,"q":5}},{"type":"quest","id":"69986","obj":{"i":69986,"n":"A Bold Decision","g":11,"l":"Old Sharlayan","s":604}},{"type":"quest","id":"69988","obj":{"i":69988,"n":"Unto the Heavens","g":11,"l":"Old Sharlayan","s":606}}]}