{"quest":{"name":"Once Forged","location":"Labyrinthos","id":69983,"patch":6.0,"sort":601,"eventIcon":71201,"issuer":1040451,"target":1040455,"genre":11,"journal":["An unspecified task awaits you."],"objectives":["Speak with G'raha Tia.","Survey the designated location and defeat any enemies that appear.","Survey the designated location again.","Speak with Kokkol Dankkol."],"dialogue":[{"name":"ALPHINAUD","text":"'Tis strange to hear Father spoken of in such a way...but I suppose he would find your view of me no less odd."},{"name":"ALISAIE","text":"Much as I'd like to press Theopauldin for more revealing tidbits, we should be getting back to our tasks."},{"name":"GRAHATIA","text":"In the event that our─and I quote─“promised heap of adamantite falls right out of the bloody sky and into my lap,” Master Kokkol wishes to be ready to put the proverbial hammer to anvil at a moment's notice."},{"name":"GRAHATIA","text":"To fabricate these parts, however, he needs the flames in Kokkol's Forge to burn hotter. He sent me to increase the amount of aether being funneled to his furnaces."},{"name":"GRAHATIA","text":"The flow of fire-aspected aether in Labyrinthos is regulated by an elemental reactor south of here─to which I have borrowed the key."},{"name":"GRAHATIA","text":"The adjustment will require two people to carry out safely...but I can explain the process when we arrive."},{"name":"ALISAIE","text":"This is where we part, then."},{"name":"ALISAIE","text":"We'll see you in Sharlayan Hamlet once the adamantite arrives, if not before."},{"name":"GRAHATIA","text":"This way, then!"},{"name":"GRAHATIA","text":"The reactor is housed within this facility."},{"name":"GRAHATIA","text":"I'll be the one to go inside and adjust the fire aether output."},{"name":"GRAHATIA","text":"When I do, a rather large amount of water-aspected aether will issue from the vent at the top. I expect this to attract at least a few elementals─which we would both rather not be drawn into the reactor itself. Trust me."},{"name":"GRAHATIA","text":"Can I ask that you put down any that draw too near? They'll pose you little trouble, I'm sure."},{"name":"GRAHATIA","text":"Wait here, if you would!"},{"name":"POPMESSAGE","text":"An apa is lured by the siren song of water-aspected aether!"},{"name":"POPMESSAGE","text":"Further creatures have been attracted by the font of aether!"},{"name":"GRAHATIA","text":"Did everything go smoothly out here?"},{"name":"GRAHATIA","text":"I thought as much. No major complications to speak of inside, either."},{"name":"GRAHATIA","text":"...And the water aether appears to be venting properly."},{"name":"GRAHATIA","text":"I expect Kokkol will have seen a difference in his forge-flames by the time I return."},{"name":"GRAHATIA","text":"Since I have you...there was another matter I thought to discuss with you."},{"name":"GRAHATIA","text":"Nothing terribly important─merely something I've been considering."},{"name":"GRAHATIA","text":"Part of this, I shared with everyone. Yet you, and only you, have been to Elpis..."},{"name":"GRAHATIA","text":"As we have established, refined adamantite is a product of Allag. Of the empire's twilight years, in fact."},{"name":"GRAHATIA","text":"It was a material which saw much use as part of the Allagans' efforts to extend beyond the bounds of this world─Dalamud, of course, being the most prominent."},{"name":"GRAHATIA","text":"Of those who would push further─expand Allag's empire to encompass the heavens and the stars above─perhaps the greatest was its infamous technologist, Amon."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"<span class=\"emphasis\">Amon</span> wanted to travel the sea of stars?"},{"name":"A1","text":"Did he remember his life as Hermes?"},{"name":"GRAHATIA","text":"He did. He must have had his own reasons, however, for there is no evidence to suggest that he retained memories of his life as an ancient."},{"name":"GRAHATIA","text":"I believe he had his own reasons. There is no evidence to suggest that he retained memories of his former life."},{"name":"GRAHATIA","text":"He only joined the Ascians once the empire was all but dust, as you know."},{"name":"GRAHATIA","text":"If not his memory, though, what drove him to pursue the idea with such fervor?"},{"name":"GRAHATIA","text":"This may seem far-fetched, but what if souls, like minds, have...a personality, so to speak? A natural disposition towards which they are inclined?"},{"name":"GRAHATIA","text":"We know with relative certainty that it was the gross decadence and inexorable decline of Allag that moved Amon to resurrect Emperor Xande."},{"name":"GRAHATIA","text":"The empire's people spoke lightly of death and destruction, experimenting on those they deemed beneath them to fill the emptiness in their hearts."},{"name":"GRAHATIA","text":"In facilitating Xande's return, Amon provided these languid souls with the means to free themselves from the mire of their own indolence."},{"name":"GRAHATIA","text":"...Or would have, had not Xande been convinced by his own death that life itself was meaningless."},{"name":"GRAHATIA","text":"Amon's desire for his countrymen to conquer the heavens could only be a means to the same end─to instill the people with new purpose."},{"name":"GRAHATIA","text":"Like Hermes before him, Amon was appalled by how those around him lived, but could never bring himself to believe that those lives were devoid of meaning."},{"name":"GRAHATIA","text":"And both of them sought that meaning, that hope, in the distant stars."},{"name":"GRAHATIA","text":"...Such is my theory, anyway."},{"name":"GRAHATIA","text":"Ultimately, it is the consequences of their actions which matter. Their motives are of no moment. And yet..."},{"name":"GRAHATIA","text":"To reach those stars on wings of adamantite. To travel to the ends of creation and beyond. The promise of hope everlasting...that much I do understand."},{"name":"GRAHATIA","text":"But enough musing for now. Why don't we see how Kokkol is getting on?"},{"name":"GRAHATIA","text":"I did thoroughly brief Kokkol on refined adamantite's history. I only volunteered to go to the reactor because I was finished and there was little else to do."},{"name":"GRAHATIA","text":"Hopefully that dispels any misapprehensions that I was kicked out for prattling on..."},{"name":"KOKKOLDANKKOL","text":"Whew! I can feel those flames a-blazin' from here!"},{"name":"KOKKOLDANKKOL","text":"Glad you found someone capable, G'raha, but there's not much left for you lot to do."},{"name":"KOKKOLDANKKOL","text":"'Less you can conjure up that refined adamantite any faster...?"}],"reward":{"gil":904},"reqs":{"jobs":[{"lvl":88,"id":142}],"quests":[69982]},"next":[69984]},"partials":[{"type":"npc","id":"1040451","obj":{"i":1040451,"n":"G'raha Tia","l":3708,"q":1}},{"type":"npc","id":"1040455","obj":{"i":1040455,"n":"Kokkol Dankkol","l":3708,"q":2}},{"type":"quest","id":"69982","obj":{"i":69982,"n":"Hither and Yarns","g":11,"l":"Labyrinthos","s":600}},{"type":"quest","id":"69984","obj":{"i":69984,"n":"Bonds of Adamant(ite)","g":11,"l":"Labyrinthos","s":602}}]}