{"quest":{"name":"Hither and Yarns","location":"Labyrinthos","id":69982,"patch":6.0,"sort":600,"eventIcon":71201,"issuer":1040436,"target":1040447,"genre":11,"journal":["The pall of anxiety over Sharlayan Hamlet has thinned to more manageable levels."],"objectives":["Search for Alisaie.","Pick up the crate of samples.","Deliver the crate of samples to Alphinaud.","Speak with Theopauldin.","Deliver the ream of documents to the reserved representative.","Speak with Theopauldin."],"dialogue":[{"name":"THANCRED","text":"Remind me to invite Urianger for a drink, when we have a moment to breathe. We're long overdue for one."},{"name":"THANCRED","text":"We can raise a glass to Moenbryda."},{"name":"LIVINGWAY","text":"I was so busy asking questions about Etheirys that I never thought to ask more about Urianger..."},{"name":"LIVINGWAY","text":"I'd like to, but where would I begin?"},{"name":"GROWINGWAY","text":"I assure you that my fellow Loporrits are equally excited to have this opportunity. They were humming the whole way here!"},{"name":"SINGINGWAY","text":"We spent so long gazing at this star. Wondering, and hoping... But to be here now, to walk among the people, to be a part of their lives and know that we've made a difference... It's so much more than I ever dreamed."},{"name":"COOKINGWAY","text":"Goodness me, I've never felt like there was too <span class=\"emphasis\">little</span> time before! There are so many people to talk to, so many things to learn..."},{"name":"WILFSUNN","text":"Classical Roegadyn isn't so different from Eorzean. Did you ever wonder why we named our daughter “moon's bride”?"},{"name":"WILFSUNN","text":"When I first held her, the moon was shining silver and full─the whole world seemed aglow. I knew it had chosen her─that she would be a beacon of that selfsame light."},{"name":"WILFSUNN","text":"Of course, we'd later hear our fair share of jokes about how we ought to have gone for “sun” instead, with how bright and stubborn she was. But fiery as my Moenbryda was, she was always kind. Kind and gentle."},{"name":"BLOEWYDA","text":"Oh... You must be one of the Scions, correct?"},{"name":"BLOEWYDA","text":"Thank you for caring for my daughter. The time she spent with you was all too short, but I know she was proud to have you as comrades."},{"name":"BLOEWYDA","text":"Urianger is too, I'm sure. And I certainly feel better for knowing he has good friends to look after him. See that he comes home from time to time, will you?"},{"name":"URIANGER","text":"Ahem. Thou hast my gratitude for lending courage to the Loporrits."},{"name":"URIANGER","text":"Not disposed to rest on their laurels, several of our guests have elected to accompany my countrymen to their stations."},{"name":"URIANGER","text":"Some few may still come hither seeking counsel, and so shall I remain to aid them as need be. If thou art needed elsewhere, do not let me detain thee."},{"name":"THANCRED","text":"As a matter of fact, I was hoping you might check on Alisaie. Last I saw, she was struggling to carry an enormous pile of boxes out the west gate..."},{"name":"THANCRED","text":"I could go myself, but we both know whose help she's less like to scorn."},{"name":"THANCRED","text":"Not to mention that─much to my misfortune─I can think of several other things I ought to be doing. Until later!"},{"name":"URIANGER","text":"Pray assist Mistress Alisaie. She hath taken up too great a burden, like as not."},{"name":"URIANGER","text":"Livingway and I shall attend to matters here."},{"name":"ALISAIE","text":"<span class=\"highlight\">Forename</span>! What are you doing out here?"},{"name":"ALISAIE","text":"No, I don't <span class=\"emphasis\">mind</span> if you help with the boxes, but it's far from the most exciting of tasks. Are you sure?"},{"name":"ALISAIE","text":"Well, I appreciate the assistance."},{"name":"ALISAIE","text":"We need to get these to Aporia. Time is short, of course─but they're full of organic specimens and samples, so try not to be too rough with them."},{"name":"ALISAIE","text":"Alphinaud should be waiting for us when we arrive. I'll see you there!"},{"name":"SYSTEM","text":"Deliver the crate of samples to Alphinaud."},{"name":"SYSTEM","text":"You will have three minutes to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"ALISAIE","text":"I can't shake the feeling that there are more of these than when I started. Did I pick up an additional crate somewhere...?"},{"name":"ALPHINAUD","text":"Fancy seeing you here! To what do I owe the pleasure?"},{"name":"SYSTEM","text":"Alphinaud is clearly awaiting delivery of the samples..."},{"name":"SYSTEM","text":"Oh, you're helping with the crates! Wonderful─you can put that there, with the others..."},{"name":"ALPHINAUD","text":"You have my gratitude, but how did you come to be involved in this?"},{"name":"ALPHINAUD","text":"Hah, then I suppose I have Thancred to thank as well."},{"name":"ALPHINAUD","text":"If you're wondering why we were tasked with bringing these boxes to Aporia to begin with─so was I."},{"name":"ALPHINAUD","text":"It turns out that this is a base of operations, of sorts. Those with final say as to what is included in the ship's manifest can be found here."},{"name":"ALPHINAUD","text":"Father included, I suspect..."},{"name":"ALISAIE","text":"That should be everything!"},{"name":"ALPHINAUD","text":"You carried all of that at once!? Are you <span class=\"emphasis\">trying</span> to injure yourself?"},{"name":"ALISAIE","text":"Oh, hush. They're lighter than they look─and not everyone has your delicate arms."},{"name":"ALISAIE","text":"I suppose we should let someone know that we've finished..."},{"name":"ALPHINAUD","text":"Theopauldin is in the courtyard. We can report to him."},{"name":"ALISAIE","text":"Why don't you come along? You should get credit for your assistance, at least. Considering where we are, we might even learn something interesting!"},{"name":"ALPHINAUD","text":"I keep thinking that I've seen him elsewhere, but I cannot for the life of me remember when."},{"name":"ALISAIE","text":"This must be Theopauldin."},{"name":"THEOPAULDIN","text":"Gods, it never ends, does it? &lt;sigh&gt; What can I do for you?"},{"name":"ALISAIE","text":"We've brought samples from Sharlayan Hamlet─series one-one-zero? The crates are by the entrance."},{"name":"THEOPAULDIN","text":"Ah, thank you. I had expected one of my colleagues, but we are dreadfully shorthanded..."},{"name":"THEOPAULDIN","text":"Just a moment─you are Fourchenault's children, are you not?"},{"name":"ALPHINAUD","text":"Alphinaud and Alisaie, at your service. You're well acquainted with Father, I take it?"},{"name":"THEOPAULDIN","text":"Quite! I've been friends with your parents since our days at the Studium. I remember when you were yea high, waddling hither and thither..."},{"name":"THEOPAULDIN","text":"Clearly, it's been quite some time since we've met. 'Tis good to see you again─wielding your father's nouliths, no less!"},{"name":"ALISAIE","text":"You knew our parents when they were young? What were they like? Pray, spare no detail!"},{"name":"THEOPAULDIN","text":"I should like nothing more than to regale you─alas, I <span class=\"emphasis\">am</span> meant to be in charge here, and reams of paperwork want for submission."},{"name":"ALISAIE","text":"We can help with that! In exchange for the sort of stories our parents would never willingly divulge, of course."},{"name":"THEOPAULDIN","text":"Er...very well, then. There happen to be three sets of documents in need of delivery, so how about you each take one?"},{"name":"ALISAIE","text":"Wait right there!"},{"name":"THEOPAULDIN","text":"You will find a Forum representative waiting to collect these near the southernmost structure. I hope I haven't kept her waiting too long..."},{"name":"THEOPAULDIN","text":"Never mind Alphinaud and Alisaie─I'm certain they will be back soon enough."},{"name":"THEOPAULDIN","text":"Who are you, by the by? The twins' minder?"},{"name":"LEGISLATOR04446","text":"Are you not one of the Scions of the Seventh Dawn? I thought you were meant to be working on the aetherburner..."},{"name":"LEGISLATOR04446","text":"Theopauldin's paperwork! I was beginning to worry he had misplaced his quill."},{"name":"LEGISLATOR04446","text":"I appreciate your help in seeing these documents to my hands at last. As for your other task..."},{"name":"LEGISLATOR04446","text":"Pray keep this between us, but I sincerely hope you Scions succeed."},{"name":"LEGISLATOR04446","text":"The exodus is, without a doubt, the most monumental undertaking in the history of the Forum, and so we must be circumspect in all respects. Risk is a privilege we cannot afford ourselves."},{"name":"LEGISLATOR04446","text":"At its heart, however, Sharlayan has ever been a nation of the curious. 'Twould be a tragedy indeed if we were the ones to stymie your pursuit of truth."},{"name":"THEOPAULDIN","text":"Quick and efficient. I daresay you have a talent for this work."},{"name":"THEOPAULDIN","text":"The twins' papers only needed be delivered to elsewhere in the facility, so they should be returning any moment..."},{"name":"ALISAIE","text":"We return—with not a scrap of paperwork remaining on our persons, you will note."},{"name":"THEOPAULDIN","text":"You both have my thanks─and my apologies for sending you on an errand far below your ambitions. Why, even as a babe, you struggled out of your swaddling clothes, and..."},{"name":"ALISAIE","text":"That is quite enough of that, thank you! It was compromising stories of our <span class=\"emphasis\">parents</span> that we'd asked to hear, to reiterate."},{"name":"THEOPAULDIN","text":"Of course, of course. I've known your father for so long, I must have something. Hm..."},{"name":"THEOPAULDIN","text":"Well...as you know, part of why the Leveilleur name garners such respect in Sharlayan is your family's storied history."},{"name":"THEOPAULDIN","text":"You two can trace your ancestry directly to those who came aboard <span class=\"emphasis\">Nyunkrepf's Hope</span>─a lineage few can claim."},{"name":"ALISAIE","text":"I've never thought much of it myself. It's not as though our forebears founded our nation. They were simply there when it happened."},{"name":"ALPHINAUD","text":"Nevertheless, it has traditionally been a point of pride."},{"name":"ALPHINAUD","text":"'Tis why Nyunkrepf's pronouncement─“Renounce the ways of war, and pursue enlightenment through knowledge and reason”─has ever been our family's creed."},{"name":"THEOPAULDIN","text":"Until your grandfather's time, aye."},{"name":"THEOPAULDIN","text":"Archon Louisoix looked not to Nyunkrepf's words, but his deeds. He asserted, in defiance of his peers, that choosing to save the great <span class=\"emphasis\">and</span> the small from the rising tides was the true mark of our founder's virtue."},{"name":"THEOPAULDIN","text":"Perhaps it was his expertise─his knowledge of ancient prophecy and the fall of civilizations─that led to him to conclude that to eschew conflict at every turn was to consign mankind to his doom..."},{"name":"ALISAIE","text":"There will ever be conflict, and calamity will follow. Thus..."},{"name":"ALISAIE","text":"“To ignore the plight of those one might conceivably save is not wisdom─it is indolence.”"},{"name":"THEOPAULDIN","text":"You remember his words well. Indeed, Archon Louisoix lived by that personal creed, and used every means at his disposal to bring succor to those in need─Sharlayan or no."},{"name":"THEOPAULDIN","text":"No one loved and admired your grandfather more than his son..."},{"name":"THEOPAULDIN","text":"Yet Fourchenault could not reconcile Louisoix's deeds with the philosophy of their forebears and his peers─a philosophy in which he believed so fervently, yet made a pariah of his father."},{"name":"THEOPAULDIN","text":"Fourchenault agonized over this contradiction for much of his life."},{"name":"ALPHINAUD","text":"Gods, Father..."},{"name":"THEOPAULDIN","text":"A son may carry his father's blood, but his choices are his own to bear─is it not always thus?"},{"name":"THEOPAULDIN","text":"Gods know Fourchenault's a cranky old goat, so I'm sure you butt heads often enough. Yet even so, you must know that you are constantly in his thoughts. Every moment of every day─and that is not an exaggeration in the slightest!"},{"name":"THEOPAULDIN","text":"You should have seen him when you were born─barely recognizable, he was, with a kind of dumbfounded grin I'd not seen since he first took a fancy to your mother. He was practically skipping when he told me the news."},{"name":"THEOPAULDIN","text":"Take my word for it─he loves you to an embarrassing degree."},{"name":"THEOPAULDIN","text":"But he is also frustratingly single-minded. Once he's decided that a given action is for the best, he will stay the course no matter who or what opposes him."},{"name":"THEOPAULDIN","text":"A profoundly annoying habit when you're on the other end of it, as I'm sure you will agree."},{"name":"ALISAIE","text":"I'll say!"},{"name":"ALPHINAUD","text":"Thank you for your insight. When next we meet our parents, I shall mention that we spoke."},{"name":"THEOPAULDIN","text":"Try not to get me into too much trouble, now! I need the Forum on my side."},{"name":"THEOPAULDIN","text":"Speaking of which, I ought to be getting back to work. I have to make sure those specimens you brought make it to their proper places, or the cranky old goat will have my hide. We can speak again later!"},{"name":"GRAHATIA","text":"(-???-)Hail, you three!"},{"name":"ALISAIE","text":"G'raha! Surely Kokkol hasn't driven you out of the forge already?"},{"name":"GRAHATIA","text":"For better or for worse, no. However, he has set me a task that requires more than my single pair of hands...and here you are!"},{"name":"GRAHATIA","text":"I could use at least one of you, but I won't object to more."},{"name":"ALPHINAUD","text":"Unfortunately, Alisaie and I have prior commitments, and we have delayed too long as it is..."},{"name":"ALISAIE","text":"What about you, <span class=\"highlight\">Forename</span>? Can you spare the time?"},{"name":"GRAHATIA","text":"Perfect! This shouldn't take long."}],"reward":{"gil":1116,"items":[{"id":35709}]},"reqs":{"jobs":[{"lvl":88,"id":142}],"quests":[69981]},"next":[69856,69857,69858,69859,69860,69861,69863,69867,69868,69983,70020]},"partials":[{"type":"npc","id":"1040436","obj":{"i":1040436,"n":"Urianger","l":3708,"q":2}},{"type":"npc","id":"1040447","obj":{"i":1040447,"n":"Theopauldin","l":3708,"q":1}},{"type":"item","id":"35709","obj":{"i":35709,"n":"Chondrite Hand Gear Coffer (IL 545)","l":1,"c":26560,"t":61}},{"type":"quest","id":"69981","obj":{"i":69981,"n":"Sage Council","g":11,"l":"Labyrinthos","s":599}},{"type":"quest","id":"69856","obj":{"i":69856,"n":"Gleaner's Wish","g":121,"l":"Labyrinthos","s":8201,"f":1}},{"type":"quest","id":"69857","obj":{"i":69857,"n":"A Job for a Loporrit","g":121,"l":"Labyrinthos","s":8202}},{"type":"quest","id":"69858","obj":{"i":69858,"n":"Gift for a Fan","g":121,"l":"Labyrinthos","s":8203}},{"type":"quest","id":"69859","obj":{"i":69859,"n":"Wayward Carbuncle","g":121,"l":"Labyrinthos","s":8204}},{"type":"quest","id":"69860","obj":{"i":69860,"n":"Don't Philter Yourself","g":121,"l":"Labyrinthos","s":8205}},{"type":"quest","id":"69861","obj":{"i":69861,"n":"Take a Look, It's in a Book","g":121,"l":"Labyrinthos","s":8206}},{"type":"quest","id":"69863","obj":{"i":69863,"n":"To Care Enough to Send the Very Best","g":121,"l":"Labyrinthos","s":8207}},{"type":"quest","id":"69867","obj":{"i":69867,"n":"The Dry Eyes Have It","g":121,"l":"Labyrinthos","s":8208}},{"type":"quest","id":"69868","obj":{"i":69868,"n":"Dolling out Punishment","g":121,"l":"Labyrinthos","s":8209}},{"type":"quest","id":"69983","obj":{"i":69983,"n":"Once Forged","g":11,"l":"Labyrinthos","s":601}},{"type":"quest","id":"70020","obj":{"i":70020,"n":"The Lad in Labyrinthos","g":121,"l":"Labyrinthos","s":9201,"f":1}}]}