{"quest":{"name":"You're Not Alone","location":"Ultima Thule","id":69999,"patch":6.0,"sort":617,"icon":101134,"eventIcon":71201,"issuer":1041168,"target":1041173,"genre":11,"journal":["If Alisaie is discouraged, she betrays no hint of it.","At the end of the crystalline path, you and the twins arrive at a recreation of a ruined city. Meteion reveals that this world was already devoid of life when she found it, but despite the seeming absence of emotion to bar your way, she claims you will find no path forward. Not to be discouraged, you resolve to ascertain the truth with your own eyes, and split up to explore.","You search high and low, but fail to find any forms of life. Given the state in which the city has been left, however, one would think the denizens simply up and vanished. Having seen what there is to be seen, you decide to rejoin Alisaie.","Alisaie points out a terminating road; if only it continued, the dead sun would seem to be within reach. With your combined findings, you go to seek out Alphinaud to see if he has made any discoveries of his own.","As your party gathers to ponder your quandary, Alisaie's musings spark an epiphany within Alphinaud. Convinced that there is indeed someone present who has wished for the ruin amidst which you stand, he leads the way to that very individual─Meteion herself. The familiar, he explains, was horrified by the devastation she found wheresoever she went in the universe, and succumbed to the fear of moving forward. Drawing upon their conviction that hardships are a part of life to be embraced, Alphinaud and Alisaie succeed in breaking down the wall of Meteion's fear, sacrificing themselves to open the way for you. As the last to remain, your steps weigh heavy, but you remind yourself that you are not alone as you set forth for the oppressive darkness of Absolute Horizon. Should you stray from the path, you may begin walking it again from the entrance to the nekropolis.","You arrive at Absolute Horizon only to have Meteion reveal that there is no way to reach her nest─for hope cannot deliver you unto hopelessness. To come so near yet be so far, you feel the tendrils of despair begin to grip your heart, but the voices within grant you the strength to carry on. As if resonating with your resolve, the crystal of Azem begins to shine before two familiar forms appear─Emet-Selch and Hythlodaeus, plucked from the Lifestream. Declaring their defiance against the doom Meteion would bring, they draw upon the hopes of your comrades to make for you a new path, one in a form of your choosing. You scarcely have a moment to blink as the barren ground around you transforms into a field of Elpis flowers, white and radiant in hope enduring. Their presence serves to prove that despair no longer holds complete sway in this realm, and thus you are free to summon your comrades back to your side. The blossoms also awaken the memories of Hermes within Meteion, who beseeches you to silence the song of oblivion her sisters sing before fleeing to the dead sun. Their impromptu parts played to perfection, your ancient allies take their leave, bowing out to resume their slumber and entrusting you with the fate of the star─yours and theirs.","With the way to Meteion's nest open and your comrades beside you once more, you stand ready to finish your task. To the Endsinger, you must deliver the answer of all lives of Etheirys, and see this tale to a triumphant conclusion."],"objectives":["Explore the nekropolis.","Speak with Alisaie.","Speak with Alphinaud.","Make your way to Absolute Horizon.","Speak with Alisaie."],"dialogue":[{"name":"ALPHINAUD","text":"One way or another, we must find the way forward. Let us make a thorough search of the city."},{"name":"ALISAIE","text":"Whatever Meteion may have said, we should confirm it with our own eyes. We need to have a look around."},{"name":"ALPHINAUD","text":"Indeed. At the very least, it doesn't appear to be a sprawling place like those before. If we split up, it shouldn't take too long to cover the area."},{"name":"ALPHINAUD","text":"The isle's edge already, and there only appears to be this park here. How it must have bustled with life once upon a time..."},{"name":"ALISAIE","text":"I'm trying to see if there are ways to reach the nearby isles. Just in case Meteion was bluffing..."},{"name":"SYSTEM","text":"There doesn't seem to be anyone here. Perhaps you could try calling out..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Hello!"},{"name":"A1","text":"Is anyone here?"},{"name":"SYSTEM","text":"If anyone has heard you, they do not respond."},{"name":"SYSTEM","text":"The object resembles a tree, and appears to have been fashioned from a stone-like material."},{"name":"SYSTEM","text":"Erected in place of an actual tree...or to serve some other purpose, perhaps. Regardless, there is no one left to explain. To tell the story..."},{"name":"SYSTEM","text":"Were it not for the thick layer of dust, one could imagine someone drinking from these cups but moments ago..."},{"name":"SYSTEM","text":"This place is reminiscent of a bar, but neither patrons nor staff are anywhere to be seen."},{"name":"SYSTEM","text":"Egg-shaped containers line the shelves, with a loose few sitting on the counter. Vessels for the beverages, in all likelihood."},{"name":"SYSTEM","text":"A venue bustling with activity until it was not..."},{"name":"SYSTEM","text":"Though set slightly off the ground, this appears to be a door, while the objects to the left could be letter boxes."},{"name":"SYSTEM","text":"The door is rusted shut, and the film of dust all over suggests no one has come through in a long, long time..."},{"name":"SYSTEM","text":"In the distance, you glimpse Alisaie picking her way through the ruins, but otherwise spy no signs of life."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"If anyone can hear me, say something!"},{"name":"A2","text":"..."},{"name":"SYSTEM","text":"Your call echoes faintly before being swallowed by the silence..."},{"name":"SYSTEM","text":"You strain your ears to catch something─anything─but hear not so much as the chirping of an insect..."},{"name":"ALISAIE","text":"<span class=\"highlight\">Forename</span>, take a look at this. If the road was a little longer, we could take it to just beneath the dead sun."},{"name":"ALISAIE","text":"But I suppose this is where the reconstruction ends..."},{"name":"ALISAIE","text":"How about you? Did you find anything of interest?"},{"name":"ALISAIE","text":"I see. I noticed the same things─cups left upon tables, chairs out of place... I don't know what happened here, but I do know I don't want to be alone anymore..."},{"name":"ALISAIE","text":"We've searched enough for now. Let's find Alphinaud and compare what we've learned."},{"name":"Q3","text":"Continue with the main scenario quest?"},{"name":"PASSER","text":"(-Voice from the Past-)If you need a push, I'll be right there behind you."},{"name":"PASSER","text":"(-Voice from the Past-)Do not despair! You are not without allies."},{"name":"PASSER","text":"(-Voice from the Past-)What we have sown in blood, we have reaped in suffering, and it cannot go on."},{"name":"PASSER","text":"(-Voice from the Past-)Upon the souls of they who have sacrificed themselves to pave the way for peace, we will never abandon our cause."},{"name":"PASSER","text":"(-Voice from the Past-)While it is true that man succumbs all too often to anger and avarice, he may yet overcome his baser instincts through the forming of bonds with others."},{"name":"PASSER","text":"(-Voice from the Past-)Such victories are rarely won without sacrifice. But the prize is worth the price."},{"name":"PASSER","text":"(-Voice from the Past-)And we for our part are glad indeed to be able to welcome friends both old and new..."},{"name":"PASSER","text":"(-Voice from the Past-)Save your tears for the morrow. You may be sure we will have ample cause to shed them, be they for joy or despair."},{"name":"PASSER","text":"(-Voice from the Past-)From tragedy and sacrifice we rise to greet a new dawn."},{"name":"PASSER","text":"(-Voice from the Past-)A future shaped by the choices we made, in ways we could never have foreseen."},{"name":"PASSER","text":"(-Voice from the Past-)Yet miracles do happen. So let us pray, and will our friends home."},{"name":"PASSER","text":"(-Voice from the Past-)I won't stop praying until I know they're safe."},{"name":"PASSER","text":"(-Voice from the Past-)Strong art thou, mortal."},{"name":"PASSER","text":"(-Voice from the Past-)Look to the light within, that you may continue to serve as a beacon to others."},{"name":"PASSER","text":"(-Voice from the Past-)Let's finish this."},{"name":"ALISAIE","text":"I don't think I ever knew what to say to the man. In retrospect, it always felt like the wrong thing..."},{"name":"ALISAIE","text":"But the past notwithstanding, he came to your aid in your moment of need."},{"name":"ALISAIE","text":"We are here, and we will not squander this chance he has given us!"},{"name":"ALISAIE","text":"We will see this tale to a triumphant conclusion, and bid the final curtain fall!"}],"reward":{"gil":1475,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[69998]},"next":[70000]},"partials":[{"type":"npc","id":"1041168","obj":{"i":1041168,"n":"Alisaie","l":3712,"q":1}},{"type":"npc","id":"1041173","obj":{"i":1041173,"n":"Alisaie","l":3712,"q":1}},{"type":"quest","id":"69998","obj":{"i":69998,"n":"Forge Ahead","g":11,"l":"Ultima Thule","s":616}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}}]}