{"quest":{"name":"On Burdεned ωings","location":"Ultima Thule","id":69990,"patch":6.0,"sort":608,"eventIcon":71201,"issuer":1039772,"target":1039776,"genre":11,"journal":["Despite Meteion's words, Urianger cannot accept his comrade is gone."],"objectives":["Gather information in Reah Tahra.","Search for the source of the dragons' woes in Ahm Nohl.","Investigate the dragon eggs.","Continue investigating the dragon eggs.","Search for a dragonet near Ahm Nohl.","Speak with the bereaved dragon."],"dialogue":[{"name":"ALPHINAUD","text":"I understand now why the Loporrits were surprised to find that this environment could sustain life. There but for Thancred's sacrifice..."},{"name":"ALISAIE","text":"He can't really be gone, can he? Meteion herself said his soul persists, that he is the reason we are still breathing. If so then maybe...maybe..."},{"name":"YSHTOLA","text":"His will was strong enough to reshape Ultima Thule that we might survive. That I might see again. His sacrifice must not be wasted."},{"name":"GRAHATIA","text":"It's hard to believe Thancred was able to overcome Meteion's will. Yet here we are... Would that the price for his victory had not been so high."},{"name":"ESTINIEN","text":"My aim was true. I had her."},{"name":"ESTINIEN","text":"How are we to defeat an enemy we can't attack?"},{"name":"URIANGER","text":"Soul without body... A form of being with which we are not wholly unfamiliar."},{"name":"URIANGER","text":"Indeed, for we existed in a similar state when residing in the First."},{"name":"URIANGER","text":"The circumstances are rather more dire than that, 'tis true, but I choose to believe he is not forever lost to us."},{"name":"URIANGER","text":"Regardless...in sacrifice he hath afforded us a chance to prevail. Let us not squander it, and ascertain the nature of this realm that we might confront and defeat Meteion."},{"name":"URIANGER","text":"Estinien. <span class=\"highlight\">Forename</span>. Would you accompany me in speaking with these dragons? Mayhap they can enlighten us."},{"name":"URIANGER","text":"I would ask the rest of you to survey these surrounds. If there is a path that may lead us to our quarry, we must find it."},{"name":"ALPHINAUD","text":"Very well. We can reconvene here when everyone has finished."},{"name":"ALPHINAUD","text":"Meteion said these dragons are shadow and shade, from a world whose denizens sought oblivion."},{"name":"ALPHINAUD","text":"As such, they're not like to be amenable to company, let alone conversation. So please, be careful."},{"name":"URIANGER","text":"Let us split up and gather what knowledge we may."},{"name":"SEIHLOSKH","text":"A visitor. Not of this star..."},{"name":"SEIHLOSKH","text":"Could thy slender hands bring plague to our world... Thy breath extinguish life's feeble flame... Oh, how we would adore thee. Alas..."},{"name":"SEIHLOSKH","text":"With time our flesh shall wither, our souls fade. And so we wait for its inexorable march unto oblivion."},{"name":"SEIHLOSKH","text":"If thou art not come to hasten our demise, I bid thee leave us. We crave not companionship. Only silence."},{"name":"SEIHLOSKH","text":"I pray thee leave us to our silence. To break it serves only to mark time's passage. We shall not suffer reminders of its flow."},{"name":"KOHMNOSKH","text":"Beyond that distant veil... Paradise lost. So glorious. So beautiful..."},{"name":"KOHMNOSKH","text":"We were a proud and noble race. Strength embodied. We knew only love. Before they came..."},{"name":"KOHMNOSKH","text":"Metal monstrosities of black and silver. No bonds of blood did they share, nor conviction did they have to guide them."},{"name":"KOHMNOSKH","text":"A crushing defeat. Never had we known such shame... Stilled now are the winds, though none could fill these wings burdened by ignominy. We fly no more, only sink into oblivion..."},{"name":"KOHMNOSKH","text":"I beg thee leave me to dream. To forget that which we have lost..."},{"name":"WHEIFEHSK","text":"Thou wouldst bid me speak? Hmph. Folly."},{"name":"WHEIFEHSK","text":"I observe the lesson of stone. I shall not fly, nor speak, nor roar. Only watch, and wait, and end."},{"name":"WHEIFEHSK","text":"But one sight yet stirreth my blood, tempteth me to raise my voice in lamentation: Ahm Nohl, the cradle of unsung dragons."},{"name":"WHEIFEHSK","text":"No words, no songs are possessed of the weight to describe such tragedy... Go, if that be thy will. I shall remain."},{"name":"WHEIFEHSK","text":"Stay and ponder the lesson, or go in ignorant defiance."},{"name":"WHEIFEHSK","text":"I remain...for I dare not look upon Ahm Nohl, font of our greatest loss..."},{"name":"ESTINIEN","text":"They led you here as well, did they? It was described to me as the source of their woes and proof of their end. I think I'm beginning to see why."},{"name":"ESTINIEN","text":"It's a hatching ground. Or, was... I've seen similar on Etheirys."},{"name":"ESTINIEN","text":"Midgardsormr's kind must once have lived and thrived in a place such as this."},{"name":"ESTINIEN","text":"Vrtra said his father was driven from their ancestral home by war and strife. This, then, is the fate of those who remained."},{"name":"ESTINIEN","text":"Let's have a look around. Maybe these eggs have more to tell of what happened here."},{"name":"ESTINIEN","text":"The stench of these eggs is as fierce as any weapon. Would that there were winds to carry it away."},{"name":"SYSTEM","text":"Inside the shattered egg you find the remains of an unborn dragon. The body has already begun to decompose."},{"name":"SYSTEM","text":"The gelatinous, half-dried membrane covering the corpse suggests it failed to emerge..."},{"name":"SYSTEM","text":"A murky liquid has pooled inside this egg shell. The noxious foetor is indicative of contamination..."},{"name":"SYSTEM","text":"Gingerly lifting a large egg from the viscous mire, you peer inside and see a formless mass soaking in a pool of embryonic fluid."},{"name":"SYSTEM","text":"Your stomach turns as you return the egg to its resting place."},{"name":"SYSTEM","text":"This egg appears to have been broken from the inside out. Perhaps the dragonet within succeeded in hatching..."},{"name":"ESTINIEN","text":"What's this? I thought all the eggs had been ruined."},{"name":"ESTINIEN","text":"If the dragonet was indeed hatched, there is no sign of it here─or its sire, for that matter."},{"name":"ESTINIEN","text":"We should look for them. You start with the clifftops, and I'll search the plains."},{"name":"ELDERDRAGON04454","text":"......"},{"name":"BALLOON","text":"Gwoooar!"},{"name":"BALLOON","text":"Gwoooh... &lt;gurgle&gt;"},{"name":"ELDERDRAGON04454","text":"The boisterous howling hath been quieted... By thy hand, I presume."},{"name":"ESTINIEN","text":"Everything all right? I thought I heard a dragon, or something resembling one."},{"name":"ESTINIEN","text":"Ah. I see what's happened here... Was that your child?"},{"name":"ELDERDRAGON04454","text":"Perhaps. Some eggs within Ahm Nohl are indeed mine. If life within one did quicken, the beast thou hast slain may be of my blood."},{"name":"ELDERDRAGON04454","text":"Yet I do not recognize it, twisted and malformed as it is."},{"name":"ELDERDRAGON04454","text":"Not a dragon in truth, but a reminder of our failure. A testament to our shame."},{"name":"ESTINIEN","text":"Explain."},{"name":"ELDERDRAGON04454","text":"They descended from the heavens. Cold, heartless machines. And with them rode war and death."},{"name":"ELDERDRAGON04454","text":"With fire and fury, rage and rancor, we gave answer. 'Twas a long and bloody battle, but only the beginning..."},{"name":"ELDERDRAGON04454","text":"Untold chaos and destruction swept over the star. In the end, the invaders were victorious."},{"name":"ELDERDRAGON04454","text":"Yet when they looked upon their prize, they deemed it unfit for requisition. We were abandoned to our ruin."},{"name":"ELDERDRAGON04454","text":"The survivors sought to put away their shame. To rebuild. A futile effort."},{"name":"ELDERDRAGON04454","text":"In purest soil replete with aether did we once cultivate our nesting grounds. But our lands were barren, and any eggs nurtured in such desolation were fated to rot."},{"name":"ELDERDRAGON04454","text":"What few survive to hatch emerge as...abominations. We shall have no new progeny."},{"name":"ESTINIEN","text":"But there are dragons among you capable of journeying to other stars."},{"name":"ELDERDRAGON04454","text":"That there are. Many would make the attempt, each bearing a clutch of eggs."},{"name":"ELDERDRAGON04454","text":"The richest stars were home to the harshest rulers, and the arrival of dragons incited contests for supremacy."},{"name":"ELDERDRAGON04454","text":"When the fires faded, the wars lost and won, they too were reduced to ash and waste."},{"name":"ELDERDRAGON04454","text":"'Tis the curse of those who seek life─to be drawn into conflict, to conquer or be conquered."},{"name":"ELDERDRAGON04454","text":"A vicious cycle we now choose to break. We tire of conflict. Of everything..."},{"name":"ELDERDRAGON04454","text":"We wait now in sweet, merciful silence. Free from strife and suffering. Still as stone..."},{"name":"ESTINIEN","text":"Wait! You claim your kind is doomed, but there is another star─"},{"name":"ELDERDRAGON04454","text":"......"}],"reward":{"gil":1081},"reqs":{"jobs":[{"lvl":89,"id":142}],"quests":[69989]},"next":[69875,69877,69991]},"partials":[{"type":"npc","id":"1039772","obj":{"i":1039772,"n":"Urianger","l":3712,"q":1}},{"type":"npc","id":"1039776","obj":{"i":1039776,"n":"Bereaved Dragon","l":3712,"q":1}},{"type":"quest","id":"69989","obj":{"i":69989,"n":"A §trαnge New World","g":11,"l":"Ultima Thule","s":607}},{"type":"quest","id":"69875","obj":{"i":69875,"n":"The Sound of Fear","g":126,"l":"Ultima Thule","s":9110}},{"type":"quest","id":"69877","obj":{"i":69877,"n":"Aimless Protector","g":126,"l":"Ultima Thule","s":9150}},{"type":"quest","id":"69991","obj":{"i":69991,"n":"Α Test of Wιll","g":11,"l":"Ultima Thule","s":609}}]}