{"quest":{"name":"Where Kn∞wledge Leads","location":"Ultima Thule","id":69994,"patch":6.0,"sort":612,"icon":101132,"eventIcon":71201,"issuer":1039760,"target":1039778,"genre":11,"journal":["Something seems to be weighing on Urianger's mind.","Before your party seeks out the Ea to hear the fundamental truth they discovered, Urianger bids you and G'raha Tia assist him in an investigation. To that end do you follow him outside the abode of the Ea, to the wellspring of regret.","Upon arriving at the spring, Urianger confesses that the investigation was but a pretense to speak in private. He proceeds to review the nature of Meteion, presenting his theory that she visited the home worlds of both the dragons and the Ea while they yet lived. This allowed her to take their most heartfelt emotions as her own, and their fervent desire for the end is what terminates your path in Ultima Thule. Should you struggle to find the way forward, the Archon advises, you must seek those souls that yearn for oblivion more desperately than any other. Though he does not say the words, his readiness for what he knows will come is plain to you and G'raha Tia, and it is with a tinge of sadness that you watch him walk off.","After a moment's silence, G'raha Tia sets out to join the rest of your comrades in Elegeia, and you follow on after him.","With your party assembled, Coph-coodg and his fellows begin recounting their tale. They reveal that the universe has been expanding since it came into being, and will continue to do so until all heavenly bodies freeze over in an eternal ice age. The Ea could not find a way to prevent this eventuality, and thus did their society, once a bastion of science and enlightenment, fall stagnant. Believing that everything is futile, they came to yearn for the end, and now urge you to embrace your ignorance. But Y'shtola is not to be deterred from her pursuit of knowledge, and together with Urianger's unwavering resolve to aid his comrades, the two succeed in rekindling the light of an extinguished civilization. Your final destination is the dead star that looms high overhead. It is there that the true Meteion abides─there that she prepares her gift of death eternal for all life. Your gaze firmly fixed upon her lifeless domain, you press on in your quest to silence her song."],"objectives":["Speak with Urianger.","Speak with G'raha Tia.","Speak with Y'shtola."],"dialogue":[{"name":"ALPHINAUD","text":"'Tis true that a lack of knowledge can beget fear. Therefore, in theory, by acquiring all knowledge, it may be possible to attain peace."},{"name":"ALPHINAUD","text":"But as Hydaelyn told us, all those peoples who attempted to free their worlds from life's woes met with failure."},{"name":"ALPHINAUD","text":"And the Ea are among them, as their presence here indicates. The tale we are about to hear will not be a happy one."},{"name":"ALISAIE","text":"You may be intimately familiar with a problem─know it like the back of your hand─yet be powerless to solve it."},{"name":"ALISAIE","text":"In the course of my struggles, I've often been made keenly aware of this fact. I wonder, have the Ea never felt the same frustration?"},{"name":"YSHTOLA","text":"Before we hear the climax of the Ea's tale, mayhap I should speak of..."},{"name":"YSHTOLA","text":"...On second thought, it would only be a distraction. We will talk more when the time is right."},{"name":"GRAHATIA","text":"To define the laws of creation would have been no small feat, even for the Ea. Nay, having eternal life, and hence no sense of haste, would only have made it harder."},{"name":"GRAHATIA","text":"Such tremendous drive for knowledge they once must have had, and I struggle to reconcile it with the listless beings before us. Whatever answers they found, it did not bring them happiness."},{"name":"URIANGER","text":"Ere we join the Ea, there is one trifling matter I would fain investigate."},{"name":"URIANGER","text":"<span class=\"highlight\">Forename</span>, G'raha Tia─might I trouble you for your assistance?"},{"name":"GRAHATIA","text":"But of course."},{"name":"URIANGER","text":"My thanks. We shall head outside the abode, if you would kindly follow me."},{"name":"YSHTOLA","text":"I know not what mischief you are plotting, Urianger...but I trust you have our best interests at heart."},{"name":"YSHTOLA","text":"The rest of us shall go on ahead to Elegeia. Lest you worry, we won't start without you."},{"name":"ALPHINAUD","text":"There is naught but desert out there. What could Urianger wish to investigate?"},{"name":"ALISAIE","text":"As long as Urianger explains himself to you, then I shall be satisfied. Do lend him an ear in my stead."},{"name":"YSHTOLA","text":"Go on and assist Urianger with his mysterious task. We shall wait for you."},{"name":"GRAHATIA","text":"A spring, and a sizable one at that... I hadn't noticed it amidst the dunes."},{"name":"URIANGER","text":"Aye, this place shall serve."},{"name":"GRAHATIA","text":"Is it the spring that you wished to investigate?"},{"name":"URIANGER","text":"Pray forgive me, my friends...but there is naught to investigate."},{"name":"URIANGER","text":"'Twas but a pretense to speak in private."},{"name":"GRAHATIA","text":"You have our undivided attention."},{"name":"URIANGER","text":"As we have established, here in Ultima Thule, those denizens of ruined stars are recreated in their twilight days."},{"name":"URIANGER","text":"Yet one question doth arise in my mind."},{"name":"URIANGER","text":"So faithfully formed are the simulacra, they believe themselves yet amongst the living. How dost thou suppose this is possible?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Meteion has taken their hearts unto herself."},{"name":"A1","text":"Meteion made contact with them while they still lived."},{"name":"A1","text":"I couldn't begin to guess..."},{"name":"GRAHATIA","text":"I'm inclined to agree. If Meteion can take the emotions of others as her own, I daresay she would be able to recreate them more faithfully than had she relied on any historical account."},{"name":"GRAHATIA","text":"By which logic, she must have visited them while they still lived─the dragons and the Ea both!"},{"name":"GRAHATIA","text":"Of course! She must have visited the stars of the dragons and the Ea before either race perished in their entirety."},{"name":"GRAHATIA","text":"Thus could she make their emotions her own, and with them create more faithful simulacra than had she relied on any historical account."},{"name":"GRAHATIA","text":"Wait... What if Meteion visited the dragons and the Ea while they still lived?"},{"name":"GRAHATIA","text":"If so, she could have made their emotions her own, and with them create more faithful simulacra than had she relied on any historical account."},{"name":"URIANGER","text":"So too did I theorize and, upon that assumption, consider how those two races may have met their demise."},{"name":"URIANGER","text":"According to thine own tale, Meteion perceiveth the emotions of those nearby as her own."},{"name":"URIANGER","text":"A heightened sense of empathy intrinsic to her nature as an entelechy."},{"name":"URIANGER","text":"In the course of her star-faring journey, if she encountered beings who strongly desired a cessation of their existence..."},{"name":"GRAHATIA","text":"She would be powerless before that desire."},{"name":"URIANGER","text":"Even as she possesseth the power to grant it─the power of dynamis."},{"name":"URIANGER","text":"'Tis my supposition that, overwhelmed by their longing for death, Meteion did unleash dynamis and ushered the dragons and the Ea unto their doom."},{"name":"URIANGER","text":"Of course, such was not always the outcome; full many stars did she find already lost to ruin."},{"name":"URIANGER","text":"In order to create a terminus, however, the fervent desire for the end is essential."},{"name":"URIANGER","text":"Therefore, should you struggle to find the way forward, pray ask yourselves this: in the place where you stand, whose is the soul that yearneth most desperately for oblivion?"},{"name":"GRAHATIA","text":"Why do you tell us this now?"},{"name":"URIANGER","text":"Ne'er again would I betray your trust. This pledge I did make to my comrades. In bringing thee into my confidence, I would remain true to my word."},{"name":"URIANGER","text":"As for thee... Let us consider it my fitting reward for the secrets I harbored for the Crystal Exarch."},{"name":"URIANGER","text":"I once placed my faith in thy chosen path, walking at thy side full knowing that we were bound for thy demise."},{"name":"URIANGER","text":"I ask now that thou returnest the favor, and abide in faith as I fulfill mine own destiny."},{"name":"GRAHATIA","text":"If you say my debt has come due, how am I to refuse?"},{"name":"URIANGER","text":"'Tis indelicate of me, I know full well, and I can but beg thy forgiveness."},{"name":"URIANGER","text":"Yet even if I must needs go to such lengths, I cannot well feign ignorance of the answer I have found within..."},{"name":"URIANGER","text":"The answer to the question: in what moment might I stand strongest?"},{"name":"GRAHATIA","text":"After all that we've been through, I will say only this."},{"name":"GRAHATIA","text":"Do what you must. Do what you must, and see your conviction through."},{"name":"URIANGER","text":"I shall, my friend. I shall."},{"name":"URIANGER","text":"Without further ado, then, let us go to join our comrades."},{"name":"GRAHATIA","text":"..."},{"name":"GRAHATIA","text":"Let us be off too. To Elegeia."},{"name":"ALPHINAUD","text":"I understand you've taken care of business. If you are ready to begin, then so are we."},{"name":"ALISAIE","text":"While we waited, we mentioned our star's situation to the Ea. They nodded sagely...or something to that effect."},{"name":"URIANGER","text":"Come, let us hear the Ea's tale, and learn what caused such enlightened beings to crave nihility."},{"name":"GRAHATIA","text":"...Don't mind me."},{"name":"COPHCOODG","text":"Oh, you are here already? Your comrades said you would be late..."},{"name":"LAHLAAKH","text":"We have prepared for our recounting. To facilitate comprehension, the information will be simplified to match your primitive minds."},{"name":"DEWDEEKH","text":"Your companion in front─the one called Y'shtola. She seems the keenest to learn the truth. I pity her..."},{"name":"NEHNEEDG","text":"It would seem your star, too, has been plunged into a panic-induced cataclysm. We hope that our tale will not serve to exacerbate it..."},{"name":"YSHTOLA","text":"It seems everyone is accounted for. Shall we, then?"}],"reward":{"gil":909},"reqs":{"jobs":[{"lvl":89,"id":142}],"quests":[69993]},"next":[69878,69879,69882,69995]},"partials":[{"type":"npc","id":"1039760","obj":{"i":1039760,"n":"Urianger","l":3712,"q":1}},{"type":"npc","id":"1039778","obj":{"i":1039778,"n":"Y'shtola","l":3712,"q":1}},{"type":"quest","id":"69993","obj":{"i":69993,"n":"F//εsh AbanΔon┨Δ","g":11,"l":"Ultima Thule","s":611}},{"type":"quest","id":"69878","obj":{"i":69878,"n":"Ending as One","g":126,"l":"Ultima Thule","s":9210,"f":1}},{"type":"quest","id":"69879","obj":{"i":69879,"n":"Final Words, Final Thoughts","g":126,"l":"Ultima Thule","s":9220}},{"type":"quest","id":"69882","obj":{"i":69882,"n":"A Most Stimulating Discussion","g":126,"l":"Ultima Thule","s":10001,"f":1}},{"type":"quest","id":"69995","obj":{"i":69995,"n":"Vic┨οry  ̈ ̈ ̈╳, │̆││ε Lost","g":11,"l":"Ultima Thule","s":613}}]}