{"quest":{"name":"Roads Pαved││Sacri┣ice","location":"Ultima Thule","id":69992,"patch":6.0,"sort":610,"eventIcon":71201,"issuer":1040307,"target":1040318,"genre":11,"journal":["Alphinaud has regained his composure and is ready to proceed."],"objectives":["Speak with Urianger.","Speak with Alisaie.","Search for signs of life.","Speak with Coph-coodg.","Commune with the crystalline domiciles.","Speak with Coph-coodg."],"dialogue":[{"name":"ALISAIE","text":"We have to keep going. Even if Estinien isn't here to see it, I'm sure Alphinaud wouldn't want to disappoint him."},{"name":"URIANGER","text":"No choice have we but to march onward, lest we squander their noble sacrifices..."},{"name":"YSHTOLA","text":"Though it pains me to say it, we can ill afford to stop and grieve our comrades' passing. No, there will be time enough after."},{"name":"GRAHATIA","text":"To feign bravery with bold words is a simple matter, but without the strength of will to match, we are powerless against dynamis."},{"name":"GRAHATIA","text":"Naught less than unshakable conviction will suffice... Which makes me question if I am up to the task."},{"name":"ALPHINAUD","text":"As Y'shtola and Alisaie said, we must continue."},{"name":"ALPHINAUD","text":"Hmm. Notice the change in our surroundings? Perhaps this is the memory of an altogether different world."},{"name":"ALPHINAUD","text":"'Twould be prudent to learn more of it, then. Tread carefully, lest we lose our footing in this sand."},{"name":"ALPHINAUD","text":"If not for the light emitted by these glyphs, I might well have overlooked this monolith."},{"name":"ALISAIE","text":"Sand... Sand everywhere. &lt;sigh&gt;"},{"name":"YSHTOLA","text":"If you were worried about my vision, you needn't be. I can still see quite well."},{"name":"GRAHATIA","text":"Another seemingly barren world... For a mercy, the air is nowhere near as stale, but still quite dry, and the sand will no doubt prove bothersome in due time."},{"name":"URIANGER","text":"Were it not for the violet crystal embedded in its surface, 'twould appear as ordinary stone."},{"name":"URIANGER","text":"A curious script hath been etched upon them. Alas, it is not a language with which I am familiar."},{"name":"YSHTOLA","text":"I cannot say I recognize it either."},{"name":"GRAHATIA","text":"Nor I. The dragons, from what I recall, preserve their knowledge in song and eschew the written word entirely, so we may assume this is the work of another race. One we have yet to encounter..."},{"name":"URIANGER","text":"Meteion claimed the dragons' world suffered a slow death, seeking the release of oblivion."},{"name":"URIANGER","text":"What life we find here, like as not, doth wend its way towards a similar end."},{"name":"URIANGER","text":"Fascinating as this script is, we will glean naught from what we cannot decipher..."},{"name":"ALISAIE","text":"What do you suppose that is over there?"},{"name":"ALPHINAUD","text":"I'm not sure... It's hard to make out at this distance, but its surface seems to bear the same crystals as this monument."},{"name":"ALISAIE","text":"Meaning there's a chance we may find whoever built them both. We should go and have a look. Come on."},{"name":"COPHCOODG","text":"Hail, travelers. This is a most unexpected occurrence."},{"name":"ALISAIE","text":"Oh, um... Hello there. Is this your home...?"},{"name":"COPHCOODG","text":"Indeed it is...<br>Ah, forgive me. I had forgotten─an exchange of introductions is expected when first meeting those with whom one is unacquainted."},{"name":"COPHCOODG","text":"When the vibration of vocal folds was still required to convey our thoughts and intention, “Ea,” I believe, was the pronunciation used when referring to our people."},{"name":"COPHCOODG","text":"Though it is not entirely applicable given our present state, you are welcome to use this appellation."},{"name":"COPHCOODG","text":"As for nomenclature to address my individual person, I believe it would be pronounced “Coph-coodg.”"},{"name":"COPHCOODG","text":"(-Coph-coodg-)Yes. Coph-coodg, of the Ea."},{"name":"YSHTOLA","text":"We have encountered beings that communicate intermittently through thought, but never one that is wholly without voice."},{"name":"YSHTOLA","text":"I presume we are having this conversation via the medium of aether. Or dynamis, as this space is suffused with vast quantities of it. Fascinating in either case."},{"name":"COPHCOODG","text":"(-Coph-coodg-)I gather your response to my presence is positive, then? That is well, for there is something I wish to ask of you."},{"name":"COPHCOODG","text":"(-Coph-coodg-)Like yourselves, we Ea are aether-based life-forms. Therefore, it may be surmised that your bodies are of comparable biological composition to those we once possessed."},{"name":"COPHCOODG","text":"(-Coph-coodg-)I have a number of queries regarding your subjective perception of the five senses─sight, sound, taste, touch, and smell."},{"name":"COPHCOODG","text":"(-Coph-coodg-)In total, I have prepared one hundred ninety-eight billion seven hundred twelve million one hundred eighty thousand eight hundred and twenty-seven."},{"name":"GRAHATIA","text":"Er... That's rather a lot, isn't it?"},{"name":"COPHCOODG","text":"(-Coph-coodg-)Ah, my apologies. I have omitted a great many details necessary to understand the nature of my request."},{"name":"COPHCOODG","text":"(-Coph-coodg-)Though we dispensed with our corporeal vessels long ago, we have rediscovered a need for the flesh, and have endeavored to recreate our erstwhile forms. However, all pertinent records have been lost due to the passage of time."},{"name":"COPHCOODG","text":"(-Coph-coodg-)Take for example, the nervous system. It is well within our power to recreate, but we have no frame of reference for sensations once experienced by our people, which may compromise our ability to interact with our physical environment."},{"name":"GRAHATIA","text":"And the reason you need to regain corporeal forms?"},{"name":"COPHCOODG","text":"(-Coph-coodg-)Why, to bring an end to our existence, of course."},{"name":"COPHCOODG","text":"(-Coph-coodg-)Though “need” is perhaps too strong a word. It would be a simple matter to unmake ourselves through use of aetheric exsanguinaters. But such a death seems...inadequate."},{"name":"COPHCOODG","text":"(-Coph-coodg-)The traditionalists among us believe proper death requires an inescapable sense of impermanence in one's final moments. An experience found only with bodies of flesh."},{"name":"YSHTOLA","text":"We should very much like to hear more of your plans. In exchange, we will answer any questions you have to the best of our ability."},{"name":"COPHCOODG","text":"(-Coph-coodg-)Hmm... Such an exchange of information would indeed prove useful."},{"name":"COPHCOODG","text":"(-Coph-coodg-)Very well. To ensure efficacious exchange, I hereby invite you to our home."},{"name":"COPHCOODG","text":"(-Coph-coodg-)Yes. The abode of the Ea, where we traditionalists prepare for our demise."},{"name":"COPHCOODG","text":"(-Coph-coodg-)I presume your consent to answer questions is indicative of a tacit approval of our plans? In which case, your cooperation is greatly appreciated."},{"name":"COPHCOODG","text":"(-Coph-coodg-)I must caution you, however, to be mindful of the Ea wandering the desert. Their desire for bodies of flesh could be described as...overzealous. Now, if you would follow me."},{"name":"ALISAIE","text":"This is going rather smoothly. Not that I'm complaining, mind."},{"name":"YSHTOLA","text":"Even so, we mustn't forget their aim is oblivion, much like the dragons."},{"name":"YSHTOLA","text":"Though I fail to see why a civilization so seemingly advanced would choose to unmake all they have created."},{"name":"YSHTOLA","text":"At any rate, we will find no answers dallying here. Let us be on our way."},{"name":"ALPHINAUD","text":"Something tells me we have different definitions of the word “abode.”"},{"name":"ALISAIE","text":"They said there would be others, but... I don't know what I was expecting."},{"name":"URIANGER","text":"The isle of dragons was shrouded in the silence of the dead, yet the stillness here doth suggest the Ea are, by and large, merely sleeping...?"},{"name":"YSHTOLA","text":"I should not be surprised their concept of a village is so different from ours, and yet..."},{"name":"GRAHATIA","text":"More violet-colored crystals. I cannot place my finger on it, but there is something unsettling about them."},{"name":"COPHCOODG","text":"Welcome to our abode. Most of our compeers, you will find, remain idle in their domiciles. Though your quizzical expressions indicate my phrasing is unclear."},{"name":"COPHCOODG","text":"I speak, of course, of the violet crystalline constructs hanging from the stone structures there."},{"name":"YSHTOLA","text":"You say they remain idle, but what of your work to regain corporeal bodies?"},{"name":"COPHCOODG","text":"An astute question. And understandable, given your finite nature."},{"name":"COPHCOODG","text":"We have no desire to pursue our research, for it is no longer necessary."},{"name":"COPHCOODG","text":"If, in our idleness, we are struck by sudden inspiration, we rise to pursue said inspiration to its conclusion. That is why I was present for your arrival, and why I continue to engage with you still."},{"name":"COPHCOODG","text":"But while the others are not currently in a motile state, rest assured they would not object were you to disturb their respite."},{"name":"COPHCOODG","text":"You need only cast your thoughts towards one of their crystalline domiciles to communicate."},{"name":"COPHCOODG","text":"Even should they elect not to emerge, you need but cast your thoughts to the crystals to communicate with the Ea within."},{"name":"ALPHINAUD","text":"I suppose there is a logic to creatures comprised of spiritual energy utilizing crystals as living spaces, but it is nevertheless surprising to see."},{"name":"ALISAIE","text":"I've tried reaching out to whatever is inside this crystal, but all I can hear is sporadic moaning."},{"name":"URIANGER","text":"Despite my best efforts, mine overtures have elicited no response from this crystal. I can but assume its resident sleepeth most soundly. Or so I hope..."},{"name":"YSHTOLA","text":"Is it not strange they lack passion to research that which they desire above all else?"},{"name":"YSHTOLA","text":"If we are fortunate, the Ea residing in these crystals will shed light on this contradiction."},{"name":"GRAHATIA","text":"If I heard correctly, the Ea within this crystal says it will emerge from within shortly. Do you suppose they all appear as Coph-coodg does?"},{"name":"SYSTEM","text":"You cast your thoughts toward the crystalline domicile, but there is no response..."},{"name":"LAHLAAKH","text":"(-???-)You... You wish...to speak...?"},{"name":"LAHLAAKH","text":"(-???-)Very well... Pray...a moment, if you would..."},{"name":"DEWDEEKH","text":"(-???-)Why we seek our end, you ask? If you wish to know, I will tell you."},{"name":"DEWDEEKH","text":"(-???-)Just a moment... I must remember... What form did I take when last I emerged?"},{"name":"UNKNOWNEA04456","text":"...Errrgh... Aghhh..."},{"name":"SYSTEM","text":"The strange moaning comes and goes, but soon fades into silence..."},{"name":"COPHCOODG","text":"Did your inquiries yield satisfactory responses?"},{"name":"COPHCOODG","text":"I see..."},{"name":"COPHCOODG","text":"If they failed to answer, then it is likely because their minds have unraveled due to prolonged idleness. They are naught but concentrated aether now."},{"name":"COPHCOODG","text":"Worry not─there are no others who have need of those lodgings, and they will not prove a hindrance to remain as they are. But more importantly, you said some few did answer your request for an audience, yes? I imagine they will be with us ere long."}],"reward":{"gil":1081},"reqs":{"jobs":[{"lvl":89,"id":142}],"quests":[69991]},"next":[69993]},"partials":[{"type":"npc","id":"1040307","obj":{"i":1040307,"n":"Alphinaud","l":3712,"q":1}},{"type":"npc","id":"1040318","obj":{"i":1040318,"n":"Coph-coodg","l":3712,"q":2}},{"type":"quest","id":"69991","obj":{"i":69991,"n":"Α Test of Wιll","g":11,"l":"Ultima Thule","s":609}},{"type":"quest","id":"69993","obj":{"i":69993,"n":"F//εsh AbanΔon┨Δ","g":11,"l":"Ultima Thule","s":611}}]}