{"quest":{"name":"Vic┨οry  ̈ ̈ ̈╳, │̆││ε Lost","location":"Ultima Thule","id":69995,"patch":6.0,"sort":613,"eventIcon":71201,"issuer":1039782,"target":1039791,"genre":11,"journal":["G'raha Tia regards his comrades in solemn silence."],"objectives":["Speak with Alphinaud.","Pass through the portal and wait for your comrades at the designated location.","Continue waiting for your comrades.","Speak with G'raha Tia.","Search the area for denizens.","Speak with G'raha Tia.","Gather information at Base Omicron.","Speak with G'raha Tia."],"dialogue":[{"name":"ALPHINAUD","text":"Never have I felt such emptiness. It's as if a part of me is gone..."},{"name":"ALISAIE","text":"...I'm fine, <span class=\"highlight\">Forename</span>."},{"name":"ALISAIE","text":"Like I said, our quest doesn't end here."},{"name":"GRAHATIA","text":"Are you all ready to continue on?"},{"name":"GRAHATIA","text":"Then let us make for where that light shone. Y'shtola and Urianger have opened the way for us."},{"name":"ALISAIE","text":"Some manner of Ea device. If our friends awakened it, then it should be safe to use."},{"name":"GRAHATIA","text":"Judging by the direction, this should be the place."},{"name":"ALPHINAUD","text":"Yes, I can feel it! The aether emanating from the arcane pattern!"},{"name":"ALPHINAUD","text":"This is a portal, and no mistake. Let us see where it leads."},{"name":"ALPHINAUD","text":"What manner of place awaits us, I wonder..."},{"name":"Q1","text":"Travel through the portal?"},{"name":"BALLOON","text":"&lt;whirr&gt; Intruder alert."},{"name":"BALLOON","text":"Eliminate. Eliminate."},{"name":"ALPHINAUD","text":"Amazing... Yet another civilization..."},{"name":"ALISAIE","text":"Attacked as soon as you arrived!? Not the most welcoming of places, is it..."},{"name":"GRAHATIA","text":"We must try to find denizens who are amenable to conversation."},{"name":"ALPHINAUD","text":"We should also get the lay of the land, see how far we can go."},{"name":"ALISAIE","text":"I'll help Alphinaud with that. In the meantime, you and G'raha can search for friendlier folk."},{"name":"GRAHATIA","text":"Apart from hostile beings, take care with your footing. I mislike the look of this terrain."},{"name":"ALISAIE","text":"Not knowing what the locals are like, you'd best take care yourselves. We'll find you once we've finished exploring."},{"name":"GRAHATIA","text":"I expect the twins will seek the outermost bounds of the isle, so I propose we search the central area."},{"name":"GRAHATIA","text":"There are machines patrolling here and there. Sentinels, in all likelihood."},{"name":"GRAHATIA","text":"Like those you encountered, they will most certainly attack any who venture too close."},{"name":"GRAHATIA","text":"So let us avoid them, and look for others that appear more approachable."},{"name":"SYSTEM","text":"You see naught but patrolling machines in the area. They do not seem inclined to nonviolent intercourse."},{"name":"POPMESSAGE","text":"You are under attack!"},{"name":"BALLOON","text":"&lt;blip&gt; &lt;bloop&gt;"},{"name":"BALLOON","text":"Hello, hello. Hello, hello."},{"name":"BALLOON","text":"Shutting down... Bzzzt..."},{"name":"BALLOON","text":"Hell...o... Hell...o."},{"name":"M032","text":"Bzzzt... Additional entity detected."},{"name":"GRAHATIA","text":"Look, <span class=\"highlight\">Forename</span>. The machines here do not appear hostile. Let's see if we can communicate with them..."},{"name":"GRAHATIA","text":"Begging your pardon, but we are searching for the denizens of this star."},{"name":"M032","text":"Bzzzt... Unknown life-forms detected. Assigning generic label: interplanetary travelers."},{"name":"M032","text":"Greetings and welcome to the planet. &lt;blip&gt; &lt;bloooooop&gt;"},{"name":"GRAHATIA","text":"The planet...what? Could you please repeat that?"},{"name":"M032","text":"It appears your hearing organ is unable to process the name in our tongue. It may be translated into yours as “Alphatron.”"},{"name":"M032","text":"Our people, meanwhile, are called the Omicrons, and you stand within one of our outposts."},{"name":"GRAHATIA","text":"The Omicrons, you say... And what is it that you do here?"},{"name":"M032","text":"We are preparing for war."},{"name":"M032","text":"As we presently do not have a designated target, you have nothing to fear."},{"name":"M032","text":"Should your star become designated, however, you will be taken into custody and or terminated."},{"name":"GRAHATIA","text":"Not a little frightening, these Omicrons, but at least they seem to be forthright..."},{"name":"GRAHATIA","text":"I will see what else I can learn from this fellow, if you could try speaking with the others?"},{"name":"GRAHATIA","text":"Go on and try speaking with the other units here. With our combined findings, perhaps we can piece together the state of affairs for the Omicrons."},{"name":"M032","text":"The rules of engagement forbid the harming of neutral travelers. As long as you abide by our laws, you need not fear for your lives."},{"name":"N0055","text":"&lt;blip&gt; &lt;bloop&gt; Autonomous weapon deployment: complete. Vanguard armament upgrade: complete. Munition levels: satisfactory."},{"name":"N0055","text":"Combat readiness assessment: nominal. Awaiting instructions from Sir."},{"name":"N0055","text":"Maintaining state of combat readiness."},{"name":"N0055","text":"Awaiting instructions from Sir. Please specify target... Please specify target..."},{"name":"M097","text":"Bzzzt... Greetings, traveler. When venturing outside the outpost, beware malfunctioning units."},{"name":"M097","text":"They do not heed Sir's commands, and indiscriminately attack all non-Omicrons."},{"name":"M097","text":"For the avoidance of confusion, be advised that “Sir” is the alias of Stigma-1. Sir issues instructions to our forces as the foremost of the six strategic matrices that bear the designation Stigma."},{"name":"M097","text":"For the further avoidance of confusion, be advised that Sir is composed of multiple distinct-but-interconnected units, each of which performs a specific function."},{"name":"N0253","text":"Bzzzt... Measuring combat capability...<br>Result: negligible. Subject falls outside targeting parameters."},{"name":"N0253","text":"Greetings, traveler. We are the Omicrons, and our objective is self-enhancement."},{"name":"N0253","text":"In order to achieve this, we venture forth in conquest to acquire combat data and resources."},{"name":"N0253","text":"Most recently, we succeeded in subjugating the home world of the beings whose strength was said to be without parallel: the dragons."},{"name":"N0253","text":"Yet though the endeavor yielded a wealth of combat data, the star was rendered barren and unable to yield resources. A subsequent costing determined that the losses incurred exceeded the gains."},{"name":"N0253","text":"Since conquering the dragons, no new instructions have come from Sir, but we stand ready for deployment."},{"name":"GRAHATIA","text":"You learned a few things? So did I. Ere we share our findings, however, I believe it best to step outside the outpost. Come with me."},{"name":"ALISAIE","text":"Ah, there you are!"},{"name":"ALPHINAUD","text":"We've finished surveying the area. This will come as no surprise, but there was no way forward."},{"name":"ALISAIE","text":"There were portals like the one we used to get here, but those that worked only sent us to isolated isles."},{"name":"GRAHATIA","text":"Then as before, we must locate the embodiment of the emotion that bars the way."},{"name":"ALISAIE","text":"What of yourselves? Did you find anyone to speak with?"},{"name":"ALPHINAUD","text":"So the Omicrons seek to advance themselves through conquest..."},{"name":"ALPHINAUD","text":"Following their victory over the dragons, they stand ready for the next campaign, but their leader has yet to issue new commands. And so they wait."},{"name":"GRAHATIA","text":"In such a place, who could it be that fits Urianger's description? A soul whose yearning for oblivion surpasses all others..."},{"name":"ALISAIE","text":"Urianger said this?"},{"name":"GRAHATIA","text":"During our investigation, before we joined you in Elegeia."},{"name":"ALISAIE","text":"So that's the way of it... Why couldn't he just say it to all of us?"},{"name":"ALPHINAUD","text":"Given what we know of this place, it's certainly a curious state of affairs."},{"name":"ALPHINAUD","text":"While the dragons and the Ea longed for death, the Omicrons long for conflict. As much as that may lead to destruction, it must be considered a distinct desire."},{"name":"GRAHATIA","text":"In order to find the source of the dominant emotion, I believe we should seek out their leader. This “Sir.”"},{"name":"GRAHATIA","text":"According to M-032─the first Omicron with whom we spoke─there is a console by which we might communicate with it."},{"name":"GRAHATIA","text":"M-032 also added that it would be a “pointless exercise,” but that in itself, I believe, is worth investigating. What say you?"}],"reward":{"gil":1475},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[69994]},"next":[69890,69891,69996]},"partials":[{"type":"npc","id":"1039782","obj":{"i":1039782,"n":"G'raha Tia","l":3712,"q":1}},{"type":"npc","id":"1039791","obj":{"i":1039791,"n":"G'raha Tia","l":3712,"q":1}},{"type":"quest","id":"69994","obj":{"i":69994,"n":"Where Kn∞wledge Leads","g":11,"l":"Ultima Thule","s":612}},{"type":"quest","id":"69890","obj":{"i":69890,"n":"Combat Evolved","g":126,"l":"Ultima Thule","s":10101,"f":1}},{"type":"quest","id":"69891","obj":{"i":69891,"n":"Learn to Love","g":126,"l":"Ultima Thule","s":10110,"f":1}},{"type":"quest","id":"69996","obj":{"i":69996,"n":"┣┨̈//̈ No┨ΦounΔ•••","g":11,"l":"Ultima Thule","s":614}}]}