{"quest":{"name":"Hello, World","location":"Ultima Thule","id":69997,"patch":6.0,"sort":615,"icon":101133,"eventIcon":71201,"issuer":1041158,"target":1041162,"genre":11,"journal":["G'raha Tia is ready to take the next step.","In your search for an Omicron neglecting its duties, you and G'raha Tia have identified a likely unit. It is decided that you will return to Base Omicron to confer with the others.","Harboring uncertainty about the meaning of life, it seems all but certain that the Omicron in question is the source of obstruction. Alphinaud posits that a unit in a position of leadership may have availed itself of another body, and Alisaie conceives of a plan to ascertain its true identity by striking the console with lightning and gauging its reaction. For your part, you are required to closely observe the unit, M-017, while G'raha Tia diverts its attention with conversation. With the details settled, you set forth to carry out the operation.","All goes according to plan─the lightning strike proving M-017 is not entirely what it seems. The unit confesses a connection to Sir, and begs to continue the conversation away from its fellows. G'raha Tia suggests joining the twins at the console, and you head off together.","M-017 reveals its true identity: part of the shared intelligence of Stigma-1, its duty to determine the optimal path for the Omicrons to achieve their prime function. The Omicrons, it explains, were born of a frail and feeble race whose members sought to defend themselves by enhancing their bodies. Yet what began as a desire for self-preservation became conquest for conquest's sake, until the Omicrons eventually grew so powerful as to have no equal. Bereft of a worthy threat, Stigma-1 found itself unable to perform its duty, and came to question its purpose and existence. To counter this civilization-ending despair, G'raha Tia brings his dreams to bear, and by his sacrifice paves the way forward in your quest.","With yet another comrade lost, the burden of your mission weighs heavier. Yet in this place where emotions dictate reality, you can feel their presence spurring your steps ever onward, and you fix your gaze upon the path that remains to be walked."],"objectives":["Speak with Alisaie.","Speak with G'raha Tia and observe M-017.","Speak with M-017.","Speak with Alisaie."],"dialogue":[{"name":"GRAHATIA","text":"We should return to the outpost for now. The others will wish to hear about the errant Omicron."},{"name":"ALPHINAUD","text":"It appears the two of you made a promising discovery."},{"name":"GRAHATIA","text":"I have given them the short of it, if you would care to provide the full account."},{"name":"ALISAIE","text":"G'raha says you found a suspicious Omicron. That's good, because the units here were of no help."},{"name":"ALISAIE","text":"They all had the same thing to say about the extended operations unit: that there's no way to arrange a direct meeting."},{"name":"ALISAIE","text":"Still, that served to prove that it's business as usual at the outpost."},{"name":"ALISAIE","text":"But enough about us. Tell me you learned something more useful..."},{"name":"ALISAIE","text":"An Omicron trying to make sense of the meaning of life... None of the others were even a fraction as philosophical."},{"name":"ALPHINAUD","text":"This unit may well be in a position of leadership. Perhaps even one of those that comprise Sir."},{"name":"ALPHINAUD","text":"As we know, the Omicrons invade other stars and enhance themselves using the spoils of conquest."},{"name":"ALPHINAUD","text":"With the technology at their disposal, they should be able to alter their bodies, be it in part or in whole."},{"name":"ALPHINAUD","text":"Setting aside the question of motive, if Sir, for example, wished to have an ordinary Omicron's body, I see no reason why it would not be possible."},{"name":"GRAHATIA","text":"The problem is how to go about ascertaining if that's what happened..."},{"name":"GRAHATIA","text":"When I attempted to probe further, it promptly ended the conversation. If it is indeed Sir, I doubt it would willingly reveal its true identity."},{"name":"ALISAIE","text":"I have an idea."},{"name":"ALISAIE","text":"We use lightning on the console again, but we make it stronger. Much stronger."},{"name":"ALISAIE","text":"At that moment, should the unit exhibit a reaction, that could suggest that it has a connection to Sir."},{"name":"GRAHATIA","text":"An inspired idea. I daresay it is worth a try."},{"name":"ALISAIE","text":"I had a feeling you'd be on board. This time, you must allow me to do the honors."},{"name":"ALPHINAUD","text":"I will stand guard in case your incantation draws sentries to the scene."},{"name":"GRAHATIA","text":"For my part, then, I will approach our suspect and divert its attention."},{"name":"GRAHATIA","text":"During which time, <span class=\"highlight\">Forename</span>, I want you to observe it closely for anomalous behavior."},{"name":"ALPHINAUD","text":"I should mention that, shortly before you returned, an Omicron appeared from the same direction."},{"name":"ALPHINAUD","text":"Rather than entering the outpost, however, it headed off towards the console. At first I assumed it was a unit on patrol, but perhaps..."},{"name":"GRAHATIA","text":"That could only be our errant Omicron! We must seek it out and begin our operation at once!"},{"name":"ALISAIE","text":"All right, Alphinaud and I will stand by at the console. And when it's time, I'll unleash a veritable storm!"},{"name":"GRAHATIA","text":"This will work, I'm sure of it. After all, our comrades are watching over us..."},{"name":"GRAHATIA","text":"Come, my friend. Let us find this doubt-plagued Omicron!"},{"name":"M017","text":"Bzzzt... It is you again. What is your query?"},{"name":"GRAHATIA","text":"You are the one that was observing the tree, are you not? Full glad I am to find you again."},{"name":"GRAHATIA","text":"I have a question for you, you see. About the device which sustains the tree."},{"name":"M017","text":"Provided it does not necessitate the disclosure of restricted information, very well..."},{"name":"SYSTEM","text":"G'raha has begun distracting the Omicron. Soon, Alisaie will strike the console with lightning."},{"name":"SYSTEM","text":"Observe M-017 closely for anomalous behavior after Alisaie has cast her spell. You may move the camera as well as zoom in and out. Target an area and confirm it with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"M017","text":"...An anomaly, you say?"},{"name":"M017","text":"Performing diagnostic... Error confirmed. My connection to central command is suffering from intermittent failures."},{"name":"M017","text":"I must leave at once and present myself for maintenance at the nearest facility. You will excuse me."},{"name":"GRAHATIA","text":"What you need, my friend, isn't maintenance. It is to confront the truth."},{"name":"GRAHATIA","text":"While we spoke, our comrade struck the console used to communicate with Sir."},{"name":"GRAHATIA","text":"That is the cause of your anomaly. You are connected to Sir, aren't you?"},{"name":"M017","text":"...Affirmative."},{"name":"M017","text":"To what end you sought to assert this fact, I do not know. But before we speak further, we must move away from the other units."},{"name":"M017","text":"I do not wish for them to know my true identity."},{"name":"GRAHATIA","text":"Very well. Our friends are at the console. Let us head there."},{"name":"ALPHINAUD","text":"If naught is amiss with the other Omicrons, I dare to hope we have found that which prevents our advance."},{"name":"ALISAIE","text":"A little jolt works wonders, doesn't it?"},{"name":"ALISAIE","text":"All that's left is to have this Omicron divulge the truth to us."},{"name":"GRAHATIA","text":"This unit struggles to understand why the tree continues to grow despite being destined to die."},{"name":"GRAHATIA","text":"Let us shed light on its doubts, that we may shine the way forward."},{"name":"ALPHINAUD","text":"A crystalline path... He has paved it for us..."},{"name":"ALISAIE","text":"They all leave so easily, as if it's nothing... How do they think we feel!?"},{"name":"ALISAIE","text":"The next time we meet, I'll...I'll give him such a flick...and that'll be just to start..."}],"reward":{"gil":1087},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[69996]},"next":[69998]},"partials":[{"type":"npc","id":"1041158","obj":{"i":1041158,"n":"G'raha Tia","l":3712,"q":1}},{"type":"npc","id":"1041162","obj":{"i":1041162,"n":"Alisaie","l":3712,"q":1}},{"type":"quest","id":"69996","obj":{"i":69996,"n":"┣┨̈//̈ No┨ΦounΔ•••","g":11,"l":"Ultima Thule","s":614}},{"type":"quest","id":"69998","obj":{"i":69998,"n":"Forge Ahead","g":11,"l":"Ultima Thule","s":616}}]}