{"quest":{"name":"F//εsh AbanΔon┨Δ","location":"Ultima Thule","id":69993,"patch":6.0,"sort":611,"eventIcon":71201,"issuer":1040318,"target":1039759,"genre":11,"journal":["Coph-coodg languidly awaits his brethren's arrival."],"objectives":["Speak with Coph-coodg.","Wait at the designated location.","Wait at the designated location again.","Speak with Y'shtola."],"dialogue":[{"name":"ALPHINAUD","text":"I suppose there is a logic to creatures comprised of spiritual energy utilizing crystals as living spaces, but it is nevertheless surprising to see."},{"name":"ALISAIE","text":"I've tried reaching out to whatever is inside this crystal, but all I can hear is sporadic moaning."},{"name":"URIANGER","text":"Despite my best efforts, mine overtures have elicited no response from this crystal. I can but assume its resident sleepeth most soundly. Or so I hope..."},{"name":"YSHTOLA","text":"Is it not strange they lack passion to research that which they allegedly desire?"},{"name":"YSHTOLA","text":"If we are fortunate, the Ea residing in these crystals will shed light on this contradiction."},{"name":"GRAHATIA","text":"If I heard correctly, the Ea within this crystal says it will emerge from within shortly. Do you suppose they all appear as Coph-coodg does?"},{"name":"ALISAIE","text":"&lt;sigh&gt; I had no luck, but everyone else fared well enough. Quite a few Ea have awakened."},{"name":"COPHCOODG","text":"Ah, there they are."},{"name":"COPHCOODG","text":"May I introduce to you Lah-laakh, Dew-deekh, and Neh-needg."},{"name":"LAHLAAKH","text":"It has been too long, Coph-coodg. I daresay Sadr IV has since completed an orbit."},{"name":"COPHCOODG","text":"Indeed. Until the travelers brought it to my attention, I hadn't noticed how unraveled some had become."},{"name":"NEHNEEDG","text":"Travelers...? Ah, of course, of course. The ones who wished to know why we seek to regain corporeal forms."},{"name":"COPHCOODG","text":"The truth of the matter is as plain to see as the neighboring systems, but my single account would fail to satisfy the requirement for scientific objectivity. Thus did I bid them awaken you."},{"name":"GRAHATIA","text":"Am I the only one who struggles to tell who is speaking?"},{"name":"URIANGER","text":"Nay, thou art not. In the absence of corporeal forms and the divergence they afford, mayhap such similarity in voice is unavoidable."},{"name":"DEWDEEKH","text":"By the way, Coph-coodg─have you already observed the requisite custom for the travelers?"},{"name":"DEWDEEKH","text":"That which one is expected to do when receiving guests. A matter of proper form."},{"name":"COPHCOODG","text":"Ahhh, yes. So long has it been, it had completely escaped my mind...and still does. What was it again? I can't seem to remember..."},{"name":"DEWDEEKH","text":"Neither do I. Pity. I was hoping you would..."},{"name":"NEHNEEDG","text":"Perhaps we can search the archives for the answer."},{"name":"COPHCOODG","text":"Come now, Neh-needg, the archives have long been frozen, lest we subject ourselves to further dolor. Surely you recall that much."},{"name":"LAHLAAKH","text":"...Ah, of course. Food─the custom is to serve food."},{"name":"LAHLAAKH","text":"Beings of flesh such as they must regularly replenish their aether. By contributing to their replenishment, we communicate our friendly intention."},{"name":"ALLEA04457","text":"(-All-)That's right, that's right!"},{"name":"COPHCOODG","text":"We duly invite you to join us in communal repast, after which we may engage in leisurely conversation."},{"name":"ALPHINAUD","text":"If we have a chance to learn something, then I see no reason to decline."},{"name":"COPHCOODG","text":"Excellent. If you would care to follow, we shall feast you on the purest aether."},{"name":"LAHLAAKH","text":"How much aether would be adequate for your kind, I wonder... As I recall, there is a fine line between optimal satiation and violent sickness."},{"name":"DEWDEEKH","text":"Throughout the universe, but few races have completely shed their flesh as we have. As a result, we seldom receive visitors from other systems."},{"name":"DEWDEEKH","text":"Extreme differences can inhibit meaningful interaction, you see, and none more so than those which affect communication. Most entities, for example, cannot even comprehend our words."},{"name":"DEWDEEKH","text":"You are rare indeed in your ability to do so. You avail yourselves of dynamis, yes? It is an impressive application...even if it is ultimately pointless like all the rest."},{"name":"NEHNEEDG","text":"To think that I had forgotten what had become of the archives... How much has my essence deteriorated since last I was awake?"},{"name":"NEHNEEDG","text":"Not that I am averse to having my mind fade away in this manner. It isn't so unlike the natural degradation of one's flesh. How delightful."},{"name":"ALPHINAUD","text":"If they are thus able to replenish their aether, the loss of vital sustenance isn't like to be the cause of their demise."},{"name":"ALISAIE","text":"Aether, they said, but I can't help but feel a bit nervous..."},{"name":"URIANGER","text":"Judging by the construction of this facility, 'twould seem the Ea directly draw upon the aether."},{"name":"YSHTOLA","text":"If it is as I suspect, then this so-called feast..."},{"name":"YSHTOLA","text":"...Actually, let us just see it for ourselves. Fear not─we are not like to come to harm."},{"name":"GRAHATIA","text":"We were told to stand wherever we like. This strikes me as less of a meal and more a ritual..."},{"name":"COPHCOODG","text":"This facility is where we replenish our aether. There is no particular name for it, but we traditionalists sometimes use the word “restaurant.”"},{"name":"COPHCOODG","text":"Now then, if you would take your place with your comrades, the space will soon be awash with purest aether. Please absorb as much as you like."},{"name":"COPHCOODG","text":"If you are worried about the quality of aether, don't be. We guarantee it is the purest stuff."},{"name":"SYSTEM","text":"You brace yourself for a rush of sweet, sweet aether...but nothing seems to happen. Perhaps you need to wait a little longer."},{"name":"SYSTEM","text":"You brace yourself again. But again, nothing seems to happen."},{"name":"YSHTOLA","text":"Just as I had suspected. As meticulously as one might recreate the Ea's home world, this is Ultima Thule. One cannot simply generate aether here."},{"name":"YSHTOLA","text":"As recreations, our friends are oblivious to this fact. To the very truth of their existence. Much like the phantoms of the recreated Amaurot."},{"name":"YSHTOLA","text":"However appearances may seem, we must ever be mindful that it is the memories of the dead with whom we deal."},{"name":"COPHCOODG","text":"So, did you have your fill of aether?"},{"name":"YSHTOLA","text":"Alas, we couldn't absorb it. A deficiency in our forms, it would seem."},{"name":"COPHCOODG","text":"Oh, how very unfortunate... May I ask how you normally replenish your aether?"},{"name":"DEWDEEKH","text":"Through your mouths, you say! How very primitive and quaint!"},{"name":"NEHNEEDG","text":"To think that their mouths serve not only to expel sound, but draw in sustenance besides... Such life-forms have long since vanished from our systems!"},{"name":"URIANGER","text":"Though we regrettably could not partake of your magnificent feast, rest assured we feel your welcome most keenly."},{"name":"URIANGER","text":"In the course of acquainting ourselves with your sophisticated ways, however, we could not fail but wonder: wherefore do you wish to obtain vessels of flesh, and thence to vanish? Will you not favor us with an explanation?"},{"name":"COPHCOODG","text":"You flesh-and-blood beings are always so hasty. It does have its charm, however..."},{"name":"COPHCOODG","text":"Very well, we shall indulge you. In the beginning, when the Ea yet possessed corporeal bodies, our ancestors dedicated themselves to the pursuit of knowledge and technological advancement."},{"name":"COPHCOODG","text":"By transcending all limitations, we believed we would eliminate sorrow and abide in true happiness."},{"name":"LAHLAAKH","text":"From the tangible such as land to the intangible such as labor, there exist myriad hindrances to progress. But the most confining of all was the flesh itself."},{"name":"LAHLAAKH","text":"Our natural lifespan was distressingly middling, you see. Too short to enjoy unhurried lives, yet too long to be considered disposable."},{"name":"LAHLAAKH","text":"Furthermore, to simply maintain the integrity of our bodies demanded considerable resources."},{"name":"NEHNEEDG","text":"But we managed to solve this problem."},{"name":"NEHNEEDG","text":"After long years, we discovered how to become noncorporeal entities with everlasting lives, untroubled by the failures of the flesh."},{"name":"DEWDEEKH","text":"Thus changed, we had more time and freedom to continue our scientific pursuits."},{"name":"DEWDEEKH","text":"We went on to make ever greater strides in our quest to transcend all limitations, until we finally decided to challenge the last of them all: the limit of knowledge."},{"name":"COPHCOODG","text":"That is to say, deciphering the laws of creation."},{"name":"COPHCOODG","text":"We sought to discover how the universe came into being and explain all extant phenomena, and thence predict the future."},{"name":"COPHCOODG","text":"If we could but achieve this, we believed that we would be free from uncertainty and anxiety."},{"name":"YSHTOLA","text":"And did you find the answers you sought?"},{"name":"COPHCOODG","text":"Yes, we did. Our efforts revealed to us a fundamental truth."},{"name":"LAHLAAKH","text":"Knowledge of said truth is essential for the continuation of our conversation. If you would learn more, we will share it with you."},{"name":"DEWDEEKH","text":"No, we mustn't. Primitive as they are, it would be unspeakably cruel to deprive them of their ignorance."},{"name":"NEHNEEDG","text":"They are possessed of corporeal forms, their lives readily ended."},{"name":"NEHNEEDG","text":"As those who have gone before, is it not our duty to warn them?"},{"name":"URIANGER","text":"What thinkest thou...?"},{"name":"COPHCOODG","text":"We have deliberated and come to a consensus."},{"name":"COPHCOODG","text":"If you are resolved to know it, we will disclose to you the truth we discovered. The truth of the universe."},{"name":"COPHCOODG","text":"Seek us at the stone pillars just outside the bounds of the abode. A place called Elegeia."},{"name":"ALPHINAUD","text":"'Tis true that a lack of knowledge can beget fear. Therefore, in theory, by acquiring all knowledge, it may be possible to attain peace."},{"name":"ALPHINAUD","text":"But as Hydaelyn told us, all those peoples who attempted to free their worlds from life's woes met with failure."},{"name":"ALPHINAUD","text":"And the Ea are among them, as their presence here attests. The tale we are about to hear will not be a happy one."},{"name":"ALISAIE","text":"You may be intimately familiar with a problem─know it like the back of your hand─yet be powerless to solve it."},{"name":"ALISAIE","text":"In the course of my struggles, I've often been made keenly aware of this fact. I wonder, have the Ea never felt the same frustration?"},{"name":"URIANGER","text":"Like her master, Y'shtola seeketh the truth of creation."},{"name":"URIANGER","text":"How will the truth of the Ea, who uncovered all only to desire the end, fall upon her ears...?"},{"name":"GRAHATIA","text":"To define the laws of creation would have been no small feat, even for the Ea. Nay, having eternal life, and hence no sense of haste, would only have made it harder."},{"name":"GRAHATIA","text":"Such tremendous drive for knowledge they once must have had, and I struggle to reconcile it with the listless beings before us. Whatever answers they found, it did not bring them happiness."},{"name":"YSHTOLA","text":"A fundamental truth..."},{"name":"YSHTOLA","text":"We will hear it, of course. Let us learn what has led such an enlightened people to this indolent end."}],"reward":{"gil":952},"reqs":{"jobs":[{"lvl":89,"id":142}],"quests":[69992]},"next":[69994]},"partials":[{"type":"npc","id":"1040318","obj":{"i":1040318,"n":"Coph-coodg","l":3712,"q":2}},{"type":"npc","id":"1039759","obj":{"i":1039759,"n":"Y'shtola","l":3712,"q":1}},{"type":"quest","id":"69992","obj":{"i":69992,"n":"Roads Pαved││Sacri┣ice","g":11,"l":"Ultima Thule","s":610}},{"type":"quest","id":"69994","obj":{"i":69994,"n":"Where Kn∞wledge Leads","g":11,"l":"Ultima Thule","s":612}}]}