{"quest":{"name":"┣┨̈//̈ No┨ΦounΔ•••","location":"Ultima Thule","id":69996,"patch":6.0,"sort":614,"eventIcon":71201,"issuer":1040340,"target":1041157,"genre":11,"journal":["G'raha Tia is ready to set forth."],"objectives":["Speak with G'raha Tia.","Examine the console.","Speak with Alphinaud.","Observe activity at Base Omicron.","Speak with G'raha Tia.","Search for the errant Omicron."],"dialogue":[{"name":"ALPHINAUD","text":"Considering the Omicrons' single-minded character, the lack of new orders does seem unusual. I agree that we should seek out their leader."},{"name":"ALISAIE","text":"“Pointless exercise”... What does that mean, I wonder..."},{"name":"GRAHATIA","text":"So, the console we seek lies on the far side of this isle."},{"name":"GRAHATIA","text":"Given the nature of the ground, the route may not be entirely direct as it seems."},{"name":"GRAHATIA","text":"Let us all watch our step as we make our way."},{"name":"ALPHINAUD","text":"The glow would suggest it is still operational. But how are we to interact with it...?"},{"name":"ALISAIE","text":"Greetings, Sir! Can you hear me? Say something if you can! Awaken! Activate! ...Password!"},{"name":"ALISAIE","text":"...Well, I tried."},{"name":"GRAHATIA","text":"This appears to be the console."},{"name":"GRAHATIA","text":"But it seems...unresponsive."},{"name":"GRAHATIA","text":"Would you care to take a look at it?"},{"name":"GRAHATIA","text":"Judging by the size of the Omicrons we've met, I'm reasonably confident the console is controlled via the orb."},{"name":"SYSTEM","text":"You try touching, smacking, and attuning with the console, but there is no response..."},{"name":"GRAHATIA","text":"No luck, I see."},{"name":"GRAHATIA","text":"But there must be a way to activate it. There must..."},{"name":"ALISAIE","text":"I remember when we set Omega loose to deal with Shinryu..."},{"name":"ALISAIE","text":"An Allagan weapon, we once thought. And here we are now, visiting a recreation of its home world."},{"name":"ALISAIE","text":"I can only imagine how else these beings will surprise us..."},{"name":"GRAHATIA","text":"Though I never encountered Omega myself, in conceiving the means to send the Crystal Tower to the First, we borrowed much from its mastery of the rift."},{"name":"GRAHATIA","text":"Indeed, so many times did I read the report of your battle, I believe I could recite it word for word."},{"name":"GRAHATIA","text":"Omega's miniature likeness also survived to the future, if a little worse for the wear. I must confess, I was delighted to see it again in the present."},{"name":"GRAHATIA","text":"Though I never encountered Omega myself, in conceiving the means to send the Crystal Tower to the First, we derived no small inspiration from its abilities."},{"name":"GRAHATIA","text":"In the course of my research, I devoured every single piece of literature I could find on the being. To think that the knowledge would prove useful here, at the edge of existence..."},{"name":"ALPHINAUD","text":"Let us focus our search on the outpost."},{"name":"ALPHINAUD","text":"Alisaie and I will try speaking with the Omicrons this time, in the hopes we might learn something new."},{"name":"ALPHINAUD","text":"Meanwhile, perhaps you and G'raha could observe them from a distance."},{"name":"ALPHINAUD","text":"These beings are systematic and routine by nature. If there are any that aren't, it shouldn't be too difficult to spot them."},{"name":"ALPHINAUD","text":"If there are no questions, then let us begin at once!"},{"name":"GRAHATIA","text":"As we came this way, I believe I spied a promising vantage point. Follow me."},{"name":"ALPHINAUD","text":"We will be certain to ask about the extended operations unit."},{"name":"ALISAIE","text":"Not only do they look the same; they say the same things as well..."},{"name":"GRAHATIA","text":"And here we are. I see the twins are wasting no time with their inquiries."},{"name":"GRAHATIA","text":"Let us begin observing the Omicrons. They are supposed to be standing by, so we should look for any that aren't."},{"name":"SYSTEM","text":"Search Base Omicron for errant Omicrons. You may move the camera, as well as zoom in and out. Target an Omicron and examine it with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"GRAHATIA","text":"An Omicron wandering aimlessly? Where!?"},{"name":"GRAHATIA","text":"Aha, I see it!"},{"name":"GRAHATIA","text":"It's left the base. Let's follow it!"},{"name":"GRAHATIA","text":"It's not here, but it definitely came this way. It must have used the portal."},{"name":"GRAHATIA","text":"Time to go through and see what we find..."},{"name":"GRAHATIA","text":"Nothing nearby save malfunctioning units. Come─the portal awaits."},{"name":"Q1","text":"Travel through the portal?"},{"name":"M017","text":"Bzzzt... What is your query?"},{"name":"GRAHATIA","text":"Ah, you found it!"},{"name":"GRAHATIA","text":"What are you doing here?"},{"name":"M017","text":"...I am looking at the tree."},{"name":"GRAHATIA","text":"Quite an unusual specimen... What is the device attached to it?"},{"name":"M017","text":"The tree is a sample collected from another star. As it cannot survive in our environment, however, it requires life support. That is the function of the device."},{"name":"GRAHATIA","text":"To go to such lengths to sustain it... Is there something special about this tree?"},{"name":"M017","text":"Being foreign matter, protocol requires that we study it. As this task has been completed, the specimen may be discarded."},{"name":"M017","text":"However, when I behold the tree, I am made to feel as though...there is a problem."},{"name":"M017","text":"In order to become strong, we have continued to enhance ourselves. Like we did countless others, we conquered the star whence this tree came."},{"name":"M017","text":"It is the last remnant of a dead world, and there is nothing towards which it may aspire. Yet it grows. Extends its branches. Sprouts leaves. Produces seeds."},{"name":"M017","text":"Why does it seek to continue?"},{"name":"M017","text":"Why was it made to behave in such a way, and to what end? I do not understand."},{"name":"GRAHATIA","text":"...I see. Out of curiosity, does this pertain to your duty?"},{"name":"M017","text":"...No, it does not. My apologies, I shall return to my designated post and assume a state of combat readiness."},{"name":"GRAHATIA","text":"So, it was acting outside of orders..."},{"name":"GRAHATIA","text":"Perhaps it is simply a malfunctioning Omicron. These are by no means uncommon."},{"name":"GRAHATIA","text":"But it may also be a unit possessed of the ability to make decisions. One not unlike Sir..."},{"name":"GRAHATIA","text":"I believe this bears further investigation."},{"name":"GRAHATIA","text":"To endeavor to live even if we must depend on forces beyond our control..."},{"name":"GRAHATIA","text":"Tell me, <span class=\"highlight\">Forename</span>. One day, when this adventure becomes a part of your epic, do you think I will be mentioned in it?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Of course. Why wouldn't you be?"},{"name":"A3","text":"Maybe in a footnote."},{"name":"A3","text":"You're not here so you can be in a story."},{"name":"GRAHATIA","text":"You truly think so? That would be a..."},{"name":"GRAHATIA","text":"Nay, I shouldn't say such things until the moment comes to pass. Never mind the embarrassment..."},{"name":"GRAHATIA","text":"Oh, come now, how much would it have cost you to simply nod?"},{"name":"GRAHATIA","text":"'Tis no simple thing to earn a place beside you, this I know full well. But it is something to hope for as I forge on."},{"name":"GRAHATIA","text":"...Forgive me. Let there be no doubt that fame and glory could not be further from my mind."},{"name":"GRAHATIA","text":"And yet...I would be lying if I said that I don't relish the thought of my name being spoken in the same breath as yours."},{"name":"GRAHATIA","text":"...Well, we had best get on with our task."},{"name":"GRAHATIA","text":"Tracking down Sir, and understanding the nature of the emotion which bars our way!"}],"reward":{"gil":1260},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[69995]},"next":[69997]},"partials":[{"type":"npc","id":"1040340","obj":{"i":1040340,"n":"G'raha Tia","l":3712,"q":1}},{"type":"npc","id":"1041157","obj":{"i":1041157,"n":"M-017","l":3712,"q":1}},{"type":"quest","id":"69995","obj":{"i":69995,"n":"Vic┨οry  ̈ ̈ ̈╳, │̆││ε Lost","g":11,"l":"Ultima Thule","s":613}},{"type":"quest","id":"69997","obj":{"i":69997,"n":"Hello, World","g":11,"l":"Ultima Thule","s":615}}]}