{"quest":{"name":"Forge Ahead","location":"Ultima Thule","id":69998,"patch":6.0,"sort":616,"eventIcon":71201,"issuer":1041161,"target":1041167,"genre":11,"journal":["Amidst the sadness of Alphinaud's countenance, there is a newfound determination."],"objectives":["Speak with Alphinaud.","Speak with Alphinaud and have him accompany you.","Speak with Alisaie while accompanied by Alphinaud and have them accompany you.","Follow the crystalline path while accompanied by Alphinaud and Alisaie, and speak with Alphinaud at the designated location.","Speak with Alphinaud."],"dialogue":[{"name":"ALISAIE","text":"Fools, all of them... Fools..."},{"name":"ALPHINAUD","text":"That crystalline path─G'raha has paved it for us."},{"name":"ALPHINAUD","text":"Difficult as it is, we must carry on. For our friends, and all who await us in faith."},{"name":"ALPHINAUD","text":"So come, let us seek the path's beginning. It appears to be near the outpost."},{"name":"ALISAIE","text":"I won't let it break me, don't you worry. I never have, and I never will."},{"name":"ALPHINAUD","text":"Look, <span class=\"highlight\">Forename</span>. A portal has opened."},{"name":"ALPHINAUD","text":"It will surely deliver us true. It must."},{"name":"Q1","text":"Travel through the portal?"},{"name":"ALISAIE","text":"Look up, <span class=\"highlight\">Forename</span>. It's as though the stars are being devoured by the dead sun..."},{"name":"ALISAIE","text":"And that's where we're headed─into the maw of darkness."},{"name":"ALPHINAUD","text":"Well, here is where the path begins. And it ascends to dizzying heights..."},{"name":"ALPHINAUD","text":"Let us make our way, one sure step at a time."},{"name":"Q2","text":"What will you do?"},{"name":"A2","text":"Talk."},{"name":"A2","text":"Part ways."},{"name":"A2","text":"Nothing."},{"name":"ALPHINAUD","text":"Now more than ever, we must walk as one. Will you go and take Alisaie's hand?"},{"name":"Q3","text":"Are you sure you wish to part ways with your companions?"},{"name":"ALPHINAUD","text":"Forgotten something, have you? Very well, we'll be waiting by the portal."},{"name":"ALPHINAUD","text":"Aye, let us press on. One sure step at a time, till we win through to Meteion."},{"name":"SYSTEM","text":"Your companions have yet to arrive. Be sure they are at your side before attempting to continue."},{"name":"ALISAIE","text":"We should keep moving. Go and tell Alphinaud, will you?"},{"name":"SYSTEM","text":"You should have Alphinaud accompanying you before setting forth."},{"name":"ALISAIE","text":"Our friends got us this far. Their courage, their strength. Their wisdom. Their love."},{"name":"ALISAIE","text":"We owe it to them to continue. No matter how long it takes..."},{"name":"SYSTEM","text":"Alphinaud and Alisaie are now accompanying you. Keep them at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave your quest companions behind by entering a different area, or by speaking with them and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have your companions join you again, return and speak with them at the original location."},{"name":"A3","text":"<span class=\"highlight\">Gaze at the distant stars.</span>"},{"name":"A3","text":"<span class=\"highlight\">Listen to the silence.</span>"},{"name":"A3","text":"<span class=\"highlight\">Look back on the path.</span>"},{"name":"A3","text":"<span class=\"highlight\">Offer a word of comfort.</span>"},{"name":"A3","text":"<span class=\"highlight\">Look at the path ahead.</span>"},{"name":"ALPHINAUD","text":"Should you start to fall, we'll be here to catch you. I know you'll do the same for us."},{"name":"ALPHINAUD","text":"Alisaie appears to have fallen behind... We had best head back and fetch her."},{"name":"ALISAIE","text":"G'raha paved this path for us. We were meant to follow it."},{"name":"ALISAIE","text":"Where did Alphinaud disappear to now? We need to turn around and look for him."},{"name":"ALISAIE","text":"We understand, take what time you need. When you're ready to continue, we'll be waiting by the portal."},{"name":"ALISAIE","text":"If you're ready, then so am I. Let's follow the path where it leads!"},{"name":"ALPHINAUD","text":"The innumerable lights that shine in the distance─to think that they all could have birthed civilizations..."},{"name":"ALPHINAUD","text":"To think that everything they built has gone to dust, their peoples lost to despair... Of the stars floating in this sea of midnight, ours is a lonely aberration."},{"name":"ALPHINAUD","text":"And yet...no matter how many worlds have met their ends, with you and Alisaie beside me, there is nothing I fear. No ocean so vast I cannot cross."},{"name":"ALISAIE","text":"Those broken stars I see─shattered, ruptured, unraveled─I wonder if they're also worlds recreated at their ends..."},{"name":"ALISAIE","text":"The sight of them fills me with a sorrow I cannot describe...and a truth I cannot deny."},{"name":"ALISAIE","text":"Birth...and death. Whence we came and where we'll return. A wheel from which there is no escape."},{"name":"ALPHINAUD","text":"...Thancred would scout the road ahead. Y'shtola and Urianger would trade opinions on esoteric subjects."},{"name":"ALPHINAUD","text":"G'raha would join in their discussion, or else chat with me and Alisaie about the mission. Estinien would be at the rear, apart yet present."},{"name":"ALPHINAUD","text":"All the while you would come and go. Wherever you are needed. And together, we would travel..."},{"name":"ALISAIE","text":"All I can hear are my footfalls. My heartbeat. It's so much quieter now..."},{"name":"ALISAIE","text":"But the fact we can breathe and continue on is proof that the others are still with us."},{"name":"ALISAIE","text":"They are... They are... Aren't they...?"},{"name":"ALPHINAUD","text":"The portal is barely visible from up here."},{"name":"ALPHINAUD","text":"...Truly, we've come far. Much farther than would have been possible had we kept chasing perfect ideals as we did in the past."},{"name":"ALPHINAUD","text":"It is because we have known failure and frustration─that we have learned and grown from them─that Hydaelyn has entrusted us with this mission. With the fate of the very star."},{"name":"ALISAIE","text":"It's all a dream, isn't it...? A long, elaborate dream..."},{"name":"ALISAIE","text":"Any moment now, I'll wake up in my bed. Still a student. Grandfather alive. I'd go about my day, relieved as the fragments of that other life fade away..."},{"name":"ALISAIE","text":"And that would be happiness...wouldn't it? That none of it... No. No, I won't give up these experiences. Good and bad, they are mine. They are <span class=\"emphasis\">me</span>."},{"name":"ALPHINAUD","text":"Rest assured I am fine...but thank you for your concern. What of yourself? Though we can't afford to be too leisurely, neither need we rush unduly."},{"name":"ALPHINAUD","text":"We've crossed an impossible distance to stand where we are now, and we're but a few steps away from journey's end. It will be over before we know it."},{"name":"ALISAIE","text":"Me...? Oh, I still have plenty of legs left in me, don't you worry. It's you I'm worried about."},{"name":"ALISAIE","text":"You always push yourself so hard for us─for everyone. And while we're here, we'll make sure to bear our share of the burden."},{"name":"ALPHINAUD","text":"Well, this is it. The end of the path, and the beginning of whatever awaits."},{"name":"ALPHINAUD","text":"There will be greater hardships. We may be made to feel powerless."},{"name":"ALPHINAUD","text":"Yet come what may, let us have no regrets. No, let us have pride in what we have achieved."},{"name":"ALPHINAUD","text":"In what we achieved, and how it changed us for the better... That's worth fighting for. And dying for. As they did..."},{"name":"ALISAIE","text":"There are some structures up ahead. Still a ways to go before we reach the dead sun..."},{"name":"ALISAIE","text":"Given...all this...I know how naive it must sound to hope it all works out somehow."},{"name":"ALISAIE","text":"Still, you'll forgive me if I wish for it all the same. And for you most of all."},{"name":"ALISAIE","text":"Not that you of all people need it. It's just...after all the help you've given me, for once I want to be the one to help you."},{"name":"ALISAIE","text":"Of all the recreated worlds we've seen, this one feels the most familiar..."},{"name":"SYSTEM","text":"You should have Alisaie accompanying you before continuing."},{"name":"ALPHINAUD","text":"This is almost..."},{"name":"ALISAIE","text":"Normal? It's not unlike many cities we know. But it's deathly quiet..."},{"name":"ALPHINAUD","text":"Mayhap the inhabitants are within the buildings. Or invisible to our senses."},{"name":"METEION","text":"(-???-)Wrong on both counts. There is simply no one here."},{"name":"ALPHINAUD","text":"Meteion!"},{"name":"METEION","text":"This is how I found it when I arrived. Another star which once pulsed with life, but no longer."},{"name":"METEION","text":"How it ended, I do not know. Invasion, sickness, suicide─none can say."},{"name":"METEION","text":"None lived to speak for the dead. They are gone. Gone. Search all you like, but you'll only end up turning back."},{"name":"ALISAIE","text":"If what Meteion says is true, what are we supposed to do...?"},{"name":"ALPHINAUD","text":"If there is no one here, then neither should there be emotion to bar our way."},{"name":"ALPHINAUD","text":"Yet Meteion seems convinced we'll turn back. What riddle is this...?"}],"reward":{"gil":915},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[69997]},"next":[69999]},"partials":[{"type":"npc","id":"1041161","obj":{"i":1041161,"n":"Alphinaud","l":3712,"q":1}},{"type":"npc","id":"1041167","obj":{"i":1041167,"n":"Alphinaud","l":3712,"q":1}},{"type":"quest","id":"69997","obj":{"i":69997,"n":"Hello, World","g":11,"l":"Ultima Thule","s":615}},{"type":"quest","id":"69999","obj":{"i":69999,"n":"You're Not Alone","g":11,"l":"Ultima Thule","s":617}}]}