{"quest":{"name":"Endwalker","location":"Ultima Thule","id":70000,"patch":6.0,"sort":618,"icon":101135,"eventIcon":71201,"issuer":1042216,"target":1041189,"genre":11,"journal":["The Scions of the Seventh Dawn stand ready for the finale.","Having come this far together, everyone's resolve is beyond doubt, and there is little left to say. All that remains is to sally forth into the Dead Ends on your way to your reckoning with Meteion.<br><br>※To enlist your companion NPCs for this duty, speak with them near the entrance or access Duty Support via the main menu. Use the Duty Finder if you wish to complete the instance alongside fellow players.","With your staunch comrades at your side, you cut a path through foes born of despair to arrive at the innermost part of the Dead Ends. Just beyond lies the heart of Meteion's dominion, and you steel yourself for the confrontation to come.<br><br>※In the event that you leave the area, you may return from Absolute Horizon in Ultima Thule.","After a journey through time immemorial and space immeasurable, you finally come face-to-face with the true Meteion. The familiar marshals the despair of countless ruined stars to arise as the Endsinger, and unleashes her might against you. Though you fight resolutely, one after another your comrades are overpowered, and it is all you can do to activate your teleporter and deliver them to safety. Just when it seems you must contend with your fearsome foe alone, help arrives in the most unexpected of forms─Zenos as a dragon. Though his foremost desire as ever remains glorious battle with you, he lends you his wings that you might first dispense with the distraction. Thus do you take to the air, to silence the song of oblivion once and for all.<br><br>※The Final Day can be accessed via the Duty Finder.","In a struggle between hope and despair, the stakes no less than the continued existence of life itself, the Endsinger brings her all to bear against you. More than once, the mighty being pushes you beyond your limits, but given strength by the prayers of your comrades, you weather the relentless onslaught to deliver the decisive blow. In defeat the Endsinger falls, and you descend after her.<br><br>※In the event that you leave the area, you may return from Absolute Horizon in Ultima Thule.","Amidst an endless darkness, you find Meteion alone, as the familiar she once was. You share with her all that you felt during your journeys─from sweetest triumphs to bitterest defeats─and by this act, she finally finds the answer which she had sought all along. Filled with joy for the discovery and remorse for her deeds, she offers to sing one last song before she falls forever silent─a song of hope unbridled─and creates a path to deliver you back to your comrades. But ere you leave, Zenos arrives to issue you challenge. Though he allows you the choice to walk away, it is past time to put an end to this chapter─and him.","At the end of a grueling encounter, you succeed in laying Zenos low and gifting him the bliss for which he hungered. However, you succumb to your own injuries and collapse to the ground. Your opponent breathes his last, and it seems you are destined to share his grave at the edge of existence...","Miracles happen every day. And this day, a miracle─one borne upon hopes, perhaps─has delivered you unto the <span class=\"emphasis\">Ragnarok</span>, where you awaken surrounded by caring comrades. Though you have felt better, you are very much alive, and make a triumphant return to beautiful Etheirys, having delivered salvation to the world.<br><br>Some time later, the Scions of the Seventh Dawn gather at the Rising Stones for the final time. For as has been decided, the order shall disband─albeit only in appearance. Having done its part to usher in lasting change, it will retreat from plain sight, and instead work unobtrusively to solve the problems that plague the realm. Ere you and your comrades go your separate ways, Tataru bids everyone leave no preparations undone or words unsaid.","You take a moment to speak with each of your comrades, and hear their respective plans and aspirations. Though your destinations be disparate, and you will work apart for the foreseeable future, ever will you be united by your unseverable ties as Scions. Having said all that needs be said, you turn to inform Tataru that you are ready to set forth.","Thus are the Final Days averted, and the curtain falls on a tale spanning eons. Gone are those ancient gods who had steered the course of the world, and none can say what lies ahead. Yet one thing is certain: where there is life, there is hope. A light that pierces the deepest darkness. And so long as we hold fast to it, ever will we shine a way unto the morrow. Bearing the memories of your journey thus far, of those whose lives you have touched, and who have touched you in turn, you look forward to the tales still to come."],"objectives":["Enter the Dead Ends.","Confront the Endsinger on the Final Day.","Defeat Zenos.","Speak with your comrades.","Speak with Tataru."],"dialogue":[{"name":"ALISAIE","text":"Let's usher in an ending worthy of the grandest ovation─one that will give all Etheirys cause to raise their voices in celebration!"},{"name":"ALPHINAUD","text":"Are you ready, <span class=\"highlight\">Forename</span>?"},{"name":"ALPHINAUD","text":"Then let us set forth for the reckoning."},{"name":"ALPHINAUD","text":"Having come this far, I know everyone's resolve is beyond doubt. So I will say only this."},{"name":"ALPHINAUD","text":"Within that dead sun swirls the emotions that Meteion has hoarded. The emotions of innumerable souls who strove for happiness but failed."},{"name":"ALPHINAUD","text":"As it was with the denizens of Ultima Thule that barred our way, it is not for us to rebuke and admonish."},{"name":"ALPHINAUD","text":"'Twas not by passing judgment on the tragic legacies of others that we arrived at this moment."},{"name":"ALPHINAUD","text":"Rather, it was by opening our hearts to their despair─by understanding and acknowledging their fates, while still refusing to share in them ourselves. To hold fast to hope, not in ignorance but by choice."},{"name":"ALPHINAUD","text":"Should you struggle to do so, I am here to help. As you have all helped me."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We will prevail!"},{"name":"A1","text":"Everyone's going home today. Understood?"},{"name":"A1","text":"Let's put an end to the end."},{"name":"SCIONS","text":"(-All-)Aye!"},{"name":"Q2","text":"What will you do?"},{"name":"A2","text":"Small talk."},{"name":"A2","text":"Form a party and enter the Dead Ends."},{"name":"A2","text":"Nothing."},{"name":"ALPHINAUD","text":"Emet-Selch and Hythlodaeus created these flowers from our hopes."},{"name":"ALPHINAUD","text":"If so, mine and Alisaie's shall live on here..."},{"name":"ALPHINAUD","text":"The hope that you will find happiness at journey's end."},{"name":"ALPHINAUD","text":"So let us go, <span class=\"highlight\">Forename</span>, and see this tale to its conclusion!"},{"name":"ALISAIE","text":"Just so you know, <span class=\"highlight\">Forename</span>, I won't try to keep up with you in the coming battle."},{"name":"ALISAIE","text":"No, I mean to <span class=\"emphasis\">surpass</span> you! If there's anyone who'll need to keep up, it's Estinien!"},{"name":"ALISAIE","text":"I'm not joking. Both Alphinaud and I have worked hard and come far. It's time we set our sights higher."},{"name":"ALISAIE","text":"So you had better watch out, else you'll find yourself in my wake!"},{"name":"THANCRED","text":"It seems our arms and armor are in order, as are our personal effects."},{"name":"THANCRED","text":"Most importantly, we have each other. We need only finish what we came here to do."},{"name":"THANCRED","text":"Avert the end. For Minfilia, for Ryne, for all who aspire to live."},{"name":"URIANGER","text":"Thus far, we have encountered recreations of some few stars. Doubtless they account for but a fraction of the innumerable worlds to whose fall Meteion did bear witness."},{"name":"URIANGER","text":"Roiling with torment, the dead sun is forsooth oblivion's apotheosis. It shall be no small coup to breach this nexus of despair."},{"name":"URIANGER","text":"And yet, as this vista doth prove, where there is hope, there is a way. So let us press forward together, as e'er we have, and find our way unto victory."},{"name":"YSHTOLA","text":"As Alphinaud says, everyone's resolve is beyond doubt. Yet ere we set forth, there is a thought to which I must give voice."},{"name":"YSHTOLA","text":"While you were in Elpis, I understand that people assumed you were a familiar."},{"name":"YSHTOLA","text":"In contrast, those phantoms we encountered in the recreated Amaurot regarded us as children."},{"name":"YSHTOLA","text":"As people, albeit naive and immature."},{"name":"YSHTOLA","text":"The discrepancy, I posit, is a reflection of their creator's perspective. Having spent eons among sundered men, perhaps he came to acknowledge us, even if only subconsciously."},{"name":"YSHTOLA","text":"With Emet-Selch gone, we may never learn the truth. But I will not suffer this and countless other mysteries to go unsolved. Our journey will not end this day."},{"name":"GRAHATIA","text":"I am returned, thanks to you, but we still have work to do if we are to make our promise a reality."},{"name":"GRAHATIA","text":"Having you show me the sights in Ishgard, then regaling me your greatest adventures, then embarking on a new adventure together... For these things and more, I will fight."},{"name":"GRAHATIA","text":"...What? Could there possibly be an adventure greater than this one?"},{"name":"GRAHATIA","text":"Of course! So long as you desire it and dare to take the first step, there is absolutely no limit!"},{"name":"ESTINIEN","text":"So, the moment of reckoning is finally upon us... I must say, when I pledged myself to your cause, never did I imagine that it would bring me to the very edge of existence."},{"name":"ESTINIEN","text":"Not that I'm complaining, mind you. After casting aside vengeance and shedding title and duty, I found myself wanting for purpose. In journeying with you, there has been nary a dull moment."},{"name":"ESTINIEN","text":"In the course of it all, I feel as though I have found a new place for myself. And a welcome opportunity to see how much the boy has grown."},{"name":"ESTINIEN","text":"I owe you a debt, aye. But as you can guess, I've ever preferred to express my gratitude through action rather than word. My lance is yours."},{"name":"Q3","text":"Proceed to the Final Day?"},{"name":"Q4","text":"Return to Absolute Horizon?"},{"name":"SYSTEM","text":"You must be a Disciple of War or Magic of level 90 or above to proceed."},{"name":"TATARU","text":"Go on, <span class=\"highlight\">Forename</span>! Don't miss this chance to say a word to each of our friends!"},{"name":"TATARU","text":"After all you've been through together, I'm sure they'd appreciate it!"},{"name":"ALPHINAUD","text":"Oh, <span class=\"highlight\">Forename</span>. Pray forgive me for delaying the gathering."},{"name":"ALPHINAUD","text":"I was writing a letter, you see. To my parents."},{"name":"ALPHINAUD","text":"As busy as Father has been, tending the aftermath of the exodus, he has been good enough to show concern for the Scions."},{"name":"ALPHINAUD","text":"And besides...I've made them worry enough for a lifetime. Henceforth, I will endeavor to write as often as I am able."},{"name":"ALPHINAUD","text":"A little effort to set their minds at ease while we continue to be away from Sharlayan."},{"name":"ALPHINAUD","text":"Both Alisaie and I are off to assist with Garlemald's recovery, you see. Though uncertainty remains over what will become of the nation, we cannot well leave the capital in its present state."},{"name":"ALPHINAUD","text":"We will rejoin those members of the Ilsabard contingent still stationed there. Lucia and Maxima helm the relief effort, with support from our allies─the people of Garlemald among them."},{"name":"ALPHINAUD","text":"They will gradually be joined by those who have finished treating the tempered across the lands."},{"name":"ALPHINAUD","text":"Lest you misunderstand, we do not seek redemption for failing Licinia and her sister. That is a burden we must always bear."},{"name":"ALPHINAUD","text":"Nay, we go because of the truth in Lord Quintus's words."},{"name":"ALPHINAUD","text":"The truth that, whatever ideals individuals may espouse, nations are not moved to action unless they stand to benefit..."},{"name":"ALPHINAUD","text":"For the foreseeable future, the fallen Empire will be at the mercy of both internal and external forces."},{"name":"ALPHINAUD","text":"And though I do not doubt the intentions of the contingent, with greater powers involved in the relief effort, our allies may well find themselves drawn into a political agenda."},{"name":"ALPHINAUD","text":"In going, we seek to ensure that the needs of the people come first. To understand their hearts, that we might better help them to begin anew."},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"You'd best write me too."},{"name":"A5","text":"I'll visit when I can."},{"name":"ALPHINAUD","text":"Write you letters? Of course I would be glad to do so..."},{"name":"ALPHINAUD","text":"But I would be gladder still were you to come and visit, and I believe I speak for Alisaie as well."},{"name":"ALPHINAUD","text":"By all means! Full glad would I be for your visit, and I believe I speak for Alisaie as well!"},{"name":"ALPHINAUD","text":"For fairly as long as I've been in Eorzea, you've been at my side. Watching over me, in good times and in bad."},{"name":"ALPHINAUD","text":"How many times have we gathered to share tidings... None could possibly keep count."},{"name":"ALPHINAUD","text":"The world is changing and will continue to do so. Yet no matter what the future brings, I hope that I can ever look to you..."},{"name":"ALPHINAUD","text":"In good times and in bad. As a dependable comrade and dear friend both."},{"name":"ALPHINAUD","text":"Thank you, <span class=\"highlight\">Forename</span>. From the bottom of my heart."},{"name":"ALPHINAUD","text":"I've been keeping Arenvald abreast of the situation in letters, but unfortunately he could not be here today."},{"name":"ALPHINAUD","text":"When it is convenient for both of us, we should pay him a visit."},{"name":"ALISAIE","text":"<span class=\"highlight\">Forename</span>! Seen to your preparations, have you?"},{"name":"ALISAIE","text":"I'm just making another sweep of my belongings. Wouldn't do to find I've forgotten something halfway to my destination..."},{"name":"ALISAIE","text":"Oh, in case you hadn't heard, we've received new reports detailing the devastation caused by the Final Days."},{"name":"ALISAIE","text":"It appears the situation is gravest in the lands surrounding the Bounty, where the sky first began to burn."},{"name":"ALISAIE","text":"After that, the calamity was observed in the far north─in Garlemald and the frozen lands beyond."},{"name":"ALISAIE","text":"We also had reports of the heavens catching fire in isolated locations, one of which was an area in the Northern Empty. Had our quest taken any longer, Sharlayan too may have come under threat."},{"name":"ALISAIE","text":"Thank goodness it's over now."},{"name":"ALISAIE","text":"To be sure, blasphemies and lesser beasts may still be roaming about, but these localized crises should be well within the capacities of each nation to handle on their own. The Scions are no longer needed."},{"name":"ALISAIE","text":"Which isn't to say that we won't help out where we can, of course. As individuals─no more of this order business."},{"name":"ALISAIE","text":"For my part, I'll be heading to Garlemald with Alphinaud. They were among the worst affected, and still need all the help they can get."},{"name":"ALISAIE","text":"It won't be easy..."},{"name":"ALISAIE","text":"An inevitable part of aiding those in need is coming face-to-face with tragedy."},{"name":"ALISAIE","text":"Knowing it doesn't make it any easier, though. That I'll curse my weakness. My inability to fix every problem and save every lost soul."},{"name":"ALISAIE","text":"But no matter how much it hurts, I won't give up."},{"name":"ALISAIE","text":"I'll do what I can for as many people as I can, begrudging no effort."},{"name":"ALISAIE","text":"And should I find myself discouraged, I'll remember you. Think back fondly to one of your many moments of triumph and the accompanying determined expression."},{"name":"ALISAIE","text":"Even those that still annoy me in retrospect, like when you activated the teleporter without warning!"},{"name":"ALISAIE","text":"And should you hear about me, I want you to remember too."},{"name":"ALISAIE","text":"Remember that I'm out there somewhere, trying my very best."},{"name":"Q6","text":"What will you say?"},{"name":"A6","text":"I look forward to hearing all about the legendary Alisaie Leveilleur."},{"name":"A6","text":"Think you can keep up with me?"},{"name":"ALISAIE","text":"N-Not that I'm trying to become famous or anything..."},{"name":"ALISAIE","text":"That being said..."},{"name":"ALISAIE","text":"Heh, you asked for it, so you had better watch out!"},{"name":"ALISAIE","text":"Oh, yes!"},{"name":"ALISAIE","text":"The next time we meet, I'll be vastly improved. So don't be surprised when you find yourself marveling at me!"},{"name":"ALISAIE","text":"Hm, did I forget to mention anything? ...Ah, yes! The Hannish envoy who came to see Estinien also bore a letter from Matsya."},{"name":"ALISAIE","text":"He writes that Mehvan and Qerasaf's little girl is doing well, and he often goes to visit her."},{"name":"ALISAIE","text":"It won't be easy growing up without her parents, but with her fellow villagers watching over her, I dare to hope that she won't want for warmth as she grows up."},{"name":"THANCRED","text":"Ah, our champion and savior. I was beginning to think my chance for an audience would never come!"},{"name":"THANCRED","text":"...Ahem, that sounded more amusing in my head. Speaking of heads, I was worried about yours─and the rest of you, for that matter. On the mend, I trust?"},{"name":"THANCRED","text":"Glad to hear it. You were in a bad way, and healing magicks or no, I'm impressed by how swiftly you've recovered..."},{"name":"THANCRED","text":"Then again, 'tis hardly the first time you've cheated death. Your strength of will has never failed to astonish me."},{"name":"THANCRED","text":"Look at what you've accomplished. Meteion defeated, her song of oblivion cut short. The Source and all her reflections delivered from the Final Days."},{"name":"THANCRED","text":"If you had faltered at the last, then all hope would have been lost. But you held fast."},{"name":"THANCRED","text":"Now Ryne has a tomorrow to look forward to, and I could ask for no greater gift than that."},{"name":"THANCRED","text":"As for a lesser gift, however... The next time you see her, I would appreciate you <span class=\"emphasis\">not</span> describing my travel plans with Urianger as “aimless wandering.”"},{"name":"THANCRED","text":"We've a purpose in our roaming, after all: keeping an eye on things in the absence of the Scions on the world stage."},{"name":"THANCRED","text":"There'll never be an end to the little problems that go untended by nations. We will do our best to help out where and when we can."},{"name":"THANCRED","text":"...Which I suppose is an approach not far removed from “aimless wandering” when you get down to it."},{"name":"THANCRED","text":"Perhaps you could tell her I am faring well, and leave it at that, eh?"},{"name":"THANCRED","text":"No need to mention this feeling of being uprooted..."},{"name":"THANCRED","text":"I've never been one to stand still for long, but when I think of home, 'tis the Rising Stones which comes to mind. How many times have we set out from this base, thence to return when our work was done?"},{"name":"THANCRED","text":"On the day the Scions came together, I only hoped for Minfilia to find a place where she belonged...but never did I expect to find one here for myself."},{"name":"THANCRED","text":"Indulge me, <span class=\"highlight\">Forename</span>. I have a question for you─and imagine Minfilia herself is asking."},{"name":"THANCRED","text":"Are you glad you joined the Scions?"},{"name":"Q7","text":"What will you say?"},{"name":"A7","text":"Best decision I've ever made."},{"name":"A7","text":"There's never been a dull moment, that's for certain."},{"name":"THANCRED","text":"Aye, I can honestly say the same."},{"name":"THANCRED","text":"That's one way of putting it! In many ways, the experience has left us far stronger than when we began."},{"name":"THANCRED","text":"But all good things must come to an end...at least for a time."},{"name":"THANCRED","text":"Should you need a helping hand for infiltration or reconnaissance, you know who to ask. I'll come running, and you'll likely get a certain “funny-talking fortune-teller” into the bargain."},{"name":"THANCRED","text":"In case you've not heard, the Waking Sands will be converted into a warehouse. We'll be keeping the place free of rats and cobwebs, so it can still serve as an outpost should the need arise."},{"name":"THANCRED","text":"Considering Tataru's ambitions, however, I'd not be surprised if she claimed the lot for her budding empire..."},{"name":"URIANGER","text":"<span class=\"highlight\">Forename</span>, thou hast spoken with our comrades?"},{"name":"URIANGER","text":"Though this parting be not forevermore, 'tis nonetheless occasion for sorrow. Akin to a pixie's path, the navigation of such farewells is a perilous endeavor indeed..."},{"name":"URIANGER","text":"For their part, however, the Loporrits embark upon a new beginning."},{"name":"URIANGER","text":"Though bereft of its purpose as a vessel, the moon yet remaineth hospitable for the creatures of Etheirys."},{"name":"URIANGER","text":"Thus do our lunar visitors convene with the Forum, intent upon assigning some new and beneficial role to our solitary satellite."},{"name":"URIANGER","text":"Yet ere that may come to pass, there is much and more each party must learn of the other─a process which doth promise to be eventful indeed."},{"name":"URIANGER","text":"To that end, a cadre of Loporrits hath gleefully dispersed across our lands in the name of mutual understanding."},{"name":"URIANGER","text":"Hydaelyn, 'tis said, did imbue them with Her love for all things born of this star..."},{"name":"URIANGER","text":"...And 'tis Venat's own nature, I believe, which doth manifest in this irrepressible, inexhaustible curiosity of theirs."},{"name":"URIANGER","text":"Having witnessed that which they strove to achieve, I wish most keenly for their long labors to be rewarded─that their abiding affection for man result in a boon for all."},{"name":"URIANGER","text":"Moreover, I hope to continue our acquaintance, and share in such knowledge as they see fit to impart..."},{"name":"Q8","text":"What will you say?"},{"name":"A8","text":"Acquaintance? I'd call it friendship."},{"name":"A8","text":"You are the first to truly understand them."},{"name":"URIANGER","text":"I...did not wish to presume."},{"name":"URIANGER","text":"Aye, I would be honored should they consider me a friend."},{"name":"URIANGER","text":"For 'tis certainly true that I have grown fond of their company."},{"name":"URIANGER","text":"Dost thou think so?"},{"name":"URIANGER","text":"The Loporrits are certainly possessed of a unique outlook, and it hath been my pleasure to act as their facilitator upon this star."},{"name":"URIANGER","text":"Mayhap I might yet serve as a bridge betwixt them and our fellow man...as Moenbryda once did for me."},{"name":"URIANGER","text":"Ah, but I shall digress no further. This day should belong to the Scions of the Seventh Dawn; to mine incomparable companions."},{"name":"URIANGER","text":"Ofttimes hath mine reticence caused thee grief, and mine actions spurred allies to suspect betrayal..."},{"name":"URIANGER","text":"And yet, here amongst you I still stand. No amount of words could express my gratitude for thine acceptance and forgiveness."},{"name":"URIANGER","text":"Thus instead, I do proffer my humble support."},{"name":"URIANGER","text":"Be it unto the deepest abyss or the highest heavens, even if I must needs founder 'cross stormy seas, ever shall I answer thy summons."},{"name":"URIANGER","text":"I understand that, following thy clash with Zenos, the teleportation device thou had discarded fell to thee from on high."},{"name":"URIANGER","text":"To return to thee in such a manner... I did confer with Wilfsunn and Bloewyda, yet they insist the device was possessed of no such capability."},{"name":"URIANGER","text":"'Twas a miracle befitting the nature of that place, where emotion becometh tangible reality. Whence, then, arose this timely wonder? Thine ardent wish...or another's fervent prayer?"},{"name":"YSHTOLA","text":"Oh, are we saying our farewells, too? I hadn't, at present, planned on a journey of any great length..."},{"name":"YSHTOLA","text":"...Not that I am averse to a moment or two of quiet reminiscence."},{"name":"YSHTOLA","text":"In fact, there was something I'd been meaning to ask you─something that has been in my thoughts since the last flames of the Final Days subsided."},{"name":"YSHTOLA","text":"During our travels, we have witnessed more than a lifetime's worth of oddities and spectacles. More than can be easily recalled or remembered..."},{"name":"YSHTOLA","text":"And nestled amongst those memories are certain essential facts─the history of Etheirys and the ancients; glimpses of the Ea─of their culture and philosophy."},{"name":"YSHTOLA","text":"Rather than simply hoard such treasures in my mind, I wonder if I should not be disseminating them in formal records for wider consumption."},{"name":"YSHTOLA","text":"When needed, I have penned reports and prepared briefings... But ever have I balked at the idea of binding the subject of my studies in a book or tablet."},{"name":"YSHTOLA","text":"Truth is given shape in interpretation. When we seek to capture it with our words, it is invariably molded to fit a narrative─no matter how well-intentioned the rendering."},{"name":"YSHTOLA","text":"An event is described as “sad.” A summation which fails to express the emotional complexity. Yet the word on the page is what endures. A pale shadow of reality."},{"name":"YSHTOLA","text":"Throughout history, some have deliberately embellished the truth, but I believe many─if not most─deviations are the result of similar linguistic shortcomings, piling one upon the other, until the end result is unrecognizable from its origin."},{"name":"YSHTOLA","text":"Which is why I fear that writing an account in my own words would be akin to diluting fine wine with water."},{"name":"YSHTOLA","text":"Yet even with the potential for corrupted meaning, I do of course realize the importance of keeping written records. Without them, my search for wisdom would be a painful affair indeed."},{"name":"YSHTOLA","text":"But what say you on this matter? Should I take up the quill? Reflect upon those experiences only we have shared, and seek to preserve them for posterity?"},{"name":"Q9","text":"What will you say?"},{"name":"A9","text":"Aye, let them be read and remembered."},{"name":"A9","text":"Nay, it's enough to hold them in your memories."},{"name":"YSHTOLA","text":"Very well, then. I shall endeavor to pen what I can of the Ea, and the ancients, and of so many other wonders."},{"name":"YSHTOLA","text":"But I am no scribe. It will be less a polished work, and more a reordering of scattered notes..."},{"name":"YSHTOLA","text":"Very well, then. I will refrain from publishing any formal work on the Ea, or the ancients, or on any of the wonders we encountered."},{"name":"YSHTOLA","text":"I will, however, need to keep a few notes for future research. The passage of time can warp the truth just as surely as a poorly chosen word..."},{"name":"YSHTOLA","text":"In any case, I feel much better for having sought your opinion. Left to our own devices, we tend to overthink such things."},{"name":"YSHTOLA","text":"I will otherwise return to following where my curiosity leads. After all, a safe method of travel to the First yet eludes me, and our venture into the great expanse has prompted an entirely new set of questions!"},{"name":"YSHTOLA","text":"Should you stumble into the unknown, or struggle with some impenetrable mystery, know that I am at your beck and call."},{"name":"YSHTOLA","text":"It never hurts to see things from a different perspective, and mine is rather different than most!"},{"name":"YSHTOLA","text":"Lyse came to visit the other day. She peppered me with questions about the lasting repercussions of the Final Days."},{"name":"YSHTOLA","text":"I took the opportunity to explain our plans to “disband,” and she understood our reasoning immediately. Once a Scion, always a Scion, it would seem."},{"name":"YSHTOLA","text":"She was eager to relive old times, and remember old friends... Bittersweet memories, mayhap, but from the look on her face, the joys outweighed the sorrows."},{"name":"GRAHATIA","text":"Oh, <span class=\"highlight\">Forename</span>. Might you have a moment to talk?"},{"name":"GRAHATIA","text":"With the Scions stepping away from the public eye, I've been left to consider what new endeavors I might pursue."},{"name":"GRAHATIA","text":"And after speaking with Krile, I've decided. I will be assisting her in rebuilding the Students of Baldesion."},{"name":"GRAHATIA","text":"Not only am I indebted to Master Galuf for giving me a new home, but had our order never existed, I would have never set foot within the Crystal Tower."},{"name":"GRAHATIA","text":"How different my life might have been..."},{"name":"GRAHATIA","text":"I would have never met you. Never become caretaker of the tower. Never become a Scion."},{"name":"GRAHATIA","text":"You gave me the chance to do so much good, and I hope to continue to do so with the Students."},{"name":"GRAHATIA","text":"For an added benefit, new mysteries often find their way to our doorsteps─mysteries that could prove ideal for fulfilling our promise: to embark on a new adventure together, unlike any we've experienced before!"},{"name":"GRAHATIA","text":"Whenever you have the time and inclination, my friend, I stand ready to accompany you unto the unknown!"},{"name":"GRAHATIA","text":"...Do you recall in the realm of the Omicrons, when I asked if you thought I may someday be mentioned in your epic?"},{"name":"GRAHATIA","text":"While 'tis true that to earn a place at your side would be the stuff of dreams..."},{"name":"GRAHATIA","text":"In the end, nothing would give me greater joy than to stand with you in the here and now!"},{"name":"GRAHATIA","text":"It needn't be some grand endeavor. There needn't be a promise. Whenever adventure calls, I won't hesitate to invite you...and I hope that you will do the same for me."},{"name":"Q10","text":"What will you say?"},{"name":"A10","text":"Without a second thought."},{"name":"A10","text":"As long as you don't overexert yourself."},{"name":"GRAHATIA","text":"Hah, I'll hold you to that!"},{"name":"GRAHATIA","text":"I know, I know. I can all but hear Lyna and Beq Lugg's voices each time you remind me."},{"name":"GRAHATIA","text":"...As much as we have already seen, there's still so much we haven't. Who knows─perhaps we will even encounter survivors of the Omicrons somewhere out there."},{"name":"GRAHATIA","text":"After all, given how they took to the stars, it isn't implausible that some found themselves far from home."},{"name":"GRAHATIA","text":"And should we encounter a wayward traveler awaiting commands that will never come..."},{"name":"GRAHATIA","text":"I would bid them seek adventure with someone, and with that partner find new purpose. A new dream."},{"name":"GRAHATIA","text":"For if crystals can hold fast to dreams, why not Omicrons?"},{"name":"GRAHATIA","text":"Wherever your plans may lead, do not hesitate to send word. And should a commission of interest come my way, you will be the first to know!"},{"name":"GRAHATIA","text":"By the way, have you spoken with Feo Ul of late? Some days ago, they appeared to me in a dream─of the sleeping persuasion, that is."},{"name":"GRAHATIA","text":"All is well in the First, they bade me tell you."},{"name":"GRAHATIA","text":"When I asked why not tell you themself, they unleashed giant, ravenous beavers upon me... Have you perchance done something to incur their ire?"},{"name":"ESTINIEN","text":"...If you have something to say, then out with it."},{"name":"Q11","text":"What will you say?"},{"name":"A11","text":"Just worried how you'll earn your keep now."},{"name":"A11","text":"Just wondering how I'll earn my keep now."},{"name":"ESTINIEN","text":"You talk as if the Scions' dissolution was more than mere pretense. There may be fewer calls to action, but we should be compensated as before."},{"name":"ESTINIEN","text":"...Why are you so concerned for me, anyway?"},{"name":"ESTINIEN","text":"What, I thought you adventurers had any number of ways to earn coin. And though the Scions' mode of operation has changed, we should be compensated as before."},{"name":"ESTINIEN","text":"In any case, I do not want for options. Even if some are worse than others..."},{"name":"ESTINIEN","text":"No sooner did Aymeric hear about our disbandment than he offered me a position as a guardsman in the Empyreum district. As a former Azure Dragoon, I'm guaranteed to be popular, he said."},{"name":"ESTINIEN","text":"Who does he take me for!? Even without his meddling, I'm perfectly capable of finding employment─and have!"},{"name":"ESTINIEN","text":"Some days ago, a Hannish envoy arrived with word from Vrtra. The wyrm requests my presence as soon as things have settled here."},{"name":"ESTINIEN","text":"He didn't deign to mention why I'm needed, but it pertains to dragons, like as not."},{"name":"ESTINIEN","text":"In Thavnair, like elsewhere, the phenomena caused by the Final Days abated when you defeated Meteion."},{"name":"ESTINIEN","text":"Though it was too late for those who had already transformed, life is beginning to return to normal for the survivors."},{"name":"ESTINIEN","text":"Of those who sought refuge in Sharlayan, most have already returned home."},{"name":"ESTINIEN","text":"But many do not have a home to return to, nor loved ones. By an arrangement between Vrtra and the Forum, such souls may remain in Sharlayan if they wish, to work and study."},{"name":"ESTINIEN","text":"Vrtra was always the satrap in truth. It's gratifying to see him become one in name as well─one who has the complete confidence of his people, if the envoy's tone was any indication."},{"name":"ESTINIEN","text":"Hmph, I often find myself speaking favorably of dragons of late..."},{"name":"ESTINIEN","text":"Not so long ago, I would have assumed his benevolence hid ulterior motives. But 'tis clear he cares for his people, and they in turn revere him."},{"name":"ESTINIEN","text":"To know such a nation may flourish is...comforting."},{"name":"ESTINIEN","text":"Vrtra's kin sought release from conflict. So weary were they of the suffering it wrought, they surrendered to oblivion."},{"name":"ESTINIEN","text":"But Midgardsormr didn't give up. In hope he made the journey to distant Etheirys with his clutch of eggs."},{"name":"ESTINIEN","text":"And though his progeny went on to be embroiled in conflict with men, there were times when they transcended hatred to abide in harmony."},{"name":"ESTINIEN","text":"That is their legacy and their triumph."},{"name":"ESTINIEN","text":"In my lance, I feel the weight of their struggle and the strength of their resolve. And it lends me strength."},{"name":"ESTINIEN","text":"These things, I might never have learned had I not joined you."},{"name":"ESTINIEN","text":"Should you ever have need of me, I will come. At the very least, it might be an opportunity to earn coin."},{"name":"ESTINIEN","text":"Word has it a false deity born in the Tower of Zot has survived, and occasionally appears to terrorize the locals."},{"name":"ESTINIEN","text":"Those who vanquish the being and present proof in Radz-at-Han will receive a handsome reward. Though “handsome” isn't the word I would use to describe such outlandish garb..."},{"name":"ESTINIEN","text":"But while I'm in Thavnair, perhaps I will acquire a set to send to Aymeric in lieu of an answer to his job offer. Let him stand guard thus attired and be the talk of Empyreum, if not all Coerthas."},{"name":"KRILE","text":"Oh, <span class=\"highlight\">Forename</span>. How are you feeling? Any lingering aches or pains?"},{"name":"KRILE","text":"I can't apologize enough for sending Zenos to find you in Ultima Thule..."},{"name":"KRILE","text":"When he came to me in Sharlayan, I was truly torn. As ever, there was only one thing on his mind."},{"name":"KRILE","text":"Forced to make a decision, I reasoned that, if he would not be deterred from seeking you out, he might at least aid us in our cause. And so I struck a bargain..."},{"name":"KRILE","text":"In the end, he was true to his word, and you defeated him despite your earlier exertions. But knowing the state you were found in, it could have ended very differently."},{"name":"KRILE","text":"My decision almost cost you your life, and no words could express the remorse I feel..."},{"name":"Q12","text":"What will you say?"},{"name":"A12","text":"It worked out. You did the right thing."},{"name":"A12","text":"I won't lie─I thought that was it for me."},{"name":"KRILE","text":"It is a relief to hear you say that. Thank you."},{"name":"KRILE","text":"So did everyone... I'm so sorry, <span class=\"highlight\">Forename</span>..."},{"name":"KRILE","text":"Time and time again, I've been made to feel woefully inadequate."},{"name":"KRILE","text":"I wasn't much use in battle, nor could I face the Forum without my nerves getting the better of me. It always fell to you and the others."},{"name":"KRILE","text":"I must─and will─do better."},{"name":"KRILE","text":"And I shall begin with the restoration of the Students of Baldesion. Through our work, Sharlayan will strengthen its ties with other nations, that we may be better prepared to face whatever threats arise in future."},{"name":"KRILE","text":"Of course, this isn't something I can accomplish alone. But thankfully, I have the staunchest of help in Raha and Ojika and our other remaining members. Together, we'll continue Grandfather's work."},{"name":"KRILE","text":"As before, certain commissions will take us to dangerous locales, and we may need to call upon seasoned adventurers."},{"name":"KRILE","text":"In such times, might you be willing to assist us? Not because you feel obliged, mind you, but because you feel allure for the task itself."},{"name":"KRILE","text":"Marvelous. Should something of interest arise, I shan't hesitate to reach out to you."},{"name":"KRILE","text":"Until that day, I shall endeavor to become a more dependable comrade."},{"name":"KRILE","text":"Oh, I should mention that Erenville has kindly agreed to share aught of potential interest he hears from his fellow gleaners."},{"name":"KRILE","text":"In exchange, we will help them to restore the archives to their proper order. With the exodus abandoned, all items must be returned whence they came─a task no less grueling than their removal."},{"name":"KRILE","text":"Even now, Ojika assists in the sorting of arcane artifacts. Oh yes, not only is he a skilled administrator─he's also a certified appraiser specializing in relics from the Fifth Astral Era!"},{"name":"KRILE","text":"Despite his qualifications, though, he seems none too keen on the work. I shall have to go and relieve him as soon as I can..."},{"name":"TATARU","text":"Spoken your fill, have you? If so, I'm thinking to send everyone off."},{"name":"Q13","text":"Leave the Rising Stones?"},{"name":"TATARU","text":"With your permission, then!"},{"name":"TATARU","text":"Your attention please! At risk of spoiling the mood, the time of departure is upon us."},{"name":"TATARU","text":"In my capacity as your receptionist, I bid you all safe journeys. Till next we meet...be well!"},{"name":"SYSTEM","text":"You have completed the main scenario quest “Endwalker”! Quests to unlock new content have now become available in Old Sharlayan."},{"name":"SYSTEM","text":"Additionally, you may now enter the Dead Ends with a party of NPC avatars. To make use of this feature, open the <span class=\"highlight\">Trust</span> interface located under <span class=\"highlight\">Duty</span> in the main menu."},{"name":"SYSTEM","text":"Rest well, champion of Etheirys, for many and more adventures await you!"}],"reward":{"gil":5000,"items":[{"id":36002},{"id":35989},{"id":36370},{"id":36371}],"instance":20079},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[69999]},"next":[69703,69704,69707,69709,69873,69874,69876,69880,69881,69883,69884,69885,69886,69887,69888,69889,69892,70011,70059,70062,70078,70081,70122,70179,70187,70199,70217,70251,70266]},"partials":[{"type":"npc","id":"1042216","obj":{"i":1042216,"n":"Alphinaud","l":3712,"q":1}},{"type":"npc","id":"1041189","obj":{"i":1041189,"n":"Tataru","l":481,"q":1}},{"type":"item","id":"36002","obj":{"i":36002,"n":"Argos Horn","l":1,"c":26038,"t":63}},{"type":"item","id":"35989","obj":{"i":35989,"n":"Wind-up Herois","l":1,"c":59841,"t":81}},{"type":"item","id":"36370","obj":{"i":36370,"n":"Endwalker – Footfalls Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"item","id":"36371","obj":{"i":36371,"n":"Flow Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"instance","id":"84","obj":{"i":84,"n":"The Dead Ends","c":61801,"t":"Dungeons","min_lvl":90,"max_lvl":90,"min_ilvl":540,"max_ilvl":570}},{"type":"instance","id":"20079","obj":{"i":20079,"n":"The Final Day","c":61804,"t":"Trials","min_lvl":90,"max_lvl":90,"min_ilvl":540}},{"type":"quest","id":"69999","obj":{"i":69999,"n":"You're Not Alone","g":11,"l":"Ultima Thule","s":617}},{"type":"quest","id":"69703","obj":{"i":69703,"n":"Cutting the Cheese","g":119,"l":"Old Sharlayan","s":8110,"f":1}},{"type":"quest","id":"69704","obj":{"i":69704,"n":"Where No Loporrit Has Gone Before","g":119,"l":"Old Sharlayan","s":8120,"f":1}},{"type":"quest","id":"69707","obj":{"i":69707,"n":"I Wandered Sharlayan as a Minstrel","g":0,"l":"Old Sharlayan","s":0,"f":1}},{"type":"quest","id":"69709","obj":{"i":69709,"n":"A Place to Train","g":122,"l":"Radz-at-Han","s":2201,"f":1}},{"type":"quest","id":"69873","obj":{"i":69873,"n":"Futures Lost","g":126,"l":"Ultima Thule","s":9120}},{"type":"quest","id":"69874","obj":{"i":69874,"n":"That Once Rang Clear","g":126,"l":"Ultima Thule","s":9130}},{"type":"quest","id":"69876","obj":{"i":69876,"n":"Stars Like Gems","g":126,"l":"Ultima Thule","s":9140}},{"type":"quest","id":"69880","obj":{"i":69880,"n":"Come Back to Us","g":126,"l":"Ultima Thule","s":9230}},{"type":"quest","id":"69881","obj":{"i":69881,"n":"Eat Like an Ea","g":126,"l":"Ultima Thule","s":9240}},{"type":"quest","id":"69883","obj":{"i":69883,"n":"The Body Beautiful","g":126,"l":"Ultima Thule","s":10010}},{"type":"quest","id":"69884","obj":{"i":69884,"n":"Left Alive","g":126,"l":"Ultima Thule","s":9160}},{"type":"quest","id":"69885","obj":{"i":69885,"n":"Loud and Proud","g":126,"l":"Ultima Thule","s":9170}},{"type":"quest","id":"69886","obj":{"i":69886,"n":"A Parent's Love","g":126,"l":"Ultima Thule","s":9180}},{"type":"quest","id":"69887","obj":{"i":69887,"n":"Remember Me","g":126,"l":"Ultima Thule","s":10050}},{"type":"quest","id":"69888","obj":{"i":69888,"n":"Bodily Curiosity","g":126,"l":"Ultima Thule","s":10060}},{"type":"quest","id":"69889","obj":{"i":69889,"n":"A Life of Regret","g":126,"l":"Ultima Thule","s":10070}},{"type":"quest","id":"69892","obj":{"i":69892,"n":"Work Woes","g":126,"l":"Ultima Thule","s":10120}},{"type":"quest","id":"70011","obj":{"i":70011,"n":"The Crystal from Beyond","g":26,"l":"Old Sharlayan","s":19,"f":1}},{"type":"quest","id":"70059","obj":{"i":70059,"n":"Of Mothers and Merchants","g":119,"l":"Old Sharlayan","s":9101,"f":1}},{"type":"quest","id":"70062","obj":{"i":70062,"n":"Newfound Adventure","g":12,"l":"The Rising Stones","s":619}},{"type":"quest","id":"70078","obj":{"i":70078,"n":"The Sleeping Gentleman","g":71,"l":"Radz-at-Han","s":100,"f":1}},{"type":"quest","id":"70081","obj":{"i":70081,"n":"Hippos Born to Run","g":32,"l":"Thavnair","s":1,"f":1}},{"type":"quest","id":"70122","obj":{"i":70122,"n":"A Heartless Hypothesis","g":20,"l":"Old Sharlayan","s":30}},{"type":"quest","id":"70179","obj":{"i":70179,"n":"Seeking Sanctuary","g":89,"l":"Old Sharlayan","s":20,"f":1}},{"type":"quest","id":"70187","obj":{"i":70187,"n":"An Odd Job","g":0,"l":"Old Sharlayan","s":1,"f":1}},{"type":"quest","id":"70199","obj":{"i":70199,"n":"Delve into Myth","g":88,"l":"Mor Dhona","s":301,"f":1}},{"type":"quest","id":"70217","obj":{"i":70217,"n":"Must Be Dreaming(way)","g":28,"l":"Old Sharlayan","s":1,"f":1}},{"type":"quest","id":"70251","obj":{"i":70251,"n":"That's So Anden","g":111,"l":"The Crystarium","s":4001,"f":1}},{"type":"quest","id":"70266","obj":{"i":70266,"n":"An Original Improvement","g":85,"l":"The Crystarium","s":10,"f":1}}]}