{"quest":{"name":"Fashion Face-off","location":"Ul'dah","id":70007,"patch":6.0,"sort":213,"icon":101154,"eventIcon":71221,"issuer":1041574,"target":1041580,"genre":198,"journal":["Marabel looks you up and down, a glint in her eye.<br>※This quest is available for a limited time only.","Marabel is seeking an experienced adventurer to aid her entry for this year's Little Ladies' Day walk-off. You agree to help by surveying the Ul'dahn citizens about their impressions of this holiday.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Having successfully surveyed the citizens, you head toward Eshtaime's Aesthetics to report your findings to Marabel.","Inspired by the citizens' responses, Marabel quickly sets to work on assembling your costume. You decide to wait for her at the designated location per her instructions.","As the fates would have it, you will be strutting atop the stage in this year's Little Ladies' Day walk-off. You make your preparations ere approaching Marabel, who awaits on Emerald Avenue, once more.","You and Marabel manage to take first place in the Little Ladies' Day walk-off and add your names to the annals of fashion fame. She is overjoyed, and you head back to offer her a word of congratulations.","Galvanized by her first fashion victory, Marabel sets forth in pursuit of her next goal: launching a brand of her own. As thanks for lending your support, she offers to help you select an outfit should you wish to participate in Masked Rose's Fashion Check."],"objectives":["Survey the citizens at the Steps of Nald.","Survey the citizens at the Steps of Thal.","Speak with Marabel.","Wait at the designated location.","Speak with Marabel on Emerald Avenue.","Speak with Marabel again."],"dialogue":[{"name":"MARABEL","text":"Yes, you'll do just splendidly... You there! Yes─you, dahling. What say you to becoming a first-place fashion icon?"},{"name":"MARABEL","text":"Ah, forgive me. Where <span class=\"emphasis\">are</span> my manners? The name is Marabel, dahling, and I am one of Eshtaime's Aesthetics' finest accessory artisans...which is how I plan to introduce myself once I complete my apprenticeship."},{"name":"MARABEL","text":"Now, the crown jewel of this year's Little Ladies' Day festivities is a walk-off: an event in which the visually savvy strut the stage and vie for style supremacy."},{"name":"MARABEL","text":"And while I'm no novice when it comes to competitions of this sort, I'm also not much of a winner, dahling. To be perfectly honest, I've never once managed to come out on top─but now that you're here, I'm certain my fortunes are about to change!"},{"name":"MARABEL","text":"After all, an adventurer such as yourself possesses so much of what I lack: knowledge, daring, and not least of all experience! So, what say you? Care to help this diamond in the rough earn her maiden victory?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Sounds like fun!"},{"name":"A1","text":"For the right price..."},{"name":"MARABEL","text":"Splendid, dahling! Oh, you won't regret this in the least."},{"name":"MARABEL","text":"Pah! To think that I would enlist your aid without recompense. You and I will split our winnings right down the middle, dahling!"},{"name":"MARABEL","text":"Now then, let's get down to brass tacks, shall we? "},{"name":"MARABEL","text":"Participants compete in pairs of two: one designer and one model. There are no restrictions on who can join─style icons of all shapes and sizes may enter. The only condition is that those who walk the stage don an ensemble inspired by the holiday."},{"name":"MARABEL","text":"But as far as themes go, it's a touch broad. Makes it rather difficult to decide on a direction for the costume... Perhaps you can offer some inspiration, though! Tell me, dahling: what's one word that comes to mind when you think of Little Ladies' Day?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"“Gorgeous”!"},{"name":"A2","text":"“Princess”!"},{"name":"MARABEL","text":"Interesting... I suppose that should come as no surprise, given that the origins of this holiday lie in the tale of gorgeous Princess Edvya's disappearance from the palace."},{"name":"MARABEL","text":"And while I appreciate your input, dahling, I'm afraid that's a bit too on the nose. If I am to create a truly prize-worthy ensemble, I'll require more inspiration... Wait─we could survey the citizens!"},{"name":"MARABEL","text":"Yes, yes, that's a fabulous idea, if I do say so myself.<br>Listen, dahling: you and I will ask around for people's impressions of Little Ladies' Day and then rendezvous at Eshtaime's. Savvy? Ta-ta for now!"},{"name":"CITIZENA04471","text":"What comes to mind when I think of Little Ladies' Day? Hm... I suppose this isn't exactly about the day itself, but it makes me think of the peach blossoms that always bloom this time of year."},{"name":"CITIZENA04471","text":"Whenever I see those flowers, I know this season's come around once more. And there's something so soothing about their coloration. I can't help but smile when I lay my eyes on those pretty pink petals!"},{"name":"CITIZENB04471","text":"Ul'dah really comes alive this time of year. Why, just look at all the decorations strung up around town! And no one would dare miss the Songbirds' annual show. The entire city turns out to hear them sing!"},{"name":"CITIZENB04471","text":"No other festival compares to the Little Ladies' Day celebration─not for me, at least. I don't know if that answers your question, but I hope it helps!"},{"name":"CITIZENC04471","text":"I've always dreamt of strolling through the streets on Little Ladies' Day wearing the most gorgeous gown I can find─like a proper princess, you know?"},{"name":"CITIZENC04471","text":"Unfortunately, I don't have proper princess money, and that sort of dress usually costs a small fortune. No choice but to keep dreaming, I suppose..."},{"name":"CITIZEND04471","text":"My memories of Little Ladies' Day are somewhat bittersweet. You see, there was a lass I once fancied. All I wanted was to dote upon her like the royal seneschal would. I would've done anything to catch her eye..."},{"name":"CITIZEND04471","text":"And while I <span class=\"emphasis\">did</span> catch her eye, she didn't exactly like what she saw: “No seneschal would be caught dead wearing that revealing subligar!” I guess acting like a royal seneschal isn't good enough unless you look like one, too..."},{"name":"CITIZENA04471","text":"Whenever I see those flowers, I know this season's come around once more. And there's something so soothing about their coloration. I can't help but smile when I lay my eyes on those pretty pink petals!"},{"name":"CITIZENB04471","text":"Ul'dah really comes alive this time of year. Why, just look at all the decorations strung up around town! And no one would dare miss the Songbirds' annual show. The entire city turns out to hear them sing!"},{"name":"CITIZENC04471","text":"Unfortunately, a proper princess dress usually costs a small fortune, and I don't have real princess money. No choice but to keep dreaming, I suppose..."},{"name":"CITIZEND04471","text":"I admit my outfit was a bit revealing, but I didn't realize that was such a bad thing... I guess acting like a royal seneschal doesn't mean much unless you look like one, too."},{"name":"MARABEL","text":"Well, how did you fare, dahling? Glean anything insightful?"},{"name":"MARABEL","text":"...I see. That more or less aligns with what I heard as well."},{"name":"MARABEL","text":"So many folks had their dreams of fashion grandeur dashed by oppressively expensive pricing. Not a new tale by any stretch, but a troubling one nonetheless."},{"name":"MARABEL","text":"In that case, what if we were to put together an ensemble that's as alluring as it is affordable? Surely that would resonate with the audience... Yes, I do believe this will work, dahling!"},{"name":"MARABEL","text":"Just allow me to take some visual measurements first... I'll need a few yards of this, a spool of that..."},{"name":"MARABEL","text":"All right─I'm ready to set to work! You just sit tight while I go assemble the ensemble. Ta-ta for now, dahling!"},{"name":"MARABEL","text":"I'm back, dahling! At last, our costume is complete─not a single stitch out of place."},{"name":"MARABEL","text":"Now all that's left is to win that walk-off. How are you feeling? Surely an experienced adventurer of your caliber doesn't get nervous in situations such as these."},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"Should I be nervous?"},{"name":"A4","text":"Wait─who's going to walk?"},{"name":"MARABEL","text":"Pah! Of course not, dahling. Why, you've doubtless traversed the whole realm. This little stage should be child's play for you, no?"},{"name":"MARABEL","text":"...Hm? Don't be daft, dahling. <span class=\"emphasis\">You'll</span> be walking."},{"name":"MARABEL","text":"...Oh, gods!"},{"name":"MARABEL","text":"This whole time I thought we had a mutual understanding that you would be my muse, but that look on your face tells me you hadn't the slightest idea. It seems my excitement got the better of me once again..."},{"name":"MARABEL","text":"The trouble is, this costume is couture, dahling─tailor-made for your beautiful body. I hate to ask this of you at the last minute, but would you mind modeling my work in the walk-off!?"},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"I would be honored!"},{"name":"A5","text":"If it won't fit anyone else..."},{"name":"MARABEL","text":"Oh, bless you, dahling!"},{"name":"MARABEL","text":"I simply can't thank you enough─primarily because there's no time. I'll help you slip into your costume backstage, so just meet me at the venue and we'll go from there. Savvy? "},{"name":"MARABEL","text":"See you at the Steps of Nald─and don't dally! Ta-ta for now, dahling!"},{"name":"MARABEL","text":"There you are, dahling! Your time to shine is finally here. Are you ready to strut your stuff?"},{"name":"MARABEL","text":"Oh! By the way, I prepared two ensembles for you: one inspired by the seneschal, and another inspired by the princess. Either should fit you just fine, but do you have a preference?"},{"name":"Q6","text":"What will you say?"},{"name":"A6","text":"The seneschal costume."},{"name":"A6","text":"The princess costume."},{"name":"MARABEL","text":"Fabulous! I'll apply a few finishing touches, then. You just get ready to command the stage, dahling!"},{"name":"BUTLER","text":"I bid you welcome, and thank you all for attending our Little Ladies' Day celebration."},{"name":"BUTLER","text":"Before we commence with today's walk-off, pray permit me to introduce the members of our esteemed judging panel."},{"name":"BUTLER","text":"First, we have the host of the Gold Saucer's Fashion Report, the style-savvy superstar with a discerning eye and a thorny tongue: Masked Rose!"},{"name":"BUTLER","text":"Next, we have the headmistress of the Goldsmiths' Guild, the unrivaled artisan of exceptional accessories: Serendipity!"},{"name":"BUTLER","text":"And lastly, as the resident master of ceremonies, yours truly shall round out the panel."},{"name":"BUTLER","text":"The winners of today's walk-off shall be awarded this resplendent crown. Enticing, no?"},{"name":"BUTLER","text":"Now, then! Without further ado, let us welcome our first pair of contestants..."},{"name":"MARABEL","text":"You look positively fabulous, dahling! Oh, Marabel, you've done it again."},{"name":"MARABEL","text":"It sounds like we're up next... This is it!"},{"name":"BUTLER","text":"...Next, we have our eighth pair of contestants: <span class=\"highlight\">Forename</span>, modeling an ensemble designed by Marabel. "},{"name":"BUTLER","text":"Are you ready, <span class=\"highlight\">Forename</span>? If so, then step forth onto the stage!"},{"name":"MASKEDROSE","text":"Oho... That's quite the unconventional combination. Color me impressed!"},{"name":"SERENDIPITY","text":"Me, too! It's such an inspired take on the theme."},{"name":"BUTLER","text":"I would like to thank you all for participating in today's walk-off. Each ensemble was a visual delight, which made this competition a joy to behold but a challenge to score─a fine problem to have, I should say."},{"name":"BUTLER","text":"Yet after much deliberation, we have settled on our winning pair."},{"name":"BUTLER","text":"First prize in this year's Little Ladies' Day walk-off goes to..."},{"name":"BUTLER","text":"Entry number eight: Marabel and <span class=\"highlight\">Forename</span>!"},{"name":"BUTLER","text":"Congratulations to you both! Please, step right this way."},{"name":"BUTLER","text":"We've witnessed many elegant ensembles today, but Marabel's was not lost among them. The panel was particularly impressed with the materials used: appropriately gorgeous yet surprisingly affordable!"},{"name":"BUTLER","text":"If you don't mind, Marabel, pray permit me to ask how it feels to emerge victorious today!"},{"name":"MARABEL","text":"Oh, it feels...unreal... I can &lt;sniff&gt; barely believe it!"},{"name":"BUTLER","text":"Look at that: the poor girl is completely overcome with joy! And what about you, <span class=\"highlight\">Forename</span>? How do you feel?"},{"name":"Q7","text":"What will you say?"},{"name":"A7","text":"I had a feeling we would win."},{"name":"A7","text":"Marabel's hard work paid off."},{"name":"BUTLER","text":"Indeed! Your ensemble was worthy of not only approbation, but the grand prize as well! My sincerest congratulations to you both."},{"name":"BUTLER","text":"Now, before we bring the contest to a close, I have one more announcement."},{"name":"BUTLER","text":"This stage will remain in place for the duration of the Little Ladies' Day celebration."},{"name":"BUTLER","text":"Those who were unable to participate in today's competition are free to ascend the stage at their leisure and walk to their hearts' content!"},{"name":"BUTLER","text":"Now then, let us conclude by giving one more round of applause to our first-place fashionistas: Marabel and <span class=\"highlight\">Forename</span>!"},{"name":"MARABEL","text":"We did it, dahling! We really did it!"},{"name":"MARABEL","text":"Part of me honestly believed my losing streak would never end, but you helped me prove myself wrong... "},{"name":"MARABEL","text":"I couldn't have done it without you as my muse. I simply can't thank you enough, dahling!"},{"name":"BUTLER","text":"And I must thank <span class=\"emphasis\">you</span> for the splendid showing!"},{"name":"BUTLER","text":"Congratulations once again, you two. As promised, I now present you with your prize."},{"name":"BUTLER","text":"And with that, I shall take my leave."},{"name":"MARABEL","text":"Here I still thought I might be dreaming...but now that I look upon this crown before me, the reality of our victory is finally settling in!"},{"name":"MARABEL","text":"And while I may still be but an artisan's apprentice, today's success has rekindled my burning desire to someday launch a brand of my own─so remember my name, dahling!"},{"name":"MARABEL","text":"Oh! And speaking of style, you heard the royal seneschal say that the stage would remain open for the duration of the festival, yes?"},{"name":"MARABEL","text":"Well, it sounds as though Masked Rose will be holding a special Fashion Check for all those interested. You've already proven yourself a more-than-capable model, so why not try envisioning an ensemble for someone else this time?"},{"name":"MARABEL","text":"And don't worry: I'd be more than happy to lend you my expertise should you require any styling assistance!"}],"reward":{"items":[{"id":35857}]},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[70008]},"partials":[{"type":"npc","id":"1041574","obj":{"i":1041574,"n":"Marabel","l":40,"q":1}},{"type":"npc","id":"1041580","obj":{"i":1041580,"n":"Marabel","l":40,"q":2}},{"type":"item","id":"35857","obj":{"i":35857,"n":"Little Lady's Crown","l":1,"c":40873,"t":34,"p":1000}},{"type":"quest","id":"70008","obj":{"i":70008,"n":"A Stylish Transformation","g":198,"l":"Ul'dah","s":214,"r":1}}]}