{"quest":{"name":"Saintly Inspiration","location":"Gridania","id":70006,"patch":6.0,"sort":217,"repeatable":1,"icon":101145,"eventIcon":71222,"issuer":1040593,"target":1040593,"genre":204,"journal":["A certain esteemed personage would speak to you immediately, and Amh Garanjy is ready to introduce you.<br><br>※This quest is available for a limited time only.","Amh Garanjy informs you that none other than the Saint of Nymeia is asking after you. Though neither of you are sure why, it would appear he has specifically requested your presence in person. Seek him out and see what he would ask of you.","The Saint of Nymeia wishes you a merry Starlight, and proceeds to explain his plight. It would seem he finds himself at a loss regarding what sort of new gifts he should fashion for the children this year, and would have you join him on a stroll through the town in hopes the sights might inspire him. You resolve to accompany him to one or more scenic locations─chosen from among Apkallu Falls, the Lancers' Guild, the Leatherworkers' Guild, the marketplace, the watermill, and the Greatloam Growery─before making your way to Nophica's Altar.<br><br>※You must be accompanied by the Saint of Nymeia to complete this task. Speak with him again should you become separated.","The saint appears satisfied with the inspiration your stroll together has provided him, though he doubtless would appreciate it even more if you were to accompany him to another location or two.","The sight of the scenic Gridanian streetscapes veiled in snow, and the vigor and vitality of its people have filled the Saint of Nymeia with renewed energy, enthusiasm, and a healthy dose of Starlight spirit. Declaring his intention to craft little snow globes for the children depicting the picturesque scenes that inspired him so, he returns to his workshop, leaving you to report back to Amh Garanjy at the amphitheatre.","Amh Garanjy welcomes you back from your excursion, and provides you with a gift left especially for you by the saint himself in appreciation for your efforts. Your task complete, you are free to enjoy the Starlight Celebration as you like for as long as the festivities continue. Should you wish to pay the saint a visit once more before season's end, he would certainly welcome your company."],"objectives":["Speak with the Saint of Nymeia and have him accompany you.","Accompany the Saint of Nymeia to the designated locations and then speak with him.","Accompany the Saint of Nymeia at Nophica's Altar and then speak with him.","Speak with Amh Garanjy."],"dialogue":[{"name":"GODBERT","text":"Hmmmmmm! I am in need of inspiration, but wherever to find it...?"},{"name":"GODBERT","text":"Happy Starlight, my friend! I hope that you can join me for another inspiring journey! Ho ho ho!"},{"name":"AMHGARANJY","text":"Is it strange that I got so attached to Rudy in such a short time? Either way, I only hope we can meet him again someday!"},{"name":"AMHGARANJY","text":"Ah, but this is no time to get all sentimental! I have work to do. And remember, the Saint of Nymeia wishes to have a word with you, if you've the time to spare."},{"name":"AMHGARANJY","text":"He didn't mention exactly what he wants, but he was most insistent that you come alone. Whatever do you think it could be?"},{"name":"AMHGARANJY","text":"The saint wishes to speak with you again. You will humor him, won't you?"},{"name":"AMHGARANJY","text":"I know not what it is, but the saint has something he would discuss with you. If you're not otherwise occupied, pray pay him a visit."},{"name":"GODBERT","text":"Ho ho ho! Thank you for joining me, my adventuring friend! As no doubt you know, I am the Saint of Nymeia, bringer of gifts and joy to children all across the realm! Amh Garanjy has told me all about your exploits this Starlight season, and I simply had to express my gratitude in person."},{"name":"GODBERT","text":"Truth be told, I was observing you the whole time from a distance. Why, I almost wish that I could have joined you myself, but it is my policy to stay out of the spotlight─or the starlight, as it were."},{"name":"GODBERT","text":"Besides, you and your furry friends were having such a jolly time that I couldn't bring myself to intrude. Watching Rudy help make those delightful snowball treats and grow into a confident little helper was a wonder to behold. A true Starlight miracle!"},{"name":"GODBERT","text":"Which brings me to my request. I was hoping you might inspire me the same way you did young Rudy. For you see─as much as it pains me to admit this─I find myself at a loss for new gift ideas this year."},{"name":"GODBERT","text":"If you don't mind, I was hoping we might spend a little time together─just the two of us. What say you, friend?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"What are you getting at?"},{"name":"A1","text":"And what would we do?"},{"name":"GODBERT","text":"I just want a taste of that inspiration of yours! Yes, I'm sure some quality time with you is precisely what I need to rekindle my creative spirit."},{"name":"GODBERT","text":"Ho ho ho! No need to look so alarmed! I won't ask much of you. I would simply have you accompany me on a little stroll."},{"name":"GODBERT","text":"The decorations are most lovely, after all—why not take in the festive atmosphere together? We can amble about Old Gridania and make our way to Nophica's Altar."},{"name":"GODBERT","text":"There are a few spots in particular I'd like to take in with you along the way. Just one would be plenty if you've other places to be, though if you can spare the time, I would love to see three! And with that, let us be off. Ho ho ho!"},{"name":"GODBERT","text":"Back so soon? I had a feeling you couldn't bear to be away from the jolly old Saint of Nymeia for too long. Ho ho ho!"},{"name":"GODBERT","text":"Ready? Then let us enjoy ourselves a most inspiring stroll!"},{"name":"SYSTEM","text":"The Saint of Nymeia is now accompanying you. Lead him to the designated locations and speak with him there."},{"name":"SYSTEM","text":"You may choose from among six of the saint's desired destinations: Apkallu Falls, the Lancers' Guild, the Leatherworkers' Guild, the marketplace, the watermill, and the Greatloam Growery."},{"name":"SYSTEM","text":"Furthermore, you must stay close to your companion in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave the saint behind by entering a different area, or by speaking with him and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have the saint join you again, return and speak with him at the original location."},{"name":"Q2","text":"What will you do?"},{"name":"A2","text":"Speak with the saint."},{"name":"A2","text":"<span class=\"highlight\">Speak about Apkallu Falls.</span>"},{"name":"A2","text":"<span class=\"highlight\">Speak about the Lancers' Guild.</span>"},{"name":"A2","text":"<span class=\"highlight\">Speak about the Leatherworkers' Guild.</span>"},{"name":"A2","text":"<span class=\"highlight\">Speak about the marketplace.</span>"},{"name":"A2","text":"<span class=\"highlight\">Speak about the watermill.</span>"},{"name":"A2","text":"<span class=\"highlight\">Speak about the Greatloam Growery.</span>"},{"name":"A2","text":"Part ways with the saint."},{"name":"A2","text":"Nothing."},{"name":"GODBERT","text":"What a lovely season for a stroll! I'm sure you agree, yes? There's no better way to stimulate the senses─particularly when I'm joined by an inspiring presence like yours, my friend! Ho ho ho!"},{"name":"SYSTEM","text":"Are you sure you wish to part ways with the saint?"},{"name":"GODBERT","text":"Oho! Such a lovely, tranquil place, yes? Just gazing out upon the dancing water gets my juices flowing!"},{"name":"GODBERT","text":"I am all but certain that inspiration will strike me any moment now! Yes, I can feel it coming... Almost there..."},{"name":"GODBERT","text":"..."},{"name":"GODBERT","text":"...Or perhaps not."},{"name":"GODBERT","text":"I was certain I had something for a moment there, but it seems to have eluded me. No matter! My mind is now clear and ready to be filled with new ideas. I must say, spending time with you has been every bit as stimulating as I expected!"},{"name":"GODBERT","text":"Oho! So these are the barracks of the Wood Wailers! It's most inspiring to see everyone hard at work."},{"name":"GODBERT","text":"Mayhap they would also be inspired to feast their eyes on my own muscles. Though they may be difficult to see through all these clothes..."},{"name":"GODBERT","text":"Behold!"},{"name":"GODBERT","text":"Ho ho ho!"},{"name":"GODBERT","text":"Ho ho ho ho ho ho ho!"},{"name":"GODBERT","text":"Impressive, are they not? You are free to feel them for yourself if the sight alone does not suffice."},{"name":"GODBERT","text":"Bwahaha! Come now, my friend, there's no need to be shy."},{"name":"GODBERT","text":"Ah, but nothing stimulates the mind more than moving one's body. I daresay I'm feeling more inspired by the moment!"},{"name":"GODBERT","text":"Oho! What a remarkable collection of most masterfully crafted leatherwork! I would expect nothing less from the home of the Fen–Yll brand."},{"name":"GODBERT","text":"These would make marvelous gifts, indeed...though perhaps not for children."},{"name":"GODBERT","text":"For one as cultured as <span class=\"emphasis\">you</span>, however, I do believe this bag would be perfect. It complements your powerful silhouette most remarkably. What do you say? Might you have something in mind for me?"},{"name":"GODBERT","text":"Ah, but there are few greater pleasures in life than exchanging presents with friends and loved ones. Just imagining the delight in their eyes upon receiving the item you so carefully chose for them..."},{"name":"GODBERT","text":"This stroll truly has been most eye-opening. Doing this every year, one tends to fall into a bit of routine. Slowly but surely, you are helping me remember the true joys of the season."},{"name":"GODBERT","text":"Why, I daresay I'm feeling as excited and motivated as I did during the inaugural Starlight Celebration! Ho ho ho!"},{"name":"GODBERT","text":"Ah, but of course! If the perfect gift is to be found, what better place to search for it than in a marketplace chock-full of the finest wares? By all means, let us have a look around!"},{"name":"GODBERT","text":"Out of curiosity, what manner of purchase is it that usually inspires you to come to these markets? Arms and armor, perhaps? Or foodstuffs? Something more ornamental? Do tell me if anything has caught your eye."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"I don't do much shopping."},{"name":"A3","text":"I buy materials from time to time."},{"name":"A3","text":"It used to be belts..."},{"name":"GODBERT","text":"Oho! I see! Prefer to make things yourself, then? 'Tis another quality we share! After all, I <span class=\"emphasis\">am</span> known as one of the realm's greatest goldsm─er, pardon me."},{"name":"GODBERT","text":"That is to say, as the Saint of Nymeia, I take pride in personally handcrafting every single gift that I deliver!"},{"name":"GODBERT","text":"“Belts”...? Ah, yes! Those fabled objects that were said to have once held up many an adventurer's pantaloons! And yet, it is strange. When I try to recall what they looked like, I see them only in silhouette, as if they stood betwixt me and a blinding glare..."},{"name":"GODBERT","text":"Well, there are certainly plenty of wonderful items from which to draw inspiration! As always, your perspective has proved most enlightening, my friend."},{"name":"GODBERT","text":"Oho! What a lovely spot, indeed. I must say, attuning my ears to the sound of the babbling river and spinning waterwheel instills me with a transcendent calm!"},{"name":"GODBERT","text":"..."},{"name":"GODBERT","text":"That said, it is a bit chilly here at water's edge, is it not? Most fortunate that I'm layered up nice and warm."},{"name":"GODBERT","text":"Why, I daresay I was even feeling a bit hot. Yes, a bit of a cool air might have been just what I needed for inspiration!"},{"name":"GODBERT","text":"Perhaps I could make a gift of garb and garments to keep out the chill of winter. Yes, that would be a fine idea! Why did I not think of this sooner?"},{"name":"GODBERT","text":"Oho! Such a magnificent tree! Clearly, it's been tended to with the greatest of care."},{"name":"GODBERT","text":"You can feel the love that those who work here have for nature. A gentle tranquility permeates the very air around us."},{"name":"GODBERT","text":"It's quite the departure from the bustling crowds that are the norm at most places I visit. Why, just the other day at the Gold Sau-er, um..."},{"name":"GODBERT","text":"The Gold...source! As in a mine of sorts. Yes, I'm so inspired I feel as if I have struck gold! Ho ho ho!"},{"name":"GODBERT","text":"But what treasures still await us? Onward we go!"},{"name":"SYSTEM","text":"It would appear that the Saint of Nymeia has found some small measure of inspiration. You may make for Nophica's Altar if you are ready to end your stroll, or accompany him to other locations that you might inspire him further."},{"name":"SYSTEM","text":"While you are accompanied, you may encounter “conversation points” along the way which offer additional topics of discussion."},{"name":"SYSTEM","text":"Enter the glowing area and speak with your quest companions to access these bonus conversations. Enjoy exploring your surroundings together!"},{"name":"SYSTEM","text":"The Saint of Nymeia is in need of further inspiration. If there are other destinations you believe might inspire him, accompany him there."},{"name":"SYSTEM","text":"It seems the Saint of Nymeia is sufficiently inspired. Accompany him to Nophica's Altar when you are ready to depart."},{"name":"SYSTEM","text":"It would appear that the Saint of Nymeia has found the inspiration he seeks. You may accompany him to Nophica's Altar once you are ready."},{"name":"GODBERT","text":"Pressing matters require your attention? By all means, do not let me keep you! I will be attending to business in Mih Khetto's Amphitheatre, so pray seek me out when you are ready to resume our little stroll."},{"name":"GODBERT","text":"There you are! I was starting to worry you wouldn't be coming back. Ready to resume our inspiring excursion?"},{"name":"GODBERT","text":"Ho ho! As all good things do, it would seem our little journey together has come to an end. And I can just feel the fire of inspiration coursing through me! Many thanks for the kindling, my friend."},{"name":"GODBERT","text":"Now all that remains is to bring my ideas to life in the form of gifts for the children. Yes, I must be off to my workshop."},{"name":"GODBERT","text":"That said, I very much enjoyed our little Starlight stroll together. I do hope you feel the same?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"It was...entertaining."},{"name":"A4","text":"It was...exhausting."},{"name":"A4","text":"Must we part so soon?"},{"name":"GODBERT","text":"Ho ho ho! My apologies if I got a bit carried away at times."},{"name":"GODBERT","text":"As the Saint of Nymeia, I've vowed to devote my life to helping others. I believe the two of us are rather alike in that sense."},{"name":"GODBERT","text":"And your exploits this season have reminded me anew of just what the Starlight spirit is all about. Anyone, be they man or beast, can bring joy and wonder to the world if they so choose."},{"name":"GODBERT","text":"It's a wonderful thing, is it not? I must channel all this vim and vigor towards crafting new gifts for the children! Alas, I fear this means our time together is at an end..."},{"name":"GODBERT","text":"Ho ho ho! Don't tell me─you're curious about what I'll be making for them, yes?"},{"name":"GODBERT","text":"Walking about town with you, I was struck by the calmness I felt looking at the streetscapes veiled in white, and the warmth that welled up in my heart in seeing the smiling faces of the townspeople."},{"name":"GODBERT","text":"That's when it hit me─I could craft snow globes! Yes, little spheres of glass depicting the Starlight season here in Gridania! The children would enjoy that, don't you think?"},{"name":"GODBERT","text":"And with that, I'd best get to work giving physical form to my ideas. Do send Amh Garanjy my regards. Ho ho ho!"},{"name":"GODBERT","text":"Oho? Well, if you insist, perhaps I <span class=\"emphasis\">could</span> linger just a bit longer..."},{"name":"GODBERT","text":"Say, did you know that skilled Hearers can attune their ears to the voices of the elementals?"},{"name":"GODBERT","text":"It got me thinking: do you suppose that on certain special occasions, <span class=\"emphasis\">we</span> could hear them as well? I daresay if there's any time that we might, it would be during the Starlight season!"},{"name":"GODBERT","text":"Shall we try it, then? Close your eyes and open your ears. Come now, it'll be fun!"},{"name":"SYSTEM","text":"You close your eyes and listen closely to the sounds of nature around you."},{"name":"SYSTEM","text":"Slowly but surely, the bustling noises of the city fade, and you can feel your mind clearing..."},{"name":"GODBERT","text":"(-Saint of Nymeia-)Aaah...aaah...aaah...ACHOO!"},{"name":"GODBERT","text":"(-Saint of Nymeia-)...Ah."},{"name":"GODBERT","text":"(-Saint of Nymeia-)Did you hear anything? If there's anyone the elementals would speak to, undoubtedly it is you!"},{"name":"GODBERT","text":"(-Saint of Nymeia-)Yes, it's only a matter of time, now. I'm certain of it. Whatever you do, don't open your eyes!"},{"name":"GODBERT","text":"(-Saint of Nymeia-)Yes, just like that... Don't move. And no peeking!"},{"name":"SYSTEM","text":"A warm hand caresses your cheek."},{"name":"Q5","text":"Will you open your eyes?"},{"name":"A5","text":"Yes."},{"name":"A5","text":"No."},{"name":"GODBERT","text":"...You've got a little something on your face."},{"name":"GODBERT","text":"Fret not, it's gone now! Ho ho ho!"},{"name":"SYSTEM","text":"You keep your eyes tightly shut, and focus on the voices of the elementals."},{"name":"GODBERT","text":"(-Soft Whisper-)...vation...waste not...great...vene...groundw..."},{"name":"SYSTEM","text":"You hear mumbling whispers, but cannot discern precisely what is being said..."},{"name":"Q6","text":"Will you open your eyes?"},{"name":"A6","text":"Yes."},{"name":"A6","text":"No."},{"name":"GODBERT","text":"Oh! I fear you've caught me. I was hoping the image of your resting face would provide for me the last jolt of inspiration, but alas, it seems you were wise to my ruse."},{"name":"GODBERT","text":"(-Saint of Nymeia-)Hmm... It would appear laymen like us cannot hear the elementals after all. Still, our moment of quiet meditation has brought me clarity of mind! I know exactly how I will get started on this year's presents."},{"name":"GODBERT","text":"Joining you for a brisk stroll through the snow-veiled forest has truly invigorated me. My head is finally clear enough for me to start working on gifts for the children."},{"name":"GODBERT","text":"Ho ho ho! Don't tell me─you're curious about what I'll be making for them, yes?"},{"name":"GODBERT","text":"Walking about town with you, I was struck by the calmness I felt looking at the streetscapes veiled in white, and the warmth that welled up in my heart in seeing the smiling faces of the townspeople."},{"name":"GODBERT","text":"That's when it hit me─I could craft snow globes! Yes, little spheres of glass depicting the Starlight season here in Gridania! The children would enjoy that, don't you think?"},{"name":"GODBERT","text":"And with that, I'd best be off. Do send Amh Garanjy my regards. Ho ho ho!"},{"name":"BOYHAVINGFUN04470","text":"Look! The saint is here!"},{"name":"GODBERT","text":"Ho ho ho! Happy Starlight to one and all! I hope you boys and girls are looking forward to your presents this year! That adventurer over there inspired me with a wonderful new ideaーI think you're all in for quite the surprise!"},{"name":"AMHGARANJY","text":"The saint was beaming from ear to ear on his way out. You must have had quite the time together!"},{"name":"AMHGARANJY","text":"But where's my head? He left this as a special Starlight gift just for you. Well, I do hope you enjoy the festivities! And if you're so inclined, do check back in with the saint before the season's over. I'm sure he'd be overjoyed to see you again."},{"name":"GODBERT","text":"Ho ho ho! Both my body and soul are warmed up and ready to go!"}],"reward":{"items":[{"num":10,"id":7809}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[70005]}},"partials":[{"type":"npc","id":"1040593","obj":{"i":1040593,"n":"Amh Garanjy","l":53,"q":3}},{"type":"item","id":"7809","obj":{"i":7809,"n":"Magicked Prism (Sunshine)","l":1,"c":22633,"t":85,"p":8}},{"type":"quest","id":"70005","obj":{"i":70005,"n":"Time to Shine","g":204,"l":"Gridania","s":216}}]}