{"quest":{"name":"A Stylish Transformation","location":"Ul'dah","id":70008,"patch":6.0,"sort":214,"repeatable":1,"icon":101155,"eventIcon":71222,"issuer":1041580,"target":1041580,"genre":198,"journal":["Marabel is beaming with pride.<br>※This quest is available for a limited time only.","As thanks for helping her win the Little Ladies' Day walk-off, Marabel has offered to lend you her styling expertise in your efforts to outfit a model of your own. You agree to come up with a concept and report back to her near the stage.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Marabel has prepared a dazzling ensemble for your chosen model─who, for their part, seems quite pleased with this change of costume. You decide to thank Marabel for her services.","Pleased with your foray into the fashion world, Marabel has agreed to provide further styling assistance for a model of your choosing. You kindly accept, promising to stop by again if time permits."],"objectives":["Speak with Marabel.","Speak with Marabel again."],"dialogue":[{"name":"MARABEL","text":"Oh, hello there, <span class=\"highlight\">Forename</span>! Don't tell me, dahling─has your turn on the stage given you fashion fever?"},{"name":"MARABEL","text":"Well, it just so happens that <span class=\"emphasis\">the</span> Masked Rose will be holding a Fashion Check as part of the day's festivities! Of course, we'll require a model, but if you have someone in mind, do let me know!"},{"name":"MARABEL","text":"You do the scouting, and I'll do the sewing─it's as simple as that, dahling. Just let me know when you're ready to start the show!"},{"name":"MARABEL","text":"Well? Ready to embark on your maiden voyage as designer extraordinaire, dahling? We'll need a model, but did you have anyone in mind?"},{"name":"Q1","text":"Who will you ask to be your model?"},{"name":"A1","text":"A gallant gladiator."},{"name":"A1","text":"A master miner."},{"name":"A1","text":"A premier pugilist."},{"name":"A1","text":"A minute machinist."},{"name":"A1","text":"A godlike goldsmith."},{"name":"MARABEL","text":"A fabulous choice, dahling! Well, let's not waste time: call them over so we can commence our styling session!"},{"name":"MYLLA","text":"Now, I presume you've some reason for summoning me here?"},{"name":"MYLLA","text":"...You want me to <span class=\"emphasis\">what</span>!? I had heard today's festivities would include heretofore unseen entertainment, but I certainly didn't imagine I would be providing it."},{"name":"MYLLA","text":"While I'm no stranger to public performances, gladiator tournaments are a vastly different beast than...whatever this gorgeous affair is. "},{"name":"MYLLA","text":"I can't say I see myself as fit for the role, but if you insist, I have little choice but to acquiesce."},{"name":"MARABEL","text":"So <span class=\"emphasis\">this</span> is our lucky model-to-be! You certainly know how to pick them, dahling. Now, what did you have in mind as far as a concept is concerned?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Gorgeous yet gallant!"},{"name":"A2","text":"Opposite of ordinary!"},{"name":"MARABEL","text":"Say no more! I'll go prepare an ensemble for our model-to-be. <span class=\"emphasis\">You</span> just sit tight and get ready to awe your audience!"},{"name":"MARABEL","text":"...Oh, splendid! That fits like a glove. Now, go out there and knock them dead, dahling!"},{"name":"BUTLER","text":"Thank you kindly for your participation. And now, let us hear our judge's evaluation!"},{"name":"MASKEDROSE","text":"Such passion... Why, I could feel your spirit bursting through the seams and spilling forth onto the stage!"},{"name":"MASKEDROSE","text":"There has never been a foe too ferocious for the gladiators' guildmaster─and today, you've proven there is likewise no foe too fashionable. You've slain the competition!"},{"name":"MASKEDROSE","text":"'Twas quite a treat to see you reveal a softer side on this stage. Why, it simply set my heart aflutter!"},{"name":"MASKEDROSE","text":"There is great beauty in the fluidity of your fighting, and your ensemble today serves to highlight that elegance. Splendidly done!"},{"name":"MYLLA","text":"'Tis strange: a simple walk across the stage never rattled my nerves until today. Perhaps it's because I'm so accustomed to having an opponent to train my eyes upon. I felt rather aimless without someone to watch."},{"name":"MYLLA","text":"That said, it <span class=\"emphasis\">was</span> rather refreshing to don a different set of clothes for once. Can't say I'll do it again any time soon, but I shall cherish this experience all the same."},{"name":"MYLLA","text":"Perhaps I'll put a touch more care into choosing what I wear henceforth─and should I require any assistance to that end, I hope I can count on you both."},{"name":"ADALBERTA","text":"If you're in need of ore, I'd be happy to put in a request with the guild on your behalf..."},{"name":"ADALBERTA","text":"...Did I mishear you, <span class=\"highlight\">Forename</span>? You wish to make a <span class=\"emphasis\">model</span> of me!?"},{"name":"ADALBERTA","text":"Oh, my... Although I had planned on taking part in today's festivities, this certainly isn't what I had in mind."},{"name":"ADALBERTA","text":"But you've piqued my curiosity. I've always been enamored of life on the stage, after all. Very well─I shall be your muse!"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Unearthing a new image!"},{"name":"A3","text":"Unveiling a softer side!"},{"name":"MASKEDROSE","text":"I am by no means a miner, but were you and I to cross paths in a quarry somewhere, not even the brightest gleaming gem could draw my eye away from your beauty!"},{"name":"MASKEDROSE","text":"Those shimmering stones should consider themselves lucky to be unearthed by a living, breathing treasure such as you."},{"name":"MASKEDROSE","text":"Your ensemble evokes an elegance that is often sought yet rarely found─a diamond hidden amongst the dust and darkness. You are a treasure to behold!"},{"name":"MASKEDROSE","text":"Why, this must be how you miners feel when you uncover a precious stone. And to think that I would figuratively strike it rich on my first attempt!"},{"name":"ADALBERTA","text":"A miner like myself isn't often thrust into the spotlight─especially given how much time I spend underground─and I think I might prefer to keep it that way."},{"name":"ADALBERTA","text":"But I must say the ensemble you picked out was quite charming! So charming, in fact, that I'm inclined to wear it home."},{"name":"ADALBERTA","text":"This was quite the unforgettable experience, if unexpected. Thank you both again for the invitation!"},{"name":"HAMON","text":"Well? If you've got business with me, then be quick about it: I don't want to miss the Songbirds!"},{"name":"HAMON","text":"...What's that, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">son</span></span>? You want <span class=\"emphasis\">me</span> to get up on that stage!?"},{"name":"HAMON","text":"Hah hah hah! It seems the Holyfist's good looks aren't lost on you. Well, if you think I'm a knockout now, you should've seen me in my youth!"},{"name":"HAMON","text":"Say, if my turn as a model goes well, I might even enjoy some renewed popularity with the ladies─just like in the olden days. Well? No time to waste. Let's hop to it!"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"A dashing lady-killer!"},{"name":"A4","text":"A stylish pugilist!"},{"name":"MASKEDROSE","text":"Th-This is...a most novel ensemble. It provides a playful youthfulness that belies your years."},{"name":"MASKEDROSE","text":"And while I cannot imagine enrobing myself with those raiments, I must say the power pouring forth from within you pulls that outfit together in a way others would envy."},{"name":"MASKEDROSE","text":"You must forgive me for underestimating you, but I certainly didn't expect you to take such a fashion-forward approach to your ensemble..."},{"name":"MASKEDROSE","text":"I must say, I'm quite impressed. Why, you may even have a future as a model for the <span class=\"emphasis\">Mythril Eye</span>! I daresay men your age could take a few pointers from your stylish sensibilities."},{"name":"HAMON","text":"What a thrill! Did you see the way those lasses watched me? Why, their lustful gaze was so hot it nearly burned clean through my costume!"},{"name":"HAMON","text":"Who would've thought a simple change of clothes was all it'd take to bring this old coot back to his lady-killing heyday?"},{"name":"HAMON","text":"At this rate, I might as well start calling myself “Handsomefist” instead! Hah hah hah!"},{"name":"WEDGE","text":"If you're looking to embark on an expedition, you'd best run it by the chief first..."},{"name":"WEDGE","text":"&lt;gasp&gt; Y-You want me to <span class=\"emphasis\">model</span> for you? No...I couldn't!"},{"name":"WEDGE","text":"Although...if everything goes well, and word gets around to <span class=\"emphasis\">her</span>..."},{"name":"WEDGE","text":"V-Very well! I've made up my mind: I'll do it! Dress me as you see fit!"},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"Ditch the goggles, show the face!"},{"name":"A5","text":"Dress in brown, show some style!"},{"name":"MASKEDROSE","text":"Oh, I could get lost in those big, round eyes... Even a single glance makes my heart skip a beat! You Lalafell boys are simply adorable."},{"name":"MASKEDROSE","text":"And your ensemble today only serves to highlight your inherent cuteness. Why, I can barely restrain myself from leaping out of my seat and squeezing you right now!"},{"name":"MASKEDROSE","text":"This all-brown ensemble of yours is so chic! If a stylish mechanist like you tried to sell me the most expensive magitek device you own, I'd pay top gil for it without question."},{"name":"MASKEDROSE","text":"While I recognize that folk in your line of work are often forced into wearing the same uniform day in and day out, I encourage you to experiment a little when you're off the clock!"},{"name":"WEDGE","text":"Th-That was unbelievably terrifying! The sound of my heartbeat was thundering in my ears the entire time!"},{"name":"WEDGE","text":"Would I could have only heard the crowd cheering for me... But seeing their smiling faces was exhilarating in its own right!"},{"name":"WEDGE","text":"...Although I think this proves I'm better suited to staying behind the scenes. I-If you require another model, might I suggest Biggs?"},{"name":"GODBERT","text":"Well, then. Fancy a spot of strength training, adventurer?"},{"name":"GODBERT","text":"...Oho? A modeling job, is it? "},{"name":"GODBERT","text":"I say, it certainly isn't in my nature to get all dressed up─or very dressed at all! But a new experience could be elucidating... Very well─I'll do it!"},{"name":"Q6","text":"What will you say?"},{"name":"A6","text":"Unrestricted eroticism!"},{"name":"A6","text":"Unfettered physicality!"},{"name":"MASKEDROSE","text":"Your calm demeanor belies a formidable passion that only a man of your years can exude─a fine wine that I would give anything to imbibe."},{"name":"MASKEDROSE","text":"And although those sunglasses may cover your eyes, I can feel your gaze piercing straight through my heart. Everything about your ensemble is fabulous!"},{"name":"MASKEDROSE","text":"M-My word... Muscles upon muscles, all chiseled to perfection..."},{"name":"MASKEDROSE","text":"You have exhibited great courage in sporting such an austere ensemble─and for that, I must both commend and thank you. I shall not forget your fantastic physique as long as I live!"},{"name":"GODBERT","text":"Ohohoho! What did you think, adventurer? Certainly not an ensemble I would've chosen for myself."},{"name":"GODBERT","text":"But your unique sensibilities have provided me with just the inspiration I needed. Yes, I can feel the creative juices surging through my entire body!"},{"name":"GODBERT","text":"I'd best set to work on my next piece before this spark fades away. Farewell!"},{"name":"MARABEL","text":"Well done, dahling! Your model seemed to have a splendid time─and I quite enjoyed providing couture counsel as well."},{"name":"MARABEL","text":"If you stumble upon another model-in-the-making, just let me know. I'd be more than happy to offer additional styling assistance!"}],"reward":{"items":[{"num":10,"id":5888},{"num":10,"id":5889}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[70007]}},"partials":[{"type":"npc","id":"1041580","obj":{"i":1041580,"n":"Marabel","l":40,"q":2}},{"type":"item","id":"5888","obj":{"i":5888,"n":"Peach Confetti","l":1,"c":22640,"t":85,"p":10}},{"type":"item","id":"5889","obj":{"i":5889,"n":"Cherry Confetti","l":1,"c":22641,"t":85,"p":10}},{"type":"quest","id":"70007","obj":{"i":70007,"n":"Fashion Face-off","g":198,"l":"Ul'dah","s":213}}]}