{"quest":{"name":"The Faculty","location":"Old Sharlayan","id":70009,"patch":6.0,"sort":10,"unlocksFunction":1,"eventIcon":71341,"issuer":1038500,"target":1038500,"genre":178,"journal":["Qih Aliapoh is in need of a helping hand.","Qih Aliapoh informs you that she has been looking for able workers capable of aiding the Studium. She asks you to speak with her once more should you be interested in rendering your services.","You are given a brief introduction to the Studium's various faculties, and their members who seek assistance. Which faculty you choose to help is at your discretion. However, Qih Aliapoh suggests you proceed with caution, as academics are often known to be a peculiar sort."],"objectives":["Speak with Qih Aliapoh."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the sidequest “Inscrutable Tastes.”"},{"name":"QIHALIAPOH","text":"It's you! You're the one the scholarch was telling us about. <span class=\"highlight\">Forename</span>, yes?"},{"name":"QIHALIAPOH","text":"Brilliant! Just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I was hoping to see."},{"name":"QIHALIAPOH","text":"As I'm sure you are aware, the Studium is the most prestigious educational institution in all of Sharlayan. As such, we make a point of only working with the best educators and students."},{"name":"QIHALIAPOH","text":"The gleaners we employ are also held to the same high standards, of course. Which is perhaps why it has been so difficult to find the assistance we need of late. Surely you understand the trouble of finding competent and capable help?"},{"name":"QIHALIAPOH","text":"...Ahem. That you are come here suggests you're willing to lend a hand, no? I'm certain you would have much to gain from working with us if so."},{"name":"QIHALIAPOH","text":"Do let me know should you commit to lending your services to the Studium. I should warn you, however, there is much I must explain ere you begin. So please be certain you have sufficient time to spare."},{"name":"QIHALIAPOH","text":"Now, allow me to explain our work here."},{"name":"QIHALIAPOH","text":"Professors and students from our many faculties gather in Searchers' Meet in order to do business with and recruit reputable individuals such as yourself. Allow me to briefly introduce those here at present."},{"name":"QIHALIAPOH","text":"Here we have Boric from the Faculty of Archaeology. He works as an assistant to one Professor Rurusha and is currently seeking a skilled metalworker to help restore an ancient relic."},{"name":"QIHALIAPOH","text":"Then there's Jude, who belongs to the Faculty of Astronomy. He seems to be looking for an artisan able to work with leather, cloth, or wood, but he wouldn't tell me much more than that─he's awfully shy, you see."},{"name":"QIHALIAPOH","text":"Next we have Debroye, a student studying in the Faculty of Medicine. I'm fairly sure she's carrying out research under the supervision of Professor Galveroche. In any case, I hear she's after someone who knows a thing or two about medicine and nutrition."},{"name":"QIHALIAPOH","text":"And here's Hinageshi of the Faculty of Anthropology. She told me she's searching for botanists and miners at present. By the sounds of it, she and Professor Tankin are dealing with a formidable task."},{"name":"QIHALIAPOH","text":"Last but not least, this is Professor T'laqa Tia, an associate professor in the Faculty of Aetherology. I heard he's in need of a fisher to help him conduct research for his thesis. Unfortunately, things do not seem to be progressing well for him at the moment."},{"name":"QIHALIAPOH","text":"I'd say those five are the ones most in need of supplementary aid."},{"name":"QIHALIAPOH","text":"I'll leave it to your discretion as to who you choose to help. Although, be forewarned: academics can be something of an odd bunch."},{"name":"QIHALIAPOH","text":"Just be sure not to leave anyone in the lurch after you've agreed to help them."},{"name":"SYSTEM","text":"You may now undertake deliveries at the Studium. Speak to those belonging to the institution's various faculties to learn what ails them."}],"reward":{"gil":615},"reqs":{"jobs":[{"lvl":80,"id":35}],"quests":[69916]},"next":[69668,69675,69682,69689,69696]},"partials":[{"type":"npc","id":"1038500","obj":{"i":1038500,"n":"Qih Aliapoh","l":3706,"q":2}},{"type":"quest","id":"69916","obj":{"i":69916,"n":"Sound the Bell, School's In","g":11,"l":"Old Sharlayan","s":534}},{"type":"quest","id":"69668","obj":{"i":69668,"n":"Professor Rurusha's New Friend","g":173,"l":"Old Sharlayan","s":0,"f":1}},{"type":"quest","id":"69675","obj":{"i":69675,"n":"In Search of the Azure Star","g":174,"l":"Old Sharlayan","s":0,"f":1}},{"type":"quest","id":"69682","obj":{"i":69682,"n":"Perfectly Awful","g":175,"l":"Old Sharlayan","s":0,"f":1}},{"type":"quest","id":"69689","obj":{"i":69689,"n":"Cultured Pursuits","g":176,"l":"Old Sharlayan","s":0,"f":1}},{"type":"quest","id":"69696","obj":{"i":69696,"n":"Fear the Thesis","g":177,"l":"Old Sharlayan","s":0,"f":1}}]}