{"quest":{"name":"Pests Be Gone","location":"Labyrinthos","id":70018,"patch":6.0,"sort":1193,"icon":101077,"eventIcon":71221,"issuer":1041673,"target":1041673,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The biologist has worms on the brain.","The biologist volunteers to make an even stronger pesticide to kill off the woodworms once and for all. However, you must first obtain one of the key ingredients─a luncheon toad's poison gland.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Having obtained the requested bit of innards, you are free to make your way back to Meryall Agronomics. Slowly, quickly─however you travel, you know in your heart that toad parts will be fouling up your bag along the way.","You hand over the poison gland to the biologist. However, just as he makes to get to work on the new pesticide, the Archeion's director, Vandealine, appears and forbids you from using such a potent solution due to its potential environmental impact. Though she is keen to take Shaggles back to his home amongst the meticulously catalogued specimens, he pleads for one last chance to solve the pest problem. Surprised by his display of sentience, Vandealine acquiesces, promising to cease treating the troll as a mere sample if he succeeds."],"objectives":["Obtain a poison gland from a luncheon toad.","Deliver the luncheon toad's poison gland to the Agronomics biologist."],"dialogue":[{"name":"LITTLETROLL","text":"It was grrr enough when I thought these were normal woodworms..."},{"name":"NWELHITIA","text":"I suppose I should really return Shaggles to the Archeion soon... Oh, ignore me. I'm just thinking out loud."},{"name":"BIORESEARCHER","text":"It may not be the most inventive solution, but what if we were to make an even stronger pesticide?"},{"name":"LITTLETROLL","text":"Grrr, but how?"},{"name":"BIORESEARCHER","text":"Assuming that's a “yes,” I'll need you to get your hands on a luncheon toad's poison gland. I'll take care of the rest."},{"name":"NWELHITIA","text":"Oh my. Despite their adorable name, those toads are not to be trifled with. "},{"name":"LITTLETROLL","text":"Think you're up to it? The buffoon clearly isn't, so I'd say you're our only hope."},{"name":"NWELHITIA","text":"I take it he's skipped right to asking for your assistance. You'll find the toads roaming near Pneuma, I believe. Do take care now!"},{"name":"BIORESEARCHER","text":"The toads are really quite delicious once you extract the poison gland. Just a friendly tip."},{"name":"LITTLETROLL","text":"Have you managed to take out one of those toads yet?"},{"name":"NWELHITIA","text":"Remember─those toads would just as soon have <span class=\"emphasis\">you</span> for luncheon."},{"name":"NWELHITIA","text":"Glad to see you returned safely! You may give the spoils to our friend here directly─no, no, I don't need to see, thank you."},{"name":"LITTLETROLL","text":"Grrr to have you back. Now, hurry up and give that toad's innards to the biologist."},{"name":"BIORESEARCHER","text":"Oof, judging by the smell I think it's safe to assume you've got what I asked for. Allow me to tuck that away before we all pass out from the stench."},{"name":"BIORESEARCHER","text":"Out of smell, out of mind. And now I've got all I need to make one of the most potent pesticides out there."},{"name":"VEANDELINE","text":"(-???-)Hold on just a moment."},{"name":"NWELHITIA","text":"D-Director!"},{"name":"VEANDELINE","text":"What exactly are you making here, and why does it smell like the inside of a toad?"},{"name":"VEANDELINE","text":"And you, N'welhi Tia. I believe your job requires you bring any missing specimens back to the Archeion, not take them on a tour of the realm."},{"name":"NWELHITIA","text":"Please, a-allow me to explain."},{"name":"VEANDELINE","text":"Hmm. I see why you feel such drastic action is needed."},{"name":"VEANDELINE","text":"However, I cannot permit you to release such a potent pesticide inside my Archeion."},{"name":"VEANDELINE","text":"It could damage that which is housed within, and there's no telling how it might affect Labyrinthos's environment once the fumes inevitably escape the building."},{"name":"VEANDELINE","text":"Whilst the pesticide we currently use may be on the weaker side, that is also one of its strengths: it has a negligible impact on the environment. You clearly haven't given your plan much thought."},{"name":"VEANDELINE","text":"Fear not─I shall come up with a solution in due course. For now, let us return the specimen to the Archeion. There's little to be gained by allowing a troll to ruminate on such matters, no matter how...odd it may be."},{"name":"LITTLETROLL","text":"Grrr me another chance! I can't sit back and watch those marvelous books be destroyed!"},{"name":"VEANDELINE","text":"Is it...addressing me?"},{"name":"VEANDELINE","text":"It truly wishes to protect the tomes so strongly?"},{"name":"VEANDELINE","text":"Very well. In light of you having discovered the woodworm issue in the first place, I shall grant you one more chance to present a solution."},{"name":"VEANDELINE","text":"Should you prove capable of ridding us of the infestation, I promise to cease treating you as a mere specimen."},{"name":"VEANDELINE","text":"...Assuming that you come up with the solution all on your own, of course. You are forbidden from consulting the researchers. Understood?"}],"reward":{"gil":935},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70017]},"next":[70019]},"partials":[{"type":"npc","id":"1041673","obj":{"i":1041673,"n":"Agronomics Biologist","l":3708,"q":2}},{"type":"quest","id":"70017","obj":{"i":70017,"n":"Problematic Pests","g":121,"l":"Labyrinthos","s":1192}},{"type":"quest","id":"70019","obj":{"i":70019,"n":"Dream Big","g":121,"l":"Labyrinthos","s":1194}}]}