{"quest":{"name":"The Meeting of Minds","location":"Old Sharlayan","id":70010,"patch":6.0,"sort":20,"icon":101141,"eventIcon":71221,"issuer":1038500,"target":1038500,"genre":178,"journal":["Qih Aliapoh has been eagerly awaiting your return.","Qih thanks you for all your hard work and informs you that someone is very keen to talk with you at Learners' Meet. You agree to hear them out and head off to find out just who is so interested in chatting with you.","Soon after you arrive at Learners' Meet, you find yourself face-to-face with none other than the scholarch himself. Montichaigne asks if you would be willing to sound out those you helped about sharing their findings with one another. You agree to lend a hand and set off to go and see your old friends once more.","Rurusha is more than happy to accept your invitation, causing Boric to be overcome with emotion upon realizing she is finally getting the recognition she deserves. Jude, however, seems unsure if he is deserving of your invite at first, but eventually concedes this is a perfect opportunity to showcase the starlens. After broaching the subject with Debroye, she is overjoyed to be presented with another chance to show the world just how delicious Mervynbread can be. Upon speaking with you, Hinageshi realizes she and Tankin are yet to hold their reception. She excitedly muses about taking advantage of this opportunity to honor her marriage to the professor as you take your leave. T'laqa Tia happily accepts your proposal as he is keen to keep pushing ahead to do justice to his mentor's legacy. Having spoken to everyone, you head back to Searchers' Meet to inform Qih that all will be in attendance.","Qih informs you that she has been instructed by the scholarch to treat you to a meal at the Last Stand. Feeling rather peckish, you excitedly make your way to the restaurant.","Your meal at the Last Stand is interrupted by a wayward Loporrit─Searchingway. He came to Etheirys seeking out new and exciting discoveries, and Qih's mention of the upcoming gathering sparks his interest. His attendance would require permission from Montichaigne, however, so the three of you make for Learners' Meet to see if the scholarch can be persuaded.","The scholarch finds a kindred spirit in Searchingway and gladly allows him to sit in on the meeting. The Loporrit is enthralled by all the presentations, but remains curious as to how such differing disciplines can be combined to achieve a common goal. You suggest they explore new possibilities with their newly gained knowledge, and inspire the group to dream bigger yet in the process. With proceedings having come to a close, you make tracks for Searchers' Meet once more.","Qih remarks that even she is excited by the prospect of one day exploring the great expanse. She is altogether less happy, however, when she realizes she never got the chance to stroke Searchingway's silky soft fur."],"objectives":["Speak with Qih Aliapoh.","Speak with Rurusha.","Speak with Jude.","Speak with Debroye.","Speak with Hinageshi.","Speak with T'laqa Tia.","Speak with Qih Aliapoh.","Wait at the designated location.","Speak with Qih Aliapoh."],"dialogue":[{"name":"QIHALIAPOH","text":"Ah, <span class=\"highlight\">Forename</span>! Just who I was looking for."},{"name":"QIHALIAPOH","text":"I wished to thank you for helping the students and staff from the various faculties."},{"name":"QIHALIAPOH","text":"Their work has become the talk of the Studium! You've made a real difference."},{"name":"QIHALIAPOH","text":"Actually, while you're here, there's a pressing matter I wished to discuss."},{"name":"QIHALIAPOH","text":"Having heard the many glowing accounts of your work, another official of the Studium has requested an audience. Would you be able to spare time to speak with him?"},{"name":"QIHALIAPOH","text":"Wonderful. Then let us head to Learners' Meet."},{"name":"QIHALIAPOH","text":"He should arrive any moment now. Let's take a seat."},{"name":"MONTICHAIGNE","text":"(-???-)My apologies for keeping you waiting."},{"name":"MONTICHAIGNE","text":"Before we proceed, I wish to extend my sincerest thanks on behalf of the Studium for all you have done to aid our faculty and students."},{"name":"MONTICHAIGNE","text":"By the sounds of it, they have made remarkable findings one and all. That is why I would hold an assembly that we might discuss the overarching impact of their research."},{"name":"QIHALIAPOH","text":"Such gatherings are how academia evolves and advances─the shared knowledge of our works, be they successes or failures, that all may strive to improve."},{"name":"MONTICHAIGNE","text":"Precisely. Knowledge begets knowledge. Amassing and combining findings from a host of fields often leads to the creation of entirely new disciplines—one of the very reasons for which the Studium was founded."},{"name":"MONTICHAIGNE","text":"Which brings me to the reason why I asked you here. Might I prevail upon you to speak with the faculty and invite them to this meeting?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It would be my pleasure."},{"name":"A1","text":"Is there no one else who can ask them?"},{"name":"MONTICHAIGNE","text":"Excellent! I can think of no one better suited to the task. You were, after all, a key factor in all their successes."},{"name":"MONTICHAIGNE","text":"I thought to speak with them myself, but I do not wish for them to think attendance compulsory. And an invitation from you is less likely to be perceived as an order."},{"name":"MONTICHAIGNE","text":"Splendid. You have my thanks."},{"name":"QIHALIAPOH","text":"Well, that's that then. And you needn't rush to deliver these invitations. Pray speak with the faculty and students in your own time. "},{"name":"QIHALIAPOH","text":"When you've finished, return here and I will see to readying a chamber for the meeting."},{"name":"RURUSHA","text":"Well, well, look who it is! To what do I owe the pleasure?"},{"name":"RURUSHA","text":"Oh, that sounds lovely!"},{"name":"BORIC","text":"At long last your research will receive the recognition it deserves. Oh, Professor... &lt;sniffle&gt;"},{"name":"RURUSHA","text":"Oh, Boric, stop. I understand how you feel, but this is no time for tears."},{"name":"RURUSHA","text":"Professor Namono will wish to attend as well, like as not. I'll have a word with him, and see if we can't prepare a suitable compilation of our works."},{"name":"JUDE","text":"Ah, <span class=\"highlight\">Forename</span>. I must admit, I did not expect to see you here again."},{"name":"JUDE","text":"I see... I have certainly heard of such events, though I never dared dream a student such as myself would be invited to one."},{"name":"JEROMERE","text":"Don't tell me you're getting cold feet already! The Jude I know would relish such a challenge."},{"name":"JUDE","text":"Perhaps you're right, Jeromere. This would be the perfect opportunity to demonstrate what a boon the starlens could be to the academic community!"},{"name":"JUDE","text":"All right, then. Jeromere and I will set to work preparing a presentation at once."},{"name":"DEBROYE","text":"<span class=\"highlight\">Forename</span>! What a pleasant surprise. Would you care for a quick meal at the Last Stand to commemorate our reunion?"},{"name":"DEBROYE","text":"Well, that sounds wonderful!"},{"name":"DEBROYE","text":"It would be an honor to attend. I may never have a better opportunity to inform my peers of the benefits of fine dining."},{"name":"DEBROYE","text":"Perhaps I will invite Professor Galveroche and a few employees from the Last Stand to prepare samples of Mervynbread for those in attendance."},{"name":"DEBROYE","text":"In any case, there is much I must do to prepare. Until then, <span class=\"highlight\">Forename</span>!"},{"name":"HINAGESHI","text":"<span class=\"highlight\">Forename</span>! It's so good to see you."},{"name":"HINAGESHI","text":"Lest you wonder, Professor Tankin and I are doing quite well. But to what do we owe the pleasure of your visit?"},{"name":"HINAGESHI","text":"Is that so? I suppose the professor and I could share what we've learned from the various cultures we emulated."},{"name":"HINAGESHI","text":"Come to think of it, we've yet to share the news of our union either. The proposal was so sudden, we scarcely had time to invite any of the faculty, let alone hold a reception. All the more reason we should attend."},{"name":"HINAGESHI","text":"We will be there, absolutely! Professor Tankin should be most glad to hear about this."},{"name":"TLAQATIA","text":"My, what a surprise! Don't tell me─you've come with a souvenir from some far-flung land?"},{"name":"TLAQATIA","text":"Oho! First I am promoted to tenured professor, then this momentous opportunity presents itself to me."},{"name":"TLAQATIA","text":"Of course I shall attend. Were it not for you, I never would have proven my theory, and I would be a fool to overlook a chance to present my findings."},{"name":"TLAQATIA","text":"Yes, a bold first step in honoring Professor Nele's legacy."},{"name":"QIHALIAPOH","text":"When all parties have been informed, return here and I will see to reserving a space for the assembly."},{"name":"RURUSHA","text":"Goodness me, I haven't been this excited for an assembly in ages."},{"name":"JUDE","text":"There's still much we must do to prepare, but worry not─we will be ready!"},{"name":"DEBROYE","text":"I've no doubt the other faculty and students will be quite pleased to see what we have to share."},{"name":"HINAGESHI","text":"The professor and I shouldn't be much longer."},{"name":"TLAQATIA","text":"I daresay even Professor Nele would be impressed were he here to see what I have planned."},{"name":"QIHALIAPOH","text":"Welcome back! Well, what did they say?"},{"name":"QIHALIAPOH","text":"Very good. They have all worked so very hard, it is heartening to see their efforts will be rewarded."},{"name":"QIHALIAPOH","text":"The assembly will be held at Aporia in Labyrinthos. I've no doubt they would all be glad for your attendance, so please do stop by if you have time."},{"name":"QIHALIAPOH","text":"Oh, before I forget, the scholarch requested you be treated to a meal at the Last Stand as thanks for your help. As there's still time before they're set to begin, would you care to go now?"},{"name":"QIHALIAPOH","text":"To the Last Stand, then."},{"name":"QIHALIAPOH","text":"I hope you don't mind, but I've already ordered for the both of us. The meal was meant to be for you alone, but I'm sure the scholarch will forgive me for partaking of his generosity."},{"name":"QIHALIAPOH","text":"It's true! My sister has the diet of a savage. Naught but rock-hard bread and wildflowers day in and day out."},{"name":"SEARCHINGWAY","text":"(-Familiar Face-)Forgive the interruption, but...have we met? I swear you're the spitting image of one of those intrepid adventurers that visited the moon."},{"name":"SEARCHINGWAY","text":"Aha! I knew it. The name's Searchingway, by the way. Seeker of knowledge and all things curious."},{"name":"QIHALIAPOH","text":"A Loporrit! My, if you aren't the most adorable creature. Forgive me, but I cannot help but notice how wonderfully fuzzy your ears are. May I...?"},{"name":"SEARCHINGWAY","text":"Again with my ears. Honestly, what is it with you people and... &lt;sigh&gt; Very well. You may rub my ears, but I must insist on something in exchange."},{"name":"QIHALIAPOH","text":"Hmm... Well, some of our finest academics will soon be gathering at Aporia. I've no doubt they have curious and otherwise intriguing things to talk about."},{"name":"SEARCHINGWAY","text":"I see... May I ask the reason for this meeting of minds?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"To share their research."},{"name":"A2","text":"To see who's the smartest in the Studium."},{"name":"QIHALIAPOH","text":"Erm...perhaps further explanation is in order."},{"name":"SEARCHINGWAY","text":"The greatest minds of Etheirys come together to share heretofore unknown knowledge? That really does sound intriguing! And you'd allow me to observe this gathering?"},{"name":"QIHALIAPOH","text":"You would first need permission from Scholarch Montichaigne, but─"},{"name":"SEARCHINGWAY","text":"Then what are we waiting for? Where is this Scholard Monty-chu?"},{"name":"QIHALIAPOH","text":"It's Scholarch Montichaigne, and please bear in mind there is a chance he may refuse you. Still, I see no harm in asking. If you would go to Learners' Meet, I will have him to meet us there."},{"name":"SEARCHINGWAY","text":"Splendid! Let's hop to it, then!"},{"name":"QIHALIAPOH","text":"Right, well I had better go and─hold on a moment! I never got to rub his ears!"},{"name":"MONTICHAIGNE","text":"Ah, Qih and <span class=\"highlight\">Forename</span>. What is it you wish to discuss?"},{"name":"QIHALIAPOH","text":"Searchingway here is very keen to attend the forthcoming meeting you've arranged with the faculty and students."},{"name":"SEARCHINGWAY","text":"I came to Etheirys in search of the curious and wondrous, and this place has both in equal measure. What's more, it smells of...&lt;sniiiiiiiiiiiiff&gt;...knowledge!"},{"name":"MONTICHAIGNE","text":"I should certainly hope so! Sharlayan is known as a great seat of knowledge, and the Studium is the foremost of its many academies."},{"name":"MONTICHAIGNE","text":"It is our honor and privilege to encourage the scholarly pursuits of students and faculty both, their shared insights giving rise to heretofore unseen disciplines and fields of study."},{"name":"SEARCHINGWAY","text":"That sounds absolutely fascinating! Oh, please, sir! May I attend this academic meeting of yours?"},{"name":"MONTICHAIGNE","text":"Hahaha, by all means. The more the merrier, I say."},{"name":"QIHALIAPOH","text":"Thank you, Scholarch Montichaigne. I will inform the relevant parties of his attendance, and see to it he has clearance to enter Labyrinthos."},{"name":"MONTICHAIGNE","text":"Thank you, my dear. 'Tis clear Searchingway is a kindred spirit with a passion for learning, and I could not very well deny him the opportunity to sate his curiosity."},{"name":"SEARCHINGWAY","text":"Thank you, sir! Thank you!"},{"name":"QIHALIAPOH","text":"We haven't much time until proceedings get underway. Let's get going, shall we?"},{"name":"SEARCHINGWAY","text":"Absolutely amazing! I've most certainly come to the right place!"},{"name":"MONTICHAIGNE","text":"I trust the proceedings were to your liking?"},{"name":"SEARCHINGWAY","text":"Oh, it was magnificent! There's so much we Loporrits have yet to see of Etheirys. So much to learn!"},{"name":"SEARCHINGWAY","text":"Earlier you mentioned how they create new disciplines by sharing. Does this mean you plan to have all these people working together in future?"},{"name":"MONTICHAIGNE","text":"I do indeed. That is precisely why I suggested this meeting of minds in the first place. The exchange of knowledge and ideas will invariably lead to ever greater discoveries."},{"name":"SEARCHINGWAY","text":"But how exactly do you plan to combine their fields? They seem entirely unrelated to me..."},{"name":"MONTICHAIGNE","text":"Any thoughts? Given all you've seen, I imagine you must have an idea or two as to how to further advance their work."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"They could find a new use for Labyrinthos."},{"name":"A3","text":"They could explore the sea of stars!"},{"name":"A3","text":"They could explore the great unknowns of the universe!"},{"name":"MONTICHAIGNE","text":"Having abandoned our plans of exodus, Labyrinthos does want for purpose. That I cannot deny."},{"name":"MONTICHAIGNE","text":"That is certainly a possibility. Perhaps it is indeed time we turned our gaze heavensward."},{"name":"MONTICHAIGNE","text":"Oho, you've touched on the very heart of learning, my friend. The desire to conquer the unknown is the first step to all great discoveries. And I daresay there is no greater unknown than the great expanse!"},{"name":"TLAQATIA","text":"(-???-)Well said, Scholarch Montichaigne!"},{"name":"TLAQATIA","text":"We too have been giving thought as to what our combined efforts might accomplish."},{"name":"JUDE","text":"It occurred to me that, by applying Professor T'laqa's research on aetheric currents to the data obtained via my starlens, it may be possible to discover other stars capable of supporting life."},{"name":"DEBROYE","text":"And we needn't stop there. Thanks to the work done here in Labyrinthos, we know travel to other stars is possible. With sufficient stores of Mervynbread, we could surely weather the journey, however long it may be."},{"name":"RURUSHA","text":"A marvelous idea! The Golden Dhyata should prove useful should we require the translation of foreign languages we may encounter there among the stars."},{"name":"HINAGESHI","text":"And if we can communicate with those we encounter, then we would be able to share our cultures with them! You can leave that part to Professor Tankin and me."},{"name":"SEARCHINGWAY","text":"With you all working together, your chances of encountering heretofore undiscovered intelligent life are better than good, I'd say!"},{"name":"SEARCHINGWAY","text":"But what would you say if you met them?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"I'd tell them about hope."},{"name":"A4","text":"I'd tell them about what Meteion was searching for."},{"name":"SEARCHINGWAY","text":"That's it!"},{"name":"SEARCHINGWAY","text":"Meteion was sent out to explore the stars, and search for the meaning of life... Sadly, her fruitless quest led her to the very depths of despair."},{"name":"SEARCHINGWAY","text":"But you could do things differently. You could go and spread the word that hope yet lives on."},{"name":"MONTICHAIGNE","text":"A most admirable endeavor. And who better than we to see it through? After all, not even the Final Days could extinguish the flame of life on this star."},{"name":"QIHALIAPOH","text":"Scholarch Montichaigne should arrive shortly."},{"name":"SEARCHINGWAY","text":"Worry not─I will do my very, very best to convince this Monty-chain to allow my attendance."},{"name":"QIHALIAPOH","text":"That was brilliant! Part of me is glad it's finally over, though. Organizing everything was no mean feat."},{"name":"QIHALIAPOH","text":"More importantly, I can't quite believe that your offhand suggestion has effectively created an entirely new academic field."},{"name":"QIHALIAPOH","text":"But I suppose if anyone should be taken seriously on the subject of seeking out the unknown, then it is you."},{"name":"QIHALIAPOH","text":"It's rather exciting to think I might someday help in the exploration of the stars."},{"name":"QIHALIAPOH","text":"At any rate, thank you for everything, <span class=\"highlight\">Forename</span>."},{"name":"QIHALIAPOH","text":"...Oh, but wait! Where is Searchingway!? I still need to rub those adorable little ears of his!"}],"reward":{"gil":1303,"items":[{"id":35985}]},"reqs":{"jobs":[{"lvl":90,"id":35}],"questsType":"all","quests":[69674,69681]}},"partials":[{"type":"npc","id":"1038500","obj":{"i":1038500,"n":"Qih Aliapoh","l":3706,"q":2}},{"type":"item","id":"35985","obj":{"i":35985,"n":"Golden Dhyata","l":1,"c":59837,"t":81}},{"type":"quest","id":"69674","obj":{"i":69674,"n":"Wayback Machine","g":173,"l":"Old Sharlayan","s":0}},{"type":"quest","id":"69681","obj":{"i":69681,"n":"The Promised Star","g":174,"l":"Old Sharlayan","s":0}}]}