{"quest":{"name":"Dream Big","location":"Labyrinthos","id":70019,"patch":6.0,"sort":1194,"icon":101077,"eventIcon":71221,"issuer":1041682,"target":1041680,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Shaggles is searching for a solution.","Shaggles is despondent as he finds himself unable to come up with a suitable plan to rid the Archeion of its woodworm infestation. N'welhi Tia suggests you try to /pet the young troll to see if you can lift his spirits.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You tenderly pet Shaggles, but he doesn't seem especially happy about it. Perhaps he'll appreciate your intentions if you /pet him once more.","Shaggles starts to feel more like himself after a good petting. With further discussion, he decides that attempting to suffocate the woodworms is the best course of action.","Shaggles's plan will require limestone and acid to create a smothering gas, and you helpfully procure the former from the thirty-third facet for him. As the acid was N'welhi Tia's troll-assigned problem, you need only meet him and Shaggles back at the Archeion.","The testing phase of the plan goes smashingly well and, as promised, Shaggles is freed from his former specimen status and made an apprentice researcher. Delighted by his success, he resolves to do all he can to find a way to converse with those who do not possess the Echo."],"objectives":["/pet Shaggles.","/pet Shaggles some more.","Obtain slabs of limestone.","Deliver the limestone to Shaggles."],"dialogue":[{"name":"LITTLETROLL","text":"Grrr..."},{"name":"NWELHITIA","text":"Oh, I'm so sorry you got dragged into this. It's all my fault for acting so rashly."},{"name":"LITTLETROLL","text":"Grrr... I worry that I won't be able to come up with a way to solve our problem..."},{"name":"LITTLETROLL","text":"Let me grrr and think on my own for a bit."},{"name":"NWELHITIA","text":"It's all right. You don't need to interpret for me. Even I can tell he's struggling with the weight of this task."},{"name":"NWELHITIA","text":"You know, creatures like trolls tend to perk up when someone pets them. Why don't you show Shaggles some affection?"},{"name":"NWELHITIA","text":"He might pretend not to like it at first, but trust me─he'll warm up to it soon enough."},{"name":"NWELHITIA","text":"Go on, try petting Shaggles. He's just as cuddly as he looks."},{"name":"LITTLETROLL","text":"Grrr... I can't come up with anything good. I'm just a little creature..."},{"name":"SYSTEM","text":"Shaggles is down in the dumps. Perhaps <span class=\"highlight\">petting</span> him would help cheer him up."},{"name":"LITTLETROLL","text":"Grrr! Wh-What are you doing!? I'm not a dog!"},{"name":"LITTLETROLL","text":"Honestly, what the grrr was that?"},{"name":"SYSTEM","text":"Shaggles still seems melancholic. Perhaps <span class=\"highlight\">petting</span> him again will do the trick."},{"name":"LITTLETROLL","text":"Grrrrrr...rrr... Heh. Hee hee..."},{"name":"LITTLETROLL","text":"You know, I actually feel a bit better now."},{"name":"NWELHITIA","text":"Seems like he's back to his old self. Listen, Shaggles. If anyone can do this, it's you!"},{"name":"LITTLETROLL","text":"Grrr... I'd normally call him a buffoon and move on, but I'm the grrr who nearly destroyed Labyrinthos's ecosystem by unleashing a superstrength pesticide. If anyone's a fool, it's me."},{"name":"LITTLETROLL","text":"I know I'm forbidden from consulting the researchers, but I can ask you for advice, right?"},{"name":"LITTLETROLL","text":"You must've fought your fair share of foes on your adventures. How do you take down the especially grrr ones?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I harness all my strength."},{"name":"A1","text":"I focus on their weaknesses."},{"name":"A1","text":"I simply...end them."},{"name":"LITTLETROLL","text":"But we can't use our strong pesticide. The fumes would grrr havoc..."},{"name":"LITTLETROLL","text":"Wait, fumes... That's it─we need to suffocate the vilekin!"},{"name":"LITTLETROLL","text":"The woodworms do come from tropical climes, so their weakness would probably be freezing temperatures. Though if we make it too cold in the Archeion we'd risk exposing the books to frost damage when all the moistgrrr in the air freezes..."},{"name":"LITTLETROLL","text":"Wait, the air... Deprive them of the air they need to survive!"},{"name":"LITTLETROLL","text":"Grrr! That's very morbid, thank you."},{"name":"LITTLETROLL","text":"I suppose the easiest way to “end” any creature is to stop it from breathing... Depriving them of the air they need to survive!"},{"name":"LITTLETROLL","text":"I bet we could starve the worms of oxygen with the gas emitted when you pour hydrochloric acid on limestone. We'll need to evacuate the staff and other living specimens, but it wouldn't damage the tomes or documents."},{"name":"LITTLETROLL","text":"We won't know if it'll work unless we grrr it a go. N'welhi Tia can get the acid, so I just need you to find some limestone."},{"name":"LITTLETROLL","text":"There's more than enough for the taking in the thirty-grrr facet. Meet us at the Archeion once you have it!"},{"name":"NWELHITIA","text":"I get the impression you've come up with a solution. Would you mind filling me in?"},{"name":"NWELHITIA","text":"Brilliant! Though...I'd best at least pretend to be looking after Shaggles while I fetch that acid. Please do get that stone in the meantime."},{"name":"NWELHITIA","text":"Do you not find the thirty-third facet to be a bit...scary? I'm terrible with gloomy places like that."},{"name":"LITTLETROLL","text":"Everyone's out and we've got the acid as promised. Did you keep your end of the bargain?"},{"name":"LITTLETROLL","text":"Many grrrs! I'll be right back."},{"name":"LITTLETROLL","text":"I've filled the test room with gas. Now we only need wait and see what happens."},{"name":"LITTLETROLL","text":"Grrr..."},{"name":"LITTLETROLL","text":"You know, I've been on my own almost as long as I can remember. I do recall that I constantly questioned my parents, which is probably what led to them giving up on me altogether."},{"name":"LITTLETROLL","text":"That same intelligence─or belligerence, depending on who you grrr─saw me rescued and brought here. It made me interesting, I suppose. But I've only ever been treated as a specimen. You're the first person I've been able to have an actual conversation with."},{"name":"LITTLETROLL","text":"For the longest time, the Archeion's books were my only friends. They were both my loyal companions and my window from which I gazed upon the outer world."},{"name":"LITTLETROLL","text":"That's why I can't stand by and let them be destroyed."},{"name":"LITTLETROLL","text":"Naturally, I would love for my intelligence to be recognized so that I might become a researchgrrr in my own right. But more than anything, I want to protect the Archeion."},{"name":"NWELHITIA","text":"It worked! It actually worked! The pests are no more and the tomes look as good as new."},{"name":"VEANDELINET","text":"Well done─your method is both effective and safe. We shall waste no time in using it to rid the entire facility of woodworms."},{"name":"VEANDELINET","text":"As promised, you will no longer be treated as a mere specimen. From now on, you are an apprentice researcher."},{"name":"LITTLETROLL","text":"Grrr! Thank heavens the Archeion will be safe once more."},{"name":"LITTLETROLL","text":"And allow me to thank <span class=\"emphasis\">you</span> for everything. I couldn't have done it alone."},{"name":"LITTLETROLL","text":"My very first project as an apprentice will be to study how to produce sounds just like your kind do. After grrr, if I want to be a researcher, I need to learn how to speak with people other than you."},{"name":"NWELHITIA","text":"It's good to see Shaggles looking so pleased. Thank you for all you've done for us!"},{"name":"NWELHITIA","text":"Oh, but before you go, could you perhaps tell me what he thinks of me?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"He calls you a buffoon. Regularly."},{"name":"A2","text":"He's, er...rather disparaging."},{"name":"NWELHITIA","text":"Is that so..."},{"name":"NWELHITIA","text":"Ah, but he's too adorable to be angry with. Come, let me pet you!"},{"name":"LITTLETROLL","text":"Cease this, you buffoon! I'm no one's pet."},{"name":"NWELHITIA","text":"Nooo, come back!"}],"reward":{"gil":935,"items":[{"num":2,"id":36036,"one":1},{"num":2,"id":36037,"one":1},{"num":2,"id":36038,"one":1},{"num":2,"id":36039,"one":1},{"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70018]},"next":[70024]},"partials":[{"type":"npc","id":"1041682","obj":{"i":1041682,"n":"Shaggles","l":3708,"q":1}},{"type":"npc","id":"1041680","obj":{"i":1041680,"n":"Shaggles","l":3708,"q":1}},{"type":"item","id":"36036","obj":{"i":36036,"n":"Archon Loaf","l":520,"c":24037,"t":46,"p":3829}},{"type":"item","id":"36037","obj":{"i":36037,"n":"Zurek","l":520,"c":24104,"t":46}},{"type":"item","id":"36038","obj":{"i":36038,"n":"Amra Salad","l":525,"c":24166,"t":46}},{"type":"item","id":"36039","obj":{"i":36039,"n":"Amra Lassi","l":525,"c":24454,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"70018","obj":{"i":70018,"n":"Pests Be Gone","g":121,"l":"Labyrinthos","s":1193}},{"type":"quest","id":"70024","obj":{"i":70024,"n":"Thick as Thieves","g":121,"l":"Labyrinthos","s":9210}}]}