{"quest":{"name":"Lost Little Troll","location":"Labyrinthos","id":70016,"patch":6.0,"sort":1191,"icon":101077,"unlocksFunction":1,"eventIcon":71341,"issuer":1041667,"target":1041670,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The distracted archivist seems troubled.","N'welhi Tia asks for your help in reclaiming a certain specimen that has fled the Archeion. You agree to search the thirty-third facet for any tiny trolls gone astray.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You fail to find the troll, but you have yet to search the entirety of the tunnel. You continue on, just in case.","Having scrutinized the facet, it is evident the troll is nowhere to be seen. Perhaps he stayed nearer the Archeion.","N'welhi Tia tells you he's met someone who claims to have spotted the specimen. According to this eyewitness report, a troll of diminutive size is lurking in Mornveil Forest.","N'welhi Tia informs you that he's found a set of tracks which belong to the missing specimen. The troll must be somewhere nearby...","You locate Shaggles, only to find him under attack from his fellow trolls. As they are exponentially larger, it is a fight that Shaggles could not win alone. Fortunately, you are there to protect him, and have hopefully taught the older trolls to pick on someone their own size.","Unlike N'welhi Tia, you soon realize you are able to understand Shaggles when he speaks. He is, in fact, rather knowledgeable, and remarks that you are likely able to understand him due to the Echo. He quickly explains that he had set out to try and prevent woodworms from overrunning the Archeion and, upon learning this, N'welhi Tia requests your continued aid in ridding the facility of said pests."],"objectives":["Search for the specimen at the designated location.","Rendezvous with N'welhi Tia.","Speak with N'welhi Tia.","Search for Shaggles and slay his attackers.","Aid Shaggles."],"dialogue":[{"name":"NWELHITIA","text":"Oh deary me..."},{"name":"NWELHITIA","text":"My sweetest Shaggles─ Er, one of the Archeion's precious samples has fled!"},{"name":"NWELHITIA","text":"(-N'welhi Tia-)...You have no idea what I'm talking about, do you? My apologies. I'm N'welhi Tia, an archivist."},{"name":"NWELHITIA","text":"(-N'welhi Tia-)The Archeion is home to various samples collected from all across the star, and one such specimen has just escaped!"},{"name":"NWELHITIA","text":"(-N'welhi Tia-)A young troll, to be specific. Oh, I hope he hasn't been set upon by the local predators."},{"name":"NWELHITIA","text":"(-N'welhi Tia-)Listen─I promise to compensate you, so could you please help me retrieve the specimen?"},{"name":"NWELHITIA","text":"(-N'welhi Tia-)My thanks! I will continue my search of this area. I'd like you to check the thirty-third facet."},{"name":"NWELHITIA","text":"(-N'welhi Tia-)Once you've had a comprehensive look about, please meet me at the Archeion to report your findings."},{"name":"SYSTEM","text":"You see no trolls great or small. Perhaps a bit further in..."},{"name":"SYSTEM","text":"The errant troll is nowhere to be seen. N'welhi Tia may have had better luck."},{"name":"NWELHITIA","text":"I see. I was unable to find the specimen either..."},{"name":"NWELHITIA","text":"However, I did meet someone who claimed to have seen it in Mornveil Forest. Let us head there and see if we can track it down."},{"name":"NWELHITIA","text":"Yes, there can be no doubt. These are Shaggles's footprints."},{"name":"NWELHITIA","text":"Ahem. I have uncovered the specimen's trail. It should be close. If you find it under threat from the local fauna, you may dispatch its assailants."},{"name":"NWELHITIA","text":"Oh no! Poor Shaggles has been set upon by trolls. Trolls! Quick, to the rescue!"},{"name":"NWELHITIA","text":"We must tend to Shaggles."},{"name":"NWELHITIA","text":"Oh, I'm so glad you're unharmed."},{"name":"NWELHITIA","text":"You're all safe now. Come on, let's go home, sweetie."},{"name":"LITTLETROLL","text":"Grrrlence, buffoon! Grrr..."},{"name":"LITTLETROLL","text":"The Archeion is under threat! I must do something. Grrr!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You can talk?"},{"name":"A1","text":"What is this threat?"},{"name":"NWELHITIA","text":"Grrr! You can understand me?"},{"name":"NWELHITIA","text":"Wait, are you able to communicate with him?"},{"name":"NWELHITIA","text":"Incredible! I've never met someone with such a skill before."},{"name":"NWELHITIA","text":"This bundle of joy was born in Labyrinthos. However, he was abandoned by his mother and in quite the state by the time we found him."},{"name":"NWELHITIA","text":"He possesses remarkable intelligence for one of his kind. We've elected to use him as part of a study into the effects of growing up in an artificial environment."},{"name":"NWELHITIA","text":"I had seen him making gestures that indicated he'd been reading the tomes here, but I thought he was just copying those around him. To think he actually understands speech..."},{"name":"NWELHITIA","text":"Though I do wonder exactly why you are able to understand him and I am not."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I'm sort of special."},{"name":"A2","text":"It's a secret."},{"name":"NWELHITIA","text":"Really? Oh, what I wouldn't give to understand him too..."},{"name":"LITTLETROLL","text":"Grrr... You possess the Echo, don't you? I find it difficult to grrr the way your kind do, but I suppose it makes sense that you understand my general sentiments."},{"name":"LITTLETROLL","text":"I happened to learn of said power from the tomes in the Archeion. Honestly, that buffoon over there is surrounded by a sea of knowledge and he makes no effort to engage with it. Grrr!"},{"name":"LITTLETROLL","text":"At any rate, I'm glad to finally have someone to talk to. As I was saying earlier, the Archeion is in grave danger."},{"name":"LITTLETROLL","text":"Some grrrless gleaner managed to bring woodworms in with them during a visit. If we leave them be, they're bound to cause irreparable damage to the materials at the facility!"},{"name":"LITTLETROLL","text":"I tried my best to tell that buffoon, but it was no use. That's why I took a chance and went in search of some of my own kind to see if they would help, but you saw how that turned out..."},{"name":"NWELHITIA","text":"Well, what is he saying?"},{"name":"NWELHITIA","text":"Oh deary me!"},{"name":"NWELHITIA","text":"Still, it was most courageous of him to try and solve the issue on his own."},{"name":"NWELHITIA","text":"Now that we're aware of it, we need to sort out this pest problem at once."},{"name":"NWELHITIA","text":"Would you mind helping out a little longer? You're the only one who can understand him, after all, and he seems malms ahead of us with regard to the situation at hand..."}],"reward":{"gil":935,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69901]},"next":[70017]},"partials":[{"type":"npc","id":"1041667","obj":{"i":1041667,"n":"Distracted Archivist","l":3708,"q":1}},{"type":"npc","id":"1041670","obj":{"i":1041670,"n":"Shaggles","l":3708,"q":1}},{"type":"quest","id":"69901","obj":{"i":69901,"n":"The Full Report, Warts and All","g":11,"l":"Labyrinthos","s":519}},{"type":"quest","id":"70017","obj":{"i":70017,"n":"Problematic Pests","g":121,"l":"Labyrinthos","s":1192}}]}