{"quest":{"name":"Where Familiars Dare","location":"Elpis","id":70012,"patch":6.0,"sort":20,"icon":112448,"unlocksFunction":1,"eventIcon":71341,"issuer":1041271,"target":1041501,"genre":26,"journal":["Themis is eager to commence the investigation into Pandæmonium.","Themis suggests that you journey to Pandæmonium together, both because it will be easier for you to gain access to the sensitive area and because you seem to be the “star” that was foretold by Themis's colleague. The first order of the day is to receive permission from the Words of Lahabrea, which Themis assures you should be a simple matter.","As Themis promised, your entry into Pandæmonium is granted without issue. While the member of the Words of Lahabrea assures you that any major irregularities in the facility are seen to by Lahabrea himself, Themis seems nonetheless eager to continue his own investigation into matters.","As you and Themis step foot into Pandæmonium, he reveals that something or someone within is working to erode the chains and barriers which keep the creatures locked away. Though Themis uses his own magic to strengthen the protections for the moment, he suggests you seek one of the warders to gain a more thorough understanding of how the situation might be resolved. He further explains that although he cannot participate directly in battle without relinquishing his focus on the wards, he can create warriors based on your aether to aid you, should it come to that.<br><br>※Asphodelos: The First Circle can be accessed via the Duty Finder.","Not long after you begin your search, a man wearing warders' garb rushes toward you, shouting an angry challenge before transforming into a towering vision of punitive might. After a pitched battle, you emerge victorious, and await his return to consciousness.","The warder introduces himself as Erichthonios, and it seems he scarcely remembers the moments leading up to your conflict. What he can tell you is that Asphodelos─the level of Pandæmonium closest to the surface─has become overrun by monsters, and that he became separated from his colleagues in the chaos. Concerned for their safety, he begs Themis to withhold his report to the Convocation so that he can be afforded time to rescue them ere the facility is obliterated. Although Themis cannot openly shirk his duties, he states that his investigation is yet incomplete, and the two of you agree to delve further into the hellish dungeon in search of survivors─and answers."],"objectives":["Speak with the Words of Lahabrea speaker.","Speak with Themis.","Enter Asphodelos: The First Circle.","Speak with Themis."],"dialogue":[{"name":"THEMIS","text":"Now then, my proposal is a simple one: let us journey to Pandæmonium together. Our destination is the same, and I suspect the arrangement would work to our mutual benefit."},{"name":"THEMIS","text":"Besides, I should have no trouble gaining us both access. I do hope you agree─I would be loath to part ways from the falling star I had been waiting so long for."},{"name":"THEMIS","text":"Originally I had planned to conduct my investigation with the friend I mentioned earlier. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> had also noticed the anomaly near Pandæmonium, so it only seemed natural that we should investigate it together."},{"name":"THEMIS","text":"However, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> eventually decided that it would be unwise for us both to go. If two members of our organization were seen poking our heads about restricted facilities, it could raise questions, you see."},{"name":"THEMIS","text":"I decided to go alone, but <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> left me with these words: “Fear not, for in my absence a star shall fall before you.”"},{"name":"THEMIS","text":"While I could not comprehend <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> meaning at the time, I believe now I understand. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> does have a way of being right about these things. "},{"name":"THEMIS","text":"Even so, <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> hints of what to come are generally more cryptic. I suppose I should have kept my gaze to the heavens."},{"name":"THEMIS","text":"Suffice it to say that I am grateful for your presence either way. As for the matter at hand, we must first gain permission from the Words of Lahabrea for entry into Pandæmonium. There ought to be a speaker waiting at Anagnorisis..."},{"name":"THEMIS","text":"I sent a request for permission before setting forth to Elpis. With luck we shall not be waiting long."},{"name":"STAFF04476","text":"What a fascinating aetheric signature... Ahem. In accordance with the Convocation's request, the two of you have been granted leave to observe Pandæmonium."},{"name":"STAFF04476","text":"I shall register your aether for the records. From this point on, you may freely come and go from Pandæmonium as you please."},{"name":"THEMIS","text":"Now, that was a painless process. I take this as a sign that we were meant to conduct our investigations together."},{"name":"STAFF04476","text":"Of course, while you have been permitted entry into the facility, the specimens housed inside must be handled with the utmost care. You are to heed the warders' instructions at all times."},{"name":"THEMIS","text":"Those who conduct their work within Pandæmonium are called “warders” for their role with respect to the creatures within."},{"name":"STAFF04476","text":"Generally, creations that pose a threat to the safety of the star must be undone. However, the Words of Lahabrea has deemed certain such creations as worthy of further study, interring them within the facility."},{"name":"STAFF04476","text":"Those who spend their days in Pandæmonium are not merely researchers─they must work tirelessly to ensure that none of their subjects slip their shackles."},{"name":"THEMIS","text":"For all intents and purposes, the place is a dungeon. Perhaps such a comparison arouses frightful imagery, but Pandæmonium is a frightful place."},{"name":"STAFF04476","text":"I know not the purpose of your investigation, but if you discover aught that merits a report, pray do so with utmost haste. Master Lahabrea shall guide us upon the proper course of action from there."},{"name":"THEMIS","text":"Then I take it that means you have detected nothing amiss as of late?"},{"name":"STAFF04476","text":"The warders have reported nothing that would cause alarm. Minor fluctuations in aether have been observed, but surely Master Lahabrea would have acted if they were anything worth worrying about."},{"name":"THEMIS","text":"I see. It appears Lahabrea is kept well abreast of the goings-on here, then..."},{"name":"STAFF04476","text":"I hope I am not overstepping my boundaries by asking, but... You seem to be quite familiar with Master Lahabrea. Do you know him?"},{"name":"Q3","text":"What will you say?"},{"name":"A1","text":"Know him? We've met."},{"name":"A2","text":"Oh, the stories I could tell you..."},{"name":"STAFF04476","text":"...That a mere familiar would have had the honor to meet Master Lahabrea! He is not known to easily afford others his time, so you must be extraordinary indeed to be granted even a moment of it."},{"name":"STAFF04476","text":"You are no mere familiar, are you? Master Lahabrea is not known for being generous with his time─that one would have “stories” of his company almost beggars belief."},{"name":"STAFF04476","text":"Regardless, while I doubt I need to tell you this, he is of the Convocation. Take care that your actions do not hinder his work."},{"name":"THEMIS","text":"And with that, we are free to make our way to Pandæmonium. The neus that will take us there is on the eastern bank of Lethe─let us delay no further."},{"name":"STAFF04476","text":"Pandæmonium can be reached via the neus on the island to the northeast. I suggest you hurry before your companion leaves you behind."},{"name":"THEMIS","text":"I had to contain my surprise for the sake of appearances, but is it true that you too have met Lahabrea in the flesh? I find you more fascinating by the moment..."},{"name":"THEMIS","text":"Still, I shall refrain from asking too many questions. Secrets will make our journey all the more intriguing."},{"name":"THEMIS","text":"We shall come to know each other in time, I wager. Or else why would fate have orchestrated our meeting?"},{"name":"THEMIS","text":"In any case, let us be off. Truth be told, this will be my first time beholding the fabled Pandæmonium with my own eyes. Here's to a new adventure, eh?"},{"name":"SYSTEM","text":"Teleport to Pandæmonium?"},{"name":"THEMIS","text":"It is much as I feared..."},{"name":"THEMIS","text":"The speaker seemed in such high spirits that for a moment I thought the aetherial irregularity not nearly so grave a portent as I had imagined... Alas, 'twas a fleeing and vain hope."},{"name":"THEMIS","text":"To gaze upon this complex network of chains and wards, the untrained eye might not sense anything awry. No effort has been spared in making this place impenetrable."},{"name":"THEMIS","text":"Even the finest of masterworks is not without its flaws, however..."},{"name":"THEMIS","text":"Someone, or something, is tampering with the protections."},{"name":"THEMIS","text":"It is working from within, eroding them from the inside out."},{"name":"THEMIS","text":"Fear not─there is no immediate danger. I reinforced what protections I could the moment we arrived."},{"name":"THEMIS","text":"This will not put an end to whatever is occurring, but it shall at least serve to slow its progress. One small victory─though the road ahead of us is yet long."},{"name":"THEMIS","text":"Yes... Powerful forces are at work here."},{"name":"THEMIS","text":"The silence in the air speaks volumes. While I did not expect a bustling facility, I see not a single warder."},{"name":"THEMIS","text":"Our first course of action should be to seek one out, wherever they may be."},{"name":"THEMIS","text":"However, there is something you must know..."},{"name":"THEMIS","text":"The magic I wove upon entering requires my constant awareness. That is to say─if we are forced to fight, I cannot risk joining you in battle."},{"name":"THEMIS","text":"Should I lose focus, Pandæmonium's protections will rapidly crumble before the force assailing them."},{"name":"THEMIS","text":"Were there another way, I would gladly choose it─but let us at least be grateful that neither of us is here alone, trapped in hopeless circumstances."},{"name":"THEMIS","text":"If we should fail to find a peaceable solution, then I hope that I can rely on your strength to see us through."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Of course. You have my promise."},{"name":"A2","text":"This request doesn't come as a surprise, to be honest."},{"name":"THEMIS","text":"Thank you for offering your help so willingly. If weapons are drawn, I hope to be able to lend at least a touch of magical support."},{"name":"THEMIS","text":"At least you received it with good humor. Rest assured I do not mean to stand by idly while you risk life and limb─I hope to be able to lend at least a touch of magical support."},{"name":"THEMIS","text":"Creation magicks do have their uses in that regard. I had it in mind to use your aether as basis for illusory allies that will fight at your side."},{"name":"THEMIS","text":"Perhaps...seven shall do. Not exactly an army, but by the looks of you, a formidable band nonetheless."},{"name":"THEMIS","text":"Then so shall it be. Now...what, I wonder, awaits us in Pandæmonium's pitiless halls?"},{"name":"THEMIS","text":"I cannot say for sure what awaits us. Let us make ready for the worst, and we shall not be taken by surprise."},{"name":"THEMIS","text":"That was a thrilling display! And if I may be so vaunting, the warriors I spun from your aether fought even more splendidly than I had anticipated. I suppose they were cut from excellent cloth, after all."},{"name":"THEMIS","text":"We should wait until this man regains his senses. He wears the robes of a warder, and I would be very curious to know what drove him to attack us sight unseen."},{"name":"THEMIS","text":"<span class=\"highlight\">Forename</span>. He stirs."},{"name":"ERICHTHONIOS","text":"What...what came over me?"},{"name":"ERICHTHONIOS","text":"It... It's coming back to me... My mind was filled with a storm of desperation...anger... I leapt at you, though I knew naught of your intentions..."},{"name":"ERICHTHONIOS","text":"Pray accept my apologies. And my thanks. Had you not knocked some sense back into me, I may have fallen upon someone less capable of defending themselves."},{"name":"ERICHTHONIOS","text":"I am Erichthonios, a warder of Asphodelos─Pandæmonium's highest layer, and the place we're in now."},{"name":"THEMIS","text":"One must wonder why you were so desperate to keep us out. What is happening in Pandæmonium?"},{"name":"ERICHTHONIOS","text":"The creations interred within Asphodelos have been set free, and stalk its halls to no end but violence."},{"name":"THEMIS","text":"That is...not good, to say the least. Has this ever happened before?"},{"name":"ERICHTHONIOS","text":"No, never. Each level of Pandæmonium is under the charge of a keyward, who keeps strict control over the most minute aspects of their domain. They're selected with great care, and their loyalty to Master Lahabrea is absolute..."},{"name":"ERICHTHONIOS","text":"Yet something has gone terribly wrong. Try as we might to hold the line, the chaos within is overwhelming... I hardly realized that I had become separated from my colleagues."},{"name":"ERICHTHONIOS","text":"I remember a chorus of whispers assailing my senses, and afterwards only flashes of rage and fury. Then blackness...from which I awoke to find that whatever had overcome me was gone."},{"name":"THEMIS","text":"I see... Your senses may have been muddled by magicks that affect the mind─perhaps the selfsame ones that saw you separated from the other warders."},{"name":"ERICHTHONIOS","text":"Whatever had taken hold of me, thank you for releasing me from its clutches. That you've come here from the surface must mean some word of our plight has reached the outside world. If you know anything that may help, pray tell. "},{"name":"ERICHTHONIOS","text":"Horror among horrors... So Pandæmonium's protections are indeed being dismantled from within."},{"name":"THEMIS","text":"By the same individual─or individuals─that released its captives and set them upon you, no doubt. Such knowledge avails us little, however, if we cannot ascertain their identity."},{"name":"ERICHTHONIOS","text":"...Themis, was it? You said you worked for an organization under the auspices of the Convocation. Were they to receive word of what has transpired here, what measures would they take?"},{"name":"THEMIS","text":"Doubtless they would consider this place to be a lost cause. Pandæmonium's ties to the outside world would be severed, or perhaps it would be wiped from existence entirely."},{"name":"ERICHTHONIOS","text":"As I thought. Were the creatures to escape into the outside world, there would be untold carnage. The Words of Lahabrea would never risk that, despite what value the research subjects may hold."},{"name":"ERICHTHONIOS","text":"All the more reason to work with haste. If we can't expect further help, then it falls upon me to save the others. I'll not leave them behind!"},{"name":"THEMIS","text":"...You would go alone?"},{"name":"ERICHTHONIOS","text":"I won't leave the other warders to face certain doom."},{"name":"ERICHTHONIOS","text":"I know they fight for survival even now. They wouldn't abandon their duty─they would see the creatures returned to their cells at all costs."},{"name":"ERICHTHONIOS","text":"And so I must do the same. Themis, I know the request I'm about to make of you is a monumental one, but please...say not a word of this to the Convocation until I've been given a chance to set things right."},{"name":"THEMIS","text":"...Forgive my rudeness, Erichthonios, but my decision cannot be swayed by emotion. You would only be consigning yourself to an early death─strength of resolve alone cannot win in the face of overwhelming odds."},{"name":"THEMIS","text":"That being said, our investigation has only just begun, and we would be remiss to turn back ere we've made an exhaustive survey. So, for the time being, there is slightly more than resolve to rely upon."},{"name":"THEMIS","text":"Heh... I knew you would be all too eager to join us."},{"name":"THEMIS","text":"Each moment since you fell from the skies has been more interesting than the last. More and more you remind me of my dear friend."},{"name":"THEMIS","text":"...Which goes some way toward encouraging me that this matter will yet reach a satisfactory conclusion."},{"name":"ERICHTHONIOS","text":"So you...agree to help?"},{"name":"THEMIS","text":"For the moment, our goals align. The protective magicks of Pandæmonium yet hold, so for the moment time is in our favor. Let us proceed upon the course you and <span class=\"highlight\">Forename</span> have set us upon."},{"name":"ERICHTHONIOS","text":"Themis and...<span class=\"highlight\">Forename</span>, yes? Thank you. The warders owe you a great debt already."},{"name":"THEMIS","text":"We shall be glad to have someone familiar with Pandæmonium's halls by our side. A party of three is ever so much more entertaining than a pair of two."},{"name":"THEMIS","text":"Now, let us turn our attention to rescuing your colleagues. Perhaps it would be wise to approach the gates, in case any have followed you out."}],"reward":{"gil":3000,"items":[{"num":5,"id":33929},{"num":3,"id":33918,"one":1},{"num":3,"id":33919,"one":1},{"num":3,"id":33920,"one":1}],"instance":30111},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70011]},"next":[70013]},"partials":[{"type":"npc","id":"1041271","obj":{"i":1041271,"n":"Themis","l":3713,"q":2}},{"type":"npc","id":"1041501","obj":{"i":1041501,"n":"Themis","l":4033,"q":1}},{"type":"item","id":"33929","obj":{"i":33929,"n":"Quicktongue Materia IX","l":560,"c":20282,"t":58,"materia":{"tier":8,"value":12,"attr":"Spell Speed","category":0}}},{"type":"item","id":"33918","obj":{"i":33918,"n":"Heavens' Eye Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"33919","obj":{"i":33919,"n":"Savage Aim Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Critical Hit","category":0}}},{"type":"item","id":"33920","obj":{"i":33920,"n":"Savage Might Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Determination","category":0}}},{"type":"instance","id":"30111","obj":{"i":30111,"n":"Asphodelos: The First Circle","c":61802,"t":"Raids","min_lvl":90,"max_lvl":90,"min_ilvl":565}},{"type":"quest","id":"70011","obj":{"i":70011,"n":"The Crystal from Beyond","g":26,"l":"Old Sharlayan","s":19,"f":1}},{"type":"quest","id":"70013","obj":{"i":70013,"n":"Under the Surface","g":26,"l":"The Gates of Pandæmonium","s":21,"f":1}}]}