{"quest":{"name":"Under the Surface","location":"The Gates of Pandæmonium","id":70013,"patch":6.0,"sort":21,"icon":112450,"unlocksFunction":1,"eventIcon":71341,"issuer":1041276,"target":1041502,"genre":26,"journal":["Erichthonios is peering into the depths of Pandæmonium.","It transpires that Erichthonios's aim is not only to see his colleagues rescued, but also have the creatures contained within Pandæmonium returned to their confinement rather than destroyed. In pursuit of this goal, Themis agrees to lend the warder a portion of his power that he might use the powerful interment spell. As interment is usually only performed by the keywards, this stratagem must be tested first─upon the hippokampos which Erichthonios saw skulking in the waterways. The question of who is responsible for weakening the creature ere it is recaptured is a foregone conclusion.<br><br>※Asphodelos: The Second Circle can be accessed via the Duty Finder.","You find the hippokampos in the waterways as Erichthonios said, and quickly subdue it with the help of the illusive warriors. Themis and Erichthonios then succeed in sealing it away─meaning that there is yet hope to bring order to Pandæmonium without sacrificing warder nor inmate.","Erichthonios is all too happy to place most of the credit for your success with you and Themis. Nevertheless, he seems confident and eager to journey deeper into Pandæmonium, where yet more creatures await."],"objectives":["Enter Asphodelos: The Second Circle.","Speak with Erichthonios."],"dialogue":[{"name":"THEMIS","text":"It seems our investigation will be quite the ordeal after all. Still, I find it hard to believe that Lahabrea knows naught of what has transpired here. Whoever the mastermind of this crisis is, they do not lack for power and cunning."},{"name":"ERICHTHONIOS","text":"Not a sound can be heard from within, which means neither creature nor warder has made it this far. We should begin forming a plan to save them at once."},{"name":"THEMIS","text":"...Forgive me if I misunderstand, but do you mean to rescue the warders and creations both?"},{"name":"ERICHTHONIOS","text":"Naturally. Although they may be dangerous, they're valuable research subjects. I wouldn't see our labor─our untold hours of study─go to waste."},{"name":"THEMIS","text":"I daresay Lahabrea would smile to hear you say such a thing. That is, if we had cause to report this incident to him."},{"name":"ERICHTHONIOS","text":"Smile? I'm not sure his face is capable of such warmth."},{"name":"THEMIS","text":"...Ah, so you have met him before? I was under the impression he rarely visited Pandæmonium."},{"name":"ERICHTHONIOS","text":"I have, yes. My mentor was the previous head of this facility─that is to say, Lahabrea's predecessor in the position of chief keyward."},{"name":"ERICHTHONIOS","text":"Her name was Athena, and she was a researcher with the Words. 'Twas she who appointed me to this position, in fact."},{"name":"THEMIS","text":"I see... I did not know there was a chief keyward before Lahabrea. Your motivation to save your research subjects is not entirely driven by duty to the Words, then─you wish also to preserve the work of your mentor."},{"name":"ERICHTHONIOS","text":"You've the right of it. I'm lacking in ideas of how to go about that, however. I'm a mere warder, and cannot wield interment magicks."},{"name":"ERICHTHONIOS","text":"Ah, but of course I can hardly expect you to be versed in the magicks we use here. If you recall, during our battle earlier I bound you in aetherial shackles. Interment is a more refined and powerful magick based upon the same principles."},{"name":"ERICHTHONIOS","text":"While both are used to keep our subjects docile, only the keyward of each tier is permitted to use interment. Even if I were allowed, I lack the aptitude to use the spell to any notable effect."},{"name":"THEMIS","text":"Fascinating. I have some knowledge of these forms of spellcraft, actually. Lahabrea himself established their foundation, if I recall."},{"name":"THEMIS","text":"While shackles are meant to bind an object in place for a short time, interment freezes the very space around it for as long as the caster wills."},{"name":"ERICHTHONIOS","text":"Indeed. While the illusory beings you summoned in our fight suggested as much, I see your knowledge of magic is vast. Perhaps you've already mastered the art of interment, and I've been lecturing you like a child all this time..."},{"name":"THEMIS","text":"I am afraid my knowledge ends there. I have not the precise understanding of how the invocations interact with natural laws that would be needed to cast said spells with any consistency."},{"name":"THEMIS","text":"While I consider myself well versed in various magicks, I would be ill advised to assume the duties of keyward without instruction. That being said, if I were to learn more of interment and its inner workings, perhaps..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Well, you have a warder standing in front of you."},{"name":"A2","text":"Leave the fighting to me. You two can figure out the rest."},{"name":"THEMIS","text":"Well, the solution is obvious when you put it like <span class=\"emphasis\">that</span>."},{"name":"THEMIS","text":"Hmm... I daresay <span class=\"emphasis\">we</span> can do just that."},{"name":"THEMIS","text":"Erichthonios, you implied that what prevented you from performing interment was lack of magical capacity. What if I supplemented your power with my own? Would the spell succeed then?"},{"name":"ERICHTHONIOS","text":"I...I can't say for certain. I've never heard of such a thing being done."},{"name":"THEMIS","text":"I believe it may be our best recourse. That is, of course, assuming you can perform the initial rites and incantations flawlessly. Even the smallest misstep and we would have to start over."},{"name":"ERICHTHONIOS","text":"You needn't worry about that. I've seen the spells cast so many times that their motions have been burned into my memory. I won't disappoint."},{"name":"THEMIS","text":"Very well, let us work out the specifics afterwards. Once we do, we can test out our methods on one of the escaped creatures─though I suppose there is the matter of finding one..."},{"name":"THEMIS","text":"It would be foolish to rush in blindly, lest we find ourselves surrounded with naught but an untested stratagem at our disposal. Nay─I would prefer to engage a single creature that <span class=\"highlight\">Forename</span> could dispatch on <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> own if the spell were to go awry."},{"name":"ERICHTHONIOS","text":"I agree─and I may have an idea in that regard. I recall seeing the hippokampos wandering the waterways during my flight. Perhaps it's still there."},{"name":"ERICHTHONIOS","text":"Few of the subjects housed within Asphodelos are fond of water, and I believe we'll be able to engage the beast without fear of unwanted guests."},{"name":"THEMIS","text":"Then that shall be our first target─or perhaps “subject” is a better term. Before we commence with the interment magicks, the creature should be weakened to a sufficient degree. I believe I can trust you with that task."},{"name":"THEMIS","text":"As dependable as ever. Once you have given it a thorough trouncing, we shall bind this hippokampos with the keyward's magic. Until then, my illusions shall fight by your side."},{"name":"ERICHTHONIOS","text":"The hippokampos will be alone, but it's a daunting opponent nonetheless. Its magic warps the environment around it, and it will be at home amidst the waterways. Steel yourself for a fight."},{"name":"THEMIS","text":"I take it we are each ready to fulfill our respective roles. Truth be told, this will be the first time I have practiced magic that requires such a degree of cooperation between parties. How thrilling!"},{"name":"ERICHTHONIOS","text":"Athena ever drove home the fact that our subjects should be treated with the utmost care. 'Twould be best if we could see them confined once again rather than disposed of like beasts gone feral."},{"name":"THEMIS","text":"That was a trial by fire─or water, I suppose─but I had faith we would see it through. So long as we had your stout arm, of course. "},{"name":"ERICHTHONIOS","text":"I knew that you were no mere mercenary, but to make such clean work of the hippokampos... Seasoned fighters scarcely have occasion to visit Pandæmonium, let alone display their skills. Mastery takes all forms, indeed."},{"name":"ERICHTHONIOS","text":"Needless to say, our plan worked to perfection. In no small part thanks to you two."},{"name":"ERICHTHONIOS","text":"Themis's power was more than enough to complete the interment. Spellcasting was never my strong suit, but that almost made me feel like a proper magos."},{"name":"THEMIS","text":"Truly? Having seen your abilities firsthand in your fight with <span class=\"highlight\">Forename</span>, I beg to disagree."},{"name":"ERICHTHONIOS","text":"Shackles is the one exception. And 'tis only because I've been forced to practice it since I was but a small child. Other magicks leave me feeling completely out of my depth."},{"name":"ERICHTHONIOS","text":"Regardless, it seems luck is on my side, to guide me to you. We may prove the impossible possible after all."}],"reward":{"gil":3000,"items":[{"num":5,"id":33921},{"num":3,"id":33918,"one":1},{"num":3,"id":33919,"one":1},{"num":3,"id":33920,"one":1}],"instance":30113},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70012]},"next":[70014]},"partials":[{"type":"npc","id":"1041276","obj":{"i":1041276,"n":"Erichthonios","l":4033,"q":1}},{"type":"npc","id":"1041502","obj":{"i":1041502,"n":"Erichthonios","l":4033,"q":1}},{"type":"item","id":"33921","obj":{"i":33921,"n":"Battledance Materia IX","l":560,"c":20281,"t":58,"materia":{"tier":8,"value":12,"attr":"Tenacity","category":0}}},{"type":"item","id":"33918","obj":{"i":33918,"n":"Heavens' Eye Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"33919","obj":{"i":33919,"n":"Savage Aim Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Critical Hit","category":0}}},{"type":"item","id":"33920","obj":{"i":33920,"n":"Savage Might Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Determination","category":0}}},{"type":"instance","id":"30113","obj":{"i":30113,"n":"Asphodelos: The Second Circle","c":61802,"t":"Raids","min_lvl":90,"max_lvl":90,"min_ilvl":565}},{"type":"quest","id":"70012","obj":{"i":70012,"n":"Where Familiars Dare","g":26,"l":"Elpis","s":20,"f":1}},{"type":"quest","id":"70014","obj":{"i":70014,"n":"The Fires of Creation","g":26,"l":"The Gates of Pandæmonium","s":22,"f":1}}]}