{"quest":{"name":"Who Wards the Warders?","location":"The Gates of Pandæmonium","id":70015,"patch":6.0,"sort":23,"icon":112454,"unlocksFunction":1,"eventIcon":71341,"issuer":1041278,"target":1041934,"genre":26,"journal":["Themis would offer what comfort he can to Erichthonios.","Although Themis respects that Erichthonios may need space after recent events, he is also eager to get the investigation back on track. He suggests lending an ear to Erichthonios's troubles, hoping to give the warder a chance to air his doubts and misgivings.","Erichthonios reveals his fraught past with Lahabrea, his father. Although the gaoler learned the art of shackles from said man, there is little else connecting father and son, and when Erichthonios's mother─previous chief warden of Pandæmonium─passed away, Lahabrea assumed her position with characteristic stoicism. Although there is surely more to the story, Erichthonios changes the subject to Hesperos and the battle ahead. After some discussion, you decide that he should be tracked down with the utmost haste and sealed away with interment magicks, that he might be questioned and his motives made clear. Although Hesperos's mastery of creation magicks means that you must face him in an unfavorable battle, hope ever remains in your heart.<br><br>※Asphodelos: The Fourth Circle can be accessed via the Duty Finder.","Hesperos throws every devious trick he can─along with no small amount of theatrics─at you and your band of illusive heroes, but eventually he falls before your combined might. All that remains is to inter him with the selfsame magic he once held dominion over...","Your hopes to detain Hesperos for questioning are thwarted when he brings an end to his own life, his essence and secrets returning to the star. While this leaves many questions unanswered, Erichthonios is eager to begin rescuing his colleagues and the subjects he is charged with safekeeping. Themis takes control of Asphodelos, but as he does, he senses a presence from deeper within the facility─and no sooner does he inform you of this discovery than a ward appears to block your way forward. Stymied, Themis suggests withdrawing for now, that he might better gauge this new threat.","With room to think, Themis concludes that Hesperos was not the one behind the chaos in Pandæmonium, and suggests that the true mastermind is hiding deeper underground. To progress further, however, you must find a way to surpass the obstruction blocking the entrance to Abyssos, a feat which may take some time. Themis and Erichthonios encourage you to rest until you are needed once more, and perhaps in the meantime return to Aporia to apprise Professor Claudien of your exploits.","Claudien listens to your report on the events in Elpis with both interest and growing concern. He seems convinced that your success in the past is crucial to maintaining the present, and assures you that his team will devote their every effort to aid you. You return the crystal to him so that they can continue their research into its origins, and as your allies in the past have also done, he suggests that you catch some well-earned rest until further developments occur."],"objectives":["Speak with Erichthonios.","Enter Asphodelos: The Fourth Circle.","Speak with Themis.","Speak with Claudien at Aporia."],"dialogue":[{"name":"ERICHTHONIOS","text":"Please...leave me be."},{"name":"THEMIS","text":"Much as I am loath to disturb Erichthonios so soon after what just occurred, I am afraid circumstances do not afford us the luxury of time."},{"name":"THEMIS","text":"Perhaps it will do him well to speak about recent events. Concerning both the keyward...and his father."},{"name":"THEMIS","text":"He seemed reticent to say aught concerning Lahabrea when the subject was broached. Doubtless his relationship with his father is a fraught one."},{"name":"ERICHTHONIOS","text":"The creation of the ward which surrounds Pandæmonium was an astounding feat of magical prowess. A feat accomplished by none other than Lahabrea..."},{"name":"ERICHTHONIOS","text":"That both my father and I can bind others in chains is perhaps the only thing that we have in common."},{"name":"THEMIS","text":"Ah, so it is true."},{"name":"ERICHTHONIOS","text":"Aye, I'm Lahabrea's son. Bereft of his talent for magicks or his brilliant mind, but his son nonetheless. Surely this doesn't come entirely as a surprise to you."},{"name":"THEMIS","text":"Nay... I had an inkling when you said you had practiced aetherial shackles since childhood. Assuming you haven't been employed here <span class=\"emphasis\">quite</span> that long, it had to indicate some long-held connection with Lahabrea."},{"name":"ERICHTHONIOS","text":"'Twas Lahabrea that taught me how to cast aetherial shackles, but that was it. My further education was overseen by the Words of Lahabrea─more specifically my mother, who was a researcher there."},{"name":"ETHEMIS","text":"You did speak of Athena, chief keyward before Lahabrea. She is your mother, yes?"},{"name":"ERICHTHONIOS","text":"How astute. I can see now why you were chosen to lead this investigation."},{"name":"ERICHTHONIOS","text":"You've the right of it. Athena was my mother, and it was she who invited me to join her here. Lahabrea had nothing to do with it."},{"name":"THEMIS","text":"I see there is little love lost between you two. What I cannot see is why Lahabrea was appointed chief keyward when another was already in place."},{"name":"ERICHTHONIOS","text":"...<span class=\"emphasis\">Was</span> in place. My mother is no longer with us."},{"name":"ERICHTHONIOS","text":"And Lahabrea was all too eager to assume her responsibilities, with nary a moment spared to mourn her. What love do I owe him now, when he offered not one drop of compassion then?"},{"name":"THEMIS","text":"Ah...I see. “She is no longer with us.” An expression to convey the end of a life."},{"name":"THEMIS","text":"I have known only the public face of Lahabrea. While he is lauded for his ability to maintain composure in the face of unnerving circumstances, I must admit that oft he comes across as...cold."},{"name":"ERICHTHONIOS","text":"...Apologies, but can we speak of something else? This topic isn't an easy one for me to discuss..."},{"name":"THEMIS","text":"Of course. There are more pressing matters at hand, after all. Namely, how to deal with Hesperos."},{"name":"THEMIS","text":"We have yet to see the other warders. Judging by what we know, we can surmise that Hesperos has confined them somewhere beyond our grasp."},{"name":"THEMIS","text":"And now that he is aware of our presence, he will be preparing for our next encounter. We cannot expect to face him on equal footing. Quite the opposite, in fact."},{"name":"THEMIS","text":"Every moment we spend chasing after the creations is another moment Hesperos can contrive another advantage for himself. The wisest course would be to find him first and foremost."},{"name":"ERICHTHONIOS","text":"He said that he has become one with the creations...perhaps that means he is vulnerable to interment?"},{"name":"THEMIS","text":"In theory, that should be possible. However, is it enough merely to confine him? After all he has done?"},{"name":"ERICHTHONIOS","text":"I need to know why. I need to know what drove him to forsake everything he's worked for."},{"name":"ERICHTHONIOS","text":"Was it all truly so that he could serve his master? To my mind, he's merely put Lahabrea's own work at risk in trade for some nebulous power."},{"name":"ERICHTHONIOS","text":"Lahabrea is the chief keyward of Pandæmonium─how would throwing it into disarray win his favor? It doesn't make any sense..."},{"name":"THEMIS","text":"I share your curiosity, but we must consider that our enemy has us at a disadvantage in every sense. ...What do you think? Should we seek to put him in fetters, or would it be too dangerous to allow him quarter?"},{"name":"Q2","text":"What will you say?"},{"name":"A1","text":"I want answers too."},{"name":"A2","text":"If you fail to confine him, I can always strike him down."},{"name":"THEMIS","text":"Daring as ever, I see. I know not which trials you have faced in your past, but to see you so certain is all the convincing I need. Very well, let us try Erichthonios's plan."},{"name":"ERICHTHONIOS","text":"Thank you, <span class=\"highlight\">Forename</span>."},{"name":"ERICHTHONIOS","text":"I believe I can shed some light on the nature of our foe. When Hesperos spoke with us, I noticed he bore the telltale fangs of the vrykolakas, a beast which feeds off the aether of its prey. Likely that is the creation Hesperos merged his essence with."},{"name":"THEMIS","text":"And we know all too well that he can change the environment around himself at will. The battle will not be an easy one, but I believe in our victory."},{"name":"ERICHTHONIOS","text":"That Hesperos possessed such a lust for power that he would resort to this... Clearly I misjudged him. I'd like nothing more than to strike him down myself, but seeing you wipe that arrogant grin off his face will taste just as sweet."},{"name":"ERICHTHONIOS","text":"He called himself a hemitheos, and claimed immortality. I know not how he discovered this dark art, but his actions do not bespeak a sound mind."},{"name":"ERICHTHONIOS","text":"Now, Themis. We end this here!"},{"name":"HESPEROS","text":"Fools... I will not be put in chains..."},{"name":"HESPEROS","text":"To think that I would fall before one such as you. Perhaps I should have treated you as more than a mere nuisance."},{"name":"HESPEROS","text":"Despite your victory, you shall never have the knowledge you seek. The secrets of my transformation, the secrets of my deception─they shall return to the star with me!"},{"name":"THEMIS","text":"You are wasting your breath, Hesperos. We have the upper hand now, surely you can see that."},{"name":"HESPEROS","text":"Yes, yes. My repertoire is not exhausted yet, however... Although I have failed, my end shall be on my terms."},{"name":"HESPEROS","text":"I remain loyal to my very last... Come what may, I die...with dignity..."},{"name":"ERICHTHONIOS","text":"...How did your ambition lead you so astray, Hesperos? You were better than that."},{"name":"ERICHTHONIOS","text":"Your star shone more brightly than any other in Pandæmonium. You had Lahabrea's respect, his trust─what more did you seek? That you would forsake all that, and sully your legacy besides..."},{"name":"THEMIS","text":"He became so blinded by his own desires that he lost sight of his duty. In the end, he lost everything, and his plans lie in tatters. I fail to see any dignity in that."},{"name":"ERICHTHONIOS","text":"Even so, I would have liked to know why he chose this path."},{"name":"THEMIS","text":"Hesperos's infatuation with your father was his undoing. Perhaps he was jealous that fate had chosen you, and not him, to be Lahabrea's son. So terrible did this jealousy become that he sought verboten power─power that Lahabrea would be unable to ignore."},{"name":"ERICHTHONIOS","text":"How does a pursuit for respect warp one's heart so? How does infatuation with one person turn into contempt for everyone else? I've never heard of such a thing."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It's not as uncommon as you might think."},{"name":"A2","text":"It happens, but that doesn't mean it's right."},{"name":"ERICHTHONIOS","text":"I see... I admit I cannot but find it vexing, but perhaps that signifies naught but my <span class=\"emphasis\">own</span> capacity for bitterness..."},{"name":"ERICHTHONIOS","text":"I do understand what it is to have a beacon to follow in dark times─a person you trust to guide you true. How it is to desperately wish their light would fall upon you again."},{"name":"ERICHTHONIOS","text":"...But we have spent enough time assuming the intentions of the departed─there are the living to consider. We must find the other warders and round up the remaining creations forthwith. Of that, at least, we can be certain."},{"name":"THEMIS","text":"I believe I can be of help in that matter."},{"name":"THEMIS","text":"The influence of Hesperos's magic is fading throughout Asphodelos. Now is the perfect opportunity to seize control of the facilities and restore things to their original state."},{"name":"ERICHTHONIOS","text":"Seize control...? Can you really do that?"},{"name":"THEMIS","text":"What!? What is this presence?"},{"name":"THEMIS","text":"Erichthonios. What lies beyond that threshold?"},{"name":"ERICHTHONIOS","text":"That's the passage which connects Asphodelos to Abyssos. Why?"},{"name":"THEMIS","text":"Be on your guard, you two."},{"name":"THEMIS","text":"Now that Asphodelos is free of obstructions, I can more easily sense disturbances in the lower levels. Something stirs in Abyssos!"},{"name":"ERICHTHONIOS","text":"A warding sigil? How!?"},{"name":"THEMIS","text":"Let us return to the gates for now. I should like to appraise the situation from there."},{"name":"THEMIS","text":"Needless to say, our investigation is far from over."},{"name":"ERICHTHONIOS","text":"Just when I had thought our work to be done... Did this tragedy unfold all throughout Pandæmonium?"},{"name":"THEMIS","text":"Although we have defeated Hesperos, it appears we have but scratched the surface of Pandæmonium's troubles."},{"name":"ERICHTHONIOS","text":"My head is still swimming with questions, but could this mean that Hesperos wasn't actually behind this?"},{"name":"THEMIS","text":"It is a stark possibility, yes. The root of this crisis may lie somewhere much deeper than even Abyssos."},{"name":"THEMIS","text":"When we first encountered you, you said the memories of your escape were vague and that your senses were muddled. I believe this was more than the result of a panicked mind─you were made to feel this way by a powerful magical influence."},{"name":"THEMIS","text":"It is possible that this same magic could have poisoned Hesperos's heart, twisting his affection for Lahabrea into a burning obsession. Then, in his altered state, he was made an offer of power he could not refuse..."},{"name":"ERICHTHONIOS","text":"Wait... Are you suggesting that someone else turned Hesperos into that...thing? If so, it stands to reason that they wouldn't stop at him..."},{"name":"THEMIS","text":"Indeed. Our mysterious mastermind does not lack for subjects for his experiments. For more potential hemitheoi."},{"name":"ERICHTHONIOS","text":"If what you're saying is true, then my colleagues...they're doomed to share the same fate as Hesperos."},{"name":"THEMIS","text":"Do not lose heart yet, Erichthonios. Hesperos challenged us alone, and that tells me that the process of his creation was a long and taxing one. If he was the first hemitheos, then the rest of the warders are likely still alive."},{"name":"THEMIS","text":"However, much as I would like to hasten deeper into Pandæmonium, the way forward is sealed off. We must focus our efforts on finding a way through."},{"name":"ERICHTHONIOS","text":"With the creations still having free rein of Asphodelos, that won't be easy..."},{"name":"THEMIS","text":"On the contrary, I yet retain control of these circles, and thus can wield interment magick within their halls at will. The creatures will pose no threat to us."},{"name":"ERICHTHONIOS","text":"Just like that!? Then nothing's stopping us from returning order to Asphodelos."},{"name":"THEMIS","text":"Just so. I shall require your expertise to keep the peace after the subjects have been returned to their confinement, however. You are Asphodelos's sole remaining warder, after all."},{"name":"THEMIS","text":"Truth be told, I did not expect this investigation to become so involved. Of course, I would like to resolve matters here without resorting to outside help, but..."},{"name":"ERICHTHONIOS","text":"Do you mean to send a report to Lahabrea?"},{"name":"THEMIS","text":"'Tis too soon to say. Let us first find a way into Abyssos. It would be best to withhold our judgment until we have ascertained the whereabouts of the other warders and the identity of the party responsible for their disappearance."},{"name":"ERICHTHONIOS","text":"Agreed. Even so, if it means saving even a single life within Pandæmonium, then I'm not above asking Lahabrea for help...should it come to that."},{"name":"THEMIS","text":"Recent discoveries certainly paint Hesperos's actions in a new light... The number of unknown elements in this investigation grows, and we must proceed forward with the utmost caution."},{"name":"THEMIS","text":"To that end, Erichthonios and I shall remain here for the time being. Much as I enjoy your company, I do not believe we shall be needing protection so long as we remain in Asphodelos."},{"name":"ERICHTHONIOS","text":"You should take this time to rest. Surely you are weary, and there may be more battles ahead of us. Themis's burden may grow heavier in your absence, but he's shown that he's more than capable to bear it."},{"name":"ERICHTHONIOS","text":"Still, I would help wheresoever I'm able. All we've achieved so far has been thanks to you two, and I mean to repay the debt I owe. I don't know what use I can be outside of placating the creatures, but I'll find a way."},{"name":"THEMIS","text":"Nonsense, you owe us nothing. It was thanks to your knowledge of the magicks which govern this place that we were able to come this far. Elsewise we would have likely succumbed to the hippokampos's assault."},{"name":"THEMIS","text":"Each of us has arrived at this dire pass by separate paths, but it is only by combining our respective expertise that we will reach the end of it and see Pandæmonium saved."},{"name":"ERICHTHONIOS","text":"Thank you, Themis. Hesperos's words seem to have affected me more than I realize. Together we've come this far, and together we'll reach the end."},{"name":"THEMIS","text":"I have no doubt we will. Even so, let us allow <span class=\"highlight\">Forename</span> <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> rest."},{"name":"THEMIS","text":"Besides, you have someone awaiting a report on your progress, yes? I daresay your story will be much more than they ever imagined."},{"name":"ERICHTHONIOS","text":"Ah, so you don't serve the Convocation. I suppose I needn't worry about you going behind our backs to curry favor with Lahabrea."},{"name":"ERICHTHONIOS","text":"My friend would be very curious to hear what has occurred here. However, I fear that if I left Pandæmonium, the wards protecting it would quickly deteriorate. I hope <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> does not mind assuming some of my duties in the meantime."},{"name":"NEMJIJI","text":"At the professor's behest, we have kept our reports on recent events as vague as we can manage. Even if we wished to do otherwise, not much of note has transpired here as of late..."},{"name":"RUISSENAUD","text":"Professor Claudien has tasked <span class=\"emphasis\">me</span> with recording the aetherial signatures of each and every crystal in his recent orders. As a lowly assistant, I'm honored to be given such an enormous and monumental assignment!"},{"name":"CLAUDIEN","text":"Welcome, <span class=\"highlight\">Forename</span>! Back from the past none the worse for wear, I see. So, what did you find?"},{"name":"CLAUDIEN","text":"So there is evil afoot in Pandæmonium─an already ominous place, I must say. Mythic beasts and missing warders... Truly, we are fortunate to see you returned to us in one piece."},{"name":"NEMJIJI","text":"It appears the voice <span class=\"highlight\">Forename</span> heard from the crystal spoke the truth. As for who left it behind, and why, those are yet questions to be answered."},{"name":"CLAUDIEN","text":"Indeed. It could be someone who lived among the ancients, or it could be someone trying to avert a tragedy from the future. Much remains shrouded in mystery."},{"name":"CLAUDIEN","text":"Yet ilm by ilm, we shall unveil that mystery. With the help of <span class=\"highlight\">Forename</span>, of course! By <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> actions was the fabric of the past reshaped, yet <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> returns to the same present <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> left."},{"name":"CLAUDIEN","text":"Which can only mean one thing: that <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> intervention in Pandæmonium's crisis is but one of the countless building blocks of history upon which our present has been built."},{"name":"CLAUDIEN","text":"There is no telling what consequences would arise if we stopped pursuing this matter now. Whatever plot is unraveling within Pandæmonium, we must not let it reach its conclusion. If one of those creatures should escape, what ripples would carry forth to the future?"},{"name":"CLAUDIEN","text":"They might wreak havoc upon the world of the ancients, and their despair would leave an indelible mark upon history's pages. That despair would only feed the terrible beasts that arose during the Final Days."},{"name":"RUISSENAUD","text":"The first Final Days already had a drastic effect on the eons that followed. If the scars it left were made even deeper, then we risk losing our present entirely..."},{"name":"CLAUDIEN","text":"Whatever the cost, our connection with the future of Elpis must be preserved. I know I have asked much of you already, but can I count on you to continue your work in Pandæmonium?"},{"name":"CLAUDIEN","text":"Your tireless efforts are much appreciated. If there is aught we can do to ease your burden, you need only say the word."},{"name":"CLAUDIEN","text":"Speaking of which, might you return the crystal into our keeping? While we cannot accompany you to the past, perhaps something can be gained by researching it further."},{"name":"CLAUDIEN","text":"Ah, it shines just as splendidly as the day we met! We shall begin work right away, but I cannot promise any meaningful results for some time. And as matters in Elpis seem to be in a similar state, I must ask that you rest."},{"name":"CLAUDIEN","text":"But before that, allow me to make an introduction. As our research moves into its critical stage, I found it only suitable to recruit another assistant."},{"name":"CLAUDIEN","text":"Mylenie is an expert in armaments from throughout history, be they from the far-flung past or made in the most modern forges. Should you find aught of interest in your adventures, bring it here and she will be glad to offer her services."},{"name":"CLAUDIEN","text":"We know researchers in numerous fields that would love to get their hands on artifacts from bygone eras, and would give you goods in return that should aid you in trials ahead."},{"name":"CLAUDIEN","text":"Furthermore, if you ever wish to peruse the records of events you have reported here, Nemjiji has been taking faithful and thorough notes. She is at your complete disposal."},{"name":"CLAUDIEN","text":"...I sense that we have embarked upon something monumental. Something that will dwarf all else I have accomplished in my many years of research."},{"name":"CLAUDIEN","text":"I can think of no greater honor, nor reassurance, than to have your capable assistance in this endeavor. If there is anything to be found that will contribute to your success, we shall find it."},{"name":"CLAUDIEN","text":"We shall not rest until we have unlocked the mysteries of this crystal! And you will be the first to know when we do."}],"reward":{"gil":7500,"items":[{"id":33918},{"id":33919},{"id":33920},{"num":3,"id":33928,"one":1},{"num":3,"id":33929,"one":1},{"num":3,"id":33921,"one":1},{"num":3,"id":33917,"one":1}],"instance":30107},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70014]},"next":[70171]},"partials":[{"type":"npc","id":"1041278","obj":{"i":1041278,"n":"Themis","l":4033,"q":2}},{"type":"npc","id":"1041934","obj":{"i":1041934,"n":"Claudien","l":3708,"q":1}},{"type":"item","id":"33918","obj":{"i":33918,"n":"Heavens' Eye Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"33919","obj":{"i":33919,"n":"Savage Aim Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Critical Hit","category":0}}},{"type":"item","id":"33920","obj":{"i":33920,"n":"Savage Might Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Determination","category":0}}},{"type":"item","id":"33928","obj":{"i":33928,"n":"Quickarm Materia IX","l":560,"c":20282,"t":58,"materia":{"tier":8,"value":12,"attr":"Skill Speed","category":0}}},{"type":"item","id":"33929","obj":{"i":33929,"n":"Quicktongue Materia IX","l":560,"c":20282,"t":58,"materia":{"tier":8,"value":12,"attr":"Spell Speed","category":0}}},{"type":"item","id":"33921","obj":{"i":33921,"n":"Battledance Materia IX","l":560,"c":20281,"t":58,"materia":{"tier":8,"value":12,"attr":"Tenacity","category":0}}},{"type":"item","id":"33917","obj":{"i":33917,"n":"Piety Materia IX","l":560,"c":20281,"t":58,"materia":{"tier":8,"value":12,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"instance","id":"30107","obj":{"i":30107,"n":"Asphodelos: The Fourth Circle","c":61802,"t":"Raids","min_lvl":90,"max_lvl":90,"min_ilvl":565}},{"type":"quest","id":"70014","obj":{"i":70014,"n":"The Fires of Creation","g":26,"l":"The Gates of Pandæmonium","s":22,"f":1}},{"type":"quest","id":"70171","obj":{"i":70171,"n":"An Unwelcome Visitor","g":26,"l":"Labyrinthos","s":24,"f":1}}]}