{"quest":{"name":"The Fires of Creation","location":"The Gates of Pandæmonium","id":70014,"patch":6.0,"sort":22,"icon":112452,"unlocksFunction":1,"eventIcon":71341,"issuer":1041503,"target":1041278,"genre":26,"journal":["Themis is pondering the road ahead.","Although the hippokampos is back in fetters, Themis remains worried about the other warders. Erichthonios suggests that they might have found safe haven with the aid of Hesperos, keyward of Asphodelos, and fled to the innermost circle. This seems the best destination for you now─but Erichthonios reveals the path to be blocked by the phoinix, a bird of fulgent flame created in a failed attempt to give life to the sort of Phoenix with which you are more intimately familiar. When you set forth steeled for battle, however, the corridor around you warps into a scorched wasteland.<br><br>※Asphodelos: The Third Circle can be accessed via the Duty Finder.","You manage to brave the phoinix's flames for long enough to allow Themis and Erichthonios to inter it. The identity of whoever arranged this conflict goes unspoken─yet must be confronted ere you venture further into Asphodelos.","The hand at work in Asphodelos reveals himself at last, as Hesperos descends from the skies to berate Erichthonios for his foolishness and claim himself a hemitheos─a powerful fusion of man and creation. Declaring that he shall win the adulation of Lahabrea with this form, he then attempts to bind you in arcane chains, though Themis acts quickly enough to dispel the magic and spirit the three of you away. While Hesperos has not followed you, this incident does not bode well for the future of your investigation.","The three of you are safe for now, but the other warders are still missing, and deadly creations have free rein of Pandæmonium. Furthermore, Erichthonios seems to be reeling from the revelation that his once-kindly keyward is the wicked force at work within Asphodelos. Themis believes he should be given space for now, but recognizes that time is not in your favor."],"objectives":["Enter Asphodelos: The Third Circle.","Speak with Themis."],"dialogue":[{"name":"ERICHTHONIOS","text":"After witnessing the hippokampos's capabilities, I should not blame you for wishing to avoid engaging any further creations in the place of their choosing... Alas, I doubt we will have the luxury."},{"name":"THEMIS","text":"While our success in sealing away the hippokampos is certainly heartening, the fact that we have yet to see any other warders concerns me."},{"name":"ERICHTHONIOS","text":"The keyward of Asphodelos is nothing if not cautious. Doubtless he has gathered what warders he could and retreated to a safe area."},{"name":"THEMIS","text":"Let us hope so. It occurs to me that I know little of the keywards besides their magical prowess. Is there aught more you can share?"},{"name":"ERICHTHONIOS","text":"Of course. A man named Hesperos is in charge of Asphodelos. Not only does he have thorough knowledge of the creatures here, but he takes great pains to be a mentor to each of the warders under his charge."},{"name":"ERICHTHONIOS","text":"He has done much to ensure that I flourished here, in spite of my ineptitude at magic...and I have always known him to be the sort of man who faces difficult decisions with unwavering composure."},{"name":"ERICHTHONIOS","text":"Furthermore, keywards are not only masters of interment─they can also bend the hallways of Pandæmonium to their will with creation magicks. With all this in mind, I am certain that so long as Hesperos guides them, the other warders are safe."},{"name":"THEMIS","text":"I can see why absolute control over the environs is imperative. Had we faced the hippokampos upon arid sands instead of the waterways, I suspect the battle would have ended much more quickly..."},{"name":"THEMIS","text":"In any case, if this Hesperos is as capable and caring as you say, we would do well to seek him out as soon as we can. He has like as not taken your colleagues to a secure location."},{"name":"ERICHTHONIOS","text":"The safest place would be the innermost circle of Asphodelos. From there they could flee to Abyssos if hard-pressed."},{"name":"ERICHTHONIOS","text":"Even should they have sought safe haven within the other circles, if we make for the fourth, we ought to encounter them on the way."},{"name":"THEMIS","text":"Indeed─and we shall gain a comprehensive understanding of the situation within Asphodelos, which will be essential in determining whether we ought continue down to Abyssos."},{"name":"ERICHTHONIOS","text":"The rub, of course, is that I myself possess no power to bend the circles to my will... Instead, we must proceed through the central corridor─which was barred by the phoinix, last I checked."},{"name":"THEMIS","text":"Phoinix... I have heard the name before. A fiery bird with life eternal."},{"name":"THEMIS","text":"Beyond unquenchable brilliance, the perfected concept boasts nigh-boundless restorative powers, if I recall. Truly an exemplary feat of creation magicks."},{"name":"THEMIS","text":"Perfection is ever built on the back of failure, however, and Lahabrea suffered countless missteps during his experiments..."},{"name":"THEMIS","text":"...And he was hardly the only one. This phoinix will be but one of many attempts at the concept gone awry. "},{"name":"ERICHTHONIOS","text":"Aye. Far from evoking wonder, our phoinix is a creature of fury and wrath, and seeks only to turn the world to ash. Thus was it confined within Pandæmonium."},{"name":"THEMIS","text":"Development of the concept continued elsewhere, but as the moons turned, more and more researchers abandoned the project as an impossibility... Save for Lahabrea and his Words."},{"name":"THEMIS","text":"When I received word that at long last Lahabrea had succeeded where so many others had failed, I was nearly overcome. Pray tell─how did the warders of Pandæmonium celebrate their master's accomplishment?"},{"name":"ERICHTHONIOS","text":"I...don't believe we did. The research of the Words of Lahabrea has little consequence to our work here, save for those rare times it charges us with a new specimen. Truth be told, I don't remember anyone making note of the occasion."},{"name":"ERICHTHONIOS","text":"...But enough reminiscing─we must make ready to confront the phoinix."},{"name":"ERICHTHONIOS","text":"While it's possible that it flew off to some other wing of Pandæmonium, we would make that assumption at our own peril. Better to assume that we'll need to bring Asphodelos's most unruly subject to heel."},{"name":"THEMIS","text":"I certainly see no reason to delay. The phoinix's power over flame will avail it far less in a barren corridor than elsewhere, so it may well serve us to subdue it sooner rather than later."},{"name":"ERICHTHONIOS","text":"Wh-What!?"},{"name":"THEMIS","text":"It seems whoever is behind this can alter the space around us at will. We face an uphill battle."},{"name":"ERICHTHONIOS","text":"Impossible... If those were creation magicks at work, then that means..."},{"name":"THEMIS","text":"Let us confront that reality after we have conquered the enemy in front of us. Every drop of our focus shall be required if we are to inter the phoinix."},{"name":"ERICHTHONIOS","text":"Fight well, friend."},{"name":"THEMIS","text":"We shall gain naught from allowing the larger implications of this to distract us from the fight ahead. The phoinix's rage will be unbridled, but I trust you are prepared for the worst."},{"name":"ERICHTHONIOS","text":"With that, the phoinix is shackled once more. However, there is yet the matter of this...arena."},{"name":"THEMIS","text":"As you've told us, there is but one person in Asphodelos with the ability and authority to wield such magicks..."},{"name":"THEMIS","text":"Though fortunately, it appears he has saved us the trouble of finding him."},{"name":"HESPEROS","text":"(-???-)A contemptible display─as befits an inferior specimen."},{"name":"HESPEROS","text":"(-???-)Even so, I expected it would at least delay your advance. Imagine my surprise when I saw the chains of interment drag the phoinix back to its cage..."},{"name":"HESPEROS","text":"(-???-)Either the bird is even more of a failure than its creators cared to admit, or you are no mean trespassers."},{"name":"THEMIS","text":"I had hoped our suspicions were misplaced, but alas..."},{"name":"ERICHTHONIOS","text":"Keyward Hesperos, why!? Why have you brought such chaos to your beloved Pandæmonium!?"},{"name":"THEMIS","text":"Pandæmonium─pitiless, impenetrable, and utterly steadfast...unlike those charged with its keeping."},{"name":"ERICHTHONIOS","text":"What has possessed you!? I don't understand!"},{"name":"HESPEROS","text":"Oh, Erichthonios, must you pester me with these inane questions? Think for yourself─surely you can muster a theory or two with that dim wit of yours."},{"name":"HESPEROS","text":"Then again, you have never been one for insight. Why Master Lahabrea suffers your mediocrity I shall never understand."},{"name":"ERICHTHONIOS","text":"You... You may look like him, but you're not the Hesperos I know. Something has warped you, too, from the inside out..."},{"name":"ERICHTHONIOS","text":"The keyward I knew had compassion for all those under his charge, be they clad in robes or shackled in chains."},{"name":"ERICHTHONIOS","text":"Was that all a farce? Did you hide your contempt for us all these years!?"},{"name":"HESPEROS","text":"Those who are content to merely glimpse the water's surface are doomed to be dragged into its depths. You prove my opinion of you with every word. "},{"name":"HESPEROS","text":"My mind is clearer than it has ever been. Even now, seeing you feebly grasp for answers makes the bile rise in my throat."},{"name":"HESPEROS","text":"Such wasted potential! To be son to Master Lahabrea, yet no more skilled with magic than a newborn babe!"},{"name":"ERICHTHONIOS","text":"But of course. It's <span class=\"emphasis\">always</span> about Lahabrea..."},{"name":"HESPEROS","text":"Silence! You are not worthy to utter his name!"},{"name":"HESPEROS","text":"For once, be grateful to witness a feat beyond your meager abilities. Beyond your shallow reckoning. I have slipped the surly bonds of mortality!"},{"name":"HESPEROS","text":"I have become one with our mythic creations, and rid myself of imperfections. I stand upon the threshold of godhood!"},{"name":"HESPEROS","text":"As a hemitheos shall I serve Master Lahabrea, ever faithful, unto the end of days..."},{"name":"HESPEROS","text":"And he shall require no other!"},{"name":"THEMIS","text":"I think not!"},{"name":"THEMIS","text":"Are you so blinded by arrogance that you have lost sight of what it means to serve? Erichthonios is more capable than you could ever know. "},{"name":"THEMIS","text":"It was thanks to his instruction that I was able to master the art of interment. Both how to wield it...and how to break free of it."},{"name":"THEMIS","text":"<span class=\"highlight\">Forename</span>, let us quit this place. Whatever poison has corrupted Hesperos's mind, it is plain his power far eclipses our own. We must have time to gather our strength. "},{"name":"HESPEROS","text":"Hmph. Weaklings though they may be, it takes a singular aptitude to master interment so quickly. To say nothing of how swiftly that familiar laid low the phoinix..."},{"name":"HESPEROS","text":"Regardless, their noble aims will be their undoing. Where they fritter away their strength in calming the beasts of Asphodelos, I continue my work. Even should they survive long enough to reach the heart of my domain, naught shall await them but doom."},{"name":"HESPEROS","text":"...I eagerly await your arrival, Erichthonios. Even dullards have their uses."},{"name":"ERICHTHONIOS","text":"Please...leave me be."},{"name":"THEMIS","text":"My darkest suspicions have been realized. We face the keyward of Asphodelos himself..."},{"name":"THEMIS","text":"More than that revelation, however, Erichthonios worries me. He loved Hesperos for his compassion, but received naught but scorn from whatever the keyward has become."},{"name":"THEMIS","text":"...He has said little since our return. I only hope that the shock of recent events does not prove to be a death knell for his resolve."}],"reward":{"gil":3000,"items":[{"num":5,"id":33917},{"num":3,"id":33918,"one":1},{"num":3,"id":33919,"one":1},{"num":3,"id":33920,"one":1}],"instance":30109},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70013]},"next":[70015]},"partials":[{"type":"npc","id":"1041503","obj":{"i":1041503,"n":"Themis","l":4033,"q":1}},{"type":"npc","id":"1041278","obj":{"i":1041278,"n":"Themis","l":4033,"q":2}},{"type":"item","id":"33917","obj":{"i":33917,"n":"Piety Materia IX","l":560,"c":20281,"t":58,"materia":{"tier":8,"value":12,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"item","id":"33918","obj":{"i":33918,"n":"Heavens' Eye Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"33919","obj":{"i":33919,"n":"Savage Aim Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Critical Hit","category":0}}},{"type":"item","id":"33920","obj":{"i":33920,"n":"Savage Might Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Determination","category":0}}},{"type":"instance","id":"30109","obj":{"i":30109,"n":"Asphodelos: The Third Circle","c":61802,"t":"Raids","min_lvl":90,"max_lvl":90,"min_ilvl":565}},{"type":"quest","id":"70013","obj":{"i":70013,"n":"Under the Surface","g":26,"l":"The Gates of Pandæmonium","s":21,"f":1}},{"type":"quest","id":"70015","obj":{"i":70015,"n":"Who Wards the Warders?","g":26,"l":"The Gates of Pandæmonium","s":23,"f":1}}]}