{"quest":{"name":"Problematic Pests","location":"Labyrinthos","id":70017,"patch":6.0,"sort":1192,"icon":101077,"eventIcon":71221,"issuer":1041721,"target":1041673,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Now that he's being understood at last, Shaggles is full of vim and vigor.","You ask for Shaggles's advice on the case. He suggests that you show the woodworm sample he's brought along to one better versed in such scientific matters, so you head off in search of one of the biologists at Meryall Agronomics.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","The biologist confirms Shaggles's suspicions that the woodworm is indeed a new species, and suggests you learn more about its origins should you wish to effectively rid the Archeion of the vilekin. Shaggles remarks that he found the pest attached to a tool used to make medicine that was procured by a Roegadyn gleaner, who might still be found at the Archeion.","The gleaner explains that she procured the infested tool from the Great Work in Thavnair. This latest discovery calls for another trip to Meryall Agronomics.","The biologist explains that it's no surprise that the pest is resistant to the usual alchemical pesticide, as it too was created in Thavnair. As for a solution...he appears yet uncertain."],"objectives":["Speak with the Agronomics biologist.","Speak with the Roegadyn gleaner.","Speak with the Agronomics biologist again."],"dialogue":[{"name":"NWELHITIA","text":"Your help is indispensable if we're to get Shaggles's advice on dealing with the infestation."},{"name":"LITTLETROLL","text":"Allow me to explain a few things first. Staff at the Archeion regularly use alchemic pesticides to keep the place free of harmful grrrs. "},{"name":"LITTLETROLL","text":"Unfortunately, the woodworm I found seemed to be entirely resistant to the type of pesticide employed at the facility."},{"name":"LITTLETROLL","text":"I skimmed a few tomes, including the <span class=\"emphasis\">New Eorzean Geographic</span>, but I couldn't manage to identify the vilekin in the Archeion. I'm guessing it must be a new species. Grrr..."},{"name":"LITTLETROLL","text":"We won't get very far if we know nothing about the enemy, so I went ahead and captured one of the woodworms. We can try showing it to someone who knows more about this sort of thing than I do."},{"name":"NWELHITIA","text":"I see. In that case, I think we'd be best served by a biologist at Meryall Agronomics. Shall we?"},{"name":"LITTLETROLL","text":"Don't grrr at me. I can't talk to him myself."},{"name":"NWELHITIA","text":"I went ahead and told him everything. I have to admit that I hesitated to bring up Shaggles's role, though."},{"name":"BIORESEARCHER","text":"Your troll showed me the woodworm sample, but the best I can do is confirm that I've never seen it before. I'd say your hypothesis that it's an undiscovered species is highly likely."},{"name":"BIORESEARCHER","text":"In order to ascertain how best to deal with the insect, we would need to learn about its original habitat."},{"name":"LITTLETROLL","text":"Grrr... Well, I found it clinging on to a Thavnairian tool used to make medicine that was recently brought to the Archeion. "},{"name":"LITTLETROLL","text":"It was delivered by a Roegadyn gleaner. Let's go ask grrr about it."},{"name":"BIORESEARCHER","text":"That troll truly speaks to you, doesn't it? Perhaps that woodworm is not the only new species in our midst..."},{"name":"NWELHITIA","text":"Well, what are we waiting for then? To the Archeion!"},{"name":"BIORESEARCHER","text":"Now that I think of it, there was a vilekin race capable of conversing. The Gnath, if I'm not mistaken... Though some argue that they're closer to crustaceans."},{"name":"LITTLETROLL","text":"That's the gleaner who delivered the tool. Let's ask her where she got it."},{"name":"NWELHITIA","text":"I wonder if I'll be able to talk to Shaggles someday too. I'd love to know what he thinks of me..."},{"name":"GLEANER04481","text":"Oh, that? I found that in Thavnair."},{"name":"GLEANER04481","text":"To be more specific, at the alchemists' outpost─the Great Work."},{"name":"GLEANER04481","text":"'Twas used by the first alchemists, they say, and there are few tools like it still extant. I spent days arguing my case before its owner agreed to hand it over."},{"name":"LITTLETROLL","text":"Grrr... It's all coming together now. The woodworm was probably exposed to so many alchemic concoctions in that settlement that it developed a hardy resistance to substances like the pesticide."},{"name":"LITTLETROLL","text":"Let's waste no time in grrring the biologist about this."},{"name":"GLEANER04481","text":"I feel like I've seen that little troll in the Archeion. Is it all right for him to be out and about like this?"},{"name":"NWELHITIA","text":"Ah, well, circumstances have required us to set him free for a bit. Closely monitored, of course. Now, where did he go...?"},{"name":"NWELHITIA","text":"Oh my. We should make for Meryall Agronomics straightaway, then!"},{"name":"GLEANER04481","text":"If I didn't know better, I could've sworn that troll was talking to you..."},{"name":"LITTLETROLL","text":"Grrr... Go on, then."},{"name":"NWELHITIA","text":"I suppose I should really return Shaggles to the Archeion soon... Oh, ignore me. I'm just thinking out loud."},{"name":"BIORESEARCHER","text":"Well, that certainly makes a lot of sense in light of all that's happened thus far."},{"name":"BIORESEARCHER","text":"I happen to know that the alchemic pesticide used at the Archeion was created in Thavnair, so it's hardly surprising that our woodworm friend has developed a resistance to it."},{"name":"BIORESEARCHER","text":"Hmm, now how shall we solve this conundrum..."}],"reward":{"gil":935},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70016]},"next":[70018]},"partials":[{"type":"npc","id":"1041721","obj":{"i":1041721,"n":"Shaggles","l":3708,"q":1}},{"type":"npc","id":"1041673","obj":{"i":1041673,"n":"Agronomics Biologist","l":3708,"q":2}},{"type":"quest","id":"70016","obj":{"i":70016,"n":"Lost Little Troll","g":121,"l":"Labyrinthos","s":1191,"f":1}},{"type":"quest","id":"70018","obj":{"i":70018,"n":"Pests Be Gone","g":121,"l":"Labyrinthos","s":1193}}]}