{"quest":{"name":"Ogul Repays Her Favors","location":"Thavnair","id":70027,"patch":6.0,"sort":1223,"icon":101080,"unlocksFunction":1,"eventIcon":71341,"issuer":1041341,"target":1041389,"genre":122,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Ogul is tapping her foot impatiently.","After checking the contents of her coinpurse, Ogul says that she would feel more comfortable with another job under her belt. She bids you return with her to Yedlihmad, and see what other work Kancana has on offer.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Ogul enters Kancana's offices, complaining that her coinpurse has been stolen. Sympathizing with the young Au Ra's plight, Kancana offers to put her up for the night, as well as prepare a meal for the both of you. Meet with Kancana at her residence in Yedlihmad.","You arrive at Kancana's domicile only to discover that her home has been ransacked. According to Kancana, the criminal was leaving the scene just as they arrived, and Ogul dashed off in pursuit without a second thought. The concerned Arkasodara would have you chase after Ogul, and see that she comes to no harm.","You find Ogul standing in the street, cursing after having lost sight of her prey. Convinced that the culprit was the same boy who took her coinpurse, she asks that you aid her in gathering information from the locals that might help lead to the thief's apprehension.","The locals you speak with seem to agree that the recent spate of thievery is all the work of the same young boy. Return to Kancana's offices and share your discovery with Ogul.","You report your findings to Ogul, and she responds with her own unsettling tale. It seems that the boy thief may have been employed by a grown man─a stranger who the local children say was offering easy coin in exchange for unspecified “work.” You will need to track down this shady character if you are to hold to account the true culprit behind these crimes."],"objectives":["Speak with Kancana in Yedlihmad.","Speak with Kancana again.","Search for Ogul.","Speak with the locals.","Report to Ogul."],"dialogue":[{"name":"OGUL","text":"...Ready, then? I've been counting the contents of my coinpurse."},{"name":"OGUL","text":"I have enough to buy passage on a ship, but as for food and other supplies... Well, I would feel more comfortable with the pay from one more job weighing down my belt. You can see me through just one more, yes?"},{"name":"OGUL","text":"At the very least, let us make our report to Kancana and ask what else she has on offer. Come! Show me how fleet of foot you are, champion!"},{"name":"KANCANA","text":"<span class=\"highlight\">Forename</span>─safely back from your work on the shore, I see. ...But where is Ogul?"},{"name":"OGUL","text":"My coinpurse..."},{"name":"OGUL","text":"Some slippery son of a dzo snatched it from me, brazen as you please! I lost sight of him in the market, along with all my worldly wealth! How am I to pay for lodgings!? Or food!?"},{"name":"OGUL","text":"Already my belly cries in protest!"},{"name":"KANCANA","text":"Oh, you poor thing! And after all the good work you've done for us... You will stay with me tonight─I insist!"},{"name":"OGUL","text":"You...you would take me in?"},{"name":"KANCANA","text":"Hm hm, I saw that! You looked me right in the eye! Finally warming up to us Arkasodara, are you?"},{"name":"OGUL","text":"I...I can barely see you through the tears! But, yes, maybe now I can stand to be in the same room as a Matanga. Some of them, anyway."},{"name":"KANCANA","text":"I'm glad to hear it. Here, and I'll lend you a few coins as well. We can't have you running around without a gil to your name."},{"name":"OGUL","text":"Thank you..."},{"name":"KANCANA","text":"In fact, why don't we head to my house now, and we can fill that complaining belly of yours. You're more than welcome to join us, <span class=\"highlight\">Forename</span>."},{"name":"KANCANA","text":"Oh, <span class=\"highlight\">Forename</span>, something terrible has happened!"},{"name":"KANCANA","text":"I've been robbed! We saw a boy jumping out of the window as we approached, and when I looked inside, all my belongings had been turned inside out."},{"name":"KANCANA","text":"Ogul set off in pursuit of the thief, but hasn't returned... Do you think you could catch up with her and see if everything's alright?"},{"name":"KANCANA","text":"I'll lock up here, and you can meet me back at my offices when you've found her."},{"name":"OGUL","text":"Dung! I lost him again!"},{"name":"OGUL","text":"I swear, it was that same Hyuran boy who made off with my coinpurse─his size, his clothing, it all matches."},{"name":"OGUL","text":"I was willing to cut my losses and earn more gil, but this insult to my host...it will not stand!"},{"name":"OGUL","text":"Grandmother always said to repay one's favors, and by the Dusk Mother, I mean to do just that. Will you help me find justice for Kancana?"},{"name":"OGUL","text":"Then we start by asking around for more information. I have a feeling we are not the only ones who have fallen afoul of this thieving urchin."},{"name":"OGUL","text":"The swifter we act, the better our chances, yes? I say we split up, gather what clues we can, then meet back at Kancana's offices!"},{"name":"ABDHI","text":"The recent rash of pickpocketing? Oh yes, I've heard <span class=\"emphasis\">several</span> stories. They say it's likely the work of the same criminal."},{"name":"DJINAZADE","text":"This is secondhand information, mind you, but I hear that the thief you're looking for is barely more than a child."},{"name":"DJINAZADE","text":"Sad, isn't it? How terrible things have become that a young boy is forced into a life of crime just to survive..."},{"name":"DARPASA","text":"There was another robbery? I wonder if it's the same boy I found in my house the other day."},{"name":"DARPASA","text":"He yelled that he was sorry, and when I saw the desperation on his face, I just...I didn't have the heart to chase after him."},{"name":"KANCANA","text":"I'm afraid that meal will have to wait..."},{"name":"ABDHI","text":"I hope they catch the thief, and soon."},{"name":"DJINAZADE","text":"Child thieves... The very thought of it breaks my heart."},{"name":"DARPASA","text":"Is there nothing that can be done for him, I wonder...?"},{"name":"OGUL","text":"Well, Champion? What have we discovered?"},{"name":"OGUL","text":"...So, our tale was a familiar one. And what I heard from the local children was even more disturbing."},{"name":"OGUL","text":"They tell me a man─a stranger─approached them with the promise of work and easy coin. I have no proof this offer is connected with the recent robberies...but it does seem suspicious."},{"name":"OGUL","text":"And if this stranger truly is recruiting young ones to steal for him, then <span class=\"emphasis\">he</span> is the one I would punish for these crimes. We just need to find him first..."},{"name":"KANCANA","text":"Radz–at–Han closing its gates left many struggling to make a living. And the appearance of that ghastly tower sparked a chain of events that still has the Radiant Host spread too thin on too many fronts."},{"name":"KANCANA","text":"Under the circumstances, a rise in crime is to be expected. We are fortunate, then, to have the two of you here to act on behalf of our lawkeepers. So please, accept this as payment─we cannot expect you to work on an empty stomach!"}],"reward":{"gil":1015,"items":[{"num":2,"id":36038}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70026]},"next":[70028]},"partials":[{"type":"npc","id":"1041341","obj":{"i":1041341,"n":"Ogul","l":3709,"q":1}},{"type":"npc","id":"1041389","obj":{"i":1041389,"n":"Ogul","l":3709,"q":2}},{"type":"item","id":"36038","obj":{"i":36038,"n":"Amra Salad","l":525,"c":24166,"t":46}},{"type":"quest","id":"70026","obj":{"i":70026,"n":"The Matanga along the Way","g":122,"l":"Thavnair","s":1222,"f":1}},{"type":"quest","id":"70028","obj":{"i":70028,"n":"The Yedlihmad Hunt","g":122,"l":"Thavnair","s":1224,"f":1}}]}