{"quest":{"name":"Thick as Thieves","location":"Labyrinthos","id":70024,"patch":6.0,"sort":9210,"icon":101079,"eventIcon":71221,"issuer":1041696,"target":1041727,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Verpaulaine has something to ask of you once more.","Verpaulaine informs you that he has recently made friends with a young troll, who you soon identify as Shaggles. He mentions that he is struggling to communicate with the creature, so you join him to go and see your mutual acquaintance.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Shaggles explains to you that he has come up with a spell that would enable him to converse properly, but he is unable to activate it on his own. Verpaulaine then says he could try using the elemental reactor to create an artificial current of wind-aspected aether, which could give Shaggles the helping hand he needs. The troll agrees to give the boy's plan a try, so the three of you head to the reactor.","Having created an artificial current some distance from the reactor, Verpaulaine bids you accompany him and the troll once more, so as to keep them safe from the threats that would sup on its aether.","Leading the pair, you prepare to wend through Labyrinthos's weeds so that Shaggles can do...whatever it is that Shaggles plans to do.<br><br>※You must be accompanied by Shaggles and Verpaulaine to complete this task. Speak with them again should you become separated.","The plan is a roaring success and Shaggles is at last able to communicate freely. Before he is able to fully enjoy his new voice, however, Mussalfret and N'welhi Tia appear claiming they have something to impart to the pair. You are all bid to join Verpaulaine's father in Sharlayan Hamlet.","A representative from the Studium says that in light of their recent accomplishments, the scholarch has decided to invite Verpaulaine and Shaggles to enroll at the Studium. Verpaulaine is unsure at first, given his lack of experience of the outside world, but you and Shaggles succeed in convincing him to take the chance of a lifetime."],"objectives":["Speak with Shaggles.","Speak with Verpaulaine.","Speak with Shaggles and have him accompany you.","Head to the wind-aspected aether current while accompanied by Shaggles and Verpaulaine, then speak with Shaggles.","Speak with Verpaulaine."],"dialogue":[{"name":"VERPAULAINE","text":"Ah, hello again. Thanks once more for your help in sorting out the sun. I've actually got something else to ask, if you're willing to hear me out."},{"name":"VERPAULAINE","text":"It concerns a new friend of mine─a young troll that I found wandering around these parts recently."},{"name":"VERPAULAINE","text":"Obviously, he's not capable of speech, but he can clearly understand me when I talk to him. You...do believe me, right?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Oh, that's Shaggles."},{"name":"A1","text":"I've met him before."},{"name":"VERPAULAINE","text":"What a peculiar name. Well, that makes explaining the situation much easier."},{"name":"VERPAULAINE","text":"Truly? Well, that makes explaining the situation much easier."},{"name":"VERPAULAINE","text":"I last saw him by Logistikon Alpha. Let's go and see if he's still there."},{"name":"VERPAULAINE","text":"This is my new friend."},{"name":"LITTLETROLL","text":"Grrr! I've been searching all over for you, you know."},{"name":"LITTLETROLL","text":"Since we last met, I decided to use magicks to improve my vocalization."},{"name":"LITTLETROLL","text":"To that grrr, I've read my fair share of tomes on the subject. It seems your kind are capable of making your vocal cords vibrate thanks to your ability to breathe through your mouths."},{"name":"LITTLETROLL","text":"Alas, we trolls are incapable of doing so. However, I managed to adapt a wind-aspected spell to enable me to communicate properly─not that there's anything wrong with nasal grrrs, mind you."},{"name":"LITTLETROLL","text":"I'm not gifted enough to activate the spell on my own, so I set out in search of you once more. It was then that I bumped into this clever child."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"What happened to N'welhi Tia?"},{"name":"A2","text":"What happened to the buffoon?"},{"name":"LITTLETROLL","text":"He wouldn't have been any help, so I left without him. Clearly, I made the right choice─while I might not be able to speak with this boy, he still managed to bring you to me."},{"name":"VERPAULAINE","text":"You can understand what he's saying? Simply amazing. I knew he had to have some way of communicating!"},{"name":"LITTLETROLL","text":"I gather he knows a thing or two about aether as well. Would you mind telling him what I just told you? Pretty grrr?"},{"name":"VERPAULAINE","text":"So <span class=\"emphasis\">that's</span> what he'd been trying to tell me about. Of course, I'll do my best to help."},{"name":"VERPAULAINE","text":"The wind-aspected aether vented by the earthen reactor ought to help."},{"name":"VERPAULAINE","text":"If we fiddle with the reactor's settings a bit, we should even be able to create our own blustery vortex of the stuff. That should be all you need to cast your spell."},{"name":"LITTLETROLL","text":"See, I've got an eye for people! Now, take me to this reactor."},{"name":"VERPAULAINE","text":"Right this way!"},{"name":"LITTLETROLL","text":"What a splendid boy he is. I look forward to discussing all kinds of things with him once I'm able to talk."},{"name":"VERPAULAINE","text":"I'll be back in a bit─I just need to go tinker with the reactor's settings. I learned all about this when I was coming up with ways to better the systems for the artificial sun!"},{"name":"VERPAULAINE","text":"All done. I think our wind-aspected aether vortex should pop up somewhere to the west."},{"name":"VERPAULAINE","text":"Keep your wits about you. There's every chance the high concentration of aether will attract fiends."},{"name":"VERPAULAINE","text":"We don't have any means of protecting ourselves, so we'll need your help. Let us know when you're ready."},{"name":"VERPAULAINE","text":"We don't have any means of protecting ourselves, so we'll need your help. Let us know when you're ready."},{"name":"VERPAULAINE","text":"（★未使用／削除予定★）"},{"name":"LITTLETROLL","text":"Westward grrr!"},{"name":"SYSTEM","text":"Shaggles and Verpaulaine are now accompanying you. Keep them at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave your quest companions behind by entering a different area, or by speaking with them and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have your companions join you again, return and speak with them at the original location."},{"name":"Q3","text":"What will you do?"},{"name":"A3","text":"Small talk."},{"name":"A3","text":"Part ways."},{"name":"A3","text":"Nothing."},{"name":"VERPAULAINE","text":"Hmm, what should I ask Shaggles first once he is able to talk..."},{"name":"LITTLETROLL","text":"Once I'm able to talk, I'm going to have so many things to complain about to N'welhi Tia."},{"name":"VERPAULAINE","text":"Wait, where is Shaggles? Maybe we should return to the reactor area..."},{"name":"LITTLETROLL","text":"Grrr, where's Verpaulaine? Perhaps we should return whence we came and see if he's there..."},{"name":"SYSTEM","text":"Are you sure you wish to part ways with your companions?"},{"name":"VERPAULAINE","text":"Oh, do you have something else to attend to? Well, we'll be waiting by the reactor whenever you're ready."},{"name":"LITTLETROLL","text":"Got something else to take care of? Grrr. We'll wait at the reactor for you."},{"name":"VERPAULAINE","text":"Ready to leave? So are we!"},{"name":"LITTLETROLL","text":"Ready to go? We are too."},{"name":"VERPAULAINE","text":"My apologies. I got distracted and lost sight of you two. Let us set off once more."},{"name":"LITTLETROLL","text":"Try not leaving me behind this time, all right? Let's get going."},{"name":"LITTLETROLL","text":"We can't leave the boy behind."},{"name":"VERPAULAINE","text":"（★未使用／削除予定★）"},{"name":"SYSTEM","text":"You must be accompanied by Shaggles and Verpaulaine and have them at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"Wind-aspected aether swirls before you..."},{"name":"SYSTEM","text":"You have left Verpaulaine behind. Return to his side to continue the quest."},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"VERPAULAINE","text":"Now that we have found the current, we simply need to let Shaggles take care of the rest."},{"name":"LITTLETROLL","text":"So this is it, eh? Let me give it a go, then..."},{"name":"LITTLETROLL","text":"A-grrr, ahem. Can you hear me?"},{"name":"LITTLETROLL","text":"Brilliant! I can finally talk!"},{"name":"VERPAULAINE","text":"How wonderful! There's so much I want to talk to you about."},{"name":"VERPAULAINE","text":"Oh, Father? What brings you here?"},{"name":"LITTLETROLL","text":"Well, if it isn't my favorite buffoon! How'd you know I'd be here?"},{"name":"NWELHITIA","text":"You can speak!? Oh, even your voice is adorable!"},{"name":"MUSSALFRET","text":"A pleasure to see you again. I was just looking for my boy─I have something of great importance to impart upon him."},{"name":"NWELHITIA","text":"It's a pleasure for me as well. I'd been wanting to speak with Shaggles, myself─and now he can reply!"},{"name":"MUSSALFRET","text":"In that case, why don't you all join me in Sharlayan Hamlet? There's someone I'd like you to meet."},{"name":"LITTLETROLL","text":"Here I am, finally able to talk, and people instantly decide they have more important things to share. Grrr..."},{"name":"MUSSALFRET","text":"Sounds like you've helped my son yet again. You have my thanks."},{"name":"NWELHITIA","text":"It's lovely that Shaggles can talk, but I do wish he'd stop mocking me..."},{"name":"STUDIUMSTAFF","text":"So that's the troll and the boy I've heard so much about..."},{"name":"VERPAULAINEMOTHER","text":"Thank you so much for always looking after our son."},{"name":"VERPAULAINE","text":"So what's this all about?"},{"name":"MUSSALFRET","text":"Alas, that is not for me to explain. We have someone here from the Studium who will do the honors instead."},{"name":"STUDIUMSTAFF","text":"That would be me. A pleasure to make your acquaintance. I come bearing a message for you two from the scholarch himself."},{"name":"LITTLETROLL","text":"You mean...myself and Verpaulaine?"},{"name":"STUDIUMSTAFF","text":"Correct. Master Verpaulaine and Master...Shaggles, was it? Ahem, would you two perchance be interested in pursuing an education at the Studium?"},{"name":"STUDIUMSTAFF","text":"Word of your recent accomplishments has reached us, and we are all most impressed by your abilities."},{"name":"STUDIUMSTAFF","text":"It would be our honor to welcome you to our institution and help nurture your talents while providing you with ample opportunities to learn."},{"name":"LITTLETROLL","text":"I can hardly believe my ears, but I'm not about to turn down the chance of a lifetime. Of course I'll enroll!"},{"name":"MUSSALFRET","text":"What's the matter, Verpaulaine? You've more than proved yourself ready to face greater intellectual challenges─to leave Labyrinthos and expand your horizons."},{"name":"VERPAULAINE","text":"It's just that Labyrinthos is all I've ever known. How can I be sure I'll succeed out there?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"I know you've got what it takes."},{"name":"A4","text":"I know a pair that entered the Studium at eleven."},{"name":"VERPAULAINE","text":"Thank you for trying to reassure me. Only, I won't know anyone there, and..."},{"name":"LITTLETROLL","text":"Grrr! What are you talking about? You know me, don't you?"},{"name":"LITTLETROLL","text":"Don't tell me you plan to spend your whole life in this fishbowl? There's a whole world out there to explore!"},{"name":"NWELHITIA","text":"Says the troll who's never left Labyrinthos either."},{"name":"LITTLETROLL","text":"Silence, buffoon!"},{"name":"VERPAULAINE","text":"All right. You've convinced me. I'll go!"},{"name":"STUDIUMSTAFF","text":"Splendid! Now, there are just a few sheaves of paperwork to take care of, so I'll need to borrow your guardians for a bit."},{"name":"LITTLETROLL","text":"None of this would have happened if we hadn't met, would it?"},{"name":"VERPAULAINE","text":"I never would have gotten this opportunity, or made such a wonderful new friend without you."},{"name":"VERPAULAINE","text":"Thank you. I really mean it."},{"name":"VERPAULAINE","text":"(-Verpaulaine and Shaggles-)Farewell!"}],"reward":{"gil":935,"items":[{"num":2,"id":5795,"one":1},{"num":2,"id":5799,"one":1},{"num":2,"id":5804,"one":1},{"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"questsType":"all","quests":[70019,70023]}},"partials":[{"type":"npc","id":"1041696","obj":{"i":1041696,"n":"Verpaulaine","l":3708,"q":2}},{"type":"npc","id":"1041727","obj":{"i":1041727,"n":"Verpaulaine","l":3708,"q":1}},{"type":"item","id":"5795","obj":{"i":5795,"n":"Woad Blue Dye","l":30,"c":22804,"t":55}},{"type":"item","id":"5799","obj":{"i":5799,"n":"Storm Blue Dye","l":30,"c":22804,"t":55}},{"type":"item","id":"5804","obj":{"i":5804,"n":"Abyssal Blue Dye","l":30,"c":22804,"t":55}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"70019","obj":{"i":70019,"n":"Dream Big","g":121,"l":"Labyrinthos","s":1194}},{"type":"quest","id":"70023","obj":{"i":70023,"n":"The Hero in Labyrinthos","g":121,"l":"Labyrinthos","s":9204}}]}