{"quest":{"name":"What's in a Parent","location":"Thavnair","id":70029,"patch":6.0,"sort":2130,"icon":101081,"unlocksFunction":1,"eventIcon":71341,"issuer":1042175,"target":1041397,"genre":122,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Yezahn is mumbling to himself indistinctly.","You catch the attention of a distracted man who introduces himself as Yezahn, and he quickly recognizes you as the one who saved Mehvan and Qerasaf's daughter. He informs you that her recovery is proceeding apace, but worries about where she will go after fully healed. The alchemist has taken it upon himself to find a potential parent, and enlists your aid in questioning the people of Palaka's Stand to see if any have room for one more in their heart.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You have spoken to the locals and gathered a variety of opinions on the matter of the child's future caregiver. Yezahn is doubtless eager to hear what you have learned.","While quick to dismiss himself as a potential candidate, Yezahn gives a moment's consideration upon the mention of Pasareen. Although he seems hesitant to ask her to take on such an enormous responsibility, he admits she is the best option at present. He resolves to at least speak with her, asking you to be a reassuring presence by his side.","You find Pasareen doting over her own child, and she greets Yezahn with a smile. The smile soon vanishes, however, after Yezahn makes his request. She gives a vague denial, but Yezahn does not press further. He takes his leave of Pasareen, asking you to meet him at his workshop to discuss this development further.","Yezahn seems troubled by Pasareen's words and decides that he cannot stand idly by while his friend is in distress. In the meantime, he will also ponder the question of who will raise the child. He asks that you help him once more, both for the child's sake and the sake of a distraught mother."],"objectives":["Speak with the residents.","Report to Yezahn.","Speak with Pasareen.","Speak with Yezahn."],"dialogue":[{"name":"YEZAHN","text":"Ah... Oh, excuse me. Did you need something?"},{"name":"YEZAHN","text":"Wait, you're <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>! The very <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who saved Mehvan's child. <span class=\"highlight\">Forename</span>, was it?"},{"name":"YEZAHN","text":"I knew it. I'm Yezahn, an alchemist of the Great Work. I am but one of the few who are looking after the child as she makes her recovery."},{"name":"YEZAHN","text":"Mehvan and Qerasaf were dear friends of mine. Thank you for everything you've done for their daughter."},{"name":"YEZAHN","text":"Her condition is on the mend, I'm sure you'll be glad to hear. We've been taking turns checking in on her─the last thing she needs is a gaggle of adults fussing over her day and night."},{"name":"YEZAHN","text":"That being said, when she is healed fully, there is the question of who will be in charge of her care. For the love I bore her parents, I would gladly take her in as my own, but that would mean raising her away from her home."},{"name":"YEZAHN","text":"Moreover, I am yet to be wed, and my duties consume so much of my time I can scarce focus on my own care, let alone that of a growing child. I doubt my ability to give her the love she deserves─love equal to that her parents gave her."},{"name":"YEZAHN","text":"She deserves better than that, so I've considered finding someone more suitable. It's the least I can do, and truth be told, perhaps the best option."},{"name":"YEZAHN","text":"Even so, although I was born here, much of my life was spent at the Great Work. I'm afraid I haven't the foggiest idea who to ask, even if I had the time to do so."},{"name":"YEZAHN","text":"You, however, seem to be well loved among the people here. Could you ask around in my stead? It would be a much more effective use of my time to prepare medicine for the wounded and sick. "},{"name":"YEZAHN","text":"I apologize for imposing such an enormous task upon you, but I would trust no one else with it. When you've finished, come to my hut to the south of this settlement and we can discuss any potential parental candidates."},{"name":"YEZAHN","text":"Let me know what the people say─we'll find a suitable parent yet."},{"name":"PASAREEN","text":"Now, now. Sleep, child."},{"name":"RESIDENTSA04493","text":"Who do <span class=\"emphasis\">I</span> think is most suited to care for the child? Yezahn is the obvious choice. Dependable, loyal, and dutiful. Every quality you would desire in a parent."},{"name":"RESIDENTSA04493","text":"I know he does become so absorbed in his research, but that devotion has made him a peerless alchemist. Who better is there to look after someone so sickly as her?"},{"name":"RESIDENTSB04493","text":"If you ask me, Pasareen is the most motherly among us. She had a child of her own not too long ago, so I reckon there's no one better to be a wet nurse."},{"name":"RESIDENTSB04493","text":"That being said, times have been troubled for us all. It might be unseemly to ask her to take on such a burden unless she was willing."},{"name":"RESIDENTSC04493","text":"The child, eh? None dote over her quite like Yezahn, but I understand alchemy isn't a merciful trade for a parent. Still, there's no one else that comes to mind when I consider the question."},{"name":"RESIDENTSC04493","text":"I'd volunteer to take her in myself, but with the chaos of recent events it's difficult enough to see that me and mine are fed and clothed. I know I'm not the only one facing such hardships, either."},{"name":"RESIDENTSA04493","text":"Yezahn would be a loving and responsible father, I'm sure."},{"name":"RESIDENTSB04493","text":"Pasareen is a loving mother, but one child is handful enough..."},{"name":"RESIDENTSC04493","text":"Apologies that I couldn't be of more use."},{"name":"YEZAHN","text":"Welcome to my humble workshop, <span class=\"highlight\">Forename</span>. I'm almost too nervous to ask, but what did the others say?"},{"name":"YEZAHN","text":"Eh? Someone nominated <span class=\"emphasis\">me</span>? Well, that's neither here nor there. You said Pasareen's name was mentioned?"},{"name":"YEZAHN","text":"She was a good friend to Mehvan, it's true, but there are other factors at play that make me reticent to ask her."},{"name":"YEZAHN","text":"Simply put, I'd rather not burden her further if it can be avoided. That being said, we don't exactly have the luxury of choice, all things considered."},{"name":"YEZAHN","text":"I suppose I would be remiss if I didn't at least speak with her. I owe the child that much. Will you accompany me, <span class=\"highlight\">Forename</span>? A supportive presence by my side would help me find the right words."},{"name":"YEZAHN","text":"Pasareen should be nearby, doubtless watching over her own child. I must deliver this medicine before speaking with her, so please go on ahead."},{"name":"PASAREEN","text":"Yezahn, it's so good to see you. And who is this with you?"},{"name":"YEZAHN","text":"Pasareen, meet <span class=\"highlight\">Forename</span>. <span class=\"alternative-container\"><span class=\"alternative\">She's</span><span class=\"alternative\">He's</span></span> the hero who saved Mehvan and Qerasaf's daughter."},{"name":"PASAREEN","text":"Oh, what a pleasant surprise! Thank you for your bravery."},{"name":"PASAREEN","text":"I've heard tell of the troubles she's been through since. I hope that you're able to see her returned to health soon."},{"name":"YEZAHN","text":"It has been trying, to be sure, but we must look forward to the day she is hale. Everyone is doing their utmost to make it so."},{"name":"YEZAHN","text":"The question remains as to where she will go from there, however. I've considered taking her into my home, but I fear my qualifications as a parent are somewhat lacking."},{"name":"YEZAHN","text":"I know you to have been a dear friend to Mehvan, and as such only thought it meet to ask if you're willing to care for her daughter. If you are, I would do everything in my power to see that she is given into your care."},{"name":"PASAREEN","text":"I...I'm flattered. Mehvan was as family to me, and I view her child as my own. I would do anything to see her raised into as brave a woman as her mother..."},{"name":"PASAREEN","text":"...However, I cannot care for her. I'm not worthy to care for her."},{"name":"YEZAHN","text":"Worthy? What does that─?"},{"name":"YEZAHN","text":"Ah, my apologies. I understand it was a sudden request, and no small one besides. Please forgive the imposition."},{"name":"YEZAHN","text":"I'll be in the village for some time yet. Should you require treatment for you and yours, please seek me out."},{"name":"PASAREEN","text":"I will. Thank you, Yezahn."},{"name":"YEZAHN","text":"I would speak with you further, <span class=\"highlight\">Forename</span>. Let's return to my dwelling."},{"name":"PASAREEN","text":"I'm sorry..."},{"name":"YEZAHN","text":"I wasn't too forceful, was I? I simply asked her if she was willing...I didn't mean to make her feel obligated to agree."},{"name":"YEZAHN","text":"I found her words somewhat mystifying. “Not worthy”? What could that mean? I'm usually not one to pry, but this worries me. I consider Pasareen a friend, and I am loath to leave her to her troubles."},{"name":"YEZAHN","text":"And there is still the matter of the child. Hmm... I shall have to think on what to do from here. I may need your help again soon, <span class=\"highlight\">Forename</span>. I hope you are willing."}],"reward":{"gil":935},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69953]},"next":[70030]},"partials":[{"type":"npc","id":"1042175","obj":{"i":1042175,"n":"Yezahn","l":3709,"q":1}},{"type":"npc","id":"1041397","obj":{"i":1041397,"n":"Yezahn","l":3709,"q":4}},{"type":"quest","id":"69953","obj":{"i":69953,"n":"Under His Wing","g":11,"l":"Thavnair","s":571}},{"type":"quest","id":"70030","obj":{"i":70030,"n":"Curing What Ails","g":122,"l":"Thavnair","s":2131,"f":1}}]}