{"quest":{"name":"The Lad in Labyrinthos","location":"Labyrinthos","id":70020,"patch":6.0,"sort":9201,"icon":101078,"unlocksFunction":1,"eventIcon":71341,"issuer":1041683,"target":1041685,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mussalfret is awfully worried about something.","Mussalfret informs you that his son, Verpaulaine, has recently fled the family home after a fight and asks you to try and convince him to return. You head to a local park in search of the disgruntled youth.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You find Verpaulaine, but he vanishes once more. Undeterred, you begin your search anew.","After tracking down Verpaulaine, you learn that he is concerned by a change in the color of Labyrinthos's artificial sunlight. The boy says he wishes to look into the cause himself and you gladly agree to help him."],"objectives":["Find Verpaulaine.","Find Verpaulaine again."],"dialogue":[{"name":"MUSSALFRET","text":"Oh, what am I to do?"},{"name":"MUSSALFRET","text":"Ah, you're that adventurer who helped out the Students of Baldesion, aren't you? I suppose it matters not to you, but my son seems to have run away..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Why was there a child here in the first place?"},{"name":"A1","text":"I thought only researchers lived here."},{"name":"MUSSALFRET","text":"Ah, yes. Simply put, my wife and I work at Aporia and she happened to conceive whilst we were living here in Sharlayan Hamlet."},{"name":"MUSSALFRET","text":"I assure you we had many sleepless nights wondering if we should quit our jobs and leave Labyrinthos, or entrust the child to a friend of ours who dwells somewhere more suitable."},{"name":"MUSSALFRET","text":"Ultimately, we decided to continue our work whilst raising the child here. After all, our research is focused on the very future that our offspring will inhabit."},{"name":"MUSSALFRET","text":"The issue is, however, that the magic that prevents us from revealing anything confidential is too potent to be used on children."},{"name":"MUSSALFRET","text":"Of course, we can't allow the little one to roam freely─there's no telling what he might impart unto others─so he has spent his entire life thus far within the confines of Sharlayan Hamlet."},{"name":"MUSSALFRET","text":"We recently had a slight spat with him and, well, he decided to flee."},{"name":"MUSSALFRET","text":"I imagine me going after him would only make things worse. Could I ask you to talk to him in my stead? I'm sure he'd be much more willing to listen to...er, anyone other than his parents, at this point."},{"name":"MUSSALFRET","text":"Thank you! Verpaulaine─my boy─is most likely in the plaza to the east. I cannot imagine he struck out any further on his own."},{"name":"MUSSALFRET","text":"Verpaulaine ought to be in the plaza to the east. Or so I hope..."},{"name":"VERPAULAINE","text":"Wha─ Who are you?"},{"name":"VERPAULAINE","text":"I am <span class=\"emphasis\">not</span> going to go home so easily!"},{"name":"VERPAULAINE","text":"You probably won't believe me either, but I've noticed that all is not right in Labyrinthos."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Why don't you try telling me first?"},{"name":"A2","text":"I can decide what to believe on my own, thank you."},{"name":"VERPAULAINE","text":"Fine, I shall tell you what I've seen. The color of the artificial light here changed recently."},{"name":"VERPAULAINE","text":"I'm sure most people haven't noticed, but when you've spent your whole life here, the difference is like...like night and day!"},{"name":"VERPAULAINE","text":"Even so, no one will take me seriously when I bring it up. All because of my age! Got into a big fight with Father about it..."},{"name":"VERPAULAINE","text":"But Labyrinthos is in danger! Who knows what would happen if the artificial sun broke..."},{"name":"VERPAULAINE","text":"That's why I can't go home just yet. I need to get to the bottom of this first."},{"name":"VERPAULAINE","text":"Although...I am scared to venture outside on my own. They say there's countless monsters out there..."},{"name":"VERPAULAINE","text":"I don't suppose you would come with me? I could pay you! It's not much, but I do get pocket money from my parents."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"I'll gladly take your money."},{"name":"A3","text":"You don't need to pay me."},{"name":"VERPAULAINE","text":"I thought you were different from the rest, but now you're treating me like a child too."},{"name":"VERPAULAINE","text":"This is a proper deal, all right? You've got to take my money to make it binding."},{"name":"VERPAULAINE","text":"Then it's settled!"}],"reward":{"gil":935,"aetherCurrent":1,"items":[{"id":35713}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69982]},"next":[70021]},"partials":[{"type":"npc","id":"1041683","obj":{"i":1041683,"n":"Mussalfret","l":3708,"q":1}},{"type":"npc","id":"1041685","obj":{"i":1041685,"n":"Verpaulaine","l":3708,"q":2}},{"type":"item","id":"35713","obj":{"i":35713,"n":"Chondrite Necklace Coffer (IL 545)","l":1,"c":26565,"t":61}},{"type":"quest","id":"69982","obj":{"i":69982,"n":"Hither and Yarns","g":11,"l":"Labyrinthos","s":600}},{"type":"quest","id":"70021","obj":{"i":70021,"n":"Here Comes the Sun","g":121,"l":"Labyrinthos","s":9202}}]}