{"quest":{"name":"Steppe Child","location":"Thavnair","id":70025,"patch":6.0,"sort":1221,"icon":101080,"unlocksFunction":1,"eventIcon":71341,"issuer":1041331,"target":1041332,"genre":122,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Ogul is looking around in trepidation.","Horrified at landing on an isle populated by Matanga, Ogul is desperate to earn enough coin to buy passage on a departing ship. She asks that you accompany her to Kancana, a woman who purportedly has well-paying jobs on offer.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You approach Kancana who, much to Ogul's dismay, is a Matanga herself. Despite Ogul's fearful reaction, you nevertheless secure an escort duty which requires you to meet an Arkasodara master artisan to the west of Yedlihmad.","The master artisan welcomes your somewhat belated arrival. Before he can give you instructions, however, Ogul decides that rushing off to gather materials herself would be best for everyone involved. You are left to conduct a patrol of the area alone, but deem it wise to keep one eye peeled for the unsteady Auri warrior.","You come across a petrified Ogul standing motionless between a raging beast and one of the aforementioned artisans. After making short work of the aggressive wildlife, you turn your attention to the wounded Arkasodara.","The Arkasodara insists that his injuries are slight, and that he is fit to make the journey back towards town. Return to the master artisan west of Yedlihmad.","Your employer thanks you for saving his colleague. Your payment, it seems, can be collected from Kancana back in Yedlihmad proper.","You receive your promised reward from Kancana, as well as her heartfelt approval. The offer of future work hangs in the air, but considering Ogul's deep-seated fear of all things Matanga, you wonder if she might not require your continued assistance..."],"objectives":["Speak with Ogul.","Speak with the master artisan west of Yedlihmad.","Search for Ogul.","Aid the wounded Arkasodara.","Speak with the master artisan.","Report to Kancana."],"dialogue":[{"name":"OGUL","text":"...Why are there Matanga everywhere!? Has this town fallen...?"},{"name":"OGUL","text":"Ah! Your face─it is known to me! You were the warrior who fought for the Mol in the Naadam!"},{"name":"OGUL","text":"I am Ogul of the Khatayin. It was your bravery and skill which inspired me to embark upon my own hero's journey."},{"name":"OGUL","text":"Yet now I have foolishly blundered into a den of Matanga. Why do these others walk without fear? Do they not care if they are slaughtered!?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"These Matanga are not like those on the Azim Steppe."},{"name":"A1","text":"The Arkasodara are a civilized tribe."},{"name":"OGUL","text":"I do not doubt your word. But Grandmother would always warn me: “If you encounter a Matanga, you turn tail and flee─as fast and far as you can!”"},{"name":"OGUL","text":"Her tales were awful and bloody, and so now the very sight of them, it... The terror rises unbidden! No, I cannot stay here. I must earn enough coin to buy passage from this nightmare island as soon as possible!"},{"name":"OGUL","text":"I beg of you, stay at my side for a time─just until I meet with this “Kancana” person the sailors told me about. She is said to have work that pays a fair wage, so I will see what she has for me..."},{"name":"KANCANA","text":"Why is that young lady trembling so...?"},{"name":"OGUL","text":"By the Dusk Mother! No one told me Kancana was a Matanga! Could I ask you to speak with her in my stead...?"},{"name":"KANCANA","text":"Welcome to Yedlihmad, traveler. I am Kancana, and it is my job to assign the right work to the right workers. Might I have your name?"},{"name":"KANCANA","text":"<span class=\"highlight\">Forename</span>...and Ogul, was it? Let me jot those down."},{"name":"OGUL","text":"Oh, Grandmother, why!? Why did it have to be a Matanga!?"},{"name":"KANCANA","text":"...Is your companion quite alright?"},{"name":"KANCANA","text":"Ah, an understandable reaction. The Gajasura tribe have done much to stain the reputation of our people."},{"name":"KANCANA","text":"You <span class=\"emphasis\">are</span> looking for work, though, yes? Many have been forced to take what they can get since the troubles began, so I'm afraid all the simple jobs are gone."},{"name":"KANCANA","text":"As for what's left, I only have tasks fit for seasoned fighters. Does that sound like something you could do?"},{"name":"OGUL","text":"F-Fighting? I can fight! Lest you doubt, my skill is likened to that of the Dragonbane─the legendary Chakha Zoh herself!"},{"name":"KANCANA","text":"I'm...not familiar with the name, but you sound formidable indeed. Why don't we start you out on escort duty, then. A group of artisans set off to harvest materials, and asked that I send any prospective protectors their way should I happen to enlist any."},{"name":"OGUL","text":"What? They already set off? Is our duty not to “escort” them?"},{"name":"KANCANA","text":"There's to be a ritual dance performed in Kadjaya's Footsteps─they'll need incense, and costumes for the dancers and such. The entire thing was decided rather suddenly, so there was no time to waste."},{"name":"OGUL","text":"Hmmm..."},{"name":"OGUL","text":"And, uh, these artisans you speak of...d-do they also include Matanga in their number?"},{"name":"KANCANA","text":"It was an Arkasodara who submitted the request. I hope that won't be a problem...?"},{"name":"OGUL","text":"&lt;gulp&gt; Oh, not at all. I look forward to fainting at the feet of my most feared enemy!"},{"name":"OGUL","text":"<span class=\"highlight\">Forename</span>, I cannot do this alone. Pray lend me the strength of the victor of the Naadam, and half the reward for this task will be yours!"},{"name":"KANCANA","text":"The artisans didn't plan to venture far─leave Yedlihmad to the west, and you should soon come across your employer."},{"name":"OGUL","text":"Then that is where we shall meet! You will find me there, yes...?"},{"name":"KANCANA","text":"As I said, they shouldn't be far─a short walk from the west edge of town."},{"name":"OGUL","text":"Dusk Mother, give me courage!"},{"name":"ARTISANA04489","text":"Ah, you must be our belated escort, yes?"},{"name":"ARTISANA04489","text":"Glad to have such courageous...uh...is your companion not well? She seems a touch shaky."},{"name":"OGUL","text":"Of course─I should have thought of it before! I shall harvest the necessary ingredients while the artisan stays here. That way I have no need to fear him...er, being harmed! Perfect!"},{"name":"ARTISANA04489","text":"I must say, this is less than ideal. My people are already scattered across the wilds, and I wanted someone to roam around and ensure they were safe from attack..."},{"name":"ARTISANA04489","text":"Is your friend perhaps frightened by Arkasodara? I have met such travelers before. Well, no matter. If you could patrol the area as I asked, I must attend to my own harvesting."},{"name":"SYSTEM","text":"Ogul has run off into the wilds alone. Keep an eye out for her as you continue your patrol."},{"name":"OGUL","text":"T-Tusks, trunks, bone-crunching feet..."},{"name":"ARTISANB04489","text":"You must think me foolish. I was so absorbed in my task that I failed to notice the ground shaking at their approach..."},{"name":"ARTISANB04489","text":"Still, my injuries are light and my satchel is full. Thanks to you, I think I can make it back to town in time to meet the others."},{"name":"OGUL","text":"&lt;gasp&gt; I... What happened!?"},{"name":"OGUL","text":"Did <span class=\"emphasis\">you</span> slay the beast?"},{"name":"OGUL","text":"That was a near thing. I took the first one by surprise, but the second... Knowing a Matanga stood at my back, my mind froze and my body refused to obey."},{"name":"OGUL","text":"Grandmother taught that we should let fear wash over us like water, but to my shame, I could not have failed her more thoroughly. ...Not to sound ungrateful, <span class=\"highlight\">Forename</span>, but why did you follow me?"},{"name":"OGUL","text":"...We were to patrol? Forgive me. I should have waited for orders, instead of running off alone and putting lives in peril."},{"name":"OGUL","text":"Come, we should return to our employer─I want to be sure that the wounded man reached safety."},{"name":"OGUL","text":"D-Deep breaths! Let it wash over you!"},{"name":"ARTISANA04489","text":"My colleague told me of his rescue. Although we had hoped for an escort from the start, imagine if you hadn't come at all..."},{"name":"ARTISANA04489","text":"I've sent him and the others back to our workshop, so consider your duty with us complete."},{"name":"ARTISANA04489","text":"You have my thanks. As for your payment, that you can collect from Kancana."},{"name":"OGUL","text":"Right... I suppose we report to Kancana, then."},{"name":"OGUL","text":"I had no such troubles in Doma or Kugane, I assure you. This is...different."},{"name":"KANCANA","text":"Ah, there you are. Your employer expressed satisfaction with your work, so congratulations on a job well done!"},{"name":"KANCANA","text":"As a response to the recent chaos, the upcoming ritual was hastily planned to say the least. As a consequence, the artisans have been hard-pressed to make everything ready."},{"name":"KANCANA","text":"But when times are hard, the people of Thavnair rely on such traditions to renew their faith and bolster their hearts with the teachings of the divine."},{"name":"KANCANA","text":"The death of an artisan would have thrown the whole thing into disarray, and thus your rescue was timely indeed! Please, accept your payment─half each, as agreed upon."},{"name":"KANCANA","text":"Are you interested in further work? I may have something for you, if so..."}],"reward":{"gil":1095,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69906]},"next":[70026]},"partials":[{"type":"npc","id":"1041331","obj":{"i":1041331,"n":"Ogul","l":3709,"q":1}},{"type":"npc","id":"1041332","obj":{"i":1041332,"n":"Kancana","l":3709,"q":4}},{"type":"quest","id":"69906","obj":{"i":69906,"n":"A Fisherman's Friend","g":11,"l":"Thavnair","s":524}},{"type":"quest","id":"70026","obj":{"i":70026,"n":"The Matanga along the Way","g":122,"l":"Thavnair","s":1222,"f":1}}]}