{"quest":{"name":"Here Comes the Sun","location":"Labyrinthos","id":70021,"patch":6.0,"sort":9202,"icon":101078,"eventIcon":71221,"issuer":1041685,"target":1041688,"genre":121,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Verpaulaine is chuffed that you're helping him.","After briefly explaining the artificial sun's inner workings, Verpaulaine bids you accompany him on a visit to Phoibos. You make your way to Logistikon Alpha so you can head to the Medial Circuit.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Thanks to your mature comportment, you and Verpaulaine successfully enter the Medial Circuit. The boy dashes off immediately, rather defeating the point of your accompanying him, but you turn toward Phoibos nevertheless.","Upon your catching up with him at Phoibos, Verpaulaine asks that you wait while he examines the facility for any issues. Though the Lalafell stationed at Phoibos says nothing, there is the distinct sense that he will be keeping a close eye on the youth during their tour.","Verpaulaine reports that he was unable to find anything amiss. However, the youth remains confident that the problem exists, and its cause simply lies elsewhere. You have little choice but to agree to accompany him as he searches for it."],"objectives":["Speak with Verpaulaine.","Speak with Verpaulaine again.","Speak with Verpaulaine once more."],"dialogue":[{"name":"VERPAULAINE","text":"I'm ready to go if you are!"},{"name":"VERPAULAINE","text":"Oh, I suppose I should tell you a bit about the artificial sun first. It's got an engine called a “reactor” that burns with fire aether."},{"name":"VERPAULAINE","text":"My theory is that the reactor has <span class=\"emphasis\">too</span> much aether now, and that's what's changed its color."},{"name":"VERPAULAINE","text":"<span class=\"emphasis\">Ergo</span>, we should go to Phoibos. I know someone who works there helping to control the artificial sun. I bet he'll let us have a look around!"},{"name":"VERPAULAINE","text":"It's in the Medial Circuit, so we should head for Logistikon Alpha first. Follow me so you don't get lost."},{"name":"VERPAULAINE","text":"They don't usually let me into the Medial Circuit, but having you here changes everything!"},{"name":"Q1","text":"Are you ready to enter the Medial Circuit with Verpaulaine?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"VADELOISON","text":"Hello again, Verpaulaine. You and your friend are free to go through."},{"name":"VERPAULAINE","text":"You have my thanks. It's so tiresome, having your freedoms limited because of your age..."},{"name":"VERPAULAINE","text":"Anyway, let's make our way to Phoibos."},{"name":"PHOIBOSSTAFF","text":"Oh, hello. Are you here to have a look around? I must emphasize that touching the buttons within, however tempting, is not permitted."},{"name":"VERPAULAINE","text":"He said I can go and have a look! Wait here─I'll let you know if I find anything."},{"name":"VERPAULAINE","text":"Well, he showed me the control panel, but there didn't seem to be anything wrong."},{"name":"VERPAULAINE","text":"The reactor's records didn't contain anything worth noting either."},{"name":"PHOIBOSSTAFF","text":"That's what you were worried about, eh? You do realize this place has been around as long as Labyrinthos and we've never had a single problem."},{"name":"PHOIBOSSTAFF","text":"Nor have we been able to confirm this change in the light's hue you speak of. Are you certain you didn't just stare at the sun too long? We advise against that for a reason, you know."},{"name":"VERPAULAINE","text":"They can talk down to me all they want, but I know what I saw."},{"name":"VERPAULAINE","text":"If there's nothing wrong here then it simply means the root of the problem lies elsewhere. Let's go!"}],"reward":{"gil":935},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70020]},"next":[70022]},"partials":[{"type":"npc","id":"1041685","obj":{"i":1041685,"n":"Verpaulaine","l":3708,"q":2}},{"type":"npc","id":"1041688","obj":{"i":1041688,"n":"Verpaulaine","l":3708,"q":2}},{"type":"quest","id":"70020","obj":{"i":70020,"n":"The Lad in Labyrinthos","g":121,"l":"Labyrinthos","s":9201,"f":1}},{"type":"quest","id":"70022","obj":{"i":70022,"n":"Fiery Thirst","g":121,"l":"Labyrinthos","s":9203}}]}