{"quest":{"name":"In Pursuit of Power","location":"Garlemald","id":70034,"patch":6.0,"sort":1550,"icon":101083,"unlocksFunction":1,"eventIcon":71341,"issuer":1041753,"target":1041755,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Rimelnaud would like your opinion on something.","You are approached by Rimelnaud, who wants you to accompany him when he goes to negotiate with an engineer from Tapper's Den. The man in question─Appius─is keen to restart Juturna Platform G, but Rimelnaud doubts his motives on account of his Garlean heritage.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You speak to Appius, who kindly explains his personal history and proposal for getting the ceruleum rig running again. However, the leaders of the contingent will need more than words to convince them that his plan is wise. Thus, the Garlean engineer suggests he inspect some of the camp's ceruleum engines that may be in need of repair to prove he can be trusted. At his urging, you agree to accompany him to make sure that he doesn't get up to any antics.","Upon further discussion with Appius, it is agreed that you will be the one to actually inspect the ceruleum engines, lest something break and he be blamed for it. Regardless of how you feel about taking the blame in his stead should that occur, you must concede that it would be better should a Garlean not incur the ire of the contingent by accident.<br><br>※You must be accompanied by Appius to complete this task. Speak with him again should you become separated.","With Appius's guidance, you inspect three ceruleum engines. Rimelnaud will doubtless be curious as to how it went.","Appius explains that the engines are no longer running efficiently, to the degree that they will inevitably break down. At this, Rimelnaud relents and agrees to allow the engineer to repair the engines. Continue to lend a helping hand if you wish to improve life in the camp."],"objectives":["Speak with Appius.","Speak with Appius and have him accompany you.","Inspect the ceruleum engines with Appius.","Speak with Rimelnaud while accompanied by Appius."],"dialogue":[{"name":"RIMELNAUD","text":"Ah, just who I was looking for! Allow me to introduce myself─I am Rimelnaud of Ishgard. I've been put in charge of our arrangement with Tapper's Den, you see."},{"name":"RIMELNAUD","text":"However, the very first of the tappers to come bearing ceruleum has asked quite a lot of us, if I do say so!"},{"name":"RIMELNAUD","text":"They wish for our help in getting Juturna Platform G up and running..."},{"name":"RIMELNAUD","text":"The very same platform that's at the head of the imperials' primary energy pipeline!"},{"name":"RIMELNAUD","text":"What's more, he's a Garlean. I was convinced the only engineers left in Tapper's Den were from conquered territories..."},{"name":"RIMELNAUD","text":"In any case, I'm not qualified to judge the motives of the man. I'd feel much more at ease if I had someone of your experience helping to make the call."},{"name":"RIMELNAUD","text":"I thank you for your willingness to assist. Let us go and speak with the tapper in question, then. He's a man by the name of Appius."},{"name":"APPIUS","text":"I suppose you must be the friend Rimelnaud wanted to fetch."},{"name":"APPIUS","text":"You have my thanks for getting him to agree to my proposal!"},{"name":"RIMELNAUD","text":"Do not misunderstand─I have yet to agree to any such thing. I merely wanted someone else present during our talk."},{"name":"APPIUS","text":"Very well, though I do believe my proffered deal would be a boon to us and the Ilsabard contingent alike..."},{"name":"APPIUS","text":"I used to work on Juturna Platform G, you see, so I know more than most about the facility and its operation."},{"name":"RIMELNAUD","text":"That may be so...but your relationship to the facility notwithstanding, why should a Garlean such as yourself still be taking refuge in Tapper's Den? We've been led to believe that the former workers residing there were from other territories."},{"name":"APPIUS","text":"You're right on the technicality─I was a supervisor, rather than your typical staff. When the platform went down, it only seemed right that I stay with my crew."},{"name":"APPIUS","text":"I always thought we were close, but living alongside them in Tapper's Den has made me realize that I took them and their skills for granted...and that's to say nothing of the blind eye I turned to their struggles."},{"name":"APPIUS","text":"That's why I came to you. It's high time I be of some real use to them─and everyone else, if we're lucky."},{"name":"APPIUS","text":"If we manage to get the platform back in working order, it'll dramatically increase our capacity to pump and refine ceruleum for everyone in the region! Sadly, we're more than a few hands short of a full workforce─not to mention the lack of supplies."},{"name":"APPIUS","text":"...Which is precisely where you come in. Help us get things up and running again, and you'll have your share of the ceruleum coming out of the rig. You couldn't come up with a more mutually beneficial arrangement if you tried!"},{"name":"RIMELNAUD","text":"...So he says. What do you think?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"He seems trustworthy to me."},{"name":"A1","text":"I'm a little uneasy about this..."},{"name":"RIMELNAUD","text":"Yes, I'd been leaning the same way myself. Ultimately, what he says about the potential benefits is true... Nevertheless, I doubt the higher-ups would assent to this."},{"name":"APPIUS","text":"I suppose that is how it goes when you're dealing with military types. For what it's worth, I do understand the hesitancy to throw your lot in with someone from a hostile nation."},{"name":"APPIUS","text":"Thus, part two of my proposal─I shall do you a service to prove myself worthy of the contingent's trust!"},{"name":"APPIUS","text":"I had a look around the fringes of your camp here before you arrived, and I've spotted a few ceruleum engines in need of repair. If I fix them up, your superiors would have no reason to suspect that I want to see you driven out. ...Less reason, in any case."},{"name":"RIMELNAUD","text":"Assisting us with use of local technology would go a long way, I'd imagine. That said, I've not heard anything about the ceruleum engines we've scavenged breaking down."},{"name":"APPIUS","text":"It's not as if they're entirely useless─yet─but I guarantee they're not running as they should. Give me the opportunity, and I can have them working more efficiently and safely."},{"name":"APPIUS","text":"You are welcome to accompany me while I do so. That way, you can ensure that I don't get up to anything suspect─and then vouch for me with your superiors!"},{"name":"RIMELNAUD","text":"I have no objections. I trust you will sense anything amiss."},{"name":"APPIUS","text":"Let us begin with a proper inspection, then! We can get to work as soon as you're ready, <span class=\"highlight\">Forename</span>."},{"name":"RIMELNAUD","text":"My apologies for dragging you into this, but I do appreciate the help. Keep an eye on him when you go to inspect those engines."},{"name":"APPIUS","text":"Though the ultimate objective is to get the engines running at full capacity, the purpose of this inspection is to work out what parts we'll need."},{"name":"APPIUS","text":"However, I would hate to fumble something and be accused of sabotage, so I'd appreciate it if you could be the one to lay hands on the devices. Never fear─I'll be right behind you, telling you what to look for."},{"name":"APPIUS","text":"If we inspect...say, three of them, we should have a decent idea of what needs repair. Lead the way!"},{"name":"SYSTEM","text":"Appius is now accompanying you. Keep him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Appius behind by entering a different area, or by speaking with him and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Appius accompany you again, return and speak with him at the original location."},{"name":"Q2","text":"What will you do?"},{"name":"A2","text":"Speak with Appius."},{"name":"A2","text":"Part ways with Appius."},{"name":"A2","text":"Nothing."},{"name":"APPIUS","text":"Remember─three engines in total, you do the touching."},{"name":"SYSTEM","text":"Are you sure you wish to part ways with Appius?"},{"name":"APPIUS","text":"Ah, have you something more important to do? You'll find me waiting next to Rimelnaud, so please return when you've the time."},{"name":"APPIUS","text":"Ready to go? Then let's get moving!"},{"name":"SYSTEM","text":"You'll need Appius at your side in order to make sense of these machines."},{"name":"SYSTEM","text":"You must be accompanied by Appius and have him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"Appius has yet to arrive. Be sure he is at your side before attempting to continue."},{"name":"APPIUS","text":"Praise be to your deft hands! I have an idea of what our next step ought to be─though perhaps it would be best to apprise Rimelnaud of our progress first."},{"name":"APPIUS","text":"I think I've learned more than enough. Let us report to Rimelnaud."},{"name":"SYSTEM","text":"Appius has yet to arrive. Be sure he is at your side to explain the ceruleum engines before speaking to Rimelnaud."},{"name":"APPIUS","text":"Well, I think I've learned more than enough from that. Let us report to Rimelnaud."},{"name":"RIMELNAUD","text":"Appius seems rather keen to begin. Would you mind accompanying him at your earliest convenience? I fear he may start talking to me again otherwise..."},{"name":"RIMELNAUD","text":"How are our engines?"},{"name":"APPIUS","text":"Alas, I fear that each of those we examined are guaranteed to break down sooner or later should you continue using them in their current state."},{"name":"RIMELNAUD","text":"Surely you jest!"},{"name":"APPIUS","text":"I swear it on my integrity as an engineer! You are in dire need of instruction in the proper operation of ceruleum engines."},{"name":"APPIUS","text":"You saw the little lamp light up when you touched the switch, correct? That only illuminates when there's an issue with the engine!"},{"name":"APPIUS","text":"They were switched off for want of fuel when the settlement was abandoned, no doubt. Which prevented them burning out...only to let them freeze solid instead ere your lot turned them on. From the state they're in, I can only assume it didn't occur to you to warm them up first."},{"name":"APPIUS","text":"I noticed you have heating technology of your own, but it will do you no good should the engines to power them break, now will it? You have nothing to lose and everything to gain from my assistance!"},{"name":"RIMELNAUD","text":"Hmm... I am a machinist from frozen climes myself, and what you say sounds plausible enough."},{"name":"RIMELNAUD","text":"Very well. On behalf of the camp, I formally ask you to repair the ceruleum engines."},{"name":"RIMELNAUD","text":"I suppose that means I will be taking responsibility if anything goes wrong, so you may as well use your own two hands this time."},{"name":"APPIUS","text":"That's the spirit! I knew you'd come around."}],"reward":{"gil":935,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69929]},"next":[70035]},"partials":[{"type":"npc","id":"1041753","obj":{"i":1041753,"n":"Rimelnaud","l":3710,"q":1}},{"type":"npc","id":"1041755","obj":{"i":1041755,"n":"Rimelnaud","l":3710,"q":3}},{"type":"quest","id":"69929","obj":{"i":69929,"n":"Strange Bedfellows","g":11,"l":"Garlemald","s":547}},{"type":"quest","id":"70035","obj":{"i":70035,"n":"Camp Broken Engines","g":123,"l":"Garlemald","s":1560}}]}