{"quest":{"name":"Longing for Home","location":"Garlemald","id":70039,"patch":6.0,"sort":1746,"icon":101084,"eventIcon":71221,"issuer":1041767,"target":1041767,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Volusus will not be moved.","Volusus succeeds in persuading you and Galla to search the ruins for clues to his parents' whereabouts. Though he had initially intended to visit their family home, the streets above have become far too dangerous, so you agree to go in his stead.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Volusus's directions prove remarkably useful and you are soon able to locate his house, ruined though it may be. You join Galla in sifting through the rubble for anything that might lead you to the boy's parents.","You succeed in finding a letter addressed to Volusus among what remains of his house. Galla, who is also engaged in the search, will be eager to inspect this vital clue.","Upon viewing the letter, Galla deducts it was left here for Volusus by his parents in the event he returned to the house. However, a considerable amount of time has clearly passed since then, and the missing family members are nowhere to be seen.","Volusus is thrilled to discover there is a good chance his mother Vipsania is still alive. Though this is a step in the right direction, there is much to be done before the family is reunited."],"objectives":["Speak with Galla.","Search Regio Urbanissima for clues as to Volusus's parents' whereabouts.","Show the letter to Galla.","Speak with Volusus."],"dialogue":[{"name":"GALLA","text":"He's safer here than outside, but it's clear he'd be better off coming with us. There must be some way to persuade him."},{"name":"VOLUSUS","text":"Please, help me find my parents! My mum's got red hair just like me, and my dad—"},{"name":"GALLA","text":"Volusus─ You have to understand that there's little chance we'd find your parents even if we went looking for them."},{"name":"VOLUSUS","text":"I do understand! That's why I'm waiting here. They promised to meet me at the station."},{"name":"VOLUSUS","text":"I know it's too dangerous for me outside. But you two can fight, can't you?"},{"name":"VOLUSUS","text":"So, please. Please don't give up on them like everyone else..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It won't hurt to look, will it?"},{"name":"A1","text":"It's either this or drag him off kicking and screaming."},{"name":"GALLA","text":"I worry that we're only giving him false hope...but very well."},{"name":"GALLA","text":"After all, the least we can do is try."},{"name":"GALLA","text":"Thanks to my time in the Vigiles Urbani, I know the capital like the back of my hand."},{"name":"GALLA","text":"Between the two of us, we should be able to conduct a reasonably thorough search."},{"name":"VOLUSUS","text":"Thank you so much! I can't wait to see them again!"},{"name":"GALLA","text":"Let's not get ahead of ourselves..."},{"name":"GALLA","text":"This is exactly what I was afraid of... To the task at hand, then. Given the present state of the capital, tracing his parents' steps will be no easy feat."},{"name":"GALLA","text":"Volusus, do you know anything that might help us in our search?"},{"name":"VOLUSUS","text":"Well, I was thinking about going back to my house...if it's still there."},{"name":"GALLA","text":"Where is that? Are there any landmarks nearby?"},{"name":"VOLUSUS","text":"It's on the outskirts of town, to the south. Between the tavern and the bookshop."},{"name":"VOLUSUS","text":"Oh, and Dad always used to fly a huge imperial flag in front of our house. We were the only family that had one in our neighborhood."},{"name":"GALLA","text":"That should be enough to go on."},{"name":"GALLA","text":"All right. Let's get going."},{"name":"VOLUSUS","text":"They're alive─I know they are!"},{"name":"GALLA","text":"Well, we're in the right area. Remember: he said it was between a tavern and a bookshop, and that they had a large imperial flag in front of the house."},{"name":"GALLA","text":"Let me know the moment you find anything that might be useful, no matter how insignificant it may seem. Now, let's start our search."},{"name":"GALLA","text":"We can only hope they left some clue as to their whereabouts. Without it...well, let's cross that bridge <span class=\"emphasis\">if</span> we come to it."},{"name":"SYSTEM","text":"You find a letter amidst the rubble. Though much of it has been rendered illegible, you can make out the words, “You are cordially invited to an evening of fine food and drink at Palatium Novum.”"},{"name":"SYSTEM","text":"Try searching elsewhere for a clue to Volusus's parents' whereabouts, and show anything promising to Galla."},{"name":"SYSTEM","text":"You find a leaflet amidst the rubble, apparently from a bookshop. “<span class=\"emphasis\">The War on Ilsabard</span> now in stock! Don't miss this chance to own the masterpiece dedicated to Emperor Solus's achievements.”"},{"name":"SYSTEM","text":"Try searching elsewhere for a clue to Volusus's parents' whereabouts, and show anything promising to Galla."},{"name":"SYSTEM","text":"You find a letter amidst the rubble. It begins, “Dearest Volusus─I pray this message finds you well...”"},{"name":"SYSTEM","text":"Galla will be eager to inspect this potentially vital clue."},{"name":"GALLA","text":"Found something, have you? Let's have a look."},{"name":"GALLA","text":"It's addressed to Volusus! And from his parents, no less!"},{"name":"GALLA","text":"And you said you found it nearby..."},{"name":"GALLA","text":"It looks like someone's tried to clear away the rubble, but then thought better of it─the place is far too exposed. His parents must've come back to see if their boy had returned home, and then left him this letter."},{"name":"GALLA","text":"Judging by the condition of the paper, it's safe to assume some time has passed since their visit. We're unlikely to bump into them simply waiting here."},{"name":"GALLA","text":"I'll write a reply just in case they return, but for now let's head back to Volusus. Excellent work finding this!"},{"name":"VOLUSUS","text":"Did you find anything?"},{"name":"GALLA","text":"Why yes, we did! A letter addressed to you from your parents, in fact. This is sure to help in our search, I know it."},{"name":"VOLUSUS","text":"Can I see it?"},{"name":"VOLUSUS","text":"Hmm. This is addressed to me, but this isn't Mum or Dad's handwriting..."},{"name":"GALLA","text":"Don't give up so easily, Volusus! Here, let me read it for you."},{"name":"GALLA","text":"“I am injured, but am in...<br>Do not worry about me. For now, you must stay out of danger.<br>Love,<br>Vipsania”<br>Unfortunately, it looks like the part detailing their location got wet at some stage. It's completely illegible."},{"name":"VOLUSUS","text":"Vipsania─that's Mum's name!"},{"name":"GALLA","text":"Ah, so it <span class=\"emphasis\">is</span> from her after all. There's a good chance she's still alive!"},{"name":"VOLUSUS","text":"I knew it!"},{"name":"GALLA","text":"We're one step closer to finding her!"},{"name":"GALLA","text":"In all honesty, I'm amazed we found anything. Thank you for convincing me that the search was worthwhile."},{"name":"GALLA","text":"It's clear as day to me now why your comrades have nothing but praise for you."},{"name":"GALLA","text":"With you on the case, we'll find his mother in no time!"}],"reward":{"gil":935},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70038]},"next":[70040]},"partials":[{"type":"npc","id":"1041767","obj":{"i":1041767,"n":"Volusus","l":3710,"q":3}},{"type":"quest","id":"70038","obj":{"i":70038,"n":"Stranded at the Station","g":123,"l":"Garlemald","s":1745,"f":1}},{"type":"quest","id":"70040","obj":{"i":70040,"n":"Palatial Possibilities","g":123,"l":"Garlemald","s":1747}}]}