{"quest":{"name":"A Budding Adventure","location":"Thavnair","id":70033,"patch":6.0,"sort":2134,"icon":101082,"unlocksFunction":1,"eventIcon":71341,"issuer":1041397,"target":1041397,"genre":122,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Yezahn has yet another favor to ask of the only adventurer he knows.","The troubles facing Palaka's Stand continue to mount, the most pressing of them being the lack of supplies and able bodies. Yezahn asks you if you know anyone who could help, and you mention Kancana and Ogul, who reside in Yedlihmad. Yezahn seems eager to make their acquaintance, and leaves it to you to enlist their aid.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Kancana listens with growling concern as you explain the purpose of your visit. She agrees to help Palaka's Stand without question, and promises to have a shipment of supplies ready posthaste. Ogul offers to protect the shipment, and rushes off to the gates of Yedlihmad with Racashir hot on her heels.","Ogul and Racashir are ready to depart, with the former carrying the supplies on her back. Keep an eye out for hungry monsters and daring bandits as you make the long journey to Palaka's Stand.","You rescue Ogul and Racashir from the maws of a hungry beast. They do not appear to be unharmed, but Racashir is staring at you with an awed expression.","Racashir is impressed with your display, and while Ogul is thankful for your help, she is eager to commence the adventure. She rushes off with a boisterous challenge, leaving the supplies behind. Luckily, Racashir remains to pick up the slack.","You arrive to find a monster slain, with Ogul and Sula standing over it triumphantly. Sula is pleased to see you, and it seems that in Ogul she has found a fierce fighting companion. She offers to escort you to Palaka's Stand, where it seems Yezahn is awaiting your arrival.","Yezahn is grateful for the arrival of supplies and protection both, and Ogul seems to have found her next adventure. She presents Yezahn with a journal she found during the journey, which the alchemist reveals belonged to Mehvan and Qerasaf. This unexpected discovery is welcomed, and it seems that there is hope for Palaka's Stand at last.","Ogul resolves to help the people of Palaka's Stand rebuild, and is eager to resume Racashir's instruction in the fine art of adventuring. The sun shines bright on Palaka's Stand, and the tenseness in Yezahn's shoulders seems to have dissipated entirely.","With the pressing crisis facing Palaka's Stand solved, Yezahn basks in the first moments of comfort he has had in some time. The reverie is short-lived, however, as he quickly turns to what must be done in the days ahead. With his help, and the help of the settlement's new arrivals, wounds will heal and the citizens of Palaka's Stand will come to know peace once more."],"objectives":["Speak with Kancana at Yedlihmad.","Speak with Ogul at the gates to Yedlihmad.","Rendezvous with Ogul.","Speak with Ogul.","Speak with Ogul again.","Speak with Yezahn at Palaka's Stand.","Speak with Ogul.","Speak with Yezahn."],"dialogue":[{"name":"YEZAHN","text":"Ah, <span class=\"highlight\">Forename</span>, just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I was hoping to see. Now that I've had the opportunity to speak with more of the people here, I realize their plight is even more dire than I had imagined."},{"name":"YEZAHN","text":"The recent crisis has caused the flow of supplies to grind to a halt, and the people can scarcely meet their daily needs. This would be the case even without the influx of refugees."},{"name":"YEZAHN","text":"One way we might alleviate this is to requisition a shipment from Yedlihmad, but the process takes precious time. I fear that many would starve before we see a single sack of grain. "},{"name":"YEZAHN","text":"All of this is exacerbated by the lack of able-bodied fighters. The wounded are many, and there are few who have the strength and skill to guard us from the beasts lurking in the forest."},{"name":"YEZAHN","text":"The Radiant Host would give their lives to protect us, and have, but every day more of them are injured. Bravery alone is only worth so much in the face of overwhelming numbers."},{"name":"YEZAHN","text":"And while I am much appreciative of your help so far, I'm not so naive as to think that you will remain here indefinitely. Had we another of your skill to aid us, we might at least stand a chance to weather the worst of this storm. "},{"name":"YEZAHN","text":"However, my time at the Great Work was spent largely in solitude, and the people of this village know of little beyond its walls. But you've been to the furthest reaches and back, yes? Do you know of anyone else who might lend their stout arm to these humble folk?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I know just such an adventurer. As fierce as I, if not more so."},{"name":"A1","text":"I know someone who could give the merchants proper motivation for a speedy delivery."},{"name":"YEZAHN","text":"Ah, I knew I could count on your wide web of storied personages. Ogul and Kancana, you say? I believe we may be able to kill two birds with one stone with that pair."},{"name":"YEZAHN","text":"Unfortunately, my hands are full meeting the medicinal needs of the village. Seeing as you're already acquainted with these fellows, could you appeal to them on our behalf? "},{"name":"YEZAHN","text":"Apologies for once again putting so much on your shoulders, but it is for the good of one and all. Can I count on your assistance?"},{"name":"YEZAHN","text":"Thank you, friend. Well then, off to Yedlihmad to meet this Kancana, eh? Safe travels, and I will pray that you return with good news."},{"name":"YEZAHN","text":"I pray the journey to Yedlihmad is a safe one, and that this Kancana is amenable to helping us."},{"name":"OGUL","text":"Hail, <span class=\"highlight\">Forename</span>! My day brightens to see you again!"},{"name":"RACASHIR","text":"Oh, it's you... Ah... Hello?"},{"name":"KANCANA","text":"Well, if it isn't <span class=\"highlight\">Forename</span>! I had wondered when you might walk through my door again."},{"name":"OGUL","text":"You will be pleased to hear young Racashir has taken to adventuring like a thief to a coinpurse! He is more than capable enough to assist me on my less arduous tasks. "},{"name":"KANCANA","text":"Indeed, his future is bright. However, as much as it heartens me to see you, I sense your visit isn't entirely motivated by a curiosity in our affairs, yes?"},{"name":"KANCANA","text":"I see. I did not know that Palaka's Stand was beset by such troubles, but I suppose I shouldn't be surprised, all things considered."},{"name":"KANCANA","text":"Naturally, I shall do all in my power to help. A few words to the right people, and the merchants will have a shipment of supplies ready in a matter of bells."},{"name":"KANCANA","text":"Inform this Yezahn that aid is on the way, and for much less coin than the merchants would usually charge. This chaos has gripped all of Radz-at-Han, and it is only together that we shall find the strength to release ourselves from it."},{"name":"OGUL","text":"And if you require an adventurer, then look no further!"},{"name":"OGUL","text":"The supplies require brave souls to defend them, correct? Then I offer mine! I will await you at the gates."},{"name":"RACASHIR","text":"W-Wait, wait for me! I'm coming too!"},{"name":"KANCANA","text":"Yes, that one has a bright future indeed."},{"name":"RACASHIR","text":"Would you look at this? Such a large pack of supplies, prepared in what felt like a matter of moments..."},{"name":"OGUL","text":"Kancana made good on her word, not that I doubted she would. The merchants were likely all too eager to make such a sizable trade─they even provided us with bags and coats for the journey."},{"name":"OGUL","text":"And it appears Racashir will be joining us. Try as I might to convince him otherwise, his mind is made up. Hopefully this will prove to be another learning experience for him!"},{"name":"OGUL","text":"My grandmother always did say the road forward is paved with good deeds. The three of us shall see that no beast lays fang or claw upon these provisions!"},{"name":"OGUL","text":"There are more supplies to come, but they will be delivered by the Radiant Host. We shall be the vanguard─the harbingers of salvation for Palaka's Stand!"},{"name":"OGUL","text":"And with that, let us be off!"},{"name":"RACASHIR","text":"H-Help!"},{"name":"OGUL","text":"You have arrived just in time, <span class=\"highlight\">Forename</span>! I was hoping you would honor me with a display of prowess!"},{"name":"RACASHIR","text":"What a fright that beast gave us..."},{"name":"OGUL","text":"That was a splendid display indeed! Your bravery never ceases to impress."},{"name":"RACASHIR","text":"I've never seen such a fierce warrior! I daresay <span class=\"alternative-container\"><span class=\"alternative\">she's</span><span class=\"alternative\">he's</span></span> every bit your equal!"},{"name":"OGUL","text":"Children are so easily impressed. While <span class=\"highlight\">Forename</span> is indeed a formidable adventurer, your teacher has many great deeds to her name, and more yet to come!"},{"name":"OGUL","text":"Now, the village is not far. Let us march, and I challenge any monster to approach!"},{"name":"RACASHIR","text":"H-Hold on! You forgot the supplies!"},{"name":"RACASHIR","text":"They cut the monster down before it had a chance to pounce!"},{"name":"SULA","text":"Greetings, <span class=\"highlight\">Forename</span>. I did not expect to meet you here, of all places."},{"name":"OGUL","text":"Did you see that, Racashir? Mark well how quickly that beast succumbed to the flurry of blades! In no small part thanks to this brave Arkasodara."},{"name":"SULA","text":"Ah, so this is the adventurer that Yezahn spoke of. Not since my last hunt with Sister have I fought so effortlessly with another."},{"name":"OGUL","text":"And never have I felt so invigorated, to have such a mighty Arkasodara fighting by my side!"},{"name":"RACASHIR","text":"How do you keep it up? Just watching you has me out of breath..."},{"name":"SULA","text":"Endurance is the product of long hours of practice, lad. Well then, it seems my hunt is finished. Let us return to Palaka's Stand before we draw the attention of something deadlier."},{"name":"SULA","text":"Yezahn will be eager to speak with you upon your return. Do not keep him waiting for long."},{"name":"OGUL","text":"Look, Racashir, an aetheryte! I understand an adventurer is to attune themselves to these when their journeys bring them to a new locale. But, eh, now I recall that I forgot to do so in Reunion. Let us keep that between us, yes?"},{"name":"RACASHIR","text":"This is my first time traveling this far."},{"name":"YEZAHN","text":"There you are. Sula told me you've brought both the supplies and the protection you promised. She is at present preparing the game she hunted."},{"name":"OGUL","text":"She has promised to spar with me afterward! I am fast feeling that I have made the right choice in coming here."},{"name":"YEZAHN","text":"I'm grateful for it, lass. It will do Sula good to have your energizing presence by her side."},{"name":"YEZAHN","text":"I understand that there are yet more supplies to come. I must find a way to thank the merchants and the one who spurred them to action. Kancana, was it?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"She will spare no effort to see Radz–at–Han rebuilt."},{"name":"A2","text":"If there is anything else you require from the merchants, she'll be happy to help. "},{"name":"YEZAHN","text":"It seems we've found a reliable ally, thanks to you."},{"name":"RACASHIR","text":"Oh, teacher, don't forget! We should ask about the journal we found."},{"name":"OGUL","text":"Yes, of course! I was just about to mention it."},{"name":"OGUL","text":"The beast Sula and I felled was holding fast to this. Perhaps you know who its owner is?"},{"name":"YEZAHN","text":"This... By the Manusya. Yes, I do in fact know who penned this journal. They were dear friends of mine. Unfortunately, they didn't survive the tragedy that befell us."},{"name":"OGUL","text":"I see. I am sorry for your loss."},{"name":"YEZAHN","text":"Thank you. Luckily, their memory lives on in their child. And now, this journal."},{"name":"YEZAHN","text":"When she comes of age, I'll show this to her, that she might come to know who her parents were."},{"name":"OGUL","text":"“Life is but a string of meetings and farewells. It is our memories that sustain us. That give us life.”"},{"name":"OGUL","text":"“In this way, those whose journey has ended watch over those with the strength to step forward into a new day.”"},{"name":"OGUL","text":"Of all the wisdom Grandmother passed down, I hold this to be the most precious. Memories are the greatest treasure that we can leave behind."},{"name":"RACASHIR","text":"Your grandmother had a way with words. She could have taught even the divinities a thing or two."},{"name":"OGUL","text":"I daresay you may be right, young Racashir! I am not half so wise as she was, but her sage advice has been a beacon which has always guided me true."},{"name":"YEZAHN","text":"Ogul seems eager to speak with you, doesn't she?"},{"name":"RACASHIR","text":"I see now why my teacher is so wise─she had a wise teacher herself!"},{"name":"OGUL","text":"Truth be told, I first accompanied you here to repay the debt I owed, as Grandmother would have wanted. I see now, however, that fate intended for me to be here."},{"name":"OGUL","text":"In Sula I have met a comrade-in-arms, and in Racashir I have found a capable and eager student. For both of their sakes, I must strive ever to be better than the day I was before."},{"name":"OGUL","text":"Perhaps I should take up the art of dance? The fierce display of the Sekiseigumi compelled me to set down my spear and take up the katana, but the grace and deadliness with which the dancers throw their weapons has a charm all its own."},{"name":"OGUL","text":"Some measure of peace has returned to the Matanga, and I believe my skills will put to better use here. An adventurer must court challenge, after all!"},{"name":"RACASHIR","text":"My teacher has a daring spirit, if slightly reckless. But worry not─I'll make sure she doesn't come to harm."},{"name":"OGUL","text":"Have you listened to a single word I have said, Racashir? You have no notion of the dangers I must brave daily─for now you should be content to behold great deeds and learn from them."},{"name":"OGUL","text":"I wager your adventures will soon take you far from here, <span class=\"highlight\">Forename</span>. Rest assured I shall safeguard the people of Palaka's Stand in your stead. I look forward to hearing tales of your exploits!"},{"name":"OGUL","text":"Well then, the first order of the day is to attune to the aetheryte and gather information. Jot this lesson down, young Racashir, for these are the fundamentals of adventuring. Come now!"},{"name":"YEZAHN","text":"Our lack of supplies was weighing heavily on my mind. I feared for both Pasareen and the child, but for the first time in a long while, I can breathe easily."},{"name":"YEZAHN","text":"Ogul's presence has proven to be a salve on Sula's mood, as well. She laughs as she hasn't since her sister's passing. We both have you to thank for our reversals of fortune."},{"name":"YEZAHN","text":"Even the departed have benefited from Ogul's arrival. The delivery of the journal was an unexpected boon, and it will doubtless prove to be vital in raising the child."},{"name":"YEZAHN","text":"When she becomes old enough to understand its contents, she will come to know the deep love her parents bore for her. A love so steadfast that it will shield her from the world's cruelty."},{"name":"YEZAHN","text":"Of course, I intend to tell her all about your part in her salvation as well."},{"name":"YEZAHN","text":"But for now, there is work to be done─for both of us, I'm sure. Wheresoever your travels may take you, don't forget the friends you have in this corner of Thavnair."},{"name":"YEZAHN","text":"And lastly, be safe. If you die before I can repay the debt I owe you, I'll hunt you through the seven hells until the ledger is balanced. So let's see it doesn't come to that, eh?"}],"reward":{"gil":1375},"reqs":{"jobs":[{"lvl":80,"id":34}],"questsType":"all","quests":[70032,70028]},"next":[70081]},"partials":[{"type":"npc","id":"1041397","obj":{"i":1041397,"n":"Yezahn","l":3709,"q":4}},{"type":"quest","id":"70032","obj":{"i":70032,"n":"Societal Alchemy","g":122,"l":"Thavnair","s":2133,"f":1}},{"type":"quest","id":"70028","obj":{"i":70028,"n":"The Yedlihmad Hunt","g":122,"l":"Thavnair","s":1224,"f":1}},{"type":"quest","id":"70081","obj":{"i":70081,"n":"Hippos Born to Run","g":32,"l":"Thavnair","s":1,"f":1}}]}