{"quest":{"name":"Curing What Ails","location":"Thavnair","id":70030,"patch":6.0,"sort":2131,"icon":101081,"unlocksFunction":1,"eventIcon":71341,"issuer":1041397,"target":1041397,"genre":122,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Yezahn requires a capable green thumb to assist him.","Yezahn is ready to put you to work right away, enlisting your aid to gather herbs for the treatment of both the wounded villagers and the sick child. He informs you that they grow to the northeast, and bids you follow him to their location. <br><br>※Please note that the difficulty of this quest has been synced to your current level.","After a thorough search and an encounter with the local fauna, you manage to find some sprigs of soma. Find Yezahn to see if he has had similar success.","It seems Yezahn was not so lucky as you were, although he was spared from having to fight for his life. Satisfied with his supply for now, he returns to the settlement, and asks you to follow him.","In excited tones, Yezahn explains that he returned to his workshop to find a sack full of herbs. The alchemist guesses that it was the work of an Arkasodara named Sula, who was not-so-discreetly eavesdropping on your previous conversation with Pasareen. Yezahn asks you to speak with the steward, both to offer your thanks and to find out what she may know.","Sula feigns ignorance until you mention Pasareen, after which she suggests that you all speak together about the matter. She asks you to return to Yezahn, where she will join you after gathering her thoughts.","Sula arrives at Yezahn's quarters soon after you, clearly anxious. The Arkasodara reveals that Pasareen's beloved husband was killed by her own sister, Chapa, after he had transformed into a beast and attacked the village. Sula then blamed Pasareen for the incident─an action which she has since come to regret deeply. While Sula seems eager to mend their friendship, she requires a moment to gather her courage. Several moments, in fact."],"objectives":["Investigate the shrubbery to the northeast of Palaka's Stand and defeat any enemies that appear.","Speak with Yezahn.","Speak with Yezahn at Palaka's Stand.","Speak with Sula.","Speak with Yezahn."],"dialogue":[{"name":"PASAREEN","text":"I'm sorry..."},{"name":"YEZAHN","text":"Well then, if you're willing, I have a task that requires immediate attention. It's simple but essential─namely, the gathering of herbs. The child is in a vulnerable state, and I would fortify her against further sickness."},{"name":"YEZAHN","text":"There are also more wounded in this village than I had anticipated, and my stores have begun running low. It would be best to replenish them while time affords us an opportunity. Can I count on you to help me?"},{"name":"YEZAHN","text":"Splendid. I require several of the reddish soma herbs which grow among the shrubbery to the northeast. With both of us working in tandem, I wager we should have enough gathered before the next bell."},{"name":"YEZAHN","text":"They should be around here..."},{"name":"SYSTEM","text":"These appear to be the herbs you seek, but only their stems remain. Another enterprising alchemist must have already been here."},{"name":"YEZAHN","text":"I saw the creatures emerge from the brush, but you felled them before I had a chance to be frightened. I'm glad you survived unscathed. If that had been me... &lt;shudder&gt; "},{"name":"YEZAHN","text":"Anyroad, did you manage to find the soma?"},{"name":"YEZAHN","text":"Excellent work, excellent work. My search came up fruitless. It appears we're not the only ones seeking this particular herb."},{"name":"YEZAHN","text":"It shouldn't come as a surprise, I suppose. This area is well known for the medicinal plants which grow here."},{"name":"YEZAHN","text":"If my supplies run low once more, perhaps I should ask the villagers if they have any to spare. For now, I believe we've found all we can. Let's return to Palaka's Stand. "},{"name":"SULA","text":"Will that be enough, I wonder...?"},{"name":"YEZAHN","text":"As I suspected, we weren't the only ones searching the jungle. I returned to my quarters to find a bag positively stuffed to the brim with herbs─including soma, in fact."},{"name":"YEZAHN","text":"I asked a nearby colleague who delivered this bounty, and they told me it was one of the Arkasodara stewards. I believe I know who it is: her name is Sula. A shy one, but obviously kind of heart."},{"name":"YEZAHN","text":"I spied her eavesdropping during our conversation with Pasareen─poorly, I might add."},{"name":"YEZAHN","text":"I apologize for asking more of you at the end of a trying day, but would you speak with her for me? Offer our thanks for the herbs, and perhaps find out if she knows anything of Pasareen's troubles."},{"name":"YEZAHN","text":"For my part, I'll begin synthesizing the medicine at once. Sula should be somewhere nearby─I pray you have a productive conversation."},{"name":"YEZAHN","text":"Sula shouldn't be difficult to find. This settlement isn't terribly large."},{"name":"SULA","text":"Oh, you are─ I mean, who are you? Do you require something from me?"},{"name":"SULA","text":"The herbs? I came upon them while hunting, nothing more."},{"name":"SULA","text":"I have heard that the medicine made from them is effective in treating the ailments of young children. It seemed only meet that I should do my part, as it were."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"What do you know of Pasareen's troubles?"},{"name":"A1","text":"Why were you eavesdropping on our conversation?"},{"name":"SULA","text":"I... Oh, that? Well...ah..."},{"name":"SULA","text":"...Very well. I believe I can shed some light on the root of Pasareen's distress."},{"name":"SULA","text":"That <span class=\"emphasis\">is</span> what you wish to hear, yes? Yezahn asked you to speak with me. Just as he asked you to gather his herbs."},{"name":"SULA","text":"Well, then perhaps it is best for us to all speak together. Go to him, and allow me some time to gather my thoughts. I shall approach you when I am ready."},{"name":"SULA","text":"Return to Yezahn. I won't be long."},{"name":"YEZAHN","text":"You're just in time. I've only just finished synthesizing the medicine. So, did Sula tell you anything of interest?"},{"name":"YEZAHN","text":"Well, well, I suppose I can hear it straight from her. I appreciate that you felt it fit to include me."},{"name":"SULA","text":"Firstly, I owe you an apology. I was sneaking about out of concern for Pasareen. I know what it is that weighs on her mind, you see..."},{"name":"SULA","text":"That is what you want to know, yes? The story is troubling to hear, and even more troubling to relate. Before I tell it, you must promise me that you will be her strength in the days to come."},{"name":"YEZAHN","text":"Of course. Anything to help a friend."},{"name":"SULA","text":"Dazahl, her beloved husband, was killed."},{"name":"SULA","text":"When the veil of chaos descended upon the world, he fled into the jungle and transformed into one of those terrible beasts. He returned here a monster, where my sister Chapa met his wrath. Neither of them survived the ensuing struggle."},{"name":"SULA","text":"I was there as well... Despite his monstrous form, I knew it was Dazahl. I froze in terror, while Chapa stood undaunted. She fought alone for my cowardice... It was my fault she died. I knew this, and yet..."},{"name":"SULA","text":"...I laid the blame on Pasareen's shoulders! I lashed out at her, cursing her for her husband's cowardice!"},{"name":"SULA","text":"When we both should have comforted the other in mourning, I turned my back on her. I left her to bear the burden of not one, but two deaths. It is only natural that she would be hesitant to look after another, given that."},{"name":"SULA","text":"I was a fool to condemn Pasareen, when it was my duty to protect the people here. I have wanted nothing more than to apologize since that day, but I fear my words were too cruel to forgive. I cannot stand to meet her gaze."},{"name":"YEZAHN","text":"It was a difficult time for everyone. We often lose ourselves in moments of crisis, but so long as we find our way back, we are worthy of forgiveness."},{"name":"YEZAHN","text":"Chapa would agree, I'm sure. She wouldn't blame you for what happened, nor would she want you to blame yourself. Pasareen doubtless feels the same."},{"name":"SULA","text":"...You are right. I must apologize to her─that is the only course."},{"name":"SULA","text":"<span class=\"highlight\">Forename</span>, was it? I <span class=\"emphasis\">will</span> speak with Pasareen, but I require some time to muster my courage. Soon...I promise."}],"reward":{"gil":1015},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70029]},"next":[70031]},"partials":[{"type":"npc","id":"1041397","obj":{"i":1041397,"n":"Yezahn","l":3709,"q":4}},{"type":"quest","id":"70029","obj":{"i":70029,"n":"What's in a Parent","g":122,"l":"Thavnair","s":2130,"f":1}},{"type":"quest","id":"70031","obj":{"i":70031,"n":"The Sins We Bear","g":122,"l":"Thavnair","s":2132,"f":1}}]}