{"quest":{"name":"Societal Alchemy","location":"Thavnair","id":70032,"patch":6.0,"sort":2133,"icon":101081,"unlocksFunction":1,"eventIcon":71341,"issuer":1041403,"target":1041397,"genre":122,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Yezahn has one final request to make of you.","Sula is determined to do what she can to see the burden of guilt lifted from Pasareen's shoulders. To that end, she proposes looking for a memento to remind Pasareen of Dazahl and help her accept his loss. Sula suggests retracing the path the villagers fled down while searching for anything that might have been left behind.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","After searching the woods thoroughly, you chance upon a jewel that looks as if it was once set in something. This may be what you were searching for, and Sula may know more about it.","Sula has found an ornate necklace into which the jewel you found fits perfectly. However, there are still some repairs required before you can return it to Pasareen. Sula suggests asking Yezahn for help before turning back toward the village.","Yezahn informs you that Sula has left to find materials to polish the necklace. Yezahn will craft some adhesive to affix the jewel to its rightful position, and the alchemist asks you to find Pasareen and instruct her to await their arrival.","No sooner do you greet Pasareen than does Yezahn and Sula arrive, bearing a necklace gleaming as brightly as the day it was forged. Pasareen is moved by the gesture, and proposes that Yezahn take in the child of Mehvan. She will offer her assistance, first as a wet nurse and then as anything else as the child grows. Yezahn agrees, and Sula adds that she will hunt and bring the hardiest animals as food. With everyone at a happy agreement, they each go their separate ways, and Yezahn asks you to visit him at his quarters when you can.","While Yezahn knows that there is hard work in his future, he is glad that the people around him are beginning to heal. He resolves to do his level best for their sake, and hopes that together all in Palaka's Stand can arrive at the other side of this tragedy stronger than they were before."],"objectives":["Search for discarded baubles to the northwest of Palaka's Stand.","Speak with Sula.","Speak with Yezahn at Palaka's Stand.","Speak with Pasareen.","Speak with Yezahn."],"dialogue":[{"name":"SULA","text":"There must be something more I can do for her..."},{"name":"YEZAHN","text":"It is plain that Pasareen is not yet ready to forgive herself, but I'm at a loss as to what we should do. Do we leave her be? Or is there some way we can help?"},{"name":"SULA","text":"I, for one, will not stand idly by while she suffers alone. Perhaps if she had something to remind her of her beloved, she would more easily accept his loss. Pasareen never did have the chance to say her farewells."},{"name":"SULA","text":"<span class=\"highlight\">Forename</span>, I'm afraid I must ask for your aid once more. Will I have it?"},{"name":"SULA","text":"It appears I shall be in your debt again, but it is well worth it. During the chaos, most of us fled northwest to the bridge. Let us retrace those steps, and we may find something that belonged to Dazahl."},{"name":"SULA","text":"Pick up anything that catches your eye, and we can share what we have found once we reach the bridge."},{"name":"YEZAHN","text":"Thank you for all you've done for Sula thus far, <span class=\"highlight\">Forename</span>. Her spirits are already much improved for your efforts. Let's hope that we can effect the same change in Pasareen. "},{"name":"YEZAHN","text":"Dazahl did enjoy his jewelry and baubles, so it isn't inconceivable that he may have dropped something as he fled. If you should spy anything glittering in the brush, it couldn't hurt to pick it up."},{"name":"YEZAHN","text":"Dazahl was often bedecked in dazzling jewelry. Perhaps he dropped some piece of it in his flight."},{"name":"SULA","text":"I pray we find at least one small trinket to remember him by."},{"name":"SYSTEM","text":"Though the glimmer of this object caught your eye at a distance, on closer inspection it is just a rock."},{"name":"SULA","text":"How goes the search? I found this necklace among the underbrush. One of Dazahl's favorites, but it seems to be missing the jewel that made it shine so brilliantly."},{"name":"SULA","text":"Ah, what's that in your hand?"},{"name":"SULA","text":"Why, this is it! The very jewel I spoke of! We make an excellent team, eh?"},{"name":"SULA","text":"However, we cannot give this to Pasareen as it is. We must repair it first─doubtless Yezahn will be able to lend his expertise in that respect. Let us return to the village and speak with him."},{"name":"PASAREEN","text":"Would that we could return to the days before this tragedy occurred..."},{"name":"YEZAHN","text":"Sula has told me all about your findings─quite excitably, in fact. She's gone to find materials so she can polish the necklace to a mirror sheen."},{"name":"YEZAHN","text":"As for the jewel, I believe I can take it off your hands for the time being."},{"name":"YEZAHN","text":"This repair should prove simple enough. Adhesive is one of the most elementary recipes."},{"name":"YEZAHN","text":"Once the necklace is in presentable shape, I'll bring Sula to visit Pasareen. Could you go ahead and tell her to wait for us? If we take longer than expected, I trust you can keep her enraptured with one of your grand tales."},{"name":"YEZAHN","text":"Please find Pasareen and tell her we will soon be on our way to visit. Don't tell her what it is we bear, however. That would ruin the surprise."},{"name":"PASAREEN","text":"Hmm? You have something for me? I don't recall asking anything of you..."},{"name":"SULA","text":"Pasareen, I would like you to have this. Please."},{"name":"PASAREEN","text":"This...this is Dazahl's necklace! Oh, he was so proud the day he bought this... How in the world did you find it?"},{"name":"PASAREEN","text":"I had naught but memories to remind me of him, but this...the sight of this makes me feel that he isn't so far away after all. "},{"name":"SULA","text":"There is nothing I can do to change the past, but I can work to help give us both a brighter future. This was the least I could do, and I could not have done it without the help of these two. "},{"name":"PASAREEN","text":"Thank you for this gift, truly. And for your wise words. I see now that you're right. We mustn't let the tragedies of yesterday keep us rooted in place."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"All it takes is a single step forward, but you must want to take it."},{"name":"A1","text":"Sometimes we must stop to consider the best way forward."},{"name":"YEZAHN","text":"Well said, well said. Might I add that wounds heal more quickly when a salve is applied to them. When we ignore the pain they cause, they rot."},{"name":"YEZAHN","text":"We must take action to see them healed, and rest when we are tired. Only when our energy returns can we move forward, carefully. One step at a time."},{"name":"PASAREEN","text":"Yes... One step at a time..."},{"name":"PASAREEN","text":"Yezahn, if it isn't too much trouble... Could I help to care for the child?"},{"name":"PASAREEN","text":"The scars of recent tragedy are yet too fresh for me to take care of her entirely by myself, but even so, that doesn't mean I cannot assist in some small way."},{"name":"PASAREEN","text":"I have my own child to look over, of course, but still... If you were to take the child under your wing, I would be happy to assist you whenever you needed me."},{"name":"PASAREEN","text":"For the time being, I could be her wet nurse. Any medicine she requires would be your responsibility, I suppose. Together we can see that she emerges from her affliction as hale as any newborn babe. "},{"name":"YEZAHN","text":"That's a splendid idea, I must admit. I could hardly think of a better arrangement myself."},{"name":"SULA","text":"I shall hunt, and bring food for the child that she might grow to be strong like her father and mother. That is what Chapa would do, and one step at a time, I shall make her proud."},{"name":"PASAREEN","text":"The emptiness I feel at Dazahl's loss will take some time to fill, but I believe in time I will heal. He would want me to heal."},{"name":"PASAREEN","text":"Allow me to thank you once again for all you've done. We owe you more than we can repay. Now, I would like to see the child for myself."},{"name":"YEZAHN","text":"I'm not one for the subtleties of conversation, but I'd say that went as well as could be expected, wouldn't you? Now, come back to my workshop─there's something I'd like to give you."},{"name":"YEZAHN","text":"Truth be told, I had already resolved to raise the child myself, but the prospect of having a helping hand is comforting indeed."},{"name":"YEZAHN","text":"I suppose the true work starts from here, eh? I'm glad to finally have good news to share with Qerasaf and Mehvan."},{"name":"YEZAHN","text":"...Ah, I've been so occupied with treating the sick and injured that I've had little time to think of the departed. My friends really are gone, but I can still honor their memory."},{"name":"YEZAHN","text":"If anything has become clear from recent events, it is that the people of this settlement must speak with one another about their troubles. Solitary thoughts so quickly turn dark."},{"name":"YEZAHN","text":"I'm more than capable of treating the wounds we can see, but it takes a community to heal those that are hidden. I admit the latter prospect may take some time for me to become accustomed to."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Don't be so hard on yourself. Your presence puts others at ease."},{"name":"A2","text":"You'll find a way. As an alchemist, a friend, and a father."},{"name":"YEZAHN","text":"I didn't mean to get myself entangled into such serious matters when I set out to speak with Pasareen. So much for that relaxing life I was looking forward to."},{"name":"YEZAHN","text":"Would that there were more than one of me, eh? Luckily I know more than a few concoctions that will give me the vigor of several men. I only need have the energy to brew them..."},{"name":"YEZAHN","text":"Regardless, I apologize for dragging you along all this time, even though I doubt we would have arrived at such an amicable conclusion without you. So...I retract my apology."},{"name":"YEZAHN","text":"Well then, it'll soon be my turn to care for the child."},{"name":"YEZAHN","text":"Although her parents are no longer with us, I must do my utmost to raise their daughter in a way that would meet with their approval. I owe my friends that much."},{"name":"YEZAHN","text":"Although her parents are no longer with us, I must do my utmost to raise their child in a way that would meet with their approval. I owe my friends that much."}],"reward":{"gil":1015,"items":[{"num":2,"id":36044,"one":1},{"num":2,"id":36045,"one":1},{"num":2,"id":36048,"one":1},{"num":2,"id":36049,"one":1},{"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70031]},"next":[70033]},"partials":[{"type":"npc","id":"1041403","obj":{"i":1041403,"n":"Yezahn","l":3709,"q":1}},{"type":"npc","id":"1041397","obj":{"i":1041397,"n":"Yezahn","l":3709,"q":4}},{"type":"item","id":"36044","obj":{"i":36044,"n":"Wine-dark Soup","l":533,"c":24123,"t":46}},{"type":"item","id":"36045","obj":{"i":36045,"n":"Glory Be Soup","l":533,"c":24106,"t":46}},{"type":"item","id":"36048","obj":{"i":36048,"n":"Hamsa Curry","l":539,"c":24040,"t":46}},{"type":"item","id":"36049","obj":{"i":36049,"n":"Karniyarik","l":539,"c":24162,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"70031","obj":{"i":70031,"n":"The Sins We Bear","g":122,"l":"Thavnair","s":2132,"f":1}},{"type":"quest","id":"70033","obj":{"i":70033,"n":"A Budding Adventure","g":122,"l":"Thavnair","s":2134,"f":1}}]}