{"quest":{"name":"Energy for All","location":"Garlemald","id":70037,"patch":6.0,"sort":1580,"icon":101083,"eventIcon":71221,"issuer":1041761,"target":1040963,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Rimelnaud has precisely one solution in mind, which is notably better than zero.","Rimelnaud proposes that to circumvent the issue of needing an identification key, he and Appius reconfigure the rig's control mechanisms to operate without one. He returns to camp to gather the equipment and men needed to do so while Appius gets to work on the necessary rewiring. Meanwhile, you are tasked with slaying any particularly fearsome creatures in the vicinity, that the engineers not be accosted.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You summarily execute two nearby monsters, which seems good enough. It is, after all, freezing out here.","When you return to Appius, it transpires that he has finished his preparations─and rather enjoyed watching your battle from afar. Rimelnaud then returns with the necessary power sources, which members of the contingent attach to the facility. Soon enough, Juturna Platform G roars back to life with Appius at the helm.","With the rig now confirmed operational, Rimelnaud suggests the three of you head back to camp to inform Esdelot of your roaring success.","Esdelot is delighted to hear of your achievements, and extends his gratitude for all you have done, as do the others. Thanks to you, Appius and Rimelnaud now dare to dream of the ways in which the newly recovered ceruleum supply will help the region and its people on their road to recovery."],"objectives":["Lie in wait at the designated location and slay any enemies that appear.","Speak with Appius.","Speak with Rimelnaud.","Speak with Esdelot at Camp Broken Glass."],"dialogue":[{"name":"APPIUS","text":"I appreciate your optimism, but...how <span class=\"emphasis\">are</span> we going to solve this problem?"},{"name":"RIMELNAUD","text":"Is there really no way to bypass the mechanism that the identification key interacts with?"},{"name":"APPIUS","text":"What exactly do you mean?"},{"name":"RIMELNAUD","text":"I work at the manufactory in Ishgard. I once watched my superior─as is his way─dismantle a magitek armament and put it back together again."},{"name":"RIMELNAUD","text":"He succeeded in bypassing the verification mechanism required to activate the machine by rewiring it. I was wondering if something similar wouldn't be possible with the platform."},{"name":"APPIUS","text":"That's something a second-rate thief would do!"},{"name":"RIMELNAUD","text":"Well, beggars can't be choosers. Save your chief engineer appearing out of thin air, it's likely our only option."},{"name":"APPIUS","text":"You've got a point there..."},{"name":"APPIUS","text":"And far be it from me to turn down a proposal from an esteemed colleague! I'm <span class=\"emphasis\">so</span> glad to have you at my disposal..."},{"name":"RIMELNAUD","text":"Er...that's the spirit, I suppose."},{"name":"RIMELNAUD","text":"I shall return to camp to inform the quartermaster of our plan. He should be willing to spare an external power source and a few other tools if I vow to return them soon. Perhaps even some extra pairs of hands..."},{"name":"APPIUS","text":"That leaves me to open up the control panel and rearrange a few things before Rimelnaud returns!"},{"name":"APPIUS","text":"In the meantime, I'd thank you to keep an eye out for anything that might eat him on the way back."},{"name":"APPIUS","text":"There were never so many beasts around before, but they must've gotten comfortable without us traipsing back and forth across the ice─a little <span class=\"emphasis\">too</span> comfortable, if you ask me."},{"name":"APPIUS","text":"I've done all I can for now. I even caught the end of your battle with those creatures! Spectacular."},{"name":"RIMELNAUD","text":"Ready to get to work, I hope?"},{"name":"APPIUS","text":"Of course! All that's left is to engage in a bit of Ishgardian skullduggery."},{"name":"RIMELNAUD","text":"...I'm not sure I care for that turn of phrase, but very well. We'll attach the power devices, which should allow you to utilize the control panel."},{"name":"APPIUS","text":"Thrilling!"},{"name":"APPIUS","text":"This place will be up and running before you know it. Just stand back and watch the master at work."},{"name":"RIMELNAUD","text":"It worked...yes?"},{"name":"APPIUS","text":"You bet it did! There's life in the old girl yet."},{"name":"APPIUS","text":"Of course, there's still a lot of work to be done to get it ready to extract and refine ceruleum, but we're off to an excellent start."},{"name":"APPIUS","text":"Which means Garlemald just took its first steps on the road to recovery."},{"name":"APPIUS","text":"I cannot thank you both enough!"},{"name":"APPIUS","text":"I'll be feeling that thrill for days! Fortunate am I to have such brilliant new friends."},{"name":"RIMELNAUD","text":"I'm pleased that this plan was a success after all. I appreciate your seeing it through to the end."},{"name":"RIMELNAUD","text":"We can leave the rest to the engineers I brought with me. They're more than capable of keeping the place operational until we're prepared for the next phase."},{"name":"RIMELNAUD","text":"Now, let us all return to camp and inform Esdelot of our triumph."},{"name":"ESDELOT","text":"Ah, good to see you again. I was just wondering when I might hear how you had fared with the platform."},{"name":"ESDELOT","text":"...And it seems I won't have any longer to wait. I trust your eagerness is a sign that you had some success?"},{"name":"RIMELNAUD","text":"Yes, sir! We were able to access the platform's controls and confirm that it is operational. There are still adjustments to be made, but I imagine it won't be long until it's fully operational."},{"name":"ESDELOT","text":"Splendid. If the camp can secure a stable supply of energy, we can begin rebuilding throughout the region."},{"name":"ESDELOT","text":"It will doubtless give succor to those in Tapper's Den and the capital proper as well."},{"name":"ESDELOT","text":"One of our goals when we first came here was to improve the lives of those that still call this frozen land home, and you have made a great contribution toward realizing that ambition."},{"name":"RIMELNAUD","text":"Thank you, sir."},{"name":"APPIUS","text":"I certainly wouldn't have made it this far without your genius."},{"name":"APPIUS","text":"The days when Garlemald looked toward a bright future seem so distant now that the snow and frost have reclaimed their dominion..."},{"name":"APPIUS","text":"But I, for one, am ready to embark on the same journey that my ancestors once did, and build a new home around the warmth of cerulean flame."},{"name":"RIMELNAUD","text":"I am certain that when the time comes, I shall be proud to know that I worked alongside you."},{"name":"RIMELNAUD","text":"I must thank you as well. You have taught me to listen with sincerity to the words of those who I would otherwise have unjustly scorned."},{"name":"RIMELNAUD","text":"I imagine it will be some time before we can return Laterum to its former inhabitants, but I promise that when we do, it will be in a better state than when you left."},{"name":"APPIUS","text":"Well, then, we'd better get to work!"},{"name":"RIMELNAUD","text":"...Ah. “We.” Indeed."}],"reward":{"gil":935,"items":[{"num":2,"id":36040,"one":1},{"num":2,"id":36041,"one":1},{"num":2,"id":36042,"one":1},{"num":2,"id":36043,"one":1},{"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70036]},"next":[70042]},"partials":[{"type":"npc","id":"1041761","obj":{"i":1041761,"n":"Rimelnaud","l":3710,"q":1}},{"type":"npc","id":"1040963","obj":{"i":1040963,"n":"Esdelot","l":3710,"q":1}},{"type":"item","id":"36040","obj":{"i":36040,"n":"Island Miq'abob","l":525,"c":24351,"t":46}},{"type":"item","id":"36041","obj":{"i":36041,"n":"King Crab Cake","l":530,"c":24329,"t":46}},{"type":"item","id":"36042","obj":{"i":36042,"n":"Ukha","l":530,"c":24109,"t":46}},{"type":"item","id":"36043","obj":{"i":36043,"n":"Borscht","l":530,"c":24103,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"70036","obj":{"i":70036,"n":"Operation: Reactivation","g":123,"l":"Garlemald","s":1570}},{"type":"quest","id":"70042","obj":{"i":70042,"n":"Who Is Your Daddy","g":123,"l":"Garlemald","s":1749}}]}