{"quest":{"name":"Operation: Reactivation","location":"Garlemald","id":70036,"patch":6.0,"sort":1570,"icon":101083,"eventIcon":71221,"issuer":1041755,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Rimelnaud is now surprisingly keen to get the platform up and running.","Rimelnaud bids you join him in going to tell Esdelot, the quartermaster, about the plan to reactivate Juturna Platform G. You agree in the hope of finally realizing Appius's goal to restore some warmth to his homeland.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Esdelot indicates that the contingent will only aid in the restoration of the platform if you first confirm that to do so is possible under the current conditions. As such, you are once again volunteered by Appius to head out into the snow and investigate Juturna Platform G's status.","Appius bids you stay outside and keep watch for any threats while he inspects the platform's facilities. Though it is unclear what use Rimelnaud will be in a combat situation, he remains to keep your company.","Appius returns bearing bad news: it seems the identification key required to restart the platform is in possession of his erstwhile superior, Frontinus, who has since disappeared. Though he is initially disheartened, you encourage him not to give up until you have confirmed that there is no other way the platform may be brought back to life."],"objectives":["Speak with Esdelot.","Speak with Appius at Juturna Platform G.","Wait at the designated location for Appius to return."],"dialogue":[{"name":"APPIUS","text":"Perhaps I should I temper my expectations...or is it better to remain positive? Quick, tell me what face better endears you to my cause!"},{"name":"RIMELNAUD","text":"If there are no objections, I will speak to the quartermaster about getting the necessary men and supplies for this operation straightaway. He's stationed just over there in the pavilion."},{"name":"RIMELNAUD","text":"Could I trouble you to accompany me? It might help if another can testify to Appius's sincerity and competence."},{"name":"APPIUS","text":"Great idea! What are we waiting for?"},{"name":"RIMELNAUD","text":"One would think he didn't have a care in the world... Let us pray that Esdelot is amused rather than irritated."},{"name":"APPIUS","text":"Whew! The nerves are really setting in now..."},{"name":"RIMELNAUD","text":"This is the quartermaster, Esdelot. Have you two not met?"},{"name":"ESDELOT","text":"Ah, Rimelnaud. I see you've brought <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span> and...is that the envoy from Tapper's Den?"},{"name":"RIMELNAUD","text":"Er...yes? You see, sir, it all began with Appius here..."},{"name":"ESDELOT","text":"I see... It would certainly be a boon to us if the platform was restored to working order."},{"name":"APPIUS","text":"No doubt! So...you agree to help?"},{"name":"ESDELOT","text":"On one condition─you must first confirm that the platform <span class=\"emphasis\">can</span> be reactivated."},{"name":"ESDELOT","text":"We aren't blessed with a surfeit of personnel and resources, you know─thus our reaching out to the tappers to begin with. We cannot waste time and manpower on operations with little chance of success."},{"name":"ESDELOT","text":"Rimelnaud, you are tasked with assessing the current state of Juturna Platform G, as well as the precise resources we would need to commit to reactivating it. I shall make my final decision on how to proceed only once I am fully abreast of the situation."},{"name":"RIMELNAUD","text":"Yes, sir!"},{"name":"APPIUS","text":"In that case, <span class=\"highlight\">Forename</span> and I will accompany you!"},{"name":"RIMELNAUD","text":"You really ought to stop making decisions on <span class=\"highlight\">Forename</span>'s behalf... But I would be glad for the company."},{"name":"RIMELNAUD","text":"Meet us at Juturna Platform G, if you would. Appius can help me carry the equipment..."},{"name":"ESDELOT","text":"If it can be reactivated, that platform will play a key role in restoring these lands to their former habitability. I pray you return with good tidings."},{"name":"RIMELNAUD","text":"This is an imperial facility, to be sure. Garish, if you ask me..."},{"name":"APPIUS","text":"Ah, I do so miss the days when we had a full crew! Pumping, and tinkering, and operating heavy machinery on too little sleep..."},{"name":"RIMELNAUD","text":"As much as I would like to know what in the hells you're on about, we have no time to be revisiting old memories. We're here for one reason─and one reason <span class=\"emphasis\">only</span>."},{"name":"APPIUS","text":"I know, I know... At least the exterior seems unharmed. I'll head inside and have a look around─can you two stay here and make sure nothing large and hungry is waiting for me when I come back?"},{"name":"RIMELNAUD","text":"That sounds reasonable. <span class=\"highlight\">Forename</span>, let us keep our wits about us..."},{"name":"APPIUS","text":"Excellent! I'll see you both in a bit."},{"name":"RIMELNAUD","text":"Not exactly warm out here, is it? Nevertheless, we must stay focused..."},{"name":"RIMELNAUD","text":"Ah, Appius. How did it look?"},{"name":"APPIUS","text":"The equipment appears undamaged, though temperatures are so low that we'll need to be careful about how we turn everything on again. It's just..."},{"name":"RIMELNAUD","text":"What? Is there another issue?"},{"name":"APPIUS","text":"In a word, yes. I couldn't find the identification key. Without it, there's no way to activate the platform, even if it were in pristine condition..."},{"name":"RIMELNAUD","text":"...And why exactly was it designed with such an obvious flaw?"},{"name":"APPIUS","text":"Flaw!? Juturna Platform G is the capital's main supplier of ceruleum. It wouldn't do if anyone could turn it off and on, now would it?"},{"name":"APPIUS","text":"The key is always kept secure, and there are only two people able to open the container it's usually stored in─myself and Chief Frontinus."},{"name":"APPIUS","text":"I haven't seen him since this blasted war began, but I can only imagine he's out there somewhere, key in hand."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You think he took it?"},{"name":"A1","text":"Which means he avoided being tempered."},{"name":"APPIUS","text":"I've never met anyone quite as loyal to the Empire as Chief Frontinus. He probably took the key to stop anyone from misusing the platform..."},{"name":"RIMELNAUD","text":"Then I'd say he's succeeded in his aim. It's stayed dormant this whole time, and out of the hands of the warring factions."},{"name":"APPIUS","text":"Indeed. Now we just need to find out where he is..."},{"name":"APPIUS","text":"&lt;sigh&gt; I'm sorry for wasting your time. There's no way we can get this place up and running without that key."},{"name":"RIMELNAUD","text":"Don't tell me you're going to give up! Just like that?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Let's find another way to activate it."},{"name":"A2","text":"Not after I found a <span class=\"emphasis\">carburetor</span> for you, you don't!"},{"name":"APPIUS","text":"Hmm... I suppose you're right. With the three of us together, surely we can think of something!"}],"reward":{"gil":935},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70035]},"next":[70037]},"partials":[{"type":"npc","id":"1041755","obj":{"i":1041755,"n":"Rimelnaud","l":3710,"q":3}},{"type":"quest","id":"70035","obj":{"i":70035,"n":"Camp Broken Engines","g":123,"l":"Garlemald","s":1560}},{"type":"quest","id":"70037","obj":{"i":70037,"n":"Energy for All","g":123,"l":"Garlemald","s":1580}}]}