{"quest":{"name":"The Sins We Bear","location":"Thavnair","id":70031,"patch":6.0,"sort":2132,"icon":101081,"unlocksFunction":1,"eventIcon":71341,"issuer":1041406,"target":1041402,"genre":122,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Sula looks eager to leave Palaka's Stand, but to where is not clear.","Sula's mood has lightened somewhat, but it appears she still needs some time to steel her resolve. She asks you to accompany her on a patrol of the temples dotting the region, a task which she hopes will help calm her. With a little bit of urging from Yezahn, you agree to accompany the guardian to Purusa.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You make the long trek to Purusa and Sula gives you a brief history of the place before quickly moving her mind to her duty. While this area seems to be in good repair, Sula will not be satisfied until a thorough search is conducted.","Sula appears to be concerned by the scratches and other damage in this area of the temple. She suggests splitting up and searching for further signs of disrepair.","You have searched the temple and found several spots that beg for maintenance. Return to Sula and report your findings.","Although your words trouble Sula at first, she seems to be reinvigorated by the work. Her spirits properly steeled, she resolves to make her apology. However, she not-so-subtly hints that having you by her side would be preferable to speaking with Pasareen alone.","Sula musters her courage and finally apologizes to Pasareen, but it seems the woman has already forgiven the Arkasodara, instead blaming herself for her husband's transformation and Chapa's death. Pasareen asks for more time to cope with recent events and takes her leave. Now that Sula has said her apology, she is determined to help her friend during their time of need. "],"objectives":["Speak with Sula at Purusa.","Speak with Sula again.","Investigate the damaged stones.","Report to Sula.","Speak with Pasareen at Palaka's Stand."],"dialogue":[{"name":"YEZAHN","text":"When we spoke before, Pasareen said that she was unworthy to care for the child. I see now why she would think that. The pain she suffered is not one that heals easily."},{"name":"SULA","text":"Thank you for lending an ear to my troubles, <span class=\"highlight\">Forename</span>. If you are willing, there is a place I would travel to, and I wish for you to accompany me."},{"name":"SULA","text":"Administering to my duties may help calm my nerves. To that end, I mean to inspect the temples for signs of disrepair. After we have finished, I hope to find the courage to once again look Pasareen in the eyes."},{"name":"SULA","text":"With all the monsters about, most of my attention of late has been focused on finding and protecting those who have fled. With the arrival of the Radiant Host, however, there is finally time to attend to this long-neglected duty. "},{"name":"YEZAHN","text":"I too must ask that you go with Sula. Knowing that their holy places are being cared for may set these people's hearts at ease. Even an onze of comfort is precious in these trying times."},{"name":"YEZAHN","text":"Much appreciated. Would that I could join you, but I'm afraid an alchemist's tools are of little use against fangs and claws."},{"name":"YEZAHN","text":"That doesn't mean I'll stand idly by, however. I'll remain here and continue making medicine for the children─my hands may be clumsy with sword and shield, but there are few more adroit with mortar and pestle. "},{"name":"SULA","text":"We are blessed indeed to have a pair such as you looking after us. Well then, let us begin the patrol. Our first destination shall be Purusa, to the southeast. It is a bit of a trek, so make the proper arrangements before departing."},{"name":"YEZAHN","text":"You probably don't need to hear this from me, but...be careful."},{"name":"SULA","text":"It has been some time since I have set foot in these hallowed grounds. In times bygone, there were even more such places in this region, but many were moved to Vanaspati."},{"name":"SULA","text":"From one of the divinities worshipped here were these words passed down, that we might send off our departed with its wisdom."},{"name":"SULA","text":"“Just as life leads to death, so too does death lead to life.”"},{"name":"SULA","text":"“Do not shed tears for the departed, for they have but set foot upon a new journey.”"},{"name":"SULA","text":"“Be not forlorn that your paths have diverged, but look forward with joy to the day that they might cross again.”"},{"name":"SULA","text":"For as long as I can remember, I followed in my sister's footsteps. In her absence I have felt lost. Whenever I think to forge a path of my own making, my legs become heavy and my heart becomes anxious."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Your sister would want you to move forward with courage."},{"name":"A1","text":"Sometimes standing still offers a new perspective."},{"name":"SULA","text":"...Hmm. Thank you, <span class=\"highlight\">Forename</span>. Yezahn has a generous soul, and to have your wisdom to buoy me is more than I deserve. Would that I could open my heart to Pasareen in such a way..."},{"name":"SULA","text":"...This part of the temple appears to be well-kept. Let us check the other side, shall we?"},{"name":"SULA","text":"This area is in ghastly shape. Scratches, here. And cracks, there. Will you help me investigate further?"},{"name":"SULA","text":"We will cover more ground by searching separately. I shall search around this area─I trust you to do your due diligence."},{"name":"SULA","text":"I shall look for further signs of disturbance here. You're free to search where you will─if there is aught to find, I know your keen eyes will spot it."},{"name":"SYSTEM","text":"The stones here are cracked and require repair."},{"name":"SYSTEM","text":"The stones here are crumbling and fragments of them litter the ground. It would be best to replace them."},{"name":"SYSTEM","text":"The stones of the foundation appear to be unstable. However, filling in the areas where the grout has fallen away should remedy that."},{"name":"SULA","text":"Have you finished? Was it as bad as it looks?"},{"name":"SULA","text":"I see. This may have been the site of a battle or some other horrible conflict. I must do what I can to see it repaired─though this temple may be remote, the devout do come here on occasion to offer their prayers."},{"name":"SULA","text":"Thank you for helping me today. This has helped me forget the crises that plague us and reminded me of simpler times."},{"name":"SULA","text":"When we would look after the roads and protect the pilgrims on their journeys. I ever looked forward to setting out on patrol with my sister by my side. But I must find a way to manage without her, to set foot upon my own path..."},{"name":"SULA","text":"My first step must be to apologize to Pasareen, even if she may refuse it. No more distractions. That being said, if you were by my side, it may be all the easier for me to find the right words."},{"name":"YEZAHN","text":"Well, Sula looks determined to see this through."},{"name":"SULA","text":"My heart is pounding, but the sooner this is done with the better it shall be for both of us. I hope..."},{"name":"PASAREEN","text":"...Oh, hello, <span class=\"highlight\">Forename</span>. And...Sula..."},{"name":"YEZAHN","text":"I take it your patrol was fruitful. I've just administered a soothing salve to Pasareen's child. She's sleeping soundly now, so us speaking should not wake her."},{"name":"SULA","text":"Pasareen, I... I'm sorry! I should not have said all those horrible things before. I was not in my right mind..."},{"name":"SULA","text":"It was my fault my sister was killed. I stood frozen in fear when Dazahl attacked, yet when it was all over I placed the blame on you. I was a fool!"},{"name":"PASAREEN","text":"No, Sula, you were right. It was I who couldn't ease his troubles. It was my fault he succumbed to the despair that gnawed at his heart."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"We've all lost something during this tragedy─through no one's fault but fate."},{"name":"A2","text":"These are difficult days, and we shouldn't blame ourselves for their cruelty."},{"name":"PASAREEN","text":"There is reason in your answer, of course...but forgiveness of the self is no simple matter."},{"name":"PASAREEN","text":"I am overjoyed to speak with you again, Sula. However, I'm afraid I need more time to come to terms with everything that has occurred."},{"name":"SULA","text":"...Would that I knew how much Pasareen was suffering, I could have been there to comfort her. Perhaps there is something I can do now. Something to set her upon the right path."}],"reward":{"gil":1015},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70030]},"next":[70032]},"partials":[{"type":"npc","id":"1041406","obj":{"i":1041406,"n":"Sula","l":3709,"q":1}},{"type":"npc","id":"1041402","obj":{"i":1041402,"n":"Pasareen","l":3709,"q":1}},{"type":"quest","id":"70030","obj":{"i":70030,"n":"Curing What Ails","g":122,"l":"Thavnair","s":2131,"f":1}},{"type":"quest","id":"70032","obj":{"i":70032,"n":"Societal Alchemy","g":122,"l":"Thavnair","s":2133,"f":1}}]}