{"quest":{"name":"Camp Broken Engines","location":"Garlemald","id":70035,"patch":6.0,"sort":1560,"icon":101083,"eventIcon":71221,"issuer":1041755,"target":1041754,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Rimelnaud perhaps requires some thawing.","Upon significant prompting from Rimelnaud, Appius mentions that a replacement carburetor will be required to fix one of the camp's ceruleum engines. You agree to head to Monitoring Station G in order to extract one from an engine there.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You search ceruleum engine innards as instructed, and come up with what is, as far as you can tell, an intact carburetor.","Appius wastes no time in repairing the ceruleum engines, and it soon transpires that he is originally from the area currently occupied by the camp. He explains that his motivation for reactivating the platform is to make returning to the area a viable proposition for those who once inhabited it, and is naturally delighted when Rimelnaud promises to broach the topic with his superior."],"objectives":["Obtain a ceruleum engine carburetor.","Deliver the ceruleum engine carburetor to Appius."],"dialogue":[{"name":"APPIUS","text":"Now that Rimelnaud knows I'm worthy of his trust, we need only prove it to his superiors!"},{"name":"RIMELNAUD","text":"Ere you become even more excited─will you indeed require additional parts to perform your repairs? I cannot say I spotted any likely spares while setting up the camp..."},{"name":"APPIUS","text":"Ah, it's so good to have a quick-thinking machinist like yourself on my side!"},{"name":"RIMELNAUD","text":"No amount of flattery will convince me to take you to my superiors ere we have physical proof of your good intentions."},{"name":"RIMELNAUD","text":"Now focus, please. Are spare parts required─yes or no?"},{"name":"APPIUS","text":"Yes, yes. You're awfully tense about the shoulders, did you know that?"},{"name":"APPIUS","text":"I <span class=\"emphasis\">will</span> be needing a replacement carburetor for one of the engines. Fortunately, the same sort of engines were in use at Monitoring Station G, last I checked. We ought to be able to find what we need there."},{"name":"APPIUS","text":"After I've swapped out the faulty part and made my other repairs, I'll warm the engines up properly. That should clear any ceruleum residue and allow them to run at full capacity once more."},{"name":"APPIUS","text":"With that in mind, I want to start taking things apart. Can you fetch the carburetor for me? Do you even know what a carburetor <span class=\"emphasis\">is</span>?"},{"name":"RIMELNAUD","text":"<span class=\"alternative-container\"><span class=\"alternative\">She's</span><span class=\"alternative\">He's</span></span> a bona fide hero, you know! You can't just ask <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to do your bidding. And rudely, at that!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"No idea, but leave it to me."},{"name":"A1","text":"I'm used to being ordered around..."},{"name":"RIMELNAUD","text":"If you're certain... You will need to look for a sort of tube connected to the ceruleum engine's core. Many magitek devices utilize them."},{"name":"APPIUS","text":"No, no, it's “car-bur-e-tor.” Carburetor!"},{"name":"RIMELNAUD","text":"Never fear─I shall keep an eye on Appius."},{"name":"SYSTEM","text":"This so-called “carburetor” appears to have seen better days. Perhaps another ceruleum engine has a nicer one."},{"name":"SYSTEM","text":"This “carburetor” appears to be intact. Appius will know for certain."},{"name":"APPIUS","text":"And not a moment too soon! Were you able to find an intact carburetor?"},{"name":"APPIUS","text":"This will do it! Now Rimelnaud and I can finish fixing up those engines in no time at all."},{"name":"APPIUS","text":"There─everything's in order. These should be much more efficient...and you'll notice they've stopped making strange and ominous noises!"},{"name":"RIMELNAUD","text":"I must say, I am taken aback by your abundance of skill. Allow me to thank you on behalf of everyone here at Camp Broken Glass."},{"name":"APPIUS","text":"Oh, the pleasure's all mine. Happy to be of service!"},{"name":"RIMELNAUD","text":"You...do seem genuine about that. Tell me, do you have some sort of connection to Camp Broken Glass?"},{"name":"APPIUS","text":"In a way... I hail from Laterum, as it happens."},{"name":"APPIUS","text":"It was a village here─precisely where your camp is now. It acted as a checkpoint for those visiting the capital, but it was also home to the rigs' workers and our families."},{"name":"APPIUS","text":"Obviously, much has happened since last I could call this place “home,” but in my heart of hearts, it always will be."},{"name":"RIMELNAUD","text":"I must apologize. We're effectively occupying your home, yet placed the full burden of proving good faith in our dealings upon you..."},{"name":"APPIUS","text":"Oh, no, I couldn't blame you for that. We hardly had a viable alternative to abandoning Laterum, knowing we could never defend ourselves against wandering bands of maddened soldiers, but that reality is no more your fault than ours."},{"name":"APPIUS","text":"Even if you vacated right this instant, I doubt many of us would return. We simply don't have the resources..."},{"name":"APPIUS","text":"Until Juturna Platform G is back in working order, that is."},{"name":"APPIUS","text":"Truth be told, your presence here is what has me daring to hope. If you agree to help me now, there may come a day when the other survivors and I can come home."},{"name":"RIMELNAUD","text":"Fury above, I certainly can't turn you away now...and you've proven yourself with your work this day. I've no lingering qualms about approaching my superiors with your proposal."},{"name":"APPIUS","text":"Truly? Oh, I could kiss you!"}],"reward":{"gil":935},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70034]},"next":[70036]},"partials":[{"type":"npc","id":"1041755","obj":{"i":1041755,"n":"Rimelnaud","l":3710,"q":3}},{"type":"npc","id":"1041754","obj":{"i":1041754,"n":"Appius","l":3710,"q":1}},{"type":"quest","id":"70034","obj":{"i":70034,"n":"In Pursuit of Power","g":123,"l":"Garlemald","s":1550,"f":1}},{"type":"quest","id":"70036","obj":{"i":70036,"n":"Operation: Reactivation","g":123,"l":"Garlemald","s":1570}}]}