{"quest":{"name":"Meekly Majestic","location":"Elpis","id":70049,"patch":6.0,"sort":6193,"icon":101087,"eventIcon":71221,"issuer":1041426,"target":1041434,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Kleon hopes to retain your company a while longer.","Kleon tells you of another concept due for evaluation, and asks that you remain at his side during the process. Follow after Alkaios to the place where the io roams.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You join Alkaios at the spot where the io is usually found, but the creature is nowhere to be seen. At Maira's suggestion, you split up to track down the missing concept, a “shaggy, four-legged beast with rather majestic horns.”","You eventually find the io, and Kleon shares his plans for the creature's place in the world. Unfortunately, however, Alkaios is forced to point out that although the beast is indeed physically powerful, it lacks the traits necessary to become a dominant hunter. Noting the io's tendency towards nutritional deficiency, the observer requests that you administer its scheduled aetherial supplement.","The aetherial supplement appears to have been successfully absorbed by the io. You turn to see Kleon looking upon his creation, his face filled with bittersweet adoration...","Facing yet another recommendation to adjust his original concept, Kleon seems unwilling to abandon his dream of turning the io into an apex predator. A sudden hope lights up his features, and he looks to you─the worldly familiar─in search of inspiration..."],"objectives":["Speak with Alkaios.","Search for the io.","Use the aetherial supplement on the io.","Speak with Kleon."],"dialogue":[{"name":"KLEON","text":"You've chosen to stay, then? Wonderful! I realize we've only just met, but I feel such a bond with you, <span class=\"highlight\">Forename</span>!"},{"name":"KLEON","text":"There is one more concept I need to finalize, and I could think of no other entity I would rather have at my side during these ever-so-worrisome evaluations..."},{"name":"KLEON","text":"You have my io somewhere nearby, don't you, Alkaios?"},{"name":"ALKAIOS","text":"Yes. Maira keeps that one under her watchful eye, but I know the spot where it usually roams. Come along, we need to cross the stream here..."},{"name":"MAIRA","text":"Kleon certainly has taken a liking to you, hasn't he?"},{"name":"ALKAIOS","text":"What a wonderfully unusual familiar you are..."},{"name":"MAIRA","text":"Hm? Well, that's strange."},{"name":"KLEON","text":"Oh, I don't see my io anywhere...which seems impossible, considering how big she is."},{"name":"ALKAIOS","text":"How odd. This is where it usually spends the greater part of its days..."},{"name":"MAIRA","text":"Yes, she never strays far from this spot. Perhaps the scent of unfamiliar visitors has made her wary?"},{"name":"MAIRA","text":"Let's split up and try to find her─“her” being a shaggy, four-legged beast with rather majestic horns."},{"name":"ALKAIOS","text":"Albeit rarely, a creation will sometimes display unexpected behaviors. This is exactly why we conduct thorough evaluations here in Elpis before setting them loose upon the world."},{"name":"MAIRA","text":"Come on out, girl! No one's going to harm you!"},{"name":"KLEON","text":"Am I considered an “unfamiliar visitor” now? &lt;sigh&gt; I always thought of myself as the father of my creations, but I suppose I will never be their true parent..."},{"name":"SYSTEM","text":"You find a shaggy, four-legged beast, and the horns really are rather majestic... This must be the io."},{"name":"KLEON","text":"Ah, there she is, the naughty thing! Nicely tracked, <span class=\"highlight\">Forename</span>!"},{"name":"MAIRA","text":"Hello, my lovely. Come to Maira, now."},{"name":"MAIRA","text":"Well, would you look at that. I think she's taken a liking to you, <span class=\"highlight\">Forename</span>."},{"name":"ALKAIOS","text":"And I see that Kleon has a liking for stout and stocky designs."},{"name":"KLEON","text":"Yes! The heftier, the better! The io is one of my favorites─round and robust, and bristling with spiky protrusions! A truly powerful beast!"},{"name":"KLEON","text":"I envisioned her dominating any habitat she entered. What do you think?"},{"name":"MAIRA","text":"Ah, she's certainly an imposing specimen..."},{"name":"ALKAIOS","text":"Its physical strength is readily apparent, yes, but more than muscle is needed to dominate a territory. The creature's field of vision is obscured by that mass of wiry hair and curling horns, preventing effective use of its natural weaponry."},{"name":"ALKAIOS","text":"In the wild, being unable to hunt and catch prey in a consistent manner culminates in a slow death by starvation. It is our recommendation that you redesign the io as a grass grazer and resubmit the concept as a candidate for livestock."},{"name":"KLEON","text":"Livestock..."},{"name":"ALKAIOS","text":"Unsurprisingly, the io here is susceptible to nutritional deficiencies, and we must administer regular aetherial supplements. As you appear to have gained its trust, would you mind doing the honors?"},{"name":"ALKAIOS","text":"You needn't convince it to eat anything─simply splash the creature with this solution."},{"name":"ALKAIOS","text":"Supplemental aether is absolutely essential for such a poor hunter. We wouldn't want the io to collapse now, would we?"},{"name":"MAIRA","text":"Such a good-natured creature...which is a large part of the problem, I'm afraid."},{"name":"KLEON","text":"If I must change her into livestock to see her released into the world, then that is what I must do..."},{"name":"SYSTEM","text":"The aetherial supplement is absorbed into the io's body..."},{"name":"SYSTEM","text":"Although difficult to tell, you think the io looks somewhat healthier..."},{"name":"KLEON","text":"Thank you for tending to my creation, <span class=\"highlight\">Forename</span>."},{"name":"KLEON","text":"My io would likely thrive as a livestock animal, but I did so dearly want her to become an apex predator..."},{"name":"KLEON","text":"Oh! Maybe there's still hope! You have an eye for these things─could you offer any more of your insightful suggestions?"}],"reward":{"gil":935},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70048]},"next":[70050]},"partials":[{"type":"npc","id":"1041426","obj":{"i":1041426,"n":"Kleon","l":3713,"q":2}},{"type":"npc","id":"1041434","obj":{"i":1041434,"n":"Kleon","l":3713,"q":2}},{"type":"quest","id":"70048","obj":{"i":70048,"n":"A Better Batrachoi","g":125,"l":"Elpis","s":6192}},{"type":"quest","id":"70050","obj":{"i":70050,"n":"Unleash the Beast","g":125,"l":"Elpis","s":6194}}]}