{"quest":{"name":"Touring Anagnorisis, Part I","location":"Elpis","id":70043,"patch":6.0,"sort":4111,"icon":101086,"unlocksFunction":1,"eventIcon":71341,"issuer":1041328,"target":1041328,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Sokles regards you with pointed interest.","Sokles welcomes you to Anagnorisis, and promptly assumes you are a familiar seeking to expand its worldly knowledge. To that end, the overseer suggests you speak with the nearby Charmion, and request a guided tour of the area.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Although surprised at being chosen for the duty, Charmion nevertheless agrees to show you the sights. Anagnorisis awaits you...as does Charmion.","Rather than simply lecture you as you walk around, Charmion suggests that you speak with her various colleagues in turn. In this way, she hopes you will gain a more intimate understanding of the work they do in Anagnorisis.<br><br>※You must be accompanied by Charmion to complete this task. Speak with her again should you become separated.","During your tour of Anagnorisis, you have learned that much of the work here consists of patient observation─be that of plants, familiars, or gargantuan creatures. The time has come to return to Overseer Sokles, and end your circuit where it began.","Convinced that you are some manner of advanced familiar, both Sokles and Charmion seem intrigued by your impressions of their workplace. They ask that you stay for a while, and continue to share your thoughts and observations..."],"objectives":["Speak with Charmion.","Speak with Charmion again and have her accompany you.","Speak with the Anagnorisis observers while accompanied by Charmion.","Speak with Sokles while accompanied by Charmion."],"dialogue":[{"name":"SOKLES","text":"Welcome, friend, to Anagnorisis. I am Sokles, and I manage this region under the authority of Chief Hermes, the head overseer of Elpis."},{"name":"SOKLES","text":"And you are, hmmm... Oh, how unusual! A soul-bearing familiar!"},{"name":"SOKLES","text":"A familiar must have a mission, and yet you offer no message and carry no cargo. Are you perhaps here for the purposes of observation?"},{"name":"SOKLES","text":"Yes, that must be it! In which case, you need only mention my name to Charmion, and she will gladly give you a tour of our domain. Soak it all in!"},{"name":"SOKLES","text":"Have you become separated from your guide? Charmion should be around here somewhere..."},{"name":"CHARMION","text":"Y-Yes? Ahem. Yes, what can I do for you?"},{"name":"CHARMION","text":"<span class=\"highlight\">Forename</span>, is it? And Overseer Sokles wishes me to act as your guide? Oh..."},{"name":"CHARMION","text":"...Oh! No! I didn't mean it like that! I would be more than happy to show you around! I'm simply wondering why the overseer chose to send you to <span class=\"emphasis\">me</span> of all people."},{"name":"CHARMION","text":"I haven't been here long myself, truth be told. Until quite recently, I was wholly engaged in a prolonged research project at the Akadaemia Anyder."},{"name":"CHARMION","text":"Surely there are other, more experienced individuals who could provide a more comprehensive─ Ahem. This grumbling is hardly constructive now, is it?"},{"name":"CHARMION","text":"The task was given to me, and I will attempt to cover the most salient features of our facilities to the best of my abilities. After all, it is not every day that one is asked to indulge the curiosity of such a rare and fascinating visitor!"},{"name":"CHARMION","text":"We can commence the tour this very moment if you like...?"},{"name":"CHARMION","text":"Then let us begin!"},{"name":"CHARMION","text":"Hm. You know, rather than have me lecture you as we walk along, I think observing firsthand what we do here in Anagnorisis would prove more beneficial."},{"name":"CHARMION","text":"I will point you in the right direction, and you can question my colleagues to your heart's content. Once we've completed a circuit, we can return and speak to Overseer Sokles!"},{"name":"SYSTEM","text":"Charmion is now accompanying you. Keep her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Charmion behind by entering a different area, or by speaking with her and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Charmion accompany you again, return and speak with her at the original location."},{"name":"SOKLES","text":"Have you become separated from your guide? Charmion should be around here somewhere..."},{"name":"BLASTE","text":"All alone, are you?"},{"name":"NIKIAS","text":"What's this? A wandering familiar?"},{"name":"PARAMONOS","text":"You're an interesting specimen, aren't you?"},{"name":"SYSTEM","text":"You must be accompanied by Charmion and have her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"Charmion has yet to arrive. Be sure she is at your side before attempting to continue."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Talk."},{"name":"A1","text":"Part ways."},{"name":"A1","text":"Nothing."},{"name":"CHARMION","text":"Not sure who to speak with? Don't be shy! Any one of my colleagues will happily answer your questions!"},{"name":"CHARMION","text":"I think we've covered the main areas of interest. All that's left now is to speak with Overseer Sokles."},{"name":"SYSTEM","text":"Are you sure you wish to part ways with Charmion?"},{"name":"CHARMION","text":"...Leaving? In the middle of the tour? Well, I suppose familiars have their own tasks to attend to, don't they! I shall be here when you are ready to resume your education!"},{"name":"CHARMION","text":"You are free to continue, yes? Then let's press on with the tour!"},{"name":"CHARMION","text":"You are free to continue, yes? Then let us return to Overseer Sokles!"},{"name":"BLASTE","text":"Hello, Charmion. ...Was there something?"},{"name":"CHARMION","text":"The overseer asked that I give this familiar a tour of the grounds, and I thought the best way to do that was to show <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> what we do here firsthand."},{"name":"BLASTE","text":"I see. Well, as my work is rather difficult to demonstrate, I hope a brief explanation will suffice."},{"name":"BLASTE","text":"Our creations are many and varied, but I mainly preside over the plant life. When it comes to watching certain grasses grow, one must be prepared to observe over the course of several years─and in the case of trees, sometimes decades."},{"name":"BLASTE","text":"Tedious, perhaps, yet necessary. Plants are capable of altering an entire habitat, and their presence as a food source has an enormous influence on the local wildlife."},{"name":"BLASTE","text":"...Was that the sort of thing you wished to know?"},{"name":"CHARMION","text":"Yes, that was perfect, thank you!"},{"name":"NIKIAS","text":"Charmion! Oh, and who is your friend?"},{"name":"NIKIAS","text":"Azem's familiar!? Why, you appear so astute and deliberate in your thinking... I should very much like to make an extended study of your composition and consciousness!"},{"name":"NIKIAS","text":"Oh, do forgive my forwardness! It is my duty to chart the behavior of familiars, and I find it ever so diverting."},{"name":"NIKIAS","text":"Arcane servants are rarely permitted to roam the world at will, you see, but our research here is given special dispensation─once the subjects are properly registered as concepts, of course."},{"name":"NIKIAS","text":"There are times when familiars are tasked with tending cattle, or must otherwise coexist with other living beings."},{"name":"NIKIAS","text":"Such projects are brought to me, and I am responsible for observing and evaluating their potential compatibilities."},{"name":"NIKIAS","text":"Oh, but of course! If Azem might grant us permission, then you could abide here for a few years while I analyze─"},{"name":"CHARMION","text":"And on that note, we really must be moving along! ...Step lively, <span class=\"highlight\">Forename</span>!"},{"name":"PARAMONOS","text":"Who do we have here? A familiar of some kind, judging by your aetherial structure..."},{"name":"CHARMION","text":"Yes, I am accompanying <span class=\"highlight\">Forename</span> here on a tour around Anagnorisis, at the behest of the overseer."},{"name":"PARAMONOS","text":"A tour? Feel free to wander as you please, of course, but I advise keeping your distance from the larger creatures."},{"name":"PARAMONOS","text":"The fauna I have under observation occupy the top tier of the food chain, and do not take kindly to intruders in their territory─especially the specimens found on the other islands. They can be <span class=\"emphasis\">exceedingly</span> hostile."},{"name":"PARAMONOS","text":"While I am sure you are quite capable of defending yourself, no one appreciates a surprise tusk through the abdomen, eh?"},{"name":"CHARMION","text":"Thank you for the warning. We will proceed with due caution!"},{"name":"CHARMION","text":"I think we've covered the main areas of interest. All that's left now is to speak with Overseer Sokles."},{"name":"BLASTE","text":"As much as I would love to field any further flora-related questions, I really cannot miss the flowering of my annual herb garden..."},{"name":"NIKIAS","text":"Hm? Still here? Has my request for full compositional analysis been granted!?"},{"name":"PARAMONOS","text":"As I said, mind the big ones as you walk around. They are best appreciated from afar."},{"name":"SOKLES","text":"Enjoying the tour, are we? Range far and wide, and drink in the sights!"},{"name":"SOKLES","text":"Ah, I see you've completed your tour."},{"name":"CHARMION","text":"Almost! We spoke with those in charge of the various facets of Anagnorisis, but I thought it would be fitting to end this visit where it began: with you, Overseer Sokles."},{"name":"SOKLES","text":"I see, and what is your impression of the work we do here?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"It attracts some interesting people..."},{"name":"A2","text":"It requires equal levels of passion and patience."},{"name":"SOKLES","text":"I am glad we could help further your worldly education."},{"name":"CHARMION","text":"And I am glad to see you enjoyed the experience! At least, I hope you did..."},{"name":"SOKLES","text":"You are truly a masterpiece of creation. Only a soul-bearing familiar could demonstrate such robust cognitive and cogitative faculties."},{"name":"CHARMION","text":"Were you perhaps designed to inspire others? I feel something special has been woven into your aura..."},{"name":"CHARMION","text":"You have an intriguing presence, to say the least! Please, stay awhile, and share more of your thoughts with us."},{"name":"SOKLES","text":"Yes, I second this invitation. In all the long years I have resided here, never have I encountered such a unique entity─and one of Azem's, no less!"}],"reward":{"gil":935,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69961]},"next":[70044]},"partials":[{"type":"npc","id":"1041328","obj":{"i":1041328,"n":"Sokles","l":3713,"q":2}},{"type":"quest","id":"69961","obj":{"i":69961,"n":"Their Greatest Contribution","g":11,"l":"Elpis","s":579}},{"type":"quest","id":"70044","obj":{"i":70044,"n":"Touring Anagnorisis, Part II","g":125,"l":"Elpis","s":4112}}]}