{"quest":{"name":"Mum Is the Word","location":"Garlemald","id":70041,"patch":6.0,"sort":1748,"icon":101084,"eventIcon":71221,"issuer":1041770,"target":1041767,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Galla senses your search is nearing an end.","With the fresh information gleaned from the abandoned hideout, you and Galla decide to make the journey to the Senaculum Imperialis. It is there you hope to find Volusus's mother and perhaps other survivors, though you can only pray they have escaped the attention of the deadly machina roaming the area.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Galla happens upon the corpse of a member of the royal guard. While inspecting the body for potential clues, you hear an anguished cry from nearby, and race to investigate.","You find another member of the royal guard who has successfully fended off a magitek drone, though he is fortunate to have survived the encounter. Nearby, you finally locate Vipsania, who is visibly shaken by the ordeal.","Having made your peaceful intentions clear to Vipsania, she gives a brief account of her flight from Palatium Novum and the kind actions of the royal guard who has kept her safe. Galla urges the pair to join her at Tertium, where they will be warmly received, particularly by Volusus, who misses his mother dearly.","Volusus and Vipsania are at long last reunited, bringing a rare moment of joy to the imperial encampment. Inspired by these jubilant scenes, Galla is reminded of why she first dedicated her life to helping the commonfolk. She urges Vipsania to rest in Tertium until suitably recovered to travel to Camp Broken Glass, a far safer environment for the mother and her young son."],"objectives":["Speak with Galla in the Senaculum Imperialis.","Search the area and aid anyone who may be injured.","Aid Vipsania.","Speak with Volusus at Tertium."],"dialogue":[{"name":"VOLUSUS","text":"Where did she go? I hope she's safe... Dad, too."},{"name":"GALLA","text":"Ready, I take it? Then let's resume our search."},{"name":"GALLA","text":"We'll be heading to the Senaculum Imperialis—that enormous stone building to the northwest. Hopefully, that's where we'll find Vipsania."},{"name":"GALLA","text":"He bears the insignia of the royal guard. Only the most proficient and experienced warriors are accepted into their ranks."},{"name":"GALLA","text":"Alas, he's no longer among the living, though evidently, he has only been here a short while. What could have happened here?"},{"name":"PRAETORIAN04505","text":"(-???-)Hyaaagh!"},{"name":"GALLA","text":"That came from nearby! Come on!"},{"name":"VIPSANIA","text":"No... Stay away!"},{"name":"PRAETORIAN04505","text":"I have no idea who you are, but I owe you a great debt."},{"name":"PRAETORIAN04505","text":"There's a wounded woman over there by the name of Vipsania. Please, tend to her as well."},{"name":"VIPSANIA","text":"I see you're not one of <span class=\"emphasis\">them</span>. But who are you?"},{"name":"VIPSANIA","text":"Just when I was about to lose all hope, you appear..."},{"name":"GALLA","text":"We managed to put down the last of them."},{"name":"VIPSANIA","text":"I still can't quite believe you're here at my son's request."},{"name":"GALLA","text":"You should be proud. Were it not for him, we might never have found you."},{"name":"GALLA","text":"I'm sure he'll be eager to express his gratitude to this gentleman here."},{"name":"VIPSANIA","text":"Yes, he and I both served the royal family, at least until the city was plunged into chaos. I was badly injured, and he's been by my side ever since."},{"name":"VIPSANIA","text":"While I was still recovering, he even penned letters for me, and placed them in the ruins of my home for my loved ones to find."},{"name":"PRAETORIAN04505","text":"Your praise is wasted on me, truly. After all, I and my comrades stopped you from going to meet your family at the Ist Legion's encampment...for our own selfish reasons."},{"name":"PRAETORIAN04505","text":"Then, even the Senaculum Imperialis─our supposed safe haven─was attacked by rampaging magitek. I shall never live down the shame of failing to protect the members of the royal household in my care..."},{"name":"PRAETORIAN04505","text":"But thanks to you both, I have been spared an untimely end. Pray accept my deepest gratitude."},{"name":"GALLA","text":"We're glad to help. And for what it's worth, I'm sure my comrades in the Ist would rather let bygones be bygones than perpetuate old grudges."},{"name":"GALLA","text":"The two of you must come with us to Tertium. That goes double for you, Vipsania─your son will be overjoyed to see you again."},{"name":"VIPSANIA","text":"And I him. We've been apart for far too long."},{"name":"GALLA","text":"Then let's waste no more time here, but we'd better not rush, given your injuries."},{"name":"VOLUSUS","text":"Did you find her?"},{"name":"VOLUSUS","text":"Mum!"},{"name":"VIPSANIA","text":"I'm so sorry, my love..."},{"name":"GALLA","text":"I simply have to know: why did you leave Palatium Novum?"},{"name":"PRAETORIAN04505","text":"We both served the kin of Lord Nerva, so it was decided we would join the IIIrd Legion in the Senaculum Imperialis."},{"name":"PRAETORIAN04505","text":"But as soon as we set foot outside, the streets were overrun by soldiers in the throes of madness and magitek drones attacking anyone who dared cross their path. It's a miracle we even managed to escape."},{"name":"PRAETORIAN04505","text":"We eventually made it to the Senaculum Imperialis and hid inside, though it didn't take long for the machina to find us. You stepped in just when we had begun to abandon hope."},{"name":"GALLA","text":"Looks like we arrived in the nick of time."},{"name":"VIPSANIA","text":"To be separated from my dear boy was more than I could bear, but I knew that even without my injuries, I wouldn't stand a chance out there on my own."},{"name":"VOLUSUS","text":"But we're together now, aren't we? That's all that matters!"},{"name":"GALLA","text":"And it's all thanks to you."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Seeing their smiles has made it all worthwhile."},{"name":"A1","text":"All's well that ends well."},{"name":"VIPSANIA","text":"She is right. We'll never forget what you've done for us. You truly are a hero."},{"name":"GALLA","text":"This reminds me of why I joined the Vigiles Urbani all those years ago. It's true what they say─a good deed really is its own reward."},{"name":"GALLA","text":"Anyroad, we'd best stay here a while to allow Vipsania time to recuperate─she's still injured after all. Then, we can head to Camp Broken Glass."}],"reward":{"gil":935,"items":[{"num":2,"id":36040,"one":1},{"num":2,"id":36041,"one":1},{"num":2,"id":36042,"one":1},{"num":2,"id":36043,"one":1},{"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70040]},"next":[70042]},"partials":[{"type":"npc","id":"1041770","obj":{"i":1041770,"n":"Galla","l":3710,"q":1}},{"type":"npc","id":"1041767","obj":{"i":1041767,"n":"Volusus","l":3710,"q":3}},{"type":"item","id":"36040","obj":{"i":36040,"n":"Island Miq'abob","l":525,"c":24351,"t":46}},{"type":"item","id":"36041","obj":{"i":36041,"n":"King Crab Cake","l":530,"c":24329,"t":46}},{"type":"item","id":"36042","obj":{"i":36042,"n":"Ukha","l":530,"c":24109,"t":46}},{"type":"item","id":"36043","obj":{"i":36043,"n":"Borscht","l":530,"c":24103,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"70040","obj":{"i":70040,"n":"Palatial Possibilities","g":123,"l":"Garlemald","s":1747}},{"type":"quest","id":"70042","obj":{"i":70042,"n":"Who Is Your Daddy","g":123,"l":"Garlemald","s":1749}}]}