{"quest":{"name":"Familiar Fate","location":"Elpis","id":70046,"patch":6.0,"sort":4114,"icon":101086,"eventIcon":71221,"issuer":1041362,"target":1041905,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Charmion has one last question to ask you.","Charmion, it seems, has saved her most philosophical question for last: how do you feel about your place in the grand scheme of things? To help you better understand her own calling in life, the inquisitive observer bids you follow her northwest to the Anagnorisis archives.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","The archives in question contain rows of what appear to be administrative records. Charmion has given you leave to browse these documents at your leisure...","Upon perusing the documentation, you discover a staggering number of observation logs─many of them written in Overseer Sokles's hand. Charmion waits nearby, eager to hear your thoughts.","Now that you have some inkling of the sheer volume of the overseer's work, Charmion admits to some trepidation at being chosen as Sokles's successor. For his part, however, Sokles has full confidence in her knowledge and ability, and credits you for helping prepare the way for his “return to the star”..."],"objectives":["Speak with Charmion.","Browse the documentation.","Speak with Charmion."],"dialogue":[{"name":"CHARMION","text":"<span class=\"highlight\">Forename</span>, I feel we've grown to understand each other..."},{"name":"CHARMION","text":"But there is one last thing I wish to know."},{"name":"CHARMION","text":"As you've seen, our purpose is to improve life on this star, and we each have our own way of approaching that purpose."},{"name":"CHARMION","text":"Familiars, too, exist for a reason─often a very specific one─and I just... I wonder what you feel about <span class=\"emphasis\">your</span> place in the grand scheme of things."},{"name":"SOKLES","text":"Charmion, perhaps you can provide our friend here with an example of what you mean. Such a nebulous question requires a more recognizable foundation from which to answer."},{"name":"CHARMION","text":"Yes, you're right, of course! We must not skip the journey in our haste to reach the destination."},{"name":"CHARMION","text":"Where to begin? Broadly speaking, we study the wisdom and magicks of our forebears, and choose our path as our interests and talents begin to crystallize."},{"name":"CHARMION","text":"Even among the observers of Anagnorisis, however, Overseer Sokles and I share a similar calling..."},{"name":"CHARMION","text":"...Again, it may be more beneficial to simply show you what I mean. Please accompany me to the archives in the northwest."},{"name":"SOKLES","text":"Never a dull moment with Charmion, is there? Still, her boundless enthusiasm is what makes her such a fine observer."},{"name":"SOKLES","text":"The exchange of knowledge is quite mutual, I assure you!"},{"name":"CHARMION","text":"This is where we keep all of the administrative records."},{"name":"CHARMION","text":"Any of these documents will help give you an idea of what we consider to be our defining purpose. Feel free to browse."},{"name":"CHARMION","text":"I shall just be...awaiting you outside."},{"name":"SYSTEM","text":"These books appear to contain detailed observation logs. The name “Sokles” is written on each of the spines."},{"name":"SYSTEM","text":"You pick up the log and flip to a random page..."},{"name":"SYSTEM","text":"<span class=\"emphasis\">Today there was an incident involving the hippokampos. The creature is extremely territorial, and four observers sustained light to severe injuries from water-based magicks as a result of their perceived intrusion into its domain.</span>"},{"name":"SYSTEM","text":"<span class=\"emphasis\">A report has been sent to the Words of Lahabrea outlining the dangers inherent in continued observation of their nominated subject, and the intent to shift our focus to the smaller─and considerably less aggressive─hippe.</span>"},{"name":"SYSTEM","text":"A stack of half-finished observation logs. Judging by the penmanship, the author is someone other than Sokles."},{"name":"CHARMION","text":"Ah, <span class=\"highlight\">Forename</span>. Did you find the observation logs enlightening?"},{"name":"CHARMION","text":"Overseer Sokles has built up quite a library, hasn't he? He's logged comprehensive observations on every living being in Anagnorisis─not only objective physical descriptions, but also his personal thoughts and impressions."},{"name":"CHARMION","text":"And that's why I'm here: to carry on the overseer's invaluable work."},{"name":"CHARMION","text":"When it comes to the continued success of Anagnorisis, our purposes are very much aligned."},{"name":"CHARMION","text":"I cannot help but worry, however, that I lack the same degree of perception and ability; that I am unfit for the task I have chosen. Even being in the same room as those logs is enough to make me feel uncomfortable."},{"name":"CHARMION","text":"My insistence that you examine <span class=\"emphasis\">your</span> purpose was, I think, born from the trepidation which surrounds my own."},{"name":"SOKLES","text":"(-???-)An uncertainty you need not feel."},{"name":"CHARMION","text":"Overseer Sokles!"},{"name":"SOKLES","text":"As one of our newest arrivals, you have ever been quick to doubt yourself."},{"name":"SOKLES","text":"Yet you were able to guide <span class=\"highlight\">Forename</span> here on an engaging tour through the intricacies of our duties, which clearly demonstrates the depths of your understanding."},{"name":"SOKLES","text":"If all I wanted was someone to emulate my work, why, I would simply continue doing it myself. No, the reason I asked you to assume my role is because I believe you can take our projects in new and novel directions."},{"name":"SOKLES","text":"Raising you as a competent successor is the final step of <span class=\"emphasis\">my</span> purpose in life. Do me proud, Charmion─it is your growth, your efforts, which will facilitate my return to the star."},{"name":"CHARMION","text":"I will do my best, Overseer!"},{"name":"CHARMION","text":"But don't be in too much of a rush to leave us! There are still so many things I need you to teach me..."},{"name":"CHARMION","text":"...And speaking of teaching! Thank you, <span class=\"highlight\">Forename</span>, for this wonderful and enriching visit. It's been a pleasure learning about you─not to mention a few things about myself!"},{"name":"SOKLES","text":"Yes, you also have my gratitude for the part you've played in training my young colleague. You are welcome to return whenever you wish!"}],"reward":{"gil":895},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70045]},"next":[70051]},"partials":[{"type":"npc","id":"1041362","obj":{"i":1041362,"n":"Charmion","l":3713,"q":2}},{"type":"npc","id":"1041905","obj":{"i":1041905,"n":"Charmion","l":3713,"q":1}},{"type":"quest","id":"70045","obj":{"i":70045,"n":"Familiar Food","g":125,"l":"Elpis","s":4113}},{"type":"quest","id":"70051","obj":{"i":70051,"n":"Methods of Mourning","g":125,"l":"Elpis","s":6195}}]}