{"quest":{"name":"Palatial Possibilities","location":"Garlemald","id":70040,"patch":6.0,"sort":1747,"icon":101084,"eventIcon":71221,"issuer":1041768,"genre":123,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Galla is on a mission to find a mother.","After speaking with Volusus you learn that his mother is likely still in Palatium Novum. Galla bids you join her there to see if you can finally find Vipsania.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Arriving at Palatium Novum, Galla volunteers to go inside and search for survivors. However, the hordes of magitek drones patrolling the area present a considerable threat to your endeavors, so you elect to keep them occupied while your companion goes about her work.","The unmanned magitek prove no match for your abilities, though it is clear they would have spelled trouble for Galla had they been allowed anywhere near the building.","Galla returns to tell you that while Palatium Novum is empty, there were several clues which suggest the survivors who had taken refuge inside have headed to the Senaculum Imperialis. With a fresh lead in your quest to find Vipsania, you prepare to make another perilous journey through the wastes."],"objectives":["Speak with Galla in Palatium Novum.","Lie in wait at the designated location and defeat the magitek drones.","Lie in wait at the designated location."],"dialogue":[{"name":"VOLUSUS","text":"Maybe Dad is with her!"},{"name":"GALLA","text":"Until now, I thought that the best thing we could do for Volusus is to take him straight to Camp Broken Glass."},{"name":"GALLA","text":"But with the new information that has come to light, perhaps it is better for him to wait here a little longer, at least while we search for his parents."},{"name":"VOLUSUS","text":"I appreciate you looking for them, I really do!"},{"name":"GALLA","text":"If you're going to thank anyone, thank <span class=\"highlight\">Forename</span> for changing my mind."},{"name":"GALLA","text":"Right, let's go over what we learned from the letter. Vipsania is injured, but in a safe location."},{"name":"GALLA","text":"Volusus says it's not his parents' handwriting, which means she must be with another person entirely, someone she can ask to write letters in her stead. Or at least, that's what I make of it."},{"name":"GALLA","text":"Do you know where she might go in a time of emergency?"},{"name":"VOLUSUS","text":"Maybe Palatium Novum? She was a maid there. The last time I saw her, she was on her way there. Even with all the fighting, she had lots to do."},{"name":"VOLUSUS","text":"She told me keep listening to the radio, in case there was any news about the war. If anything really bad happened, we were to meet here, at the station."},{"name":"GALLA","text":"So the radio kept you from harm, and thanks to her forethought, you were able to find shelter immediately after the city descended into chaos. Your mother is a clever woman indeed, but I wonder, why hasn't she made her way here?"},{"name":"GALLA","text":"Hmm... She worked at Palatium Novum─Titus and Nerva's residence. Perhaps when she learned the station was held by their enemies, the Ist Legion, she may have thought against coming here. Even with the war effectively over, she may have been suspected as a spy or the like."},{"name":"GALLA","text":"So, any thoughts on the matter?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"She must be with associates of the royal family."},{"name":"A1","text":"His mother's probably in Palatium Novum."},{"name":"GALLA","text":"Indeed. That explains why she told Volusus not to worry about her and think only of his own safety."},{"name":"GALLA","text":"At any rate, let's make our way to Palatium Novum and see what we can find."},{"name":"VOLUSUS","text":"I hope you find my mum. Then we can be together again!"},{"name":"GALLA","text":"Well, this is it: Palatium Novum. A far cry from its former glory, but relatively untouched compared to some parts of the capital."},{"name":"GALLA","text":"It was built to last, so the lower floors ought to provide adequate refuge. However, there are countless magitek drones patrolling the perimeter, attacking any who approach."},{"name":"GALLA","text":"That would explain why those inside have been unable to seek shelter elsewhere. How ironic that the very machina that once protected Garlemald are now one of the greatest threats to her people..."},{"name":"GALLA","text":"But now is not the time for such musings. I know the interior well enough that I should be able to locate any survivors fairly quickly. Could you keep the magitek drones away while I'm inside?"},{"name":"GALLA","text":"I'll be back as soon as I've finished my search. In the meantime, take care."},{"name":"GALLA","text":"Judging by the din outside, you encountered some trouble. You have my thanks."},{"name":"GALLA","text":"Unfortunately, I saw no sign of the royal family or Vipsania in there, or anyone at all, for that matter."},{"name":"GALLA","text":"That said, it wasn't a complete waste of time. It looked like people had been living in there until fairly recently."},{"name":"GALLA","text":"There was a radio in there too─one of the newer models─so I imagine they avoided being tempered."},{"name":"GALLA","text":"It appears they've taken all the provisions and warm clothing with them, which indicates they had plenty of time to plan their exit."},{"name":"GALLA","text":"I did, however, spot a map of the capital, on which they'd marked a route from here to the Senaculum Imperialis."},{"name":"GALLA","text":"You see where this is leading, yes?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Vipsania fled with the royal family."},{"name":"A2","text":"The survivors have headed to the Senaculum Imperialis."},{"name":"GALLA","text":"Precisely. It's hard to imagine Vipsania parting with the royal family at this point, which means she must have accompanied them on their journey."},{"name":"GALLA","text":"Judging by the condition of the rooms inside, I would say only a few days have passed at most since their departure."},{"name":"GALLA","text":"When you are ready, let's head to the Senaculum Imperialis and continue our search."}],"reward":{"gil":935},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70039]},"next":[70041]},"partials":[{"type":"npc","id":"1041768","obj":{"i":1041768,"n":"Galla","l":3710,"q":1}},{"type":"quest","id":"70039","obj":{"i":70039,"n":"Longing for Home","g":123,"l":"Garlemald","s":1746}},{"type":"quest","id":"70041","obj":{"i":70041,"n":"Mum Is the Word","g":123,"l":"Garlemald","s":1748}}]}