{"quest":{"name":"A Better Batrachoi","location":"Elpis","id":70048,"patch":6.0,"sort":6192,"icon":101087,"eventIcon":71221,"issuer":1041372,"target":1041426,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Kleon looks at you expectantly.","Kleon explains that he is concerned for the fate of his creations─namely, a concept he has named the “batrachoi.” It seems you are to follow the Amaurotine visitor to Rumination's Ramble, where Maira's brother, Alkaios, is tending to the observational subject in question.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You find Alkaios with the batrachoi, but he is pessimistic about the creature's final evaluation. To demonstrate why, he asks that you give the batrachoi a solid poke.","Although designed to act as a guardian of waterways, the lack of response to your deliberate provocation has revealed the batrachoi's extreme docility. Kleon is devastated at the thought of having to abandon his beloved concept, but your suggestion to impart an aggressive attack to the creature may just have saved it from being retired altogether.","Kleon thanks you enthusiastically for your assistance, and hopes you will stay around to help him with another of his creations. Meanwhile, you try not to linger on the fact that you may have helped inflict the ancestor of the gigantoad upon the world..."],"objectives":["Speak with Alkaios.","Give the batrachoi a solid /poke.","Speak with Kleon."],"dialogue":[{"name":"KLEON","text":"Thank you for agreeing to accompany us, <span class=\"highlight\">Forename</span>. Shall we?"},{"name":"MAIRA","text":"Certainly. Now, what was the name of your creation again...?"},{"name":"KLEON","text":"The “batrachoi”! A delightfully roly-poly pudding of a thing!"},{"name":"MAIRA","text":"Ah yes, the one over at Rumination's Ramble! My brother, Alkaios, is in charge of tending to it. Right this way, if you please."},{"name":"MAIRA","text":"Thank you for your continued assistance."},{"name":"MAIRA","text":"This is my brother, Alkaios. He might seem a tad gruff, but don't be fooled─there are few more gentle or kind than he."},{"name":"KLEON","text":"There's my beloved batrachoi! Did he miss me, I wonder!?"},{"name":"SYSTEM","text":"The toad-like creature placidly endures your scrutiny."},{"name":"ALKAIOS","text":"You must be <span class=\"highlight\">Forename</span>. Maira has told me so much about you...in an impressively short span of time."},{"name":"ALKAIOS","text":"As you have likely already deduced, I am her brother, Alkaios."},{"name":"ALKAIOS","text":"And you are Kleon, yes? The architect of this “batrachoi” as you call them?"},{"name":"KLEON","text":"Yes, yes I am! You think them ready for release? I would so love to see their endearing, rotund forms bouncing around free in the wild!"},{"name":"ALKAIOS","text":"I've completed my report for the main evaluation criteria. The final decision will be made after a committee discusses the results, but based upon my personal observations...? No, they are not ready."},{"name":"KLEON","text":"No!? And might I ask why!?"},{"name":"ALKAIOS","text":"<span class=\"highlight\">Forename</span>? Would you be so kind as to give this batrachoi a solid poke? The creature's lack of familiarity with you will help prove my point."},{"name":"ALKAIOS","text":"Go on, then. Before it hops away."},{"name":"MAIRA","text":"Alkaios would never ask if he thought you might be hurt, but do be careful of your toes─at that size, even a passive creature can be a danger to those around it."},{"name":"KLEON","text":"Do as he says, <span class=\"highlight\">Forename</span>, just...not too hard!"},{"name":"SYSTEM","text":"You feel Alkaios's gaze upon you, silently judging...<br>Perhaps you should settle for giving the batrachoi a simple <span class=\"highlight\">poke</span>."},{"name":"ALKAIOS","text":"You see? No response to external stimuli. The creature is far too placid."},{"name":"ALKAIOS","text":"What was the concept behind the batrachoi? A defender of water sources?"},{"name":"ALKAIOS","text":"In its current incarnation, it has neither the instincts nor the means to defend itself, much less fend off entities intent upon fouling the waterways."},{"name":"ALKAIOS","text":"I cannot, in good conscience, certify a subject so poorly equipped to carry out its intended purpose. In fact, I suggest you redesign your concept entirely."},{"name":"KLEON","text":"Thank you for your candor. &lt;sigh&gt; And I was so invested in this darling ball of pudgy flesh. Such a pity..."},{"name":"MAIRA","text":"<span class=\"highlight\">Forename</span>, as Azem's familiar, you must have seen your fair share of the world and its inhabitants."},{"name":"MAIRA","text":"Without altering its physical form, what do you think the batrachoi could do to become a more effective guardian?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It could use its tongue to grapple opponents."},{"name":"A1","text":"It could secrete an immobilizing slime."},{"name":"A1","text":"It could use its weight to knock things flying."},{"name":"KLEON","text":"Brilliant! What an innovative mind you have, <span class=\"highlight\">Forename</span>!"},{"name":"ALKAIOS","text":"Yes, that may suffice. The introduction of an effective offensive measure could very well tip the scales towards a favorable judgment."},{"name":"KLEON","text":"Truly!? Then I shall modify my concept at once!"},{"name":"KLEON","text":"May I bind this one and take him home with me? Once I've finished making the necessary adjustments, I'll resubmit my request for observation and evaluation."},{"name":"ALKAIOS","text":"Of course, you are free to do as you wish. I will make a note of it in my logs."},{"name":"ALKAIOS","text":"I sense your suggestion was based on personal experience─a most valuable source of wisdom."},{"name":"MAIRA","text":"Well done, <span class=\"highlight\">Forename</span>. What a helpful familiar you are!"},{"name":"MAIRA","text":"Kleon seemed so very pleased."},{"name":"KLEON","text":"Thank you for your creative assistance, <span class=\"highlight\">Forename</span>. I knew bringing you along would be a good idea!"},{"name":"KLEON","text":"Why, I almost wish I could have you as my own familiar! It's a shame Azem hasn't published your concept for the world to see..."},{"name":"KLEON","text":"But seeing as you're here now, would you mind lending me your talents a while longer? There is one other creation of mine that I feel may benefit from your unique perspective."}],"reward":{"gil":935},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70047]},"next":[70049]},"partials":[{"type":"npc","id":"1041372","obj":{"i":1041372,"n":"Kleon","l":3713,"q":1}},{"type":"npc","id":"1041426","obj":{"i":1041426,"n":"Kleon","l":3713,"q":2}},{"type":"quest","id":"70047","obj":{"i":70047,"n":"An Expected Guest","g":125,"l":"Elpis","s":6191,"f":1}},{"type":"quest","id":"70049","obj":{"i":70049,"n":"Meekly Majestic","g":125,"l":"Elpis","s":6193}}]}