{"quest":{"name":"An Expected Guest","location":"Elpis","id":70047,"patch":6.0,"sort":6191,"icon":101087,"unlocksFunction":1,"eventIcon":71341,"issuer":1041369,"target":1041369,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Maira appears to be mildly perturbed.","Upon learning that you are not, in fact, a messenger from an expected visitor, Maira enlists you to track said visitor down. As for where you are to search for this “Kleon,” as the guest is known, Maira gestures vaguely in the direction of southerly Zephyrneus.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You come to the rescue of a man who you assume is Maira's expected visitor, Kleon. He stands at the spot where you found him, a look of surprised gratitude on his face...","You speak with the man and confirm that he is, indeed, the “Kleon” you were searching for. Return with him to the waiting Maira.","Maira is at last united with Kleon, and they discuss the reason for his visit: it seems the guest from Amaurot is concerned with the suitability of his registered concepts when it comes to releasing them into the wild. Impressed by your display of battle prowess during his rescue, Kleon insists that you join them in evaluating the state of his “children.”"],"objectives":["Find Kleon, and defeat any monsters which threaten him.","Speak with Kleon.","Speak with Maira."],"dialogue":[{"name":"MAIRA","text":"Well, this is a pickle. Whatever am I to─hm?"},{"name":"MAIRA","text":"Please tell me you're here to deliver a message from Kleon. You <span class=\"emphasis\">are</span> a familiar, yes?"},{"name":"MAIRA","text":"Azem's familiar!? Oh, and I do like the name...“<span class=\"highlight\">Forename</span>”!"},{"name":"MAIRA","text":"But if you belong to Azem, then what has become of our visitor from Amaurot? He was meant to arrive some time ago."},{"name":"MAIRA","text":"Our wildlife subjects are accustomed to the presence of long-term observers, but when someone from outside of Elpis comes to visit, the reactions can be somewhat unpredictable...and occasionally violent!"},{"name":"MAIRA","text":"Would you be so kind as to track down Kleon and see that no harm has befallen him? Visitors don't wear masks, so he should be easy to spot!"},{"name":"MAIRA","text":"And if you do happen to find him in the process of being mauled, you have my permission to terminate the offending subject. Safety first!"},{"name":"MAIRA","text":"I will stay here and search the immediate vicinity, in case our visitor arrives in the meantime. Do point him in this direction should you manage to locate him first."},{"name":"KLEON","text":"Thank you for taking the initiative! I wasn't sure about the etiquette of destroying a creature under observation..."},{"name":"KLEON","text":"I am Kleon, recently arrived from Amaurot. I assume Maira sent you to fetch me?"},{"name":"KLEON","text":"I see. Well, we had best not keep her waiting any longer. Fear not─I will avoid upsetting any more of the local inhabitants!"},{"name":"KLEON","text":"This is Maira, yes?"},{"name":"MAIRA","text":"<span class=\"highlight\">Forename</span>, thank you for seeing to the safety of our guest."},{"name":"KLEON","text":"Indeed, my hesitancy to act would have ended poorly had your messenger not been there to shield me."},{"name":"MAIRA","text":"And I'm certainly glad that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> was. Now, shall we proceed to the business of the day? I believe you had some concerns regarding your personal creations..."},{"name":"KLEON","text":"Yes. As embarrassing as it is to admit, I was worried that the concepts I registered with the Bureau of the Architect may not be fit for release into the wild."},{"name":"MAIRA","text":"Oh, you needn't feel embarrassed. You wouldn't be the first visitor we've had who's expressed difficulty in helping their “children” leave the nest."},{"name":"MAIRA","text":"We can look in on them right now, if you like?"},{"name":"KLEON","text":"I should like that very much, but I do have one request..."},{"name":"KLEON","text":"When you swooped in to rescue me from that beast, I was treated to an impressive display of battle prowess."},{"name":"KLEON","text":"An entity with your strength and instinct would be the perfect candidate for evaluating the worth of my modest creations!"},{"name":"KLEON","text":"I must insist that you join us!"},{"name":"MAIRA","text":"What a fascinating notion... Yes, I quite agree with your assessment."},{"name":"KLEON","text":"Then we all go together. Whenever you are ready, <span class=\"highlight\">Forename</span>!"}],"reward":{"gil":855,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69969]},"next":[70048]},"partials":[{"type":"npc","id":"1041369","obj":{"i":1041369,"n":"Maira","l":3713,"q":3}},{"type":"quest","id":"69969","obj":{"i":69969,"n":"A Flower upon Your Return","g":11,"l":"Elpis","s":587}},{"type":"quest","id":"70048","obj":{"i":70048,"n":"A Better Batrachoi","g":125,"l":"Elpis","s":6192}}]}