{"quest":{"name":"A Feast to Remember","location":"Central Shroud","id":70056,"patch":6.0,"sort":219,"icon":101156,"unlocksFunction":1,"eventIcon":71341,"issuer":1035252,"target":1035245,"genre":203,"usedItems":[35832],"journal":["The Adventurers' Guild investigator has someone to introduce to you.<br>※This quest is available for a limited time only.","The investigator introduces you to Marke, an expert on the occult sent by the guild to assist you in apprehending the Scarlet Snout. After sharing a brief explanation on the nature of the so-called Night of Devilry, he presents you with two of his prized inventions that he hopes will serve to make your journey much less precarious. Properly equipped, you prepare to make for the Scarlet Snout's domain and steel yourself for the battle ahead.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The Scarlet Snout informs you that the feast is now ready to welcome visitors. Equipped with the tools you need to ensure your safety in the spectral realm, you go to seek out the harlequin guide under the Bentbranch Meadows bridge or in the Acorn Orchard, that you might be shown to the banquet. Once you have completed your business at the Phantoms' Feast, the Adventurers' Guild investigator will be eagerly awaiting evidence of your experience there in the form of one of the pumpkin cookies the Snout is said to be distributing to his guests.","You regale the Adventurers' Guild investigator with a tale of your time at the feast. He thanks you for your efforts, and assures you that he has warned the other invitees not to take the Snout up on his offer, so that there will be no further victims. Assured that the denizens of Gridania are safe from the red-nosed fiend's trickery, you consider paying the festivities another visit or two to make sure there are no other lost souls in need of your help."],"objectives":["Speak with Papa Gruff.","Obtain a pumpkin cookie from the Phantoms' Feast, and present it to the Adventurers' Guild investigator."],"dialogue":[{"name":"INVESTIGATOR04520","text":"Ready to proceed with our investigation, are you? Excellent. Allow me to introduce you to our esteemed collaborator. This is Marke, a specialist in matters of the occult dispatched by the guild to assist in apprehending the nefarious Papa Gruff."},{"name":"MARKE","text":"A pleasure to make your acquaintance."},{"name":"MARKE","text":"Before we go any further, I wish to ensure that I have a grasp on the situation as it stands. If it's quite all right with you, pray share all you have learned about our quarry thus far."},{"name":"MARKE","text":"I see...quite fascinating, indeed. Yes, it was all as I read in that tome..."},{"name":"MARKE","text":"Ah, my apologies. I tend to get lost in my own thoughts sometimes. Allow me to begin by giving you a brief introduction to the so-called “Night of Devilry”─or, at least, as I understand it."},{"name":"MARKE","text":"It is said that during All Saints' Wake, the saints are invited to banquets in the heavens each and every night."},{"name":"MARKE","text":"At such time, the world below is left unprotected, and fiends summoned by the ogre pumpkinhead are free to wreak havoc on the defenseless denizens. One fiend in particular is said to be especially boisterous..."},{"name":"MARKE","text":"Aye, I speak of the one known as the Doomsday Clown."},{"name":"MARKE","text":"...Though, perhaps, you know him better as “the Scarlet Snout” or “Papa Gruff”. In any event, they are all the same most nefarious personage. If the texts are to be believed, those who set foot in his domain are fated never to return."},{"name":"INVESTIGATOR04520","text":"I say, just listening to this tale is enough to make my hair stand on end. That said, it seems we've quite a task on our hands even attempting to save his would-be victims. Have we no way of protecting ourselves once inside his lair?"},{"name":"MARKE","text":"I thought you would never ask. Pray feast your eyes on these fine creations of mine."},{"name":"MARKE","text":"I present to you two artifacts I have recreated by referencing a number of ancient tomes─together with some of my own personal touches, of course. Behold the fiendish lantern and a phial of warding holy water."},{"name":"MARKE","text":"But what do they do? You must wonder. Well, allow me to explain! First of all, the fiendish lantern emits a certain wavelength of light that voidsent absolutely detest."},{"name":"MARKE","text":"As for the warding holy water, it not only protects the holder's soul from being stolen, but also enables one to rescue the lost souls of others and return them to their mortal frames."},{"name":"MARKE","text":"I have not yet had the opportunity to test them and thus cannot vouch for their effectiveness, but I am very much hoping that they will serve you well─for both our sakes."},{"name":"INVESTIGATOR04520","text":"Wait, you mean there's no guarantee that—"},{"name":"INVESTIGATOR04520","text":"Ah, but it matters not. We face a potential crisis here, and beggars cannot be choosers in times of need. My friend, are you willing to put your faith in Marke's creations and do what needs be done?"},{"name":"INVESTIGATOR04520","text":"Excellent! In the meantime, I shall do my best to ensure that the Scarlet Snout is not able to lure anyone else into his trap."},{"name":"INVESTIGATOR04520","text":"Speaking of the Snout, I have also heard another rumor─apparently, he has been handing out odd pumpkin cookies to those who attend his feast. Should you come into possession of such a confection, might you show it to me when you return?"},{"name":"MARKE","text":"Splendid. Before you go, allow me to furnish you with a linkpearl. Rest assured that I shall do my damnedest to support you from afar after you enter the dread clown's personal domain."},{"name":"MARKE","text":"Also, should you wish to know aught more about the items with which I have furnished you, just say the word."},{"name":"INVESTIGATOR04520","text":"I shall return to Mih Khetto's Amphitheatre and see that no other frightening high jinks ensue. When you have found out what you would about the Snout, pray visit me there."},{"name":"MARKE","text":"How fascinating. Yes, most fascinating indeed..."},{"name":"PIERROTFATHER","text":"Hm? Oh! It's you! My apologies, but I've not quite yet finished preparing for the festivities. Pray come back a bit later."},{"name":"PIERROTFATHER","text":"Ah, if it isn't my friend, <span class=\"highlight\">Forename</span>! Terribly sorry for the delay. Your timing couldn't be better─I'm pleased to report that I've finished preparing for the festivities."},{"name":"PIERROTFATHER","text":"Let my loyal harlequin guide know once you're ready, and he'll be more than happy to show you the way to the venue."},{"name":"SYSTEM","text":"You now have access to the Phantoms' Feast seasonal instance."},{"name":"SYSTEM","text":"To join the feast, speak with the harlequin guide under the Bentbranch Meadows bridge or in the Acorn Orchard."},{"name":"SYSTEM","text":"The Phantoms' Feast is a light party instance (four players). There are no class, job, or level requirements for participation."},{"name":"SYSTEM","text":"Parties that register for the instance with less than four members will be filled out automatically via the matching system."},{"name":"MARKE","text":"Ah, is there something you'd like to know?"},{"name":"Q2","text":"What will you ask about?"},{"name":"A2","text":"The Scarlet Snout."},{"name":"A2","text":"The fiendish lantern."},{"name":"A2","text":"The warding holy water."},{"name":"A2","text":"Nothing."},{"name":"MARK","text":"It is said that during All Saints' Wake, the saints are invited to banquets in the heavens each and every night."},{"name":"MARK","text":"At such time, the world below is left unprotected, and fiends summoned by the ogre pumpkinhead are free to wreak havoc on the defenseless denizens. One fiend in particular is said to be especially boisterous..."},{"name":"MARK","text":"Aye, I speak of the one known as the Doomsday Clown."},{"name":"MARK","text":"...Though, perhaps, you know him better as “the Scarlet Snout” or “Papa Gruff”. In any event, they are all the same most nefarious personage. If the texts are to be believed, those who set foot in his domain are fated never to return. How utterly terrifying!"},{"name":"MARK","text":"This is why I fashioned my greatest creations: the fiendish lantern and the warding holy water. Inspired by what I gleaned from many an ancient tome, I have no doubt that they will serve you well in your quest to quash the Snout's nefarious plot."},{"name":"MARK","text":"The fiendish lantern emits a wavelength of light that voidsent absolutely detest."},{"name":"MARK","text":"Should you encounter any such fiends, pray put it to good use. I have no doubt it will serve you well."},{"name":"MARK","text":"The warding holy water not only protects the holder's soul from being stolen, but also enables one to rescue the lost souls of others and return them to their mortal frames."},{"name":"MARK","text":"I have afforded you with a full phial, so please do not hesitate to use it should you come across any souls in need of succor."},{"name":"INVESTIGATOR04520","text":"Ah, there you are! Glad to see you returned from the spectral realm in one piece! I say, did Marke's inventions provide adequate aid?"},{"name":"INVESTIGATOR04520","text":"Relieved I am to hear that! Small wonder the man came so highly recommended. And of course, I must thank you for risking life and limb to put them to use. Thanks to you, we can rest assured that the souls of the Gridanian people are safe from the fiend's trickery."},{"name":"INVESTIGATOR04520","text":"I am full glad to finally lay my eyes upon this rumored cookie as well. Oh, and just to be safe, I took the liberty of advising the other invitees not to attend the feast...for their own good."},{"name":"INVESTIGATOR04520","text":"I am concerned, however, that some of them did not seem so keen on heeding my instructions. Should you find any that have gone on ahead, pray save as many of them as you can."},{"name":"INVESTIGATOR04520","text":"Now that we know that Marke's creations can be relied upon, there is no reason to think we should not be able to rescue everyone from the Snout's clutches."},{"name":"PIERROTCHILD","text":"P-Papa! Wh-Where have all my new friends gone? &lt;sob&gt;"},{"name":"PIERROTMOTHER","text":"Don't worry, sweetheart. Father will sort this all out."},{"name":"PIERROTMOTHER","text":"What the heck were those abominable trinkets, anyway!? And why did you not warn me that one of those despicable adventurers might crash our party!?"},{"name":"PIERROTFATHER","text":"Oh, my beloved! Pray calm your heart. That adventurer <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">fellow</span></span> was one thing, but rest assured that none of our ordinary guests will be equipped with such artifacts. We shall have our fun soon enough─believe you me!"},{"name":"PIERROTFATHER","text":"What's more, I found someone who has volunteered to help us in our quest. They say the best approach is to just wander around the town shouting out invitations to anyone within earshot."},{"name":"PIERROTFATHER","text":"Why, just imagine how many guests they'll manage to lure here with such a bold approach!"},{"name":"PIERROTFATHER","text":"Now, listen to me. Be sure to invite as many people as possible, all right? The more terror, the better, I say!"},{"name":"PIERROTFAMILYSERVANT04520","text":"Your wish is my command, Master Gruff!"},{"name":"PUMPKIN","text":"Heh heh... This will be a fine All Saints' Wake, indeed. That said, I do wonder who this mysterious new acquaintance might be...?"},{"name":"INVESTIGATOR04520","text":"Rest assured that I will be keeping close watch on the Scarlet Snout to make sure that his baleful plans never come to fruition."},{"name":"INVESTIGATOR04520","text":"I will see to it that none of his expected visitors attend his banquet. Then, when he comes out to ascertain what has gone amiss...we will strike with an expert team assembled by the Adventurers' Guild, putting an end to the villainy once and for all."},{"name":"INVESTIGATOR04520","text":"In the meantime, I ask that you pray go and rescue anyone the Snout has already managed to lure into his domain. That would doubtless encourage him to abandon his scheme even sooner."},{"name":"SYSTEM","text":"You can now attempt the Phantoms' Feast seasonal instance again by speaking with the harlequin guide in either Mih Khetto's Amphitheatre or the Acorn Orchard."},{"name":"SYSTEM","text":"Successfully completing the instance will earn you a pumpkin cookie."},{"name":"SYSTEM","text":"You can exchange cookies for items and equipment by speaking with the shady smock in Mih Khetto's Amphitheatre."},{"name":"SYSTEM","text":"You can also speak with the genial guiser, and join the marvelous masquerade in the Haunted Manor."}],"reward":{"items":[{"id":35832},{"id":36618}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[69531]}},"partials":[{"type":"npc","id":"1035252","obj":{"i":1035252,"n":"Adventurers' Guild Investigator","l":54,"q":2}},{"type":"npc","id":"1035245","obj":{"i":1035245,"n":"Adventurers' Guild Investigator","l":53,"q":2}},{"type":"item","id":"35832","obj":{"i":35832,"n":"Pumpkin Cookie","l":1,"c":24067,"t":85}},{"type":"item","id":"36618","obj":{"i":36618,"n":"Modern Cosmetics - Clowning Around","l":1,"c":26178,"t":61}},{"type":"quest","id":"69531","obj":{"i":69531,"n":"All Clowns' Wake","g":203,"l":"Gridania","s":218}}]}