{"quest":{"name":"Methods of Mourning","location":"Elpis","id":70051,"patch":6.0,"sort":6195,"icon":101088,"eventIcon":71221,"issuer":1041369,"target":1041369,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Maira and her brother Alkaios look set to leave on an errand of some kind.","After asking if you've been to Anagnorisis, Maira suggests that you accompany her and Alkaios to meet with your acquaintance, Overseer Sokles. It seems the overseer has summoned the siblings to assist with what promises to be an intriguing duty...<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Overseer Sokles explains that several creatures have fallen victim to rampaging lykaones. Alkaios, it seems, is often called upon to accelerate the decay of the remains with time magicks, and you have been invited to attend this somewhat solemn service in the southwest of Philomythes Notos.","At the site of the fallen creations, the conversation turns to the subject of mourning and you share with the gathered ancients the traditions with which you are accustomed. Fascinated by the idea of leaving a physical reminder, Maira bids you follow her to a spot where she might prepare an offering of flowers for the deceased.","Maira has manipulated the aether in the soil to produce a number of beautiful blooms. She bids you join her in picking a small bouquet for the service.","Having gathered a small handful of Maira's conjured “krinoi,” you are ready to head back and deliver the offering to the waiting Sokles.","Sokles accepts your offering of flowers and places them with the remains. The simple gesture, alongside Alkaios's solemn words, appears to have stirred the hearts of those present. The Anagnorisis observers express their thanks for your contribution before sending you on your way back to Poieten Oikos.","Although perfectly normal to you, your ideas appear to be a source of great interest and inspiration to the long-lived observers. Again, you are forced to wonder if your presence here will affect how the future of the Source unfolds."],"objectives":["Speak with Sokles.","Speak with Sokles again.","Speak with Maira.","Gather krinoi.","Deliver the krinoi to Sokles.","Speak with Maira."],"dialogue":[{"name":"MAIRA","text":"Tell me, <span class=\"highlight\">Forename</span>, have you seen much of Anagnorisis?"},{"name":"MAIRA","text":"Oh, so you've met Overseer Sokles, then! He's sent my brother a request for aid, and we were just on our way to render our assistance."},{"name":"ALKAIOS","text":"You're welcome to come along, if you like─you may be interested to witness the duty which lies ahead."},{"name":"ALKAIOS","text":"Come along. We mustn't keep the overseer waiting."},{"name":"ALKAIOS","text":"Will you accompany us a while longer?"},{"name":"MAIRA","text":"I've not crossed over to this isle in some time!"},{"name":"ALKAIOS","text":"There's only one reason they would ask for me by name..."},{"name":"CHARMION","text":"<span class=\"highlight\">Forename</span>!? You're acquainted with Alkaios and his sister, I see!"},{"name":"SOKLES","text":"Alkaios. Maira. And <span class=\"highlight\">Forename</span>, as well! Welcome, all of you."},{"name":"ALKAIOS","text":"A summons from you can only mean one thing... There has been an incident?"},{"name":"SOKLES","text":"Yes, the lykaones went into a frenzy, and more than a few of our observational projects were prematurely ended."},{"name":"SOKLES","text":"We began the sending rites, of course, but the task is burdensome for so few. Thus did I hope to secure your particular expertise."},{"name":"CHARMION","text":"Oh, you wouldn't be aware of the practice, would you, <span class=\"highlight\">Forename</span>? Here in Elpis, we expedite the aetherial dissipation of the deceased by employing time magicks."},{"name":"CHARMION","text":"The decay of the corporeal remains is accelerated, and absorbed back into the ground upon which we stand."},{"name":"MAIRA","text":"As you may have guessed, the manipulation of time is Alkaios's specialty. Whenever some unexpected event results in the mass loss of creations, it is him to whom they turn."},{"name":"SOKLES","text":"That we do. Nevertheless, I do regret tearing you away from your important work. We've prepared a site to the southwest, so if you'll follow me, we can put this unpleasant business behind us in short order."},{"name":"MAIRA","text":"When you research such an eclectic collection of wildlife, it's almost inevitable that some of them will meet a sudden and unanticipated demise."},{"name":"ALKAIOS","text":"Okyupetes..."},{"name":"CHARMION","text":"The overseer and I moved the bodies here, away from the site of violence. It's...easier this way."},{"name":"SOKLES","text":"This is them─the okyupetes which fell victim to the lykaones."},{"name":"MAIRA","text":"They were still being evaluated, yes? The poor things, they barely had a chance to fulfill their design..."},{"name":"ALKAIOS","text":"Their flesh and bones will return to the land. We will ensure that their existence was not in vain."},{"name":"CHARMION","text":"Seeing life taken mid-purpose can be distressing. Have you witnessed such events before, <span class=\"highlight\">Forename</span>? "},{"name":"CHARMION","text":"Tell me: how do <span class=\"emphasis\">you</span> express yourself at these times?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"With an offering of Nymeia lilies."},{"name":"A1","text":"By making a grave or cairn for the deceased."},{"name":"CHARMION","text":"Nymeia lilies? A beautiful name for a flower, but not one I've heard of. I wonder if it was recently registered."},{"name":"MAIRA","text":"And you offer these lilies to the fallen... Interesting. We do have a custom of gifting flowers to those we love and admire, so I suppose this is not so different. Perhaps I can prepare some blooms to take the place of the ones you mentioned."},{"name":"CHARMION","text":"A physical reminder of the life that was? An interesting sentiment, but if we practiced such a custom in Elpis, we would eventually run out of places to put them."},{"name":"MAIRA","text":"I do like the idea of a tangible offering, though. Like a final gift for a friend. What about something organic which would decompose alongside the remains? Say, a bouquet of flowers?"},{"name":"MAIRA","text":"Come with me, <span class=\"highlight\">Forename</span>─you can help me gather something suitable."},{"name":"ALKAIOS","text":"Were you finished with helping Maira? It isn't safe to wander alone."},{"name":"CHARMION","text":"Your thought process truly is amazing. Where do you encounter these notions that have never even occurred to us!?"},{"name":"SOKLES","text":"I believe Maira will have some flowers for you to pick."},{"name":"MAIRA","text":"Here, I've made some flowers of our own. Even those fashioned directly of aether tend to sprout with more life and color when you grow them in the soil."},{"name":"MAIRA","text":"Pick yourself a handful, and we'll take them back to the overseer."},{"name":"MAIRA","text":"Aren't they lovely? They're called “krinoi”─one of my favorite flowers."},{"name":"MAIRA","text":"Hm? Oh, I'll be just fine by myself, but it's sweet of you to worry. I'll pick a few more of these krinoi, then join you in a little while."},{"name":"SOKLES","text":"Maira's creations were acceptable, I trust?"},{"name":"MAIRA","text":"My apologies─I may have gotten a little carried away with the flowers."},{"name":"SOKLES","text":"Not at all, Maira. Your effort is much appreciated."},{"name":"SOKLES","text":"Alkaios, if you would be so kind...?"},{"name":"ALKAIOS","text":"Vessels within which life once flowed; cheated of purpose, stilled and cold. Unto the land you now return, the fuel 'pon which new life shall burn."},{"name":"MAIRA","text":"That was a beautiful service. I like to think it brought some joy to their departed souls, much as one feels when receiving a thoughtful gift."},{"name":"CHARMION","text":"Yes, the flowers were the perfect addition. How fortunate we are to have this knowledgeable familiar in our midst!"},{"name":"SOKLES","text":"We must return and commit this event to parchment while it remains fresh in our minds─a potential shift in our traditions is a historical moment worth recording."},{"name":"SOKLES","text":"Thank you again, Alkaios. We are ever grateful for your calming presence."},{"name":"SOKLES","text":"And our thanks to you, Maira and <span class=\"highlight\">Forename</span>─not only for attending, but also elevating the proceedings."},{"name":"CHARMION","text":"Yes, you've contributed more than enough! Allow us to take care of the tedious administrative details."},{"name":"CHARMION","text":"We hope to see you again soon, <span class=\"highlight\">Forename</span>!"},{"name":"ALKAIOS","text":"It is time we were headed back ourselves, dear sister."},{"name":"MAIRA","text":"As you say. Please, <span class=\"highlight\">Forename</span>, join us back in Poieten Oikos."},{"name":"ALKAIOS","text":"That was a different kind of service. I think...yes, we might consider some changes."},{"name":"MAIRA","text":"What a fortuitous turn of events that you were present when we received the summons to Anagnorisis."},{"name":"MAIRA","text":"As time marches on, we encounter fewer and fewer of these truly new experiences..."},{"name":"MAIRA","text":"Yet ever since you appeared, it's been one surprise after another. I suppose we should expect nothing less from one of Azem's creations."},{"name":"ALKAIOS","text":"And now we have these precious new ideas and perspectives to apply to our duties moving forward."},{"name":"ALKAIOS","text":"Speaking of which, we really must be returning to our work."},{"name":"MAIRA","text":"Be well, <span class=\"highlight\">Forename</span>, and thank you. May our purposes─or simply our paths─align again in the future!"}],"reward":{"gil":1095,"items":[{"num":2,"id":5750,"one":1},{"num":2,"id":5755,"one":1},{"num":2,"id":5759,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"questsType":"all","quests":[70046,70050]}},"partials":[{"type":"npc","id":"1041369","obj":{"i":1041369,"n":"Maira","l":3713,"q":3}},{"type":"item","id":"5750","obj":{"i":5750,"n":"Cork Brown Dye","l":1,"c":22809,"t":55,"p":334}},{"type":"item","id":"5755","obj":{"i":5755,"n":"Acorn Brown Dye","l":1,"c":22809,"t":55,"p":334}},{"type":"item","id":"5759","obj":{"i":5759,"n":"Shale Brown Dye","l":1,"c":22809,"t":55,"p":216}},{"type":"quest","id":"70046","obj":{"i":70046,"n":"Familiar Fate","g":125,"l":"Elpis","s":4114}},{"type":"quest","id":"70050","obj":{"i":70050,"n":"Unleash the Beast","g":125,"l":"Elpis","s":6194}}]}