{"quest":{"name":"Dream a Little Dream","location":"Mare Lamentorum","id":70055,"patch":6.0,"sort":1954,"icon":101089,"unlocksFunction":1,"eventIcon":71341,"issuer":1041903,"target":1041819,"genre":124,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Dreamingway has one last demonstration for you.","Still determined to discover a dream worthy of pursuit, Dreamingway wishes to show you how the Loporrits grow carrots─by having you try it yourself. To begin, he asks that you bring a handful of seeds to the carrot creation station nearby.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You somewhat unceremoniously load the seeds into the carrot creation station, impressing Dreamingway nevertheless. He explains that the next step towards a bountiful harvest requires water crystals, which can be had from the sparkling supply station in the northeast corner of the Carrotorium.","You find a large store of crystals exactly where Dreamingway said they would be. With crate in hand, you make your perilous journey over ramp and oversized stairway to arrive at a nearby carrot creation station.","Once the crystals are deposited into the machine, all one needs do is wait for the carrots to grow. Fortuitously, after mere moments, Dreamingway hears a sound─undetectable to your ears─that indicates carrots elsewhere in the Carrotorium are ready for picking.","You visit the surrounding creation stations and, surely enough, find two carrots practically begging to be plucked. After freeing them with satisfying tugs, you tuck them into your bag that you might present them to Dreamingway.","Dreamingway commends you on a job well done, though sadly, your success only reaffirms his belief that he is an unremarkable Loporrit. Mention of his exceptional hearing, however, gives you an idea, and so you ask if he has ever considered musical pursuits. After a brief explanation of what music is, he hums a melody together with his companion Knockingway. Both find it to be a heartwarming experience, and thus is Dreamingway inspired to share the gift of music with anyone and everyone─a dream of his very own.","Knockingway thanks you for solving Dreamingway's problem as only a person of Etheirys can. Similarly, the newly motivated Loporrit promises to practice his music often, hopeful that he will have a new tune to play for you when next you meet."],"objectives":["Place carrot seeds in the carrot creation station.","Pick up the crate of crystals.","Fill the carrot creation station with water crystals.","Obtain carrots from the carrot creation stations.","Deliver the carrots to Dreamingway.","Speak with Knockingway."],"dialogue":[{"name":"DREAMINGWAY","text":"Well, <span class=\"highlight\">Forename</span>? Are you excited to learn about the wonderful world of carrot cultivation?"},{"name":"DREAMINGWAY","text":"...Not that there's a lot to it, truth be told. We simply place the seeds in the machine, water them, and then reap the sweet rewards."},{"name":"DREAMINGWAY","text":"It's so easy that a─well, that anyone could do it!"},{"name":"DREAMINGWAY","text":"Hmm... As far as I know, you're an “anyone.” Why not try it for yourself?"},{"name":"DREAMINGWAY","text":"Oh, completing menial tasks is so much more fun with friends! Pray take these seeds and follow me─I do believe there's an open creation station nearby."},{"name":"DREAMINGWAY","text":"Go on, place the seeds in here."},{"name":"DREAMINGWAY","text":"That carefree tossing motion of yours seems to have scattered the seeds nicely. Now, of course, they'll need water..."},{"name":"DREAMINGWAY","text":"Water <span class=\"emphasis\">crystals</span>, to be precise─and this isn't the only machine in need of replenishment. Why don't you pay a visit to the sparkling supply station over in the northeast corner, and then bring a crate of crystals to the creation station nearby?"},{"name":"DREAMINGWAY","text":"Those crystals won't carry themselves from the supply station! It's in the northeast corner─you can't miss it."},{"name":"DREAMINGWAY","text":"Load those crystals into the machine to start the growing process─preferably before you drop them all over the floor."},{"name":"SYSTEM","text":"Take the bucket of crystals to the carrot creation station to the southwest before your arms give out."},{"name":"SYSTEM","text":"You will have ninety seconds to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"SYSTEM","text":"Be wary of attacks from enemies, which will sap your strength."},{"name":"DREAMINGWAY","text":"That should be enough to make our carrots grow nice and big! And the machine converts them into water bit by bit, so we never need worry that the seedlings are too wet or too dry."},{"name":"DREAMINGWAY","text":"...Oho! Don't you just love that sound?"},{"name":"DREAMINGWAY","text":"What─did you not hear that tone just now? It's telling us there are carrots ready for harvesting!"},{"name":"DREAMINGWAY","text":"They're not at this station, but I am certain I heard the joyous sound of two ripened carrots. You may as well see this through to the end─pulling them is the best part!"},{"name":"DREAMINGWAY","text":"That's two fully ripened carrots, remember? I'll wait for you by the entrance."},{"name":"DREAMINGWAY","text":"Do I smell carrots? ...That was rhetorical. It definitely smells like carrots in here."},{"name":"DREAMINGWAY","text":"Mmm, mouthwatering!"},{"name":"DREAMINGWAY","text":"That's really all there is to it─and to my days, to put it plainly. I apologize for not being more interesting to follow around."},{"name":"DREAMINGWAY","text":"So...have you any ideas for a dream that would suit a Loporrit like me?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Er...maybe we should consider one of your hobbies."},{"name":"A1","text":"What do you do when you're not working?"},{"name":"DREAMINGWAY","text":"But I...I don't have any hobbies..."},{"name":"DREAMINGWAY","text":"I, um... What <span class=\"emphasis\">do</span> I do?"},{"name":"DREAMINGWAY","text":"&lt;sigh&gt; It seems it just wasn't meant to be. I should never have taken such an extraordinary name, being so very ordinary myself..."},{"name":"DREAMINGWAY","text":"If only I had some sort of skill to set me apart from the others! Aside from hearing things no one else does, I suppose."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Hmm... Do you like listening to music?"},{"name":"A2","text":"A good ear, eh? Have you tried making music?"},{"name":"DREAMINGWAY","text":"I've read of this “music” of yours, though I'm afraid I don't understand why you all enjoy it so much...or why you must write it down in such cryptic ways."},{"name":"DREAMINGWAY","text":"Oh! I've read about this “music” of yours, though I'm afraid I can't make heads nor tails of the notation. Do you really think I could learn how to create something so inscrutable?"},{"name":"KNOCKINGWAY","text":"What are you two up to?"},{"name":"DREAMINGWAY","text":"<span class=\"highlight\">Forename</span> was just suggesting that I put the “dream” in “Dreamingway” through the pursuit of music!"},{"name":"KNOCKINGWAY","text":"“Music”? I can't say I'm familiar."},{"name":"DREAMINGWAY","text":"Yes, we Loporrits can do something similar! A whole lung...nose...face...thing..."},{"name":"DREAMINGWAY","text":"Look, let's just try it and see how it sounds. Come on, Knockingway!"},{"name":"DREAMINGWAY","text":"One, two, three!"},{"name":"DREAMINGWAY","text":"Goodness, that's terribly fun!"},{"name":"KNOCKINGWAY","text":"I must confess, humming in tandem has a certain charm that snorting or shrieking does not. I'd be interested in more such “music,” I daresay!"},{"name":"DREAMINGWAY","text":"Then that will be my dream─bringing joy to others through music!"},{"name":"DREAMINGWAY","text":"Who knows...perhaps I can inspire others to pursue their own dreams, too."},{"name":"THINKINGWAY","text":"What were those noises? What's this all about?"},{"name":"DREAMINGWAY","text":"Why, the gift of music, of course! Like this..."},{"name":"DREAMINGWAY","text":"I...I think that might be enough musicking for one day..."},{"name":"DREAMINGWAY","text":"I don't know how I'll ever thank you, <span class=\"highlight\">Forename</span>. You've changed my life!"},{"name":"DREAMINGWAY","text":"Finally, I can hold my head high, knowing that my heart will guide my way forward."},{"name":"DREAMINGWAY","text":"Dreamingway has a dream!"},{"name":"DREAMINGWAY","text":"At long last, I'm living my dream! I hope that someday I can repay your kindness."},{"name":"KNOCKINGWAY","text":"I cannot thank you enough for helping my dear friend."},{"name":"KNOCKINGWAY","text":"I hadn't realized he was so upset over not having a dream, of all things..."},{"name":"KNOCKINGWAY","text":"You helped him as only a person of Etheirys could."},{"name":"DREAMINGWAY","text":"I still have my other tasks to attend to, of course, but I promise to practice every day."},{"name":"DREAMINGWAY","text":"Eventually, I want to go beyond just humming, and compose original music!"},{"name":"DREAMINGWAY","text":"When next we meet, I hope you'll once again lend me an ear. Maybe even two!"}],"reward":{"gil":1015,"items":[{"num":2,"id":36044,"one":1},{"num":2,"id":36045,"one":1},{"num":2,"id":36048,"one":1},{"num":2,"id":36049,"one":1},{"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70054]},"next":[70217]},"partials":[{"type":"npc","id":"1041903","obj":{"i":1041903,"n":"Dreamingway","l":3711,"q":1}},{"type":"npc","id":"1041819","obj":{"i":1041819,"n":"Knockingway","l":3711,"q":1}},{"type":"item","id":"36044","obj":{"i":36044,"n":"Wine-dark Soup","l":533,"c":24123,"t":46}},{"type":"item","id":"36045","obj":{"i":36045,"n":"Glory Be Soup","l":533,"c":24106,"t":46}},{"type":"item","id":"36048","obj":{"i":36048,"n":"Hamsa Curry","l":539,"c":24040,"t":46}},{"type":"item","id":"36049","obj":{"i":36049,"n":"Karniyarik","l":539,"c":24162,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"70054","obj":{"i":70054,"n":"One Way or Another","g":124,"l":"Mare Lamentorum","s":1953,"f":1}},{"type":"quest","id":"70217","obj":{"i":70217,"n":"Must Be Dreaming(way)","g":28,"l":"Old Sharlayan","s":1,"f":1}}]}