{"quest":{"name":"Unleash the Beast","location":"Elpis","id":70050,"patch":6.0,"sort":6194,"icon":101087,"eventIcon":71221,"issuer":1041434,"target":1041369,"genre":125,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Kleon once more fixes you with an expectant gaze.","Disappointed that his favored creation seems fated to become cattle, Kleon asks you to look over the io for any changes he might make. Surely it wouldn't take much to transform this hulking beast into an apex predator...<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You carefully inspect the io, noting its flaws and possible improvements before making your report to its anxious creator. Apparently inspired by your advice, Kleon rushes off to make adjustments, and you are left to wait alongside Alkaios and Maira for his return.","Kleon eventually appears with his new and improved io─a beast which now greatly resembles the monster you know as a “behemoth.” Satisfied that his creation now qualifies as a dominant form of wildlife, Kleon leaves you in the company of Alkaios and Maira as he departs for Amaurot to begin work on his next concept.","Both Alkaios and Maira thank you for your help with their visitor. It seems your intervention was instrumental in salvaging Kleon's promising-yet-flawed creations. You wonder, however, what good will come of unleashing a behemoth-like beast upon the world..."],"objectives":["Inspect the io.","Wait at the designated location.","Speak with Maira."],"dialogue":[{"name":"ALKAIOS","text":"Here in Elpis, we only observe subjects worthy of evaluation as decided by the Bureau of the Architect. Kleon should be proud of his work."},{"name":"MAIRA","text":"It's heartening to see the io warm up to you so readily. She's always so timid around the observers."},{"name":"SYSTEM","text":"The io appears calm and content in your presence."},{"name":"KLEON","text":"Please, <span class=\"highlight\">Forename</span>─I have need of your worldly experience."},{"name":"KLEON","text":"My io, my darling, hulking io... She was meant for more than grazing in the fields."},{"name":"KLEON","text":"Will you look her over, and tell me what must be done? How can I transform her from potential livestock to apex predator?"},{"name":"ALKAIOS","text":"The initial design has flaws, but Kleon's passion for improvement is to be commended."},{"name":"MAIRA","text":"Kleon is very protective of his “children,” isn't he? I'm very curious to hear the results of your assessment!"},{"name":"KLEON","text":"Please tell me you have some suggestions. I would hate to see my io relegated to the rank of cattle..."},{"name":"SYSTEM","text":"Upon closer inspection, you can't shake the feeling that you've fought similar beasts before..."},{"name":"SYSTEM","text":"Such magnificent horns...rendered all but useless by the creature's poor field of vision."},{"name":"SYSTEM","text":"The io's monstrous claws seem capable of tearing a man limb from limb."},{"name":"SYSTEM","text":"Even with the io's limited vision, one swing of its muscular tail would be enough to shatter bones. But for true dominance, the beast will need something more. Something <span class=\"emphasis\">overwhelming</span>."},{"name":"KLEON","text":"What say you? How can we enhance the deadliness of my creation?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Cut back on the horns and the hair, and let her bring those fangs and claws into play!"},{"name":"A1","text":"An apex predator should wield apex magicks. Something like “Meteor,” for example."},{"name":"KLEON","text":"Yes! Deceptively simple, but devastatingly effective! I can already picture it..."},{"name":"KLEON","text":"Alkaios, Maira, will you permit me to implement some new ideas? <span class=\"highlight\">Forename</span> has given me much to think about."},{"name":"ALKAIOS","text":"Strictly speaking, any significant adjustments should be authorized by the Bureau of the Architect...but I think we can allow some temporary modifications for the purposes of experimentation."},{"name":"KLEON","text":"That sounds more than fair, thank you! If you could spare a few more moments, I shall take my creation and return with a new and improved io!"},{"name":"ALKAIOS","text":"You make me wonder, <span class=\"highlight\">Forename</span>...are you truly a familiar? Your thoughts, your behaviors, they resemble ours far too closely."},{"name":"MAIRA","text":"After living for years on end, our creativity tends to stagnate, I feel. Your revelations come as such a welcome breath of fresh air."},{"name":"MAIRA","text":"Kleon has been gone for more than “a few moments.” How extensive could these changes of his possibly be...?"},{"name":"KLEON","text":"(-Kleon-)It is done!"},{"name":"ALKAIOS","text":"Kleon, you... Well, you've certainly been busy, haven't you?"},{"name":"KLEON","text":"<span class=\"highlight\">Forename</span>'s advice began the process, and then it became difficult to stop!"},{"name":"KLEON","text":"After pruning back the horns and hair, I reinforced the talons, then moved on to arcane ability. She can now cast Meteor, as well as Charybdis. Surely now my io stands at the pinnacle of predators?"},{"name":"ALKAIOS","text":"In all my time as an observer, I have seen many a creation. But this...this concept ranks in the highest echelons. The strength inherent in your io is more than sufficient to ensure its domination."},{"name":"KLEON","text":"Wonderful, then I shall submit my refinements to the bureau at once! But I think, perhaps, this new incarnation requires a new name..."},{"name":"KLEON","text":"And I know just the familiar to bestow it. <span class=\"highlight\">Forename</span>, have you a fitting title for this glorious creature?"},{"name":"Q2","text":"What do you suggest?"},{"name":"A2","text":"“Behemoth” seems apt."},{"name":"A2","text":"“Queen Behemoth”..."},{"name":"KLEON","text":"Ah, perfect! So it shall be known─at least for now. I still need to submit the official registration."},{"name":"KLEON","text":"And now the time has come for me to return to Amaurot. I've decided that my next creation will be more of a companion─a pet, if you will─suitable for the amusement of children and very clever familiars."},{"name":"KLEON","text":"Thank you all again for this most productive visit! I hope I might impose upon you again soon?"},{"name":"MAIRA","text":"We always enjoy hosting visitors with such enthusiasm for their work."},{"name":"ALKAIOS","text":"Yes, and we very much look forward to observing your future concepts."},{"name":"MAIRA","text":"Well, Brother. <span class=\"highlight\">Forename</span>. Shall we head back to Poieten Oikos?"},{"name":"ALKAIOS","text":"You did well, <span class=\"highlight\">Forename</span>."},{"name":"MAIRA","text":"What a wonderful help you were with our visitor, <span class=\"highlight\">Forename</span>."},{"name":"MAIRA","text":"Even for a familiar of Azem, I cannot help but be impressed by your intelligence and unique sense of creativity."},{"name":"ALKAIOS","text":"I wholeheartedly agree. Your intervention salvaged some promising but unfortunately flawed creations."},{"name":"ALKAIOS","text":"You have our gratitude for providing us with such a fascinating experience."},{"name":"MAIRA","text":"Oh, Alkaios, must you always be so formal? Although he has trouble expressing it, I assure you, my brother is absolutely giddy with joy."},{"name":"MAIRA","text":"Thank you again, <span class=\"highlight\">Forename</span>. While I'm sure your duties as a familiar keep you occupied, you are more than welcome to visit us whenever you wish."},{"name":"MAIRA","text":"Thank you again, <span class=\"highlight\">Forename</span>. While I'm sure your duties as a familiar keep you occupied, we would very much welcome another chance to share your company."}],"reward":{"gil":935},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70049]},"next":[70051]},"partials":[{"type":"npc","id":"1041434","obj":{"i":1041434,"n":"Kleon","l":3713,"q":2}},{"type":"npc","id":"1041369","obj":{"i":1041369,"n":"Maira","l":3713,"q":3}},{"type":"quest","id":"70049","obj":{"i":70049,"n":"Meekly Majestic","g":125,"l":"Elpis","s":6193}},{"type":"quest","id":"70051","obj":{"i":70051,"n":"Methods of Mourning","g":125,"l":"Elpis","s":6195}}]}