{"quest":{"name":"One Way or Another","location":"Mare Lamentorum","id":70054,"patch":6.0,"sort":1953,"icon":101089,"unlocksFunction":1,"eventIcon":71341,"issuer":1041558,"target":1041564,"genre":124,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Dreamingway is eager to set about his next task─whatever it may be.","Dreamingway's next assignment is to repair a caretaker, and for that, he requires spare parts from Heimdall's Last Sight. He rushes off without a second thought─leaving you to give chase lest you lose him entirely.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You catch up to Dreamingway, who had gotten so far ahead of you that he worried you decided not to come. He has apparently learned absolutely nothing from this experience, as he then dashes off excitedly once more.","When at last you reach Heimdall's Last Sight, Dreamingway says that he can salvage the parts from the crashed Allagan vessel on his own. He insists you relax and enjoy the view while he sets about his task.","Whilst waiting, you hear a sudden shriek emanate from the area whence Dreamingway proceeded. You decide you had best check on the Loporrit.","Your suspicions are confirmed as you find Dreamingway has been set upon by mechanical monstrosities. Steeling yourself, you slay the fiends to rescue your Loporrit companion.","It transpires that Dreamingway is somewhat shaken, but otherwise none the worse for wear. What's more, he has managed to procure the parts needed to repair the caretaker.","Dreamingway's work on the caretaker is completed in two shakes of a Loporrit's tail. Though he does not feel hopeful that his true calling involves the maintenance of machinery, there is still one job of his you have yet to see─carrot production."],"objectives":["Speak with Dreamingway.","Wait at the designated location.","Search for Dreamingway.","Aid Dreamingway.","Speak with Dreamingway."],"dialogue":[{"name":"DREAMINGWAY","text":"Let's waste no time in continuing our work, shall we, <span class=\"highlight\">Forename</span>?"},{"name":"DREAMINGWAY","text":"Thinkingway, have you any other jobs for me?"},{"name":"THINKINGWAY","text":"Hmm... I suppose there's a caretaker that wants for repairing."},{"name":"THINKINGWAY","text":"If I recall correctly, the particular parts you need will be over at Heimdall's Last Sight."},{"name":"DREAMINGWAY","text":"I'll get right to it!"},{"name":"DREAMINGWAY","text":"It looks like we're on maintenance duty. Join me at Heimdall's Last Sight as quickly as you can!"},{"name":"THINKINGWAY","text":"Thank you again for gathering that sand for Buildingway."},{"name":"THINKINGWAY","text":"I imagine Dreamingway will be at Heimdall's Last Sight by now. It's not that he's that much faster than the rest of us, but he's impossible to slow down once he sets himself to a task..."},{"name":"DREAMINGWAY","text":"There you are. I was beginning to worry you'd abandoned our quest!"},{"name":"DREAMINGWAY","text":"Now, to the Heimdall! Follow me!"},{"name":"DREAMINGWAY","text":"According to our records, this vessel landed on the moon about five years ago. It's been a wonderful source of spare parts."},{"name":"DREAMINGWAY","text":"...And also of horrible mechanical monsters, but never you mind that."},{"name":"DREAMINGWAY","text":"I've been here countless times by now, so you can leave the salvaging to me. Simply relax and enjoy the view!"},{"name":"DREAMINGWAY","text":"(-???-)Oh, boil my carrots!"},{"name":"SYSTEM","text":"This colorful expletive is followed by the telltale screech of a Loporrit in distress. Perhaps you ought to check on Dreamingway..."},{"name":"DREAMINGWAY","text":"Thank heavens you were here! I tried to run, but I tripped... That grey sand is not <span class=\"emphasis\">nearly</span> as pleasant when it's in my mouth, let me tell you."},{"name":"DREAMINGWAY","text":"&lt;sigh&gt; And here I was hoping to show you what a competent and capable worker I could be on my own..."},{"name":"DREAMINGWAY","text":"I did manage to get the parts we need, though, so all's well that ends well! Meet me at the Carrotorium, and we'll see if we can't fix that caretaker."},{"name":"DREAMINGWAY","text":"As you can see, this is the caretaker that needs our attentions."},{"name":"DREAMINGWAY","text":"The poor thing's not even able to move right now─but it'll be good as new once I'm done with it!"},{"name":"DREAMINGWAY","text":"Shift this over there... Stick the thingamabob in the whatsit, and..."},{"name":"DREAMINGWAY","text":"Restored to pristine condition in no time at all!"},{"name":"DREAMINGWAY","text":"Most Loporrits know enough to make similar repairs, though. It's really nothing special..."},{"name":"DREAMINGWAY","text":"And I cannot even imagine how one would go about building such a machine from scratch. No, something tells me my dream lies elsewhere."},{"name":"DREAMINGWAY","text":"I suppose that's more than we had to go on before, though. Not to mention that there's still one job of mine that I haven't shown you yet! Would you care to see how we grow carrots?"},{"name":"DREAMINGWAY","text":"Well, then, let's hop to it!"}],"reward":{"gil":935},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[70053]},"next":[70055]},"partials":[{"type":"npc","id":"1041558","obj":{"i":1041558,"n":"Dreamingway","l":3711,"q":1}},{"type":"npc","id":"1041564","obj":{"i":1041564,"n":"Dreamingway","l":3711,"q":1}},{"type":"quest","id":"70053","obj":{"i":70053,"n":"A Way to Make a Living","g":124,"l":"Mare Lamentorum","s":1952,"f":1}},{"type":"quest","id":"70055","obj":{"i":70055,"n":"Dream a Little Dream","g":124,"l":"Mare Lamentorum","s":1954,"f":1}}]}