{"quest":{"name":"Name That Way","location":"Mare Lamentorum","id":70052,"patch":6.0,"sort":1951,"icon":101089,"unlocksFunction":1,"eventIcon":71341,"issuer":1041555,"target":1041556,"genre":124,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Knockingway would like you to call upon a friend.","Knockingway explains that their friend, Dreamingway, has not been at his best since awakening from hibernation. As they believe the forlorn Loporrit would be more likely to open up to a representative of Etheirys, you agree to go and ask him what is wrong.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Upon introducing yourself to Dreamingway, you learn that his name is the cause of his concern. Inspired by the people of Etheirys, he aspires to achieve a dream of his own─yet has no idea what he should pursue. Perhaps, as he hopes, the other Loporrits will be able to point you in the right direction.","You speak with Dreamingway's acquaintances, and though they have only praise for their fellow Loporrit, none can say what he might be particularly suited to. Though he will doubtless be disappointed, Dreamingway would want to know that you must pursue other avenues.","Dreamingway is disheartened, though unsurprised, by his fellow Loporrits' responses. You are loath to let him give up hope so soon, however, and encourage him to continue searching. With your help, he might yet find meaning in his name."],"objectives":["Speak with Dreamingway.","Speak with Dreamingway's acquaintances.","Report to Dreamingway."],"dialogue":[{"name":"KNOCKINGWAY","text":"Hail, person! Yes, you! Do you have a moment?"},{"name":"KNOCKINGWAY","text":"You see, ever since we awoke for inspection, a friend of mine has been acting a little funny. Funnier than usual, even! I can hear him sighing from all the way over here."},{"name":"KNOCKINGWAY","text":"I would go and call on him─as I do─but he always insists that nothing's wrong..."},{"name":"KNOCKINGWAY","text":"I think he'd be unable to help himself from opening up to you, though. He has always been ever so fond of people. Would you mind lending him an ear or two?"},{"name":"KNOCKINGWAY","text":"Many thanks to you! My friend's name is “Dreamingway,” and he should be somewhere nearby─just follow the lamentatious snuffling."},{"name":"KNOCKINGWAY","text":"I'm fairly certain I hear sounds of distress emanating from the eastern quadrant..."},{"name":"DREAMINGWAY","text":"&lt;sigh&gt; ...Stay focused, Dreamingway! Sure, you're no Workingway, but..."},{"name":"DREAMINGWAY","text":"Oh! Oh my."},{"name":"DREAMINGWAY","text":"You're not a Loporrit..."},{"name":"DREAMINGWAY","text":"Am I dreaming? Is the day finally here? Am I truly talking with a visitor from Etheirys!?"},{"name":"DREAMINGWAY","text":"Wh-Whatever can I help you with, kind <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"One of your friends asked me to check on you."},{"name":"A1","text":"I think I should be asking you that very same question."},{"name":"DREAMINGWAY","text":"Wh-Who put you up to such a thing!?"},{"name":"DREAMINGWAY","text":"H-How did you know!?"},{"name":"DREAMINGWAY","text":"...I-In any case, I couldn't bother an honored guest with my silly troubles."},{"name":"DREAMINGWAY","text":"If you insist... Perhaps I could share a nibble of what's on my mind."},{"name":"DREAMINGWAY","text":"Ah, but first─may I ask your name?"},{"name":"DREAMINGWAY","text":"<span class=\"highlight\">Forename Surname</span>? A truly spectacular name! I'm sure it speaks to your character, in one way or another..."},{"name":"DREAMINGWAY","text":"&lt;sigh&gt; If only I could say the same for mine..."},{"name":"DREAMINGWAY","text":"Perhaps it was a mistake to choose “dream” from that tome of words, for try as I might, I have no such thing! And seeing everyone else live up to their names since our awakening has only made me more aware of it."},{"name":"DREAMINGWAY","text":"The people of Etheirys, on the other paw, seem to dream a great deal. Have you any advice for me?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Focus on what you love to do."},{"name":"A2","text":"Focus on what you're good at."},{"name":"DREAMINGWAY","text":"B-But that's the problem─I haven't the foggiest idea what that would be!"},{"name":"DREAMINGWAY","text":"...Though my fellow Loporrits might. I've known them since...well, since we were created, so perhaps they see something in me that I cannot."},{"name":"DREAMINGWAY","text":"With their help, you must be able to find an objectively appropriate dream for me to pursue! You know best what would be of service to mankind, after all."},{"name":"DREAMINGWAY","text":"I'm all ears, so you need only tell me once you've come up with something─anything at all!"},{"name":"DREAMINGWAY","text":"I hope the others have something to say about me..."},{"name":"LOPORRITA04517","text":"Dreamingway? He can do anything he sets his mind to. He doesn't complain about getting his paws dirty, either!"},{"name":"LOPORRITA04517","text":"That said, I'm not sure I can think of anything he's <span class=\"emphasis\">particularly</span> gifted at..."},{"name":"LOPORRITB04517","text":"Hmm... He's no sluggard, I can tell you that! Always happy to lend a paw when there's work to be done."},{"name":"LOPORRITB04517","text":"Compared to some of the others... Well, let's just say that he's a great help!"},{"name":"LOPORRITC04517","text":"You want to know about Dreamingway?"},{"name":"LOPORRITC04517","text":"I can't say I know him terribly well─he's always rushing off on a new task just as soon as he finishes the old one. I've always thought him a good sort, though."},{"name":"LOPORRITA04517","text":"I doubt there's anything he <span class=\"emphasis\">can't</span> do, really."},{"name":"LOPORRITB04517","text":"Dreamingway has never been one to stand about twiddling his paws! Unlike some..."},{"name":"LOPORRITC04517","text":"Dreamingway is always there when I need him─and always rushing off to the next thing that catches his eye when I don't."},{"name":"DREAMINGWAY","text":"Did they have aught of interest to share? Please say they did..."},{"name":"DREAMINGWAY","text":"...That's more or less what I expected, I suppose. “Nice enough, but in no way gifted.” &lt;sigh&gt;"},{"name":"DREAMINGWAY","text":"Perhaps I was never meant to dream..."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"It's never too late to dream!"},{"name":"A3","text":"Don't worry─we'll find your dream yet."},{"name":"DREAMINGWAY","text":"Y-You really think so? Goodness, people are truly as kind as they say..."},{"name":"DREAMINGWAY","text":"In that case, I promise not to give up until we've found my dream! Even if it's the last thing I do..."},{"name":"DREAMINGWAY","text":"...Huh, that got grim. Let's exhaust our other options before we go for anything potentially lethal, shall we?"}],"reward":{"gil":855,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69942]},"next":[70053]},"partials":[{"type":"npc","id":"1041555","obj":{"i":1041555,"n":"Knockingway","l":3711,"q":1}},{"type":"npc","id":"1041556","obj":{"i":1041556,"n":"Dreamingway","l":3711,"q":2}},{"type":"quest","id":"69942","obj":{"i":69942,"n":"Setting Things Straight","g":11,"l":"Mare Lamentorum","s":560}},{"type":"quest","id":"70053","obj":{"i":70053,"n":"A Way to Make a Living","g":124,"l":"Mare Lamentorum","s":1952,"f":1}}]}