{"quest":{"name":"Of Mothers and Merchants","location":"Old Sharlayan","id":70059,"patch":6.15,"sort":9101,"unlocksFunction":1,"eventIcon":71341,"issuer":1042242,"target":1042428,"genre":119,"journal":["The well-dressed attendant has been sneaking glances at you since the moment you entered the Agora."],"objectives":["Wait near the table reserved by House Leveilleur.","Speak with Ameliance.","Speak with Ameliance again."],"dialogue":[{"name":"MERYLD","text":"You are... Pray forgive my directness, but you are none other than <span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, are you not?"},{"name":"MERYLD","text":"(-Meryld-)It is a pleasure to finally make your acquaintance. I am Meryld, a humble servant of House Leveilleur."},{"name":"MERYLD","text":"(-Meryld-)I have heard that you are an exemplary artisan, is this true? If so, I should hope you will be intrigued by a proposal from my employer."},{"name":"MERYLD","text":"(-Meryld-)You see, Lady Ameliance has been focused on a rather important social welfare endeavor of late, and seeks the aid of an artisan possessed of talent commensurate to the task at hand."},{"name":"MERYLD","text":"(-Meryld-)That glint in your eye tells me you wish to know more, so I invite you to speak with her in person. As fortune would have it, she is available at this very moment..."},{"name":"MERYLD","text":"(-Meryld-)You needn't say another word; I shall arrange a seat for you under the House Leveilleur reservation. Pray make your way to the Last Stand at your earliest convenience, and await Lady Ameliance's arrival."},{"name":"AMELIANCE","text":"(-???-)<span class=\"highlight\">Forename</span>! I presume it was Meryld who sent you hither!"},{"name":"FLHAMINN","text":"Lured by the prospect of fresh endeavors, no doubt. I myself am guilty of the same─our Lady Leveilleur's correspondence has been full of the most tantalizing hints of late..."},{"name":"ROWENA","text":"Surprise, surprise. What, not happy to see me?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"&lt;cough&gt; I think I may be coming down with something..."},{"name":"A1","text":"I just remembered, I, uh... I left my oven fire burning at home."},{"name":"ROWENA","text":"Relax, this ain't my venture. I'm here at F'lhaminn's invitation."},{"name":"AMELIANCE","text":"At the very least, I insist you join us for a cup of tea. Do sit down."},{"name":"ROWENA","text":"...I see. So the Studium is to begin accepting foreign students, is it?"},{"name":"AMELIANCE","text":"Yes. As you know, Sharlayan has long closed its borders and avoided interfering in the affairs of other nations, bound by a single-minded focus to secure the safety of the peoples of this star."},{"name":"AMELIANCE","text":"With the Final Days averted, the need for such drastic measures has dissipated. It took an awfully long time, and the near end of the world, but the winds of change have begun to blow─Sharlayan is trying to become an open nation."},{"name":"AMELIANCE","text":"That said, not all students can afford the costs incurred by studying abroad, let alone the steep price of the Studium's tuition. I can scarcely imagine how those from nations who suffered the worst of the Final Days might attempt such a feat."},{"name":"AMELIANCE","text":"To ease the financial burden, I plan to offer all necessary school supplies free of charge. Furthermore, I have already begun talks with a number of Sharlayan families to propose an academic homestead program."},{"name":"FLHAMINN","text":"My, what a lovely initiative. A good old-fashioned cultural exchange is sure to be a mutually enlightening experience for the many Sharlayans who've remained cooped up with their dusty old tomes."},{"name":"AMELIANCE","text":"Such is my hope. Alas, you will recall that a great deal of the Leveilleur fortune was poured into outfitting the <span class=\"emphasis\">Ragnarok</span>, yes?"},{"name":"AMELIANCE","text":"As such, I cannot hope to carry out this endeavor long-term without a financial backer...a partner, if you will."},{"name":"ROWENA","text":"I'm all for noble causes, but you can't possibly be suggestin' we provide <span class=\"emphasis\">everythin'</span> for free."},{"name":"AMELIANCE","text":"Oh, but of course I am! Were I to require students to repay the sum of their tuition after graduating─a sum few could afford─it would be no different from a loan, after all."},{"name":"ROWENA","text":"I see... Well, I wish I could help, but with no prospect of income, I must respectfully decline your offer. It's not my intent to be rude, but I run a business, not a charity."},{"name":"AMELIANCE","text":"I completely understand."},{"name":"AMELIANCE","text":"Recently, I find myself reminiscing over the time I spent in the Dravanian hinterlands...Fourchenault, the children, and myself─we were all so happy, living in the Emporium."},{"name":"AMELIANCE","text":"Idle though it may now be, the town was once tremendously effervescent, filled to the brim with inquiring souls who traveled from every corner of Eorzea in the pursuit of knowledge."},{"name":"AMELIANCE","text":"Of course, it was not solely prospective students and researchers who journeyed there─far from it. As a hub for seekers of knowledge, no small few merchants made a living by procuring research supplies. In turn, they had immediate access to a reservoir of cutting-edge inventions."},{"name":"AMELIANCE","text":"Come to think of it, I daresay my contact at the East Aldenard Trading Company will be intrigued to hear of similar possibilities arising from our program. It was so very kind of Tataru to introduce us..."},{"name":"ROWENA","text":"...The East Aldenard Trading Company?"},{"name":"ROWENA","text":"(Hold on a minute, now... What in the hells could possibly be giving this woman the confidence to act so bafflingly indifferent?)"},{"name":"ROWENA","text":"(...Her husband's supposed to be a bigwig in that Forum o' theirs, ain't he? Stands to reason she may've heard rumblings of Sharlayan investing deeper in its education system. And in that case, it'd be wiser to invest now to reap the benefits later...)"},{"name":"ROWENA","text":"(Better yet, the students who end up attending'll be the best and brightest o' their respective nations. If I make 'em feel indebted to me now, they'll be obligated to repay the favor in the future...once they've become powerful, distinguished members o' society, o' course.)"},{"name":"AMELIANCE","text":"...I will also have need of a skilled artisan to procure the necessary supplies─no doubt the demand is sure to be immense!"},{"name":"AMELIANCE","text":"Goodness, just look at me prattle on when you've no interest in the matter! I really must be getting on home─countless preparations need be made ere my distinguished guest arrives."},{"name":"ROWENA","text":"...Hold that thought."},{"name":"ROWENA","text":"I've come around to your proposal."},{"name":"ROWENA","text":"Aye, and as your partner, the House of Splendors pledges its <span class=\"emphasis\">considerable</span> support for your endeavor. An investment for the future, let's call it."},{"name":"ROWENA","text":"That is, on one condition: <span class=\"highlight\">Forename</span> must be the sole supplier."},{"name":"AMELIANCE","text":"My, how fortuitous! I did not expect you to pledge your support, but full glad am I that you have. Together, we can give countless students the opportunities they deserve!"},{"name":"AMELIANCE","text":"But what say you, <span class=\"highlight\">Forename</span>? Would you be able to spare some time from the seemingly infinite number of responsibilities that require your attention?"},{"name":"AMELIANCE","text":"Wonderful! I'm counting on both of you!"},{"name":"AMELIANCE","text":"F'lhaminn and Rowena have already left if you're wondering─they intend to do some sightseeing in town before returning home. I do hope you were able to enjoy our teatime together. I can think of none more deserving of a brief respite."},{"name":"AMELIANCE","text":"I must apologize, however, for dragging you into this matter. You deserve a full explanation─but not here. Would you care to meet me at my home?"},{"name":"AMELIANCE","text":"Splendid. I shall be awaiting you at the Leveilleur estate. "},{"name":"AMELIANCE","text":"Thank you for humoring me, <span class=\"highlight\">Forename</span>─and welcome once again!"},{"name":"AMELIANCE","text":"For years, I've supported my children from afar as a sponsor of the Scions of the Seventh Dawn. Yet even though the Scions have disbanded, it has done little to diminish my desire to be of service."},{"name":"AMELIANCE","text":"That is why I decided it is past time I made my own contribution to the world...to this star that you and my children have sacrificed so much to save."},{"name":"AMELIANCE","text":"But I am merely one person. My resources limited. Words can ill express how grateful I am for your aid."},{"name":"AMELIANCE","text":"In time, I hope you will come to see me not only as the mother of Alphinaud and Alisaie, but as your partner and friend. As I said before, I am counting on you, <span class=\"highlight\">Forename</span>."},{"name":"AMELIANCE","text":"Now, there is, in fact, another reason I invited you here. The Leveilleur household will also be partaking in the homestead program, and I have already accepted a student."},{"name":"AMELIANCE","text":"She comes from a family of accomplished alchemists, hailing from Thavnair. Meryld has already gone to fetch her from the port, so I imagine she will arrive ere long."},{"name":"MERYLD","text":"Lady Ameliance, I pray I did not keep you waiting overlong. Miss Miladeen has arrived."},{"name":"MILADEEN","text":"N-N-Nice to meet you! I am Miladeen, freshly arrived from Thavnair. It is a p-pleasure to make your acquaintance!"},{"name":"AMELIANCE","text":"Oh, the pleasure is all mine, I'm sure! You must be utterly exhausted after such a long voyage."},{"name":"AMELIANCE","text":"I am Ameliance, and standing beside me is none other than─"},{"name":"MILADEEN","text":"O-Oh, I know! It's <span class=\"alternative-container\"><span class=\"alternative\">Mistress Alisaie</span><span class=\"alternative\">Master Alphinaud</span></span>, isn't it!?"},{"name":"AMELIANCE","text":"...Hah! I'm afraid not, my dear."},{"name":"AMELIANCE","text":"This charming personage beside me is in fact <span class=\"highlight\">Forename</span>, my business partner. Better known as the hero who saved our star from the Final Days."},{"name":"MILADEEN","text":"Ah! I'm so sorry, it was rude of me to presume! I have heard much and more of your many heroic deeds in Thavnair, but I've never had a face to put to the name..."},{"name":"MILADEEN","text":"P-Putting that aside, it is a dream come true for me to finally stand in the magnificent halls of the Studium...I could collapse with happiness on this very spot!"},{"name":"MILADEEN","text":"With these dignified walls surrounding me, I feel as though I stand in the very annals of history itself! My mind wanders to the countless brilliant minds who made discovery after discovery here."},{"name":"MERYLD","text":"Erm, Miss Miladeen... I'm afraid it is not the Studium, but the Leveilleur estate in which you stand. This residence shall be your lodgings for the duration of your stay."},{"name":"AMELIANCE","text":"It may take some getting used to, but it is my wish that you come to feel at home here."},{"name":"MILADEEN","text":"Th-This...is your <span class=\"emphasis\">home</span>!?"},{"name":"MILADEEN","text":"Ahem! Though I have much to learn─and the thought of your present impression of me fills me with dread─I hope that we can get along!"},{"name":"AMELIANCE","text":"Oh, you needn't be so formal. Tell me, what can we do to make you feel more comfortable?"},{"name":"MILADEEN","text":"I-I know! Please call me Mila! That's what my folks back home call me, while Miladeen is...usually reserved for when I'm in trouble..."},{"name":"MERYLD","text":"Pray forgive me, but I'm afraid I must continue to observe formalities, Miss Miladeen. If it please you, I shall escort you to your room."},{"name":"AMELIANCE","text":"A number of other families will also be opening up their homes to students from abroad in the coming days. I must set a good example as the first host mother, for if all goes to plan, we can expand the program to include even more students!"},{"name":"AMELIANCE","text":"Let us waste no time─there is plenty of work to be done!"},{"name":"AMELIANCE","text":"Classes at the Studium will begin once students have had time to settle in. I would like to use this period to procure all of the necessities needed for their matriculation."},{"name":"AMELIANCE","text":"You may find any materials you need by speaking with Synnove, the apothecary, in the Agora. Let us give the students the welcome they deserve!"}],"reward":{"gil":895,"items":[{"num":3,"id":36053},{"num":3,"id":36054}]},"reqs":{"jobs":[{"lvl":80,"id":35}],"questsType":"all","quests":[70000,67634]},"next":[70060]},"partials":[{"type":"npc","id":"1042242","obj":{"i":1042242,"n":"Well-dressed Attendant","l":3706,"q":1}},{"type":"npc","id":"1042428","obj":{"i":1042428,"n":"Ameliance","l":3706,"q":2}},{"type":"item","id":"36053","obj":{"i":36053,"n":"Giant Haddock Dip","l":540,"c":24258,"t":46}},{"type":"item","id":"36054","obj":{"i":36054,"n":"Yakow Moussaka","l":540,"c":24112,"t":46}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}},{"type":"quest","id":"67634","obj":{"i":67634,"n":"Go West, Craftsman","g":95,"l":"Mor Dhona","s":600,"f":1}},{"type":"quest","id":"70060","obj":{"i":70060,"n":"A Mother's Love","g":119,"l":"Old Sharlayan","s":9110,"f":1}}]}