{"quest":{"name":"Alzadaal's Legacy","location":"Thavnair","id":70065,"patch":6.1,"sort":622,"icon":112465,"eventIcon":71201,"issuer":1039586,"target":1039590,"genre":12,"journal":["Y'shtola is intrigued by the legend of Alzadaal III.","Y'shtola and G'raha Tia ponder the tales of Alzadaal III, wondering what marvels may await them beneath the Bounty. The ever-practical Estinien, on the other hand, has no patience for conjecture and proposes an immediate departure. The time has come to gather your companions and ascertain the truth of Alzadaal's Legacy.<br><br>※To enlist your companion NPCs for this duty, speak with them near the entrance or access Duty Support via the main menu. Use the Duty Finder if you wish to complete the instance alongside fellow players.","The path through the island ruins leads you deep beneath the Bounty's waves. After braving a gauntlet of devilish traps and murderous constructs, you are at last free to claim the glittering treasures of Alzadaal's Legacy...","In the final chamber of the expansive treasure vault, you behold a massive, silk-draped contrivance not unlike a Hannish alchemical furnace. Even as Y'shtola steps forward to investigate, however, Varshahn arrives to beg you keep your distance. After some prompting, the wyrm's youthful simulacrum agrees to divulge to you the purpose for which the mechanism was designed. He dispels the wards and reveals what G'raha identifies as a functioning gateway to the void.<br><br>※In the event that you leave the instance, you may re-enter by speaking with Matsya in Akyaali.","G'raha Tia contemplates aloud the difference between planar fissures and voidgates, observing that the phenomenon before you is more akin to the latter owing to the elaborate control mechanism. As he stares into the inky swirls of the portal, the former Exarch waxes nostalgic about old friends and foes..."],"objectives":["Enter Alzadaal's Legacy.","Speak with G'raha Tia."],"dialogue":[{"name":"ESTINIEN","text":"Despite his misgivings, I wager Mehrahd remains in that merchant's employ..."},{"name":"GRAHATIA","text":"Ah, the thrill of imminent adventure! I never tire of this feeling."},{"name":"URIANGER","text":"In my travels, I spied many a child wandering alone─orphans, in all likelihood. Though homes razed by beasts and blasphemies can be rebuilt, the void left by those we have lost cannot so easily be filled..."},{"name":"MATSYA","text":"I will pray to Sanduruva for your safe return. May the wealth of Her blessings guide you to the treasure you seek..."},{"name":"YSHTOLA","text":"Alzadaal III... I confess I am somewhat embarrassed that the tale of his journey to another world escaped my notice. Could it be more than simple folklore?"},{"name":"GRAHATIA","text":"And what of the treasure he supposedly brought back? This undersea vault may hold relics from another reflection!"},{"name":"URIANGER","text":"My friends, we should temper our expectations. The map doth promise ruins, but beyond that we know not what we will find."},{"name":"ESTINIEN","text":"Not until we find it, aye."},{"name":"ESTINIEN","text":"So let us dispense with the conjecture and set sail for the vault."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Small talk."},{"name":"A1","text":"Form a party and enter Alzadaal's Legacy."},{"name":"A1","text":"Nothing."},{"name":"YSHTOLA","text":"I am aware that this story about an otherworldly journey may be just that─a story. But even the wildest tale often contains a few grains of truth, and that is worth investigating."},{"name":"GRAHATIA","text":"One can only spend so many days hunched over a desk before it begins to take its toll. A spot of vigorous exploration is exactly what I needed!"},{"name":"ESTINIEN","text":"None who enter these ruins come out alive... Well, we shall see about that."},{"name":"URIANGER","text":"The treasure vault of a satrap will surely be filled with diverse traps and devilish deterrents. Caution is paramount."},{"name":"MATSYA","text":"My boat is at your disposal!"},{"name":"Q2","text":"Proceed to Weaver's Warding?"},{"name":"YSHTOLA","text":"I came here in search of something that might further my research. I did <span class=\"emphasis\">not</span> anticipate a fully functioning voidgate."},{"name":"URIANGER","text":"Even in the learned halls of Sharlayan, 'tis forbidden to throw wide the gates to the abyss. The peril is far too great..."},{"name":"ESTINIEN","text":"Can such a tiny portal truly be so dangerous?"},{"name":"VARSHAHN","text":"I expect you have more questions..."},{"name":"GRAHATIA","text":"Voidgates and fissures are much the same thing in practice, in the sense that both allow passage between the Source and the Thirteenth. The difference in terminology refers to the circumstances of their creation."},{"name":"GRAHATIA","text":"A fissure is an incidental tear in the fabric between worlds, whereas a voidgate is the product of deliberate action."},{"name":"GRAHATIA","text":"I suspect this is the latter, judging by the elaborate mechanism put in place to control it."},{"name":"GRAHATIA","text":"To think that our search for material riches would lead to this priceless discovery!"},{"name":"GRAHATIA","text":"That swirling emptiness... It puts me in mind of old friends, not to mention old foes."},{"name":"SYSTEM","text":"You may now enter Alzadaal's Legacy with a party of NPC avatars. To make use of this feature, open the <span class=\"highlight\">Trust</span> interface located under <span class=\"highlight\">Duty</span> in the main menu."}],"reward":{"gil":4839,"instance":87},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70064]},"next":[70066]},"partials":[{"type":"npc","id":"1039586","obj":{"i":1039586,"n":"Y'shtola","l":3709,"q":1}},{"type":"npc","id":"1039590","obj":{"i":1039590,"n":"G'raha Tia","l":4035,"q":1}},{"type":"instance","id":"87","obj":{"i":87,"n":"Alzadaal's Legacy","c":61801,"t":"Dungeons","min_lvl":90,"max_lvl":90,"min_ilvl":560,"max_ilvl":600}},{"type":"quest","id":"70064","obj":{"i":70064,"n":"Friends for the Road","g":12,"l":"Thavnair","s":621}},{"type":"quest","id":"70066","obj":{"i":70066,"n":"A Brother's Grief","g":12,"l":"Weaver's Warding","s":623}}]}