{"quest":{"name":"Newfound Adventure","location":"The Rising Stones","id":70062,"patch":6.1,"sort":619,"icon":101179,"eventIcon":71201,"issuer":1041232,"target":1039570,"genre":12,"journal":["Tataru is putting on a pot of tea and looks in need of company.","Having traveled to the edge of existence and back, the question of what comes next has been at the forefront of your mind. Tataru inquires into your plans for the future, and her suggestion of returning to your adventuring roots strikes a chord. In particular, you recall the words of Emet-Selch, urging you to see with your own eyes the Bounty's undersea ruins...<br><br>Having anticipated your rekindled passion for exploration, Tataru reveals that she is in the process of crafting you a new set of traveling clothes. You try to wait patiently as she cuts and sews, but are soon overcome by the accumulated fatigue of saving a world and slip into an unexpected nap. You awake to find an apologetic Tataru, who asks that you accompany her to the Diamond Forge where she intends to add the finishing touches to your outfit.","Promising a shorter wait than before, Tataru throws herself body and soul into completing her work. You express admiration for the finished product, but in lieu of praise and payment she asks that you wear the outfit where other adventurers might see it, and thus garner interest for Tataru Taru's Boutique. It seems that even your return to adventure is an opportunity to drum up business!"],"objectives":["Speak with Tataru at the Diamond Forge."],"dialogue":[{"name":"TATARU","text":"<span class=\"highlight\">Forename</span>, how lovely to see you!"},{"name":"TATARU","text":"If you're not in too much of a rush, I was about to make a pot of tea. Would you like a cup?"},{"name":"TATARU","text":"Take a seat, then, and I'll find us something to nibble on as well."},{"name":"TATARU","text":"Observe as the artiste refines her piece into a <span class=\"emphasis\">master</span>piece!"},{"name":"TATARU","text":"And no napping this time! I only need a moment─you'll see!"},{"name":"TATARU","text":"A little more room in the shoulders...open up the cuffs...a final adjustment to the hem..."},{"name":"TATARU","text":"All done! Let's see how it looks on the mannequin."},{"name":"TATARU","text":"Well, what do you think? Doesn't it just scream “ready for a bold new adventure”!?"},{"name":"TATARU","text":"I'm so glad you approve!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You've outdone yourself, Tataru, thank you!"},{"name":"A1","text":"So, what do I owe you...?"},{"name":"TATARU","text":"Oh stop─you'll make me blush!"},{"name":"TATARU","text":"Oh, don't be silly. Your approval is payment enough!"},{"name":"TATARU","text":"If you really want to thank me, though, all I ask is that you wear this on your travels!"},{"name":"TATARU","text":"Or at least anywhere lots of adventurers might gather, heh heh..."},{"name":"TATARU","text":"They'll look at you, a famous hero, and wonder, “Wherever did <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> purchase those stylish-yet-practical garments?”"},{"name":"TATARU","text":"And before you know it, hordes of new customers will be climbing over each other to place orders at Tataru Taru's Boutique!"},{"name":"TATARU","text":"Muahaha! I can hear it now─the merry clink-clink of gil overflowing from my coffers! Sweet music to my ears!"},{"name":"TATARU","text":"Ahem... Burgeoning merchant empires aside, you must be excited to start a fresh chapter of your life. New places to go, new people to meet─I often wonder how you remember all your experiences and exploits without taking at least a few notes..."},{"name":"TATARU","text":"Oh! Maybe you should start doing just that! You never know when some odd past detail might become relevant, or if one day you'll take a blow to the head and forget the better part of the past decade. Something to keep in mind, in any case!"},{"name":"SYSTEM","text":"<span class=\"highlight\">The Unending Codex</span> is now available under Collection in the Duty section of the main menu."},{"name":"SYSTEM","text":"New entries for prominent terms and characters will be added to the codex as you progress through the main scenario quests."}],"reward":{"items":[{"id":37078},{"id":37079},{"id":37080},{"id":37081},{"id":37082}]},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70000]},"next":[70063,70119]},"partials":[{"type":"npc","id":"1041232","obj":{"i":1041232,"n":"Tataru","l":481,"q":1}},{"type":"npc","id":"1039570","obj":{"i":1039570,"n":"Tataru","l":67,"q":2}},{"type":"item","id":"37078","obj":{"i":37078,"n":"Wayfarer's Tabard","l":1,"c":42850,"t":35,"p":100}},{"type":"item","id":"37079","obj":{"i":37079,"n":"Wayfarer's Fingerless Gloves","l":1,"c":44998,"t":37,"p":100}},{"type":"item","id":"37080","obj":{"i":37080,"n":"Wayfarer's Boots","l":1,"c":49480,"t":38,"p":100}},{"type":"item","id":"37081","obj":{"i":37081,"n":"Wayfarer's Earcuff","l":1,"c":55496,"t":41,"p":100}},{"type":"item","id":"37082","obj":{"i":37082,"n":"Wayfarer's Necklace","l":1,"c":55057,"t":40,"p":100}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}},{"type":"quest","id":"70063","obj":{"i":70063,"n":"Bountiful Ruins","g":12,"l":"Revenant's Toll","s":620}},{"type":"quest","id":"70119","obj":{"i":70119,"n":"Small Business, Big Dreams","g":80,"l":"Old Sharlayan","s":10}}]}