{"quest":{"name":"Sharing the Wealth","location":"Radz-at-Han","id":70067,"patch":6.1,"sort":624,"eventIcon":71201,"issuer":1039600,"target":1039607,"genre":12,"journal":["Varshahn wishes to discuss the distribution of the treasure."],"objectives":["Speak with Matsya in Akyaali.","Speak with locals in Yedlihmad.","Speak with Varshahn at Meghaduta."],"dialogue":[{"name":"ESTINIEN","text":"I hope you enjoyed the expedition, at least. Otherwise it was a heavy purse to pay for a treasure map leading to a treasure we couldn't keep."},{"name":"VARSHAHN","text":"Shall we begin? If we are to spend the treasure wisely, then we must first determine which groups would benefit most from monetary assistance."},{"name":"VARSHAHN","text":"Some of my citizens may find it intimidating to speak with the satrap directly, so I would ask that you act in my stead."},{"name":"VARSHAHN","text":"<span class=\"highlight\">Forename</span>, you are to visit Akyaali and Yedlihmad. Speak with Matsya and his people, and listen to their grievances."},{"name":"VARSHAHN","text":"Estinien, I bid you do the same at Palaka's Stand. I will be conducting my own inquiries at the Giantsgall Grounds."},{"name":"VARSHAHN","text":"Once you believe you have ascertained the needs of the populace, we can reconvene at Meghaduta."},{"name":"MATSYA","text":"Oh, <span class=\"highlight\">Forename</span>! I was so glad to see you had returned unharmed. You've finished with the boat, then?"},{"name":"MATSYA","text":"...Anything the village desperately needs?"},{"name":"MATSYA","text":"Well, I suppose Khalzahl's loss hit us the hardest."},{"name":"MATSYA","text":"I've been trying to find buyers for my fish, but although I sell a few here and there, it's so much more difficult than it was before."},{"name":"MATSYA","text":"Everyone's still struggling to rebuild their lives... For now, we're just banding together as best we can."},{"name":"MATSYA","text":"I liked leaving the selling to Khalzahl. I could just catch the fish, and not have to talk people into eating them..."},{"name":"MERCHANT04368","text":"Greetings and welcome, traveler! If this is your first visit to Thavnair, then you must try my special amra lassi! Its refreshing zest cannot be beat!"},{"name":"MERCHANT04368","text":"What could such a wonder cost, you wonder? Normally I part with three bottles for the generous price of nineteen thousand and eight hundred gil, but for you? I am willing to go as low as an even ten thousand! You'd be practically <span class=\"emphasis\">stealing</span> from me!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Stealing? At that price, you're the only thief around here."},{"name":"A1","text":"Still not turning a profit these days?"},{"name":"A1","text":"I am...not Estinien."},{"name":"MERCHANT04368","text":"Gah! Y-You...you're the one who was with that spear-toting fellow!"},{"name":"MERCHANT04368","text":"Well, you can hardly blame a man for trying... The world may no longer be on fire, but we are still sifting through the ashes, so to speak. Sisters spare me, we might as well have that ugly tower back for the scant few travelers we see these days."},{"name":"MERCHANT04368","text":"Times are harsh, my friend. The world may no longer be on fire, but we are still sifting through the ashes, so to speak. Sisters spare me, we might as well have that ugly tower back for the scant few travelers we see these days."},{"name":"MERCHANT04368","text":"...Estinien? Who is Est─ Gah!"},{"name":"MERCHANT04368","text":"You're the one who was with that spear-toting fellow! Well, you can hardly blame a man for trying..."},{"name":"MERCHANT04368","text":"The world may no longer be on fire, but we are still sifting through the ashes, so to speak. Sisters spare me, we might as well have that ugly tower back for the scant few travelers we see these days."},{"name":"MERCHANT04368","text":"I myself barely have the coin to buy at local prices. I tell you, if I didn't charge the odd adventurer a small fortune for afternoon tea, I'd be scavenging for scraps in the street..."},{"name":"PORTMANAGER04368","text":"&lt;sigh&gt;"},{"name":"PORTMANAGER04368","text":"How fares the port? Well, it's in shambles, isn't it?"},{"name":"PORTMANAGER04368","text":"The trade routes are open once more now that the danger has passed, certainly."},{"name":"PORTMANAGER04368","text":"But no small number of merchants have had to sell their ships to make ends meet in the short term."},{"name":"PORTMANAGER04368","text":"Add to that the sailors we lost in the Final Days, and it's little wonder the flow of exports is no more than a pitiful trickle."},{"name":"PORTMANAGER04368","text":"If Khalzahl and his consortium were still with us, I'm sure he'd have found a way to turn our fortunes around. Now that was a man who got things done, gods rest his soul."},{"name":"SYSTEM","text":"You have spoken with key local figures, and gained an understanding of the populace's hardships. Varshahn awaits your report at Meghaduta."},{"name":"MERCHANT04368","text":"Times are lean, my friend. ...Are you <span class=\"emphasis\">sure</span> you wouldn't care for a slightly overpriced lassi?"},{"name":"PORTMANAGER04368","text":"We'll scrape by for now, but what we really need is for someone to come in with a plan...and preferably some coin to spare."},{"name":"ESTINIEN","text":"'Twould seem my stint on Vrtra's back did not go unnoticed. I couldn't take two steps before another Hannish local was thanking me profusely for saving their home."},{"name":"VARSHAHN","text":"Ah, my advisors return. I've just made it back myself."},{"name":"ESTINIEN","text":"Why do you retain this vessel now that your true form is known? You could have flown across the island in a fraction of the time."},{"name":"VARSHAHN","text":"Be that as it may, the sight of a massive creature descending from the sky can be startling to say the least. And there are few places I can enter comfortably without risk of flattening some cart or stall."},{"name":"ESTINIEN","text":"Hm... Fair enough."},{"name":"ESTINIEN","text":"As for my inquiries, the people of Palaka's Stand were unanimous in their reply."},{"name":"ESTINIEN","text":"They are surviving."},{"name":"ESTINIEN","text":"Resources were stretched to the limit when refugees were pouring in, but they persevered with some assistance from Yedlihmad."},{"name":"ESTINIEN","text":"From what I understand, they have always been an independent community─hunters and foragers, and the like─and I was assured that the jungle provides for their needs. For the most part."},{"name":"VARSHAHN","text":"Palaka's Stand has weathered the disaster better than most, it seems."},{"name":"VARSHAHN","text":"I myself heard good news and bad."},{"name":"VARSHAHN","text":"The quarrymen were cautiously optimistic, having just sold a full wagon of giantsgall to a foreign trader."},{"name":"VARSHAHN","text":"But such visitors are few and far between. Compared to our best years, the weight of stone leaving Thavnair has been light indeed."},{"name":"VARSHAHN","text":"Our nation is small and isolated, its prosperity dependent on a steady stream of exports..."},{"name":"VARSHAHN","text":"We must identify any obstacles to the flow of trade so we may begin working to remove them. Tell me, what did you learn in Akyaali and Yedlihmad?"},{"name":"VARSHAHN","text":"Hm, I see. Without a dedicated buyer, the average fisherman must struggle to off-load his daily catch..."},{"name":"VARSHAHN","text":"Which is why I believe we should first address the lack of ships and shortage of able-bodied sailors in Yedlihmad."},{"name":"VARSHAHN","text":"I am reminded of a child I spied as I made my way back to the palace. His father lost at sea when the beasts sunk their vessel..."},{"name":"VARSHAHN","text":"So many variations of the same tragic tale, repeated over and over. So many lives lost..."},{"name":"VARSHAHN","text":"Enough grief to drown in if we let ourselves be overcome...but we will not. <span class=\"highlight\">Forename</span>, Estinien, I will consider the perspectives you've brought me, and devise a plan to help my people confront this adversity."},{"name":"VARSHAHN","text":"Come, I would like you to be in attendance when I announce the proposal to my assembled functionaries."}],"reward":{"gil":1001,"items":[{"num":3,"id":36059,"one":1},{"num":3,"id":36065,"one":1},{"num":3,"id":36066,"one":1},{"num":2,"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70066]},"next":[70068]},"partials":[{"type":"npc","id":"1039600","obj":{"i":1039600,"n":"Varshahn","l":3707,"q":2}},{"type":"npc","id":"1039607","obj":{"i":1039607,"n":"Varshahn","l":3707,"q":1}},{"type":"item","id":"36059","obj":{"i":36059,"n":"Giant Popoto Pancakes","l":545,"c":24072,"t":46}},{"type":"item","id":"36065","obj":{"i":36065,"n":"Sykon Compote","l":560,"c":24076,"t":46}},{"type":"item","id":"36066","obj":{"i":36066,"n":"Sykon Bavarois","l":560,"c":24073,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"70066","obj":{"i":70066,"n":"A Brother's Grief","g":12,"l":"Weaver's Warding","s":623}},{"type":"quest","id":"70068","obj":{"i":70068,"n":"Bridging the Rift","g":12,"l":"Radz-at-Han","s":625}}]}