{"quest":{"name":"A Mother's Love","location":"Old Sharlayan","id":70060,"patch":6.15,"sort":9110,"unlocksFunction":1,"eventIcon":71341,"issuer":1042241,"target":1042428,"genre":119,"journal":["Ameliance is eager to depart for the Studium."],"objectives":["Speak with Ameliance and have her accompany you.","Accompany Ameliance to the designated location and then speak with her.","Speak with the contemplative student while accompanied by Ameliance.","Accompany Ameliance to the designated location and then speak with her.","Speak with Ameliance."],"dialogue":[{"name":"AMELIANCE","text":"Lest you worry, I've informed Meryld to wait here in case Mila returns home before we find her."},{"name":"AMELIANCE","text":"With that, let us be off. Oh, I can scarcely wait to see the look on her face when we arrive."},{"name":"MERYLD","text":"I offered to escort Miss Miladeen here, but Lady Ameliance refused. I fear her unexpected arrival may prove overly stressful for our young charge. Please look after them both in my absence, would you?"},{"name":"SYSTEM","text":"Custom deliveries cannot be made while this quest is in progress. They will become available again once the quest is completed."},{"name":"AMELIANCE","text":"Is it strange that, having come all this way, I only now begin to have second thoughts about my plan to surprise Mila? Surely, she would be glad to see us. More so, I should think, if she were to see you in the lead."},{"name":"AMELIANCE","text":"You are far too kind. Thank you."},{"name":"AMELIANCE","text":"Phenomenon is where she's most likely to be, so I suggest we start there."},{"name":"SYSTEM","text":"Ameliance is now accompanying you. Keep her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Ameliance behind by entering a different area, or by speaking with her and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Ameliance accompany you again, return and speak with her at the original location."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Talk."},{"name":"A1","text":"Part ways with Ameliance."},{"name":"A1","text":"Nothing."},{"name":"AMELIANCE","text":"Is something the matter? If you're hungry, I could have our attendants at the manor prepare something on our return."},{"name":"SYSTEM","text":"Are you sure you wish to part ways with Ameliance?"},{"name":"AMELIANCE","text":"Other worldly matters demand your attention, I take it. Say no more. When you return, I shall await you here at the Studium."},{"name":"AMELIANCE","text":"Ah, you've returned. I trust everything is all right? Wonderful. Then let us resume our search for Mila!"},{"name":"AMELIANCE","text":"I should have known she would not be here. There is rarely an opportunity to remain idle at the Studium, after all. She did mention some manner of practical training today, however. Perhaps we can find her at Makers' Meet. Or, failing that, we can ask if any students have seen her."},{"name":"AMELIANCE","text":"...But my, how wonderful it is to walk through these halls again. So many fond memories. Perhaps you would care to hear a story or two?"},{"name":"A1","text":"<span class=\"highlight\">Discuss the Studium.</span>"},{"name":"A1","text":"<span class=\"highlight\">Discuss the various faculties.</span>"},{"name":"AMELIANCE","text":"It was the twins' graduation when last I was here. Unfortunately, an emergency Forum meeting prevented Fourchenault from attending."},{"name":"AMELIANCE","text":"I'd never seen Alisaie in such a foul mood. Alphinaud, meanwhile, tried to put on a brave face, saying he understood the demand and duty of the Forum... But a mother knows when her children are hurting."},{"name":"AMELIANCE","text":"Fourchenault was no better. Would that you could have seen it. He spent an entire day with Alphinaud in the kitchen, baking batch after batch of ginger cookies for Alisaie in an amusing attempt to cheer her up."},{"name":"AMELIANCE","text":"As a student, my studies here centered on the arcane. Fourchenault, meanwhile, studied the art of somanoutics─a dreadfully difficult discipline undertaken by those who aspire to become sages."},{"name":"AMELIANCE","text":"One fateful day, he and I found ourselves working together on an experiment. I had never worked closely with him before, but I knew him well by reputation."},{"name":"AMELIANCE","text":"...He was said to be unbelievably cantankerous, stubborn, unapproachable, and overall quite insufferable─all of which turned out to be true. Naturally, I wished to learn everything about him!"},{"name":"AMELIANCE","text":"He was always so flustered whenever we spoke, averting his eyes this way and that. It was all so very amusing and peculiar─to even think of it begs for laughter! ...Ahem, 'tis probably best that we keep this conversation between ourselves."},{"name":"RESEARCHSTUDENT04524","text":"Thaliak give me strength, I can't think of a way to frame my research! Perhaps I'd best schedule another meeting with the professor..."},{"name":"SYSTEM","text":"Ameliance must be accompanying you in order to proceed with the quest."},{"name":"RESEARCHSTUDENT04524","text":"I'm sorry...did you need something?"},{"name":"AMELIANCE","text":"Please forgive us our intrusion. Would you perchance happen to know where we can find Miladeen? She's a student newly arrived from Thavnair."},{"name":"AMELIANCE","text":"Ah, but how rude of me! I am her host mother, Ameliance Leveilleur."},{"name":"RESEARCHSTUDENT04524","text":"Ameliance... <span class=\"emphasis\">L-Leveilleur</span>!?"},{"name":"RESEARCHSTUDENT04524","text":"Y-Yes, of course! Miladeen! She's in the same course as me. She usually heads over to the pavilion by Noumenon to study on her own after class!"},{"name":"AMELIANCE","text":"Perfect! She shan't be hard to find, then. My apologies again for the disturbance."},{"name":"RESEARCHSTUDENT04524","text":"N-No problem at all! It was an honor to meet you, milady!"},{"name":"AMELIANCE","text":"We've no time to lose─let us make for the pavilion near Noumenon!"},{"name":"RESEARCHSTUDENT04524","text":"Miladeen is really fond of that pavilion─there's nary a day I don't see her studying there."},{"name":"A1","text":"<span class=\"highlight\">Discuss Noumenon.</span>"},{"name":"AMELIANCE","text":"You wish to know about Noumenon? Oh, there's not much to tell of those dusty old halls, though I suppose they are not without a memorable moment or two. I once ventured there in the dead of night for some last-minute research─the deadline for my thesis was close at hand, you see."},{"name":"AMELIANCE","text":"The corridors were dark and empty, with naught but the soft echo of my footsteps to keep me company."},{"name":"AMELIANCE","text":"Then suddenly, a shadowy phantom appeared before me, as if from the very void itself!"},{"name":"AMELIANCE","text":"Much to my surprise, a phantom...it was not. Nay, 'twas Fourchenault. Under the veil of his Vanish spell, he'd been sneaking around the forbidden archives."},{"name":"AMELIANCE","text":"Gods, the look on his face! He near died from embarrassment. “Speak of this to no one, I beg you!” he cried. I obliged, but on the condition he take me to dinner."},{"name":"AMELIANCE","text":"...I trust you understand he's not to hear a word of this conversation."},{"name":"AMELIANCE","text":"There she is! But...she doesn't quite seem herself."},{"name":"AMELIANCE","text":"Mila?"},{"name":"MILADEEN","text":"L-Lady Ameliance? And <span class=\"highlight\">Forename</span> as well? Oh no, is something wrong?"},{"name":"AMELIANCE","text":"Not at all, my dear, everything is quite all right. <span class=\"highlight\">Forename</span> and I merely wished to check on you. It is getting rather late, after all. You must be famished!"},{"name":"MILADEEN","text":"Oh... I'm sorry for making you worry. I just got so absorbed in what I was doing..."},{"name":"AMELIANCE","text":"I take it you've been using the mammet there to practice your healing?"},{"name":"MILADEEN","text":"Yes...but to be perfectly honest, it hasn't been going well."},{"name":"AMELIANCE","text":"The mammet is designed specifically to respond to healing magicks. Rather than risk the danger of practice on a living patient, students use puppets such as this. When a spell is successful, the mammet will rise to its feet."},{"name":"AMELIANCE","text":"...Observe."},{"name":"MILADEEN","text":"A-Amazing...!"},{"name":"MILADEEN","text":"Lady Ameliance, that was simply incredible! Such grace and precision─without expending even an onze of excess energy. It was..."},{"name":"MILADEEN","text":"It was absolutely perfect... Yet no matter what I do, the mammet refuses to even move."},{"name":"MILADEEN","text":"I've been trying so hard to prove my mother wrong, but maybe she was right. Maybe I never should've convinced myself that I could master healing magicks..."},{"name":"MILADEEN","text":"I...I came all this way, and accomplished nothing. You've been so kind to me, Lady Ameliance, and I don't want to waste any more of your precious time. Perhaps it'd be best if I returned home..."},{"name":"AMELIANCE","text":"Nothing could be further from the truth. You think so too, don't you?"},{"name":"DUMMYMAMMET04524","text":"YeS, tHaT iS sImPlY nOt TrUe! PlEaSe ChEeR uP, mIlA!"},{"name":"MILADEEN","text":"Whoa! Erm...are you making it speak, Lady Ameliance? "},{"name":"DUMMYMAMMET04524","text":"PaReNtS aRe AlWaYs ThInKiNg Of ThEiR cHiLdReN. yOuR mOtHeR sUrElY wAnTs ThE bEsT fOr YoU."},{"name":"MILADEEN","text":"I...I know that. I do, truly. That's why I'm afraid of disappointing her."},{"name":"DUMMYMAMMET04524","text":"YoU aRe NoT a PuPpEt. YoU nEeD nOt DaNcE tO yOuR mOtHeR's TuNe!"},{"name":"DUMMYMAMMET04524","text":"YoU hAvE dEtErMiNaTiOn, PaSsIoN, aNd A wOnDeRfUl DrEaM!"},{"name":"DUMMYMAMMET04524","text":"BeSiDeS, aLwAyS dOiNg As OnE iS tOlD iS nOt EaSy. TaKe It FrOm Me─I'm An ExPeRt!"},{"name":"MILADEEN","text":"Bahahaha! That's hardly something to brag about!"},{"name":"AMELIANCE","text":"There's the darling smile I've come to admire."},{"name":"AMELIANCE","text":"Mila, there is no doubt in my mind that a brilliant, hardworking young lady like yourself would make a fine alchemist."},{"name":"AMELIANCE","text":"Your mother surely saw the same, and simply wished for you to walk an easier path─a path where your success would be assured."},{"name":"AMELIANCE","text":"But with great resolve and determination, you fought to pursue your own way forward. This is part of what it means to become an adult."},{"name":"AMELIANCE","text":"After a child strikes out on their own, a mother can only pray they find happiness..."},{"name":"MILADEEN","text":"I... I know not what to say..."},{"name":"MILADEEN","text":"Perhaps a light stroll might help me to collect my thoughts before I make any rash decisions."},{"name":"AMELIANCE","text":"Then we shall take a leisurely walk back to the estate. I would much rather hear your decision once we are returned─you're like to come down with something if you stay outdoors overlong!"},{"name":"MERYLD","text":"Welcome back. If you've worked up an appetite, you will be pleased to hear that the head chef is presently preparing a most exquisite Thavnairian stew."},{"name":"MILADEEN","text":"I'm sorry for making you worry! And, thank you."},{"name":"MILADEEN","text":"I've decided... I'm going to finish what I started! If there came a day when a life I could have saved was lost because I gave up now, I'd never be able to forgive myself."},{"name":"MILADEEN","text":"But more than that...I want to repay the support and kindness you both have shown me. I want to make you proud! That is, if you will still have me...?"},{"name":"AMELIANCE","text":"Oh, come now, you hardly need ask. You shall ever be welcome here, Mila, and have our unwavering support."},{"name":"AMELIANCE","text":"Have you any sage counsel for our aspiring weaver of magicks here?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"If worse comes to worst, you always have your fists!"},{"name":"A2","text":"Practice makes perfect."},{"name":"A2","text":"You must have a sympathetic heart to those in need of succor."},{"name":"A2","text":"An unshakable will is key."},{"name":"MILADEEN","text":"...N-No way, punching things is out of the question! Ohhh, wait, I see. You're saying a strong mind requires a strong body! One cannot hope to refine their magicks without the fortitude to do so, after all!"},{"name":"MILADEEN","text":"I see. No shortcuts, just hard work...drilling over and over until wielding magic feels like second nature. I will do my best, and follow your example! "},{"name":"MILADEEN","text":"A sympathetic heart...a shoulder for those in need to lean on. I want to become someone like that...like you!"},{"name":"MILADEEN","text":"An unshakable will... You're right, I need to believe in myself, and stand firm in my conviction. Only then I can walk the path towards mastery with my head held high!"},{"name":"AMELIANCE","text":"One last word of advice, from a former student of the Studium."},{"name":"AMELIANCE","text":"Set aside practicing healing incantations for the time being, and focus solely on manipulating the mammet."},{"name":"AMELIANCE","text":"Magic is the power to convert one's aether into tangible phenomena. The key is to visualize precisely what it is you wish to bring forth."},{"name":"AMELIANCE","text":"I believe your problem stems from the lack of a solid image in your mind's eye. When picturing the act of “healing,” what do you envision?"},{"name":"MILADEEN","text":"I-I don't know, really... I've been so caught up with trying to perfect the technique, I hadn't given it any thought."},{"name":"AMELIANCE","text":"Then focusing on manipulating the mammet may be just what you need. You can concentrate on clear images like making it walk, run, or sit."},{"name":"AMELIANCE","text":"With enough practice and repetition, more abstract concepts─such as the inner workings of healing a wound─should become easier to conceive."},{"name":"MILADEEN","text":"I-I see! The whole process just seemed so complex, that I... But that's in the past. From now on, I'm going to focus on visualizing <span class=\"emphasis\">everything</span>, step by step!"},{"name":"AMELIANCE","text":"That's the spirit! But do take care not to push yourself too hard. For now, I think a hot bowl of soup is precisely what you need. It's a Thavnairian recipe, so I hope it offers a taste of home."},{"name":"AMELIANCE","text":"I cannot thank you enough for accompanying me today. ...I admit, I may have lost track of time in all the excitement."},{"name":"AMELIANCE","text":"Now then, if Mila and the other students are to continue their training, I believe it prudent we prepare a new set of mammets. Those of cruder make are more troublesome to manipulate, and thus I must ask that you fashion aetheroconductive units to replace them."},{"name":"AMELIANCE","text":"With a mammet of good quality, Mila should be able to grasp how to manipulate her aether rather quickly─and I shall be beside her, ready to help at every turn."}],"reward":{"gil":975,"items":[{"num":3,"id":36060},{"num":3,"id":36061}]},"reqs":{"jobs":[{"lvl":80,"id":35}],"quests":[70059]},"next":[70061]},"partials":[{"type":"npc","id":"1042241","obj":{"i":1042241,"n":"Ameliance","l":3706,"q":1}},{"type":"npc","id":"1042428","obj":{"i":1042428,"n":"Ameliance","l":3706,"q":2}},{"type":"item","id":"36060","obj":{"i":36060,"n":"Tsai tou Vounou","l":554,"c":24417,"t":46}},{"type":"item","id":"36061","obj":{"i":36061,"n":"Sideritis Cookie","l":554,"c":24051,"t":46}},{"type":"quest","id":"70059","obj":{"i":70059,"n":"Of Mothers and Merchants","g":119,"l":"Old Sharlayan","s":9101,"f":1}},{"type":"quest","id":"70061","obj":{"i":70061,"n":"A Gift from House Leveilleur","g":119,"l":"Old Sharlayan","s":9120,"f":1}}]}