{"quest":{"name":"Bridging the Rift","location":"Radz-at-Han","id":70068,"patch":6.1,"sort":625,"eventIcon":71201,"issuer":1039609,"target":1039617,"genre":12,"journal":["The veteran Radiant wishes to share his gratitude."],"objectives":["Speak with Y'shtola at the High Crucible of Al-Kimiya.","Speak with Y'shtola at Sharlayan's aetheryte plaza and have her accompany you.","Speak with Montichaigne while Y'shtola is accompanying you.","Speak with the House Leveilleur butler while Y'shtola is accompanying you.","Accompany Y'shtola to the Baldesion Annex and speak with her.","Speak with Y'shtola."],"dialogue":[{"name":"ESTINIEN","text":"Vrtra is warming to his role as satrap. Clearly all those years behind the curtain were not spent napping."},{"name":"WARRIOR04532","text":"Thank you for putting forth Khalzahl's name. Those whose lives he enriched will take comfort in seeing his legacy honored."},{"name":"WARRIOR04532","text":"You will forgive me for not speaking sooner, but I bear a message from Archon Y'shtola. She asks that you meet her at the High Crucible at your earliest convenience."},{"name":"ESTINIEN","text":"Understood. Thank you."},{"name":"ESTINIEN","text":"Y'shtola must have finished her study of the voidgate. Shall we hear what she has to say, then?"},{"name":"VARSHAHN","text":"I will go with you."},{"name":"ESTINIEN","text":"I thought the satrap would be too busy setting up the foundation...?"},{"name":"VARSHAHN","text":"My clerks have been the well-oiled cogs of this administration since before Ahewann assumed the office. They understand what needs to be done."},{"name":"VARSHAHN","text":"And I am curious to learn what conclusions your Archon has reached concerning the gate's unique construction."},{"name":"ESTINIEN","text":"As you wish. Allow me to lead the way, Your Excellency."},{"name":"WARRIOR04532","text":"You can find your way to the High Crucible, I trust? I must rejoin my unit and assist with bringing the city's orphans under our care."},{"name":"ESTINIEN","text":"For one who claims it is “too late” to save his sister, Vrtra seems awfully interested in whatever revelations Y'shtola might have to share."},{"name":"VARSHAHN","text":"Shall we hear what your scholarly comrade has to say?"},{"name":"VARSHAHN","text":"..."},{"name":"YSHTOLA","text":"If we're to enter Noumenon's restricted archives with a minimum of fuss, then we must secure the permission of the Forum."},{"name":"YSHTOLA","text":"First, however, we shall need to enlist the cooperation of a member to broach the matter on our behalf. Who do you think might be inclined to assist us?"},{"name":"YSHTOLA","text":"No one springs to mind?"},{"name":"YSHTOLA","text":"Hm... What of Scholarch Montichaigne?"},{"name":"YSHTOLA","text":"He did come to G'raha's defense during the inquiry, after all."},{"name":"YSHTOLA","text":"'Tis settled. Let us head to Phenomenon and see if he's willing to help us once more."},{"name":"SYSTEM","text":"Y'shtola is now accompanying you. Keep her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Y'shtola behind by entering a different area, or by speaking with her and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Y'shtola accompany you again, return and speak with her at the original location."},{"name":"YSHTOLA","text":"I apprenticed to Master Matoya at the age of seven, and labored under her tutelage for a full decade. I never had the chance to attend the Studium..."},{"name":"YSHTOLA","text":"Neither did Thancred, as I recall. Soon after Master Louisoix took him in off the streets, he was put in the care of another Archon. His was a rigorous and practical education in the arts of espionage and survival."},{"name":"YSHTOLA","text":"I sometimes wonder what my life might have been like had I pursued studies here instead..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Tea at the Last Stand after a day of lectures?"},{"name":"A2","text":"Should...should I wonder as well?"},{"name":"YSHTOLA","text":"Oh, that does sound lovely. Afternoons with friends spent sipping tea and debating theories."},{"name":"YSHTOLA","text":"...Still, I wouldn't give up my time with Master Matoya for the world."},{"name":"YSHTOLA","text":"The dank cave I studied in was about as far from the bright, airy halls of academia as one could get. But it was a wondrous, magical childhood nonetheless."},{"name":"YSHTOLA","text":"Oh, never mind me. 'Twas just an idle thought."},{"name":"Q3","text":"What will you do?"},{"name":"A3","text":"Talk."},{"name":"A3","text":"Part ways."},{"name":"A3","text":"Nothing."},{"name":"A3","text":"<span class=\"highlight\">Discuss the Studium.</span>"},{"name":"YSHTOLA","text":"If I was pressed to name our allies in the Forum, Scholarch Montichaigne would certainly be at the top of the list. Hopefully he agrees to aid us with our request."},{"name":"SYSTEM","text":"Are you sure you wish to part ways with Y'shtola?"},{"name":"YSHTOLA","text":"Need to be somewhere? Very well, I will wait for you by the aetheryte."},{"name":"YSHTOLA","text":"Oh, not to worry─I had plenty of reading to keep me occupied while you were busy. Shall we continue?"},{"name":"MONTICHAIGNE","text":"Archon Y'shtola wishes a word with me? Then I shall eagerly await her arrival!"},{"name":"SYSTEM","text":"You must be accompanied by Y'shtola and have her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"Y'shtola has yet to arrive. Be sure she is at your side before attempting to continue."},{"name":"MONTICHAIGNE","text":"Ah, visitors! And quite esteemed ones at that. What may I do for you?"},{"name":"YSHTOLA","text":"Pray forgive the intrusion, Scholarch, but we were hoping you might help us secure permission to enter Noumenon's restricted archives."},{"name":"MONTICHAIGNE","text":"Oho! No furtive forays into the stacks this time, eh?"},{"name":"MONTICHAIGNE","text":"I applaud this newfound sense of propriety. Yet in all this wide world of comparative serenity, what so compels you to disturb a vault of forbidden wisdom?"},{"name":"MONTICHAIGNE","text":"Fascinating. I had no idea such a technique existed."},{"name":"YSHTOLA","text":"I would've been surprised if you had. If my assumption is correct, the research left behind by House Daemir has lain dormant in Sharlayan's archives for many centuries."},{"name":"MONTICHAIGNE","text":"And if you unearth this research, what then? Surely you don't intend to cross over into the void?"},{"name":"YSHTOLA","text":"That is, in fact, precisely what we intend."},{"name":"MONTICHAIGNE","text":"...To what end, pray tell?"},{"name":"YSHTOLA","text":"To develop a method of traversing the rift, for one, that I might keep my word to a distant friend."},{"name":"YSHTOLA","text":"Sentiment aside, I have journeyed to the end of existence. I have heard, felt, and thought endlessly about the truth of our world and the echo of its future. And yet I want to understand <span class=\"emphasis\">everything</span>─to unravel it all down to its very last secret."},{"name":"YSHTOLA","text":"What scholar worthy of the name wouldn't force open a voidgate or two if a grand revelation was the promised reward?"},{"name":"MONTICHAIGNE","text":"Hahaha! Marvelous!"},{"name":"MONTICHAIGNE","text":"An audacious proposal worthy of Master Matoya herself!"},{"name":"MONTICHAIGNE","text":"And after hearing the whys and the wherefores, I for one do not believe you would use the knowledge for ill."},{"name":"MONTICHAIGNE","text":"I see no reason not to present your request for the Forum's consideration."},{"name":"MONTICHAIGNE","text":"Although... Your petition would be better received if you also had the support of another well-placed acquaintance."},{"name":"MONTICHAIGNE","text":"Why, Master Fourchenault, of course! He can hardly ignore an earnest request from his dear children's most treasured comrades."},{"name":"YSHTOLA","text":"I was hesitant to approach him directly, but there is no denying that having Master Fourchenault on our side would tip the balance in our favor. Very well. We will pay a visit to the Leveilleur estate and plead our case."},{"name":"MONTICHAIGNE","text":"Ah, one last thing before you go. I would consider it a personal favor if you might share with me the discoveries you make in the void."},{"name":"MONTICHAIGNE","text":"My appetite for knowledge is every bit as insatiable as yours, I'd wager, so if you could see your way to indulging an old man's curiosity...?"},{"name":"YSHTOLA","text":"Of course, Scholarch. We will be sure to pass on any revelations."},{"name":"MONTICHAIGNE","text":"The Forum can be a cantankerous beast─one needs a persuasive voice to get it moving in the desired direction."},{"name":"YSHTOLA","text":"Montichaigne seemed optimistic, but I doubt convincing Fourchenault to champion our cause will be as simple as showing up on his doorstep."},{"name":"BUTLER04532","text":"Welcome to the Leveilleur residence. Have you come alone, or should we expect a larger party...?"},{"name":"SYSTEM","text":"You must be accompanied by Y'shtola and have her at your side in order to proceed with quest objectives."},{"name":"BUTLER04532","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, Mistress Y'shtola, how may I be of service?"},{"name":"YSHTOLA","text":"We've come to speak with Master Fourchenault. Is he home, by any chance?"},{"name":"BUTLER04532","text":"Yes, the master is in residence. I shall inform him that he has guests."},{"name":"FOURCHENAULT","text":"Well, well. Ameliance would invite you inside for tea, but I assume this is not a social visit. You have some matter of import to discuss?"},{"name":"FOURCHENAULT","text":"Then pray proceed─you have my full attention."},{"name":"FOURCHENAULT","text":"Well, I suppose I should praise you for following the proper protocols this time around..."},{"name":"YSHTOLA","text":"Scholarch Montichaigne expressed much the same sentiment. I assure you, we'll not attempt to circumvent the Forum's authority again...unless it is absolutely necessary, of course."},{"name":"FOURCHENAULT","text":"...Of course."},{"name":"FOURCHENAULT","text":"You do understand that the restricted archives are restricted for good reason, yes? If no pressing need exists, then why risk the consequences of employing this forbidden knowledge?"},{"name":"YSHTOLA","text":"For a brother who misses his sister. She was his guardian and his friend─a selfless hero who crossed the rift between worlds to save her homeland from horror and suffering."},{"name":"YSHTOLA","text":"But the brother has given up on thoughts of reunion. He spends his efforts elsewhere, watching over a people yet healing from the flames of the Final Days, loyal to his duty while betraying the longing in his heart."},{"name":"YSHTOLA","text":"'Tis no vital mission, perhaps, reuniting these siblings. But it feels a worthy cause to pursue, all the same."},{"name":"YSHTOLA","text":"As one who feared losing his own loved ones, and spent years in research to prevent it, surely you appreciate how painful such a separation must be."},{"name":"FOURCHENAULT","text":"Reflections are still very much a mystery to us. Offering to share your experiences in the First should constitute a fair exchange for our cooperation."},{"name":"FOURCHENAULT","text":"Do not celebrate just yet. The Forum must still be convinced."},{"name":"FOURCHENAULT","text":"I will add your request to the list of today's deliberations, and deliver the decision to you at the Baldesion Annex."},{"name":"BUTLER04532","text":"Please do come again. We are always glad to receive such close companions of the twins."},{"name":"YSHTOLA","text":"The matter is out of our hands. All that remains is to return to the annex and await word of the Forum's decision."},{"name":"YSHTOLA","text":"So. What did the Forum decide?"},{"name":"MONTICHAIGNE","text":"To put it bluntly, Master Matoya has burned some bridges here in Sharlayan─and salted the earth for good measure. When it became clear that her student was the petitioner in question, well, no few members voiced their discontent..."},{"name":"MONTICHAIGNE","text":"Then the chamber was reminded─in no uncertain terms, I might add─of the incredible debt we owe to you and your companions."},{"name":"MONTICHAIGNE","text":"That served to silence the grumbles and stiffen a few spines, and it was agreed that allowing you entry to the archives was the least we could do in return."},{"name":"YSHTOLA","text":"That is wonderful news. Thank you both for speaking on our behalf."},{"name":"FOURCHENAULT","text":"Yes, well... As I am sure you are aware, this permission was not extended lightly. Forbidden knowledge is to be treated with the utmost caution, and there will be repercussions if it is not."},{"name":"FOURCHENAULT","text":"I wish you well in your endeavor, and bid you good day."},{"name":"MONTICHAIGNE","text":"Ever the same, that one..."},{"name":"YSHTOLA","text":"Uncompromising? Aye, but that very stoicism is exactly what Sharlayan needed to guide it through not one, but two exoduses."},{"name":"MONTICHAIGNE","text":"If I were but five years younger, I'd cast aside my lectern and join you on your adventures in a heartbeat..."},{"name":"YSHTOLA","text":"That went rather well, I think."},{"name":"YSHTOLA","text":"As a child, I dreamed up any number of schemes for getting my hands on those forbidden tomes... And now I can simply walk in through the door."},{"name":"YSHTOLA","text":"Our focus will be on finding House Daemir's research notes, of course, but the thought of so much knowledge at my disposal has me feeling a little giddy."}],"reward":{"gil":1605},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70067]},"next":[70069]},"partials":[{"type":"npc","id":"1039609","obj":{"i":1039609,"n":"Veteran Radiant","l":3707,"q":1}},{"type":"npc","id":"1039617","obj":{"i":1039617,"n":"Y'shtola","l":3706,"q":1}},{"type":"quest","id":"70067","obj":{"i":70067,"n":"Sharing the Wealth","g":12,"l":"Radz-at-Han","s":624}},{"type":"quest","id":"70069","obj":{"i":70069,"n":"Restricted Reading","g":12,"l":"Old Sharlayan","s":626}}]}