{"quest":{"name":"Restricted Reading","location":"Old Sharlayan","id":70069,"patch":6.1,"sort":626,"eventIcon":71201,"issuer":1039618,"target":1039624,"genre":12,"journal":["Montichaigne is waiting to offer you further instructions."],"objectives":["Speak with the index page while Y'shtola is accompanying you.","Search for House Daemir's research notes.","Hand the <span class=\"emphasis\">Epiphanies of House Daemir</span> to Y'shtola.","Speak with Y'shtola.","Speak with Nidhana at the Great Work.","Inspect the astrally dense pocket of water.","Deliver the flask of astral-aspected water to Y'shtola."],"dialogue":[{"name":"YSHTOLA","text":"I'd like to set out as soon as you're ready."},{"name":"MONTICHAIGNE","text":"You'll be heading directly to the archives from here, I presume?"},{"name":"YSHTOLA","text":"You presume correctly."},{"name":"MONTICHAIGNE","text":"Then you'll want to speak with the index page when you arrive. It's been instructed to grant you access to the restricted section."},{"name":"YSHTOLA","text":"Excellent. Once again, we thank you for all your help."},{"name":"MONTICHAIGNE","text":"Oh, it was my pleasure, believe me. May you find the knowledge you seek!"},{"name":"YSHTOLA","text":"Shall we?"},{"name":"SYSTEM","text":"Y'shtola is now accompanying you. Keep her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Y'shtola behind by entering a different area, or by speaking with her and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Y'shtola accompany you again, return and speak with her at the original location."},{"name":"YSHTOLA","text":"To think the set of instructions I laughingly imagined may actually exist but yalms away from where you found me napping..."},{"name":"YSHTOLA","text":"If I had known of Alzadaal III's exploits sooner, I could well have saved myself days of research. Even a children's book might have pointed me in the right direction."},{"name":"YSHTOLA","text":"To achieve the impossible, one must needs be flexible of mind and look beyond conventional wisdom. A lesson I had already learned, but clearly not taken to heart."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Talk."},{"name":"A1","text":"Part ways."},{"name":"A1","text":"Nothing."},{"name":"A1","text":"<span class=\"highlight\">Discuss Noumenon.</span>"},{"name":"YSHTOLA","text":"Come along, <span class=\"highlight\">Forename</span>. Noumenon and its forbidden wisdom awaits."},{"name":"SYSTEM","text":"Are you sure you wish to part ways with Y'shtola?"},{"name":"YSHTOLA","text":"Very well, but please do hurry back. I shall await you at the annex."},{"name":"YSHTOLA","text":"All set this time? No forgotten chores or errands to call you away? Good─the forbidden tomes await!"},{"name":"GUIDE04533","text":"I aM iNsTrUcTeD tO pErMiT yOu EnTrAnCe. YoU aNd ArChOn Y'sHtOlA. pErMiSsIoN iS nOt ApPlIcAbLe FoR sEpArAtE eNtRy."},{"name":"SYSTEM","text":"You must be accompanied by Y'shtola and have her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"Y'shtola has yet to arrive. Be sure she is at your side before attempting to continue."},{"name":"GUIDE04533","text":"ArChOn Y'sHtOlA aNd GuEsT iDeNtIfIeD. dO yOu WiSh To PrOcEeD iNtO tHe ReStRiCtEd ArChIvEs?"},{"name":"GUIDE04533","text":"FoLlOw Me, If YoU wOuLd. WaTcH yOuR sTeP, aNd PlEaSe NoTe ThAt ThE uSe Of NaKeD fLaMeS iS dIsCoUrAgEd."},{"name":"GUIDE04533","text":"Do YoU wIsH tO pRoCeEd InTo ThE rEsTrIcTeD aRcHiVeS?"},{"name":"Q2","text":"Enter the restricted archives?"},{"name":"GUIDE04533","text":"No SmOkInG! nO tHrOwInG bOoKs! AnD nO yElLiNg OuT “eUrEkA!” iN aN oBnOxIoUsLy LoUd VoIcE!"},{"name":"YSHTOLA","text":"So many books I've yet to read..."},{"name":"YSHTOLA","text":"Yes, yes, we are here for one specific volume. You needn't remind me."},{"name":"SYSTEM","text":"(-Untitled Goldsmith's Journal-)<span class=\"emphasis\">Today, in a world not my own, I met the most beautiful voidborn creature. She was so unlike her ravenous brethren. Eyes blazing not with hunger, but trembling─like a candle's flame, threatening to flicker out at any moment.</span>"},{"name":"SYSTEM","text":"(-Untitled Goldsmith's Journal-)<span class=\"emphasis\">I wonder if “she” is even the proper word. Such distinctions seem inconsequential. Insignificant, even.</span>"},{"name":"SYSTEM","text":"(-Untitled Goldsmith's Journal-)<span class=\"emphasis\">All that matters is the love I feel for this exquisite, transcendent being!</span>"},{"name":"SYSTEM","text":"Though you are tempted to read more, this does not seem to be the volume you are seeking..."},{"name":"SYSTEM","text":"(-<span class=\"emphasis\">Primal Disquisitions</span>-)<span class=\"emphasis\">In the year 1564 of the Sixth Astral Era, the Amalj'aa summoned Ifrit, their patron god. Accounts describe the being as a gigantic, lizard-like being with a potent command of fire-aspected magicks.</span>"},{"name":"SYSTEM","text":"(-<span class=\"emphasis\">Primal Disquisitions</span>-)<span class=\"emphasis\">If we consider that primal summoning is an act fueled by faith and prayer, it is unsurprising, if not expected, that the resulting deiform entity should manifest the appearance and powers with which it is attributed by its worshipers.</span>"},{"name":"SYSTEM","text":"(-<span class=\"emphasis\">Primal Disquisitions</span>-)<span class=\"emphasis\">What, then, might emerge from the aether should one who believes in an almighty omniscience attempt the same ritual? Would the Scholar Himself grace us with His presence? Some other embodiment of divine sagacity?</span>"},{"name":"SYSTEM","text":"(-<span class=\"emphasis\">Primal Disquisitions</span>-)<span class=\"emphasis\">Could this man-made god truly be all-knowing? And if it were, whence would such knowledge arise?</span>"},{"name":"SYSTEM","text":"(-<span class=\"emphasis\">Primal Disquisitions</span>-)<span class=\"emphasis\">I myself have many questions concerning the nature of the ancient world. With no spell to transport me back to the days of old, could I instead summon a being possessed of encyclopedic wisdom of every age? Yet with no means to verify its pronouncements, how could one be certain they were true?</span>"},{"name":"SYSTEM","text":"Though your mind spins with the possibilities discussed therein, this does not seem to be the volume you are seeking..."},{"name":"SYSTEM","text":"(-<span class=\"emphasis\">Epiphanies of House Daemir</span>-)<span class=\"emphasis\">The following pages detail an advanced method for manipulating rift-spanning apertures as devised by Nuhashahn, the ninth patriarch of House Daemir.</span>"},{"name":"SYSTEM","text":"(-<span class=\"emphasis\">Epiphanies of House Daemir</span>-)<span class=\"emphasis\">We present these research notes to the faculty of Sharlayan's Studium as both a token of our friendship and an expression of our boundless admiration.</span>"},{"name":"SYSTEM","text":"You appear to have located the forbidden volume you seek. Y'shtola will need to make the final confirmation..."},{"name":"YSHTOLA","text":"Have something you'd like to show me, do you? My apologies─I flipped open but a single book and was completely absorbed by the contents..."},{"name":"YSHTOLA","text":"Well done, <span class=\"highlight\">Forename</span>. I think you may have found our prize."},{"name":"GUIDE04533","text":"CoNgRaTuLaTiOnS oN lOcAtInG tHe ObJeCt Of YoUr SeArCh. PlEaSe MoVe AlOnG."},{"name":"YSHTOLA","text":"As much as I would love to start crafting the Atomos, I'm afraid this is far outside my field of expertise."},{"name":"YSHTOLA","text":"Fortunately, we know a Hannish alchemist who would be delighted to involve herself in our House Daemir project."},{"name":"YSHTOLA","text":"Our business here is concluded, for the moment. Please pass on our regards to the Forum."},{"name":"GUIDE04533","text":"YoUr MeSsAgE wIlL bE cOnVeYeD. sHoUlD yOu WiSh To InDuLgE iN mOrE fOrBiDdEn LiTeRaTuRe, I wIlL bE hErE. pAtRoN mOdE dIsAbLeD. sEcUrItY mOdE eNgAgEd."},{"name":"YSHTOLA","text":"If anyone can help us, Nidhana can. I say we return to Thavnair and look for her at the Great Work."},{"name":"YSHTOLA","text":"All these sallow, sleep-deprived faces, but their eyes still burn with fiery zeal. Some things never change."},{"name":"NIDHANA","text":"Y'shtola tells me you are pursuing a most fascinating study! And that you want <span class=\"emphasis\">me</span> to be a part of it."},{"name":"YSHTOLA","text":"I have no doubt you will be interested. This research log should speak for itself."},{"name":"NIDHANA","text":"Will it now...?"},{"name":"NIDHANA","text":"By the Sisters! This is the mark of House Daemir! I never even knew such a work existed..."},{"name":"YSHTOLA","text":"Few should. It was sequestered in Noumenon's restricted archives, after all."},{"name":"NIDHANA","text":"It was!? But...that means every word within is <span class=\"emphasis\">forbidden knowledge</span>!"},{"name":"NIDHANA","text":"A forbidden tome filled with forbidden research, and you put it right into my unsuspecting hand!?"},{"name":"NIDHANA","text":"I can hardly wait to read it!"},{"name":"NIDHANA","text":"To think the Daemir were developing such marvelous techniques so long ago. How many innovations have been lost over the centuries, I wonder..."},{"name":"YSHTOLA","text":"Now that you've glanced over the notes, what say you to helping us build a new mock Atomos?"},{"name":"NIDHANA","text":"I say yes! A thousand times yes!"},{"name":"NIDHANA","text":"Work on a Daemir project that had even the redoubtable scholars of Sharlayan trembling in their sandals? No alchemist of the Great Work could resist!"},{"name":"YSHTOLA","text":"You are a woman after my own heart."},{"name":"NIDHANA","text":"Oh, I suppose I should ask: what do you mean to do with this big-mouthed simulacrum once we've built it?"},{"name":"NIDHANA","text":"So, there's a secret voidgate...and it's sealed in the ruins at the bottom of the Bounty? Today is a day of revelations indeed."},{"name":"NIDHANA","text":"If the purpose of our man-made Atomos is to expand this hidden portal, then I will need to see it for myself, I think. Manipulating rift-spanning apertures is not the sort of thing you want to attempt without first taking into account every single factor."},{"name":"YSHTOLA","text":"Then by all means, accompany us to the vault. I plan to lead us back there shortly...once we've finished gathering the components I require."},{"name":"YSHTOLA","text":"Sharlayan's markets provided the raw aquamarine and pure water crystals..."},{"name":"YSHTOLA","text":"But I might need help obtaining a small quantity of astrally infused water."},{"name":"NIDHANA","text":"For such a liquid, you need go no further than the Font of Maya─the ascetics of old once favored the place for their meditations, and the water which pools there now is known to enliven the flow of aether."},{"name":"YSHTOLA","text":"That sounds perfect. If you would be so kind as to fill a flask at the pool, I will petition Vrtra to join us. The idea I have in mind won't amount to much without his authority to command the voidgate."},{"name":"YSHTOLA","text":"Shall we be about it, then? We meet back here anon."},{"name":"NIDHANA","text":"Ah, there is no greater joy than having a new puzzle to ponder..."},{"name":"VARSHAHN","text":"Archon Y'shtola requested that I join you, but of her plans she offered scant detail..."},{"name":"ESTINIEN","text":"The boy Mehrahd was glad to hear the news of the foundation. It means a new life for him and his sister."},{"name":"NIDHANA","text":"Oh, I forgot to mention! The Font of Maya attracts aggressive wildlife, and you should watch out for them when, uh...you go there next time. My apologies."},{"name":"YSHTOLA","text":"Do you have that flask for me?"},{"name":"YSHTOLA","text":"Yes...this should suffice. Thank you, <span class=\"highlight\">Forename</span>."}],"reward":{"gil":1432,"items":[{"id":33917,"one":1},{"id":33921,"one":1},{"id":33928,"one":1},{"id":33929,"one":1}]},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70068]},"next":[70070]},"partials":[{"type":"npc","id":"1039618","obj":{"i":1039618,"n":"Montichaigne","l":3706,"q":1}},{"type":"npc","id":"1039624","obj":{"i":1039624,"n":"Y'shtola","l":3709,"q":2}},{"type":"item","id":"33917","obj":{"i":33917,"n":"Piety Materia IX","l":560,"c":20281,"t":58,"materia":{"tier":8,"value":12,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"item","id":"33921","obj":{"i":33921,"n":"Battledance Materia IX","l":560,"c":20281,"t":58,"materia":{"tier":8,"value":12,"attr":"Tenacity","category":0}}},{"type":"item","id":"33928","obj":{"i":33928,"n":"Quickarm Materia IX","l":560,"c":20282,"t":58,"materia":{"tier":8,"value":12,"attr":"Skill Speed","category":0}}},{"type":"item","id":"33929","obj":{"i":33929,"n":"Quicktongue Materia IX","l":560,"c":20282,"t":58,"materia":{"tier":8,"value":12,"attr":"Spell Speed","category":0}}},{"type":"quest","id":"70068","obj":{"i":70068,"n":"Bridging the Rift","g":12,"l":"Radz-at-Han","s":625}},{"type":"quest","id":"70070","obj":{"i":70070,"n":"Void Theory","g":12,"l":"Thavnair","s":627}}]}