{"quest":{"name":"A Brother's Grief","location":"Weaver's Warding","id":70066,"patch":6.1,"sort":623,"eventIcon":71201,"issuer":1039591,"target":1039600,"genre":12,"journal":["Y'shtola is appraising the voidgate with a scholarly eye."],"objectives":["Speak with Y'shtola.","Speak with Varshahn at the High Crucible of Al-Kimiya.","Speak with Varshahn again."],"dialogue":[{"name":"GRAHATIA","text":"Perhaps I might linger a touch longer..."},{"name":"URIANGER","text":"Even in the learned halls of Sharlayan, 'tis forbidden to throw wide the gates to the abyss. The peril is far too great..."},{"name":"ESTINIEN","text":"Can such a tiny portal truly be so dangerous?"},{"name":"VARSHAHN","text":"I expect you have more questions..."},{"name":"MATSYA","text":"My boat is at your disposal!"},{"name":"Q1","text":"Proceed to Weaver's Warding?"},{"name":"GRAHATIA","text":"The Thirteenth... What chaos must consume that world..."},{"name":"URIANGER","text":"Vrtra's grief for a lost sibling will be no mystery to Estinien. His hath been a life entwined with sorrow, even before he became host to Nidhogg's essence."},{"name":"ESTINIEN","text":"I wondered how one of the first brood could simply vanish and leave no trace of her passage. Now I have my answer."},{"name":"VARSHAHN","text":"Millennia have passed since last I saw her. But I see Azdaja in memory still, clear and vivid..."},{"name":"YSHTOLA","text":"So they managed not only to expand the fissure, but also manipulate it as one might a gate..."},{"name":"YSHTOLA","text":"Astonishing. Is there any chance I could learn more of how this feat was accomplished?"},{"name":"VARSHAHN","text":"I will tell you what I can. First, however, I must return to the High Crucible, and arrange to replace the guardians you so handily destroyed. It will not do to leave the gate undefended."},{"name":"YSHTOLA","text":"Ah, my apologies─we were perhaps a touch zealous in our rush to uncover the vault's secrets. If the constructs can be repaired, we would be happy to offer our assistance...?"},{"name":"VARSHAHN","text":"That will not be necessary. Much as I retain spare vessels for myself, we keep duplicate guardians on hand for such eventualities. In any case, we should return to Radz–at–Han."},{"name":"GRAHATIA","text":"While I am loath to keep Krile waiting much longer, I cannot bring myself to leave before hearing more of Vrtra's tale..."},{"name":"URIANGER","text":"'Twas a most enjoyable expedition, for which I am grateful. As for mine evaluation, I shall impress upon the Loporrits that a treasure vault is incomplete without daunting sentinels to test the mettle of any would-be intruders."},{"name":"ESTINIEN","text":"Vrtra speaks as if Azdaja is a lost cause. But I wager he feels differently in his heart of hearts."},{"name":"YSHTOLA","text":"There is much about the voidgate that I cannot even begin to explain. I must convince Vrtra to share everything he knows..."},{"name":"ALCHEMIST04530","text":"This is quite the gathering. To what do we owe the pleasure...?"},{"name":"VARSHAHN","text":"I promise we will discuss the voidgate further, but first I must attend to the matter of the vault's sentinels."},{"name":"VARSHAHN","text":"As your instruments have no doubt informed you, the Kapikulu has been reduced to so much scrap. Please bring a new one out of storage, and see that it is conveyed to its post along with some few lesser constructs."},{"name":"ALCHEMIST04530","text":"Was it tomb robbers? Fiends born of the Tower of Zot? By the Sisters, do not tell me a blasphemy yet roams free!"},{"name":"ALCHEMIST04530","text":"Why such guilty faces!? Surely it isn't <span class=\"emphasis\">you</span> who are responsible for this... Oh."},{"name":"ALCHEMIST04530","text":"Ahem, well...the details aren't important! I shall see it done immediately."},{"name":"VARSHAHN","text":"And with that, the vault will soon be secure once more. Now, I believe you had questions?"},{"name":"YSHTOLA","text":"Quite a few, in fact. But I'd like to begin with the gate itself. It is still functional, yes?"},{"name":"VARSHAHN","text":"Indeed, which is why I saw it sealed with an alchemically forged lock and warded it with my magicks. Such power must not fall into the wrong hands."},{"name":"VARSHAHN","text":"In truth, the primary reason for the vault's construction was to keep the gate hidden from the outside world."},{"name":"ESTINIEN","text":"So much effort for such a little door."},{"name":"YSHTOLA","text":"That “little door” you speak of leads to an abyss teeming with unspeakable horrors."},{"name":"YSHTOLA","text":"That said, in its current state, it would admit only the lowliest of voidsent. And from this side, no man would be able to pass through."},{"name":"ESTINIEN","text":"No man? I should think Alphinaud would fit, given a firm enough push."},{"name":"YSHTOLA","text":"Physical size is only one consideration. The true restriction hinges upon the aetheric density of the soul in transit."},{"name":"YSHTOLA","text":"And yet you succeeded in expanding this diminutive portal and sending your simulacrum to the Thirteenth..."},{"name":"VARSHAHN","text":"Thanks to my brilliant alchemists. I should have destroyed the anomaly when I found it, but instead, I bade them devise a means to control it."},{"name":"VARSHAHN","text":"After much experimentation, they accomplished the impossible. A method was conceived by which my magicks could manipulate the fissure and transform it into a serviceable gate."},{"name":"VARSHAHN","text":"But the process has long since been forgotten. Once I had given up searching for Azdaja, there was no need to preserve such esoteric and dangerous knowledge."},{"name":"VARSHAHN","text":"Thus has the gate lain dormant, for years uncounted."},{"name":"GRAHATIA","text":"Our own passage to the Thirteenth was made relatively simple thanks to the Crystal Tower."},{"name":"GRAHATIA","text":"An ancient mechanism channeled the tower's vast stores of energy to open a voidgate─one bound to a covenant made with the Cloud of Darkness."},{"name":"GRAHATIA","text":"Once that sovereign entity was beaten back, however, the covenant was broken, and the doorway severed from its connection to the void."},{"name":"GRAHATIA","text":"Theoretically, it should be possible to reconnect the gate by forging a new pact with another voidsent...but such deals usually end in betrayal and death."},{"name":"YSHTOLA","text":"You seem to have struck a bargain of your own, <span class=\"highlight\">Forename</span>. Though it serves you well in battle, be aware that the beneficial nature of your “arrangement” is the exception which proves the rule."},{"name":"YSHTOLA","text":"In any case, we should attempt to gain an understanding of the Bounty gate. Mayhap you could resume the search for your sister..."},{"name":"VARSHAHN","text":"As I have already explained, I put those futile hopes to rest centuries ago. My place─and my duty─is here now."},{"name":"VARSHAHN","text":"Ah, I had meant to ask... What prompted you to search for the vault in the first place?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"To see if the legends were true."},{"name":"A1","text":"It was all Estinien's idea."},{"name":"VARSHAHN","text":"As you have seen, the “fabulous wealth” from the stories is quite real, if not its rumored origin. But I'm afraid I must assert a prior claim."},{"name":"VARSHAHN","text":"I've been adding to that trove for years, little by little. But the time has come to spend it, that I might alleviate my people's suffering."},{"name":"ESTINIEN","text":"As I recall, 'twas you who was chasing tales of undersea ruins."},{"name":"VARSHAHN","text":"Well, as you have seen, the “fabulous wealth” from the stories is quite real, if not its rumored origin. But I'm afraid I must assert a prior claim."},{"name":"VARSHAHN","text":"I've been adding to that trove for years, little by little. But the time has come to spend it, that I might alleviate my people's suffering."},{"name":"ESTINIEN","text":"Then we are of one mind. We had no intention of taking it for ourselves."},{"name":"ESTINIEN","text":"Isn't that right, my friend?"},{"name":"YSHTOLA","text":"Your Excellency. Would you object if I were to conduct a closer examination of the gate? I will make no attempt to open it, of course."},{"name":"VARSHAHN","text":"I owe you and yours a debt that can never be repaid. Whatever boon you ask of me, you shall have it."},{"name":"YSHTOLA","text":"You are most gracious. I shall take full advantage of your permission."},{"name":"URIANGER","text":"Would that I could join thee in thy study, but the Loporrits will be anxious to receive my report. I beg my leave of you."},{"name":"GRAHATIA","text":"And I must be off to Sharlayan, as well. "},{"name":"GRAHATIA","text":"Mistress Krile was eager to speak with you about that request, so please come back to the annex as soon as you are able. Farewell for now!"},{"name":"YSHTOLA","text":"We can discuss my findings once I return. You'll not be rid of me so easily."},{"name":"SYSTEM","text":"You may now undertake the Chronicles of a New Era quest series “Myths of the Realm.” Speak with the fresh-faced Student at the Baldesion Annex to accept the first quest."},{"name":"ESTINIEN","text":"I hope you enjoyed the expedition, at least. Otherwise it was a heavy purse to pay for a treasure map leading to a treasure we couldn't keep."},{"name":"VARSHAHN","text":"The difficult part in all this will be deciding how best to put these riches to use..."},{"name":"VARSHAHN","text":"Will you lend me your assistance in these deliberations?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Of course."},{"name":"A2","text":"Anything to make up for the constructs we broke..."},{"name":"VARSHAHN","text":"Thank you, <span class=\"highlight\">Forename</span>."},{"name":"VARSHAHN","text":"Then think of your employment as recompense. Serve me as guest advisors, and I will consider the broken constructs paid for in full."},{"name":"ESTINIEN","text":"<span class=\"highlight\">Forename</span> and I are in this together. I will follow <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> example."},{"name":"SYSTEM","text":"Meanwhile, elsewhere..."},{"name":"EARTHMONOLITH","text":"(-Throne of Earth-)I sssensed the breaching of a gate, but it was not inssstigated from this ssside. 'Twas thrown open from the other..."},{"name":"FIREMONOLITH","text":"(-Throne of Fire-)I, too, felt it. A rare occurrence, yes, but such a tiny portal is beneath our notice. There are more pressing matters at hand."},{"name":"FIREMONOLITH","text":"(-Throne of Fire-)An opportunity is upon us, the coming of which we have awaited for nigh on ten thousand years. We dare not let it slip our grasp."},{"name":"WINDMONOLITH","text":"(-Throne of Wind-)Yet we must not underestimate <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> who bested the Cloud of Darkness. Even restrained by a covenant, the Cloud was no feeble wisp to be dispersed by some flesh-and-blood mortal."},{"name":"WATERMONOLITH","text":"(-Throne of Water-)Bah, let <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> come! I will drown the world and watch this fleshling gasp for breath in <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> final moments!"},{"name":"BLACKKNIGHT","text":"(-Knight in Black-)Your zeal is admirable, but forget not our cause."},{"name":"BLACKKNIGHT","text":"(-Knight in Black-)Think back on our struggles beneath this sunless sky. Remember why we cede not our will to fight."},{"name":"BLACKKNIGHT","text":"(-Knight in Black-)'Tis time we set the war in motion, and win redemption for our star!"}],"reward":{"gil":1087},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70065]},"next":[70067,70072]},"partials":[{"type":"npc","id":"1039591","obj":{"i":1039591,"n":"Y'shtola","l":4035,"q":1}},{"type":"npc","id":"1039600","obj":{"i":1039600,"n":"Varshahn","l":3707,"q":2}},{"type":"quest","id":"70065","obj":{"i":70065,"n":"Alzadaal's Legacy","g":12,"l":"Thavnair","s":622}},{"type":"quest","id":"70067","obj":{"i":70067,"n":"Sharing the Wealth","g":12,"l":"Radz-at-Han","s":624}},{"type":"quest","id":"70072","obj":{"i":70072,"n":"A Mission in Mor Dhona","g":27,"l":"Old Sharlayan","s":110,"f":1}}]}