{"quest":{"name":"The Sleeping Gentleman","location":"Radz-at-Han","id":70078,"patch":6.15,"sort":100,"icon":101177,"unlocksFunction":1,"eventIcon":71341,"issuer":1042487,"target":1042497,"genre":71,"journal":["The pungent Lalafell can scarcely conceal his excitement.","Strolling through the streets of Radz–at–Han, you encounter a strangely familiar Lalafell. He proudly identifies himself as the selfsame youth you met once upon a time in Kugane...who happens to have an unhealthy obsession with Nashu Mhakaracca. It seems the apple of his eye has once again found herself in a pickle, and is greatly distressed by the condition of one Hildibrand─agent of enquiry, inspector extraordinaire. Curious as to what fate has befallen the redoubtable gentleman─you make for the High Crucible to learn more.","Following events in the Far East in which Nashu and Hildibrand were sucked into a foreboding portal─along with Gilgamesh, notorious weapon thief, and Jubraca, an unscrupulous Hannish merchant─your associates found themselves wandering the “Interspectorial Rift” for a time. Eventually, with the aid of a recovered Gilgamesh, the other three managed to return to the Source. However, while Nashu was none the worse for wear, Hildibrand emerged in a comatose state for reasons yet unknown. The inspector's plucky assistant has attempted to fashion medicines to revive him, but to no avail. Hoping you might have some insight into his condition, she invites you to join her in Kama at the residence where the inspector is convalescing.","Examining the unconscious body of Hildibrand, you conclude that, like the Scions before him, his soul has been summoned to another world─likely the First. Nashu, understandably, is not quite able to grasp the situation, but she is nevertheless heartened that you might be able to bring him back. Entrusting you with her homemade explosives should you have need of them, she bids you a safe journey, and you prepare to depart for the Crystarium. With luck, you will track down the gentleman inspector's wandering spirit.","You pay a visit to the Wandering Stairs, where Glynard informs you that one of the veteran bounty hunters mentioned a suspicious individual wont to strike unseemly poses. After listening to the account of said bounty hunter, the dwarf Giott, you are all but convinced that the man in question is none other than Inspector Hildibrand. You are subsequently approached by the former guardsmen Theyler and Vonard, who coincidentally enough are also on the trail of the infamous poser. United by a common goal, you and your comrades depart for Sullen, where the man was last spotted.","While the various witnesses in Sullen offer conflicting reports, the picture they paint of the mystery man is one which suggests that, despite his ghastly appearance and disturbing poses, he is a gentlemanly soul at heart. With no doubt remaining that you are on the inspector's trail, you go to share your findings with Theyler and Vonard.","Theyler and Vonard are pleased to hear of your success, and somewhat relieved that the poser has proved relatively benign thus far. The three of you resolve to scour the Forest of the Lost Shepherd, where the eyewitnesses claim to have encountered your quarry.","Sure enough, you soon come upon a Hildibrand seemingly bereft of his memories and looking a bit pale in the face. Fortunately, a judicious application of Nashu's Delight is enough to make the inspector remember who he is. In that instant, you and your companions are granted a vision by the Echo, which reveals in ludicrous detail how a chance encounter with Giott led Hildibrand to believe he was a Lightwarden extraordinaire. In any event, having been disabused of such notions, Hildibrand strikes his trademark pose and announces his triumphant return to his adoring fans."],"objectives":["Speak with Nashu Mhakaracca.","Speak with Nashu Mhakaracca again.","Speak with Glynard at the Crystarium.","Question the locals in Sullen.","Speak with Theyler.","Speak with Theyler again."],"dialogue":[{"name":"OKKAKE","text":"Wait, I know you! We met in Kugane! You're that stone-cold killer I asked to look after the love of my life!"},{"name":"OKKAKE","text":"What's that look for? Surely you haven't forgotten me. You and me, we had a <span class=\"emphasis\">moment</span>─a connection! Not like the one I've got with her, of course, but I <span class=\"emphasis\">know</span> I left an impression!"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"...The creepy little bastard who smells like cheese and followed Nashu to Kugane after stalking her for over five years?"},{"name":"A4","text":"Frankly, considering how many blows to the head I've taken, I'm lucky I haven't forgotten my own name."},{"name":"OKKAKE","text":"Hey! There's nothing <span class=\"emphasis\">creepy</span> about my love! It's as pure as the pristine waters of a forest stream! &lt;sniff&gt; &lt;sniff&gt; ...Fair point about the cheese stink, though."},{"name":"OKKAKE","text":"Head trauma notwithstanding, I'm still offended! At the very least, surely my love for my sultry muse─my innocent and pure and not-at-all creepy adoration for the totality of her existence─is the kind of thing that would stick in your memory!"},{"name":"OKKAKE","text":"But enough about <span class=\"emphasis\">me</span>─this is about Miss Nashu!"},{"name":"OKKAKE","text":"Ever since she got sucked into that weird portal back east, I've been scouring the world for any sign of her. I was <span class=\"emphasis\">this</span> close to giving up, but then, huzzah! I found her here in Radz–at–Han!"},{"name":"OKKAKE","text":"Normally I'd be happy to get back to playing the silent invisible guardian, but she seems pretty distressed by the plight of her inspector friend. He's here too, but laid up and showing no signs of waking any time soon. My Nashu has been fashioning all sorts of medicines in hopes of rousing him, but to no avail."},{"name":"OKKAKE","text":"I mean, I couldn't care less if he kicked the bucket, but I hate seeing her like this. She's liable to work herself to death!"},{"name":"OKKAKE","text":"So, what say you? Will you deliver my dearest Nashu from her plight? You'll find her over at the High Crucible, no doubt slaving over an alembic."},{"name":"OKKAKE","text":"And with that, I'll get back to cheering her on from the shadows! You too, I guess. Now go, quickly! Save my beloved!"},{"name":"NASHUMHAKARACCA","text":"And that should do it! Now to take this medicine and..."},{"name":"NASHUMHAKARACCA","text":"Cor! <span class=\"highlight\">Forename</span>! It feels like it's been forever! Though <span class=\"emphasis\">definitely</span> less than a year, I'm sure."},{"name":"NASHUMHAKARACCA","text":"What brings you to Radz–at–Han? Enjoying a spot of adventuring, or perhaps..."},{"name":"NASHUMHAKARACCA","text":"Then you've heard! It's true. Inspector Hildibrand's gone into hibernation again, and─ Ah, wait. You're giving me that look. The one that screams, “What about the whole weird portal business?” All right, since you silently asked..."},{"name":"NASHUMHAKARACCA","text":"So, back on the Ruby Sea─remember how Greg got doused with dewprism and was forced to whisk us all “far away”?"},{"name":"NASHUMHAKARACCA","text":"...How that strange rift then opened up─which the inspector then got sucked up into─and how I followed him in after that?"},{"name":"NASHUMHAKARACCA","text":"Well, after that, we all ended up in this bizarre place. Couldn't tell up from down, left from right. And so we wandered, lost and confused..."},{"name":"NASHUMHAKARACCA","text":"Fortunately, Greg came to his senses and explained that we were in the “Interspectorial Rift,” and then used the same trick to bring us home! "},{"name":"NASHUMHAKARACCA","text":"Greg himself stayed behind, though. Something about a score that he had to settle. Not sure what that was about, but hey, you know Greg..."},{"name":"NASHUMHAKARACCA","text":"Anyway, we're back now, but the rub is that Inspector Hildibrand hasn't opened his eyes once!"},{"name":"NASHUMHAKARACCA","text":"I know he needs his beauty sleep, but it's been an awfully long time, and we've got cases to solve!"},{"name":"NASHUMHAKARACCA","text":"I've been trying my hand at apothecary stuff, seeing if I can't make something that'll get him up and moving, but nothing seems to work!"},{"name":"NASHUMHAKARACCA","text":"But I think we're making progress. Me and Mister Chupacabra from the Shakshouka Concern, that is. You remember Mister Chupacabra, right? Got sucked into the rift along with us, former evil mastermind─not so bad once you get to know him."},{"name":"RADZATHANMERCHANT03168","text":"Pleased I am to meet you once more, and under less compromising circumstances. If I may correct our mutual friend─I am Jubraca, chairman of the Sahjattra Concern."},{"name":"RADZATHANMERCHANT03168","text":"Y-Your distrustful and somewhat bloodthirsty glare is not unwarranted, but in my defense, who among us has not contemplated enslaving the rich and powerful to bend the world to their whim...? Hah hah...hah... Ahem."},{"name":"RADZATHANMERCHANT03168","text":"I pray you forgive me my poor joke, and allow me to assure you that after wandering the interdimensional rift for the-Sisters-only-know-how long, I am a changed man! "},{"name":"RADZATHANMERCHANT03168","text":"Naturally, I understand that words alone would not suffice to absolve me of my sins. Thus, since my return, I have operated a humble apothecary that caters to the needs of one and all."},{"name":"RADZATHANMERCHANT03168","text":"Furthermore, I made arrangements for Miss Nashu's workshop. Rest assured that I will spare no effort in helping her see Inspector Hildibrand awakened and returned to full health."},{"name":"RADZATHANMERCHANT03168","text":"And with that, if you would excuse me, I must see to other business..."},{"name":"NASHUMHAKARACCA","text":"Isn't he the nicest ex-villain you've ever met? Ah, but that's right─I had just finished my latest medicine! I've got high hopes for this new recipe."},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"I suppose I ought to get a look at the Manderville man himself."},{"name":"A5","text":"Medicine might not do us any good..."},{"name":"NASHUMHAKARACCA","text":"By all means! The inspector is resting in a room up in Kama. Awake or asleep, I'm sure he'd enjoy your company. Let's go!"},{"name":"NASHUMHAKARACCA","text":"Really? Well, you've seen all kinds of amazing things in your travels, so maybe you'll be able to tell what's wrong with the inspector if you get a look at him yourself."},{"name":"NASHUMHAKARACCA","text":"He's resting in a room up in Kama. Let's go!"},{"name":"PARIGHA","text":"The girl's a friend of yours, is she? She's welcome to stay as long as she likes. I do hope her friend recovers soon, though. Sleeping on the floor hasn't been good for my back..."},{"name":"NASHUMHAKARACCA","text":"Isn't this room nice? Mister Chupacabra's taken care of everything─even paid the rent in full! Ah, but I'm distracting you, aren't I? You need to concentrate while you examine the inspector, yes?"},{"name":"SYSTEM","text":"Study the sleeping Inspector Hildibrand. You may move the camera, as well as zoom in and out. Target a section and examine it in more detail with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"SYSTEM","text":"The inspector's condition is disturbingly reminiscent of the Scions' who were summoned to the First for a time..."},{"name":"NASHUMHAKARACCA","text":"Hmm...? Oh! Finished already?"},{"name":"NASHUMHAKARACCA","text":"Any theories as to what's wrong with the inspector?"},{"name":"Q6","text":"What will you say?"},{"name":"A6","text":"Well, he's a soulless husk, which is less than ideal."},{"name":"A6","text":"I suspect he may have been <span class=\"emphasis\">summoned</span> to another reflection."},{"name":"NASHUMHAKARACCA","text":"I see... I mean, I <span class=\"emphasis\">don't</span>, but that's what you're supposed to say at times like this, I know that much. How do we wake him up?"},{"name":"NASHUMHAKARACCA","text":"Return his soul to his body? But where did it go, and what is it doing there?"},{"name":"Q9","text":"What will you say?"},{"name":"A9","text":"Probably went to the First to become the Gentleman of Darkness, as you do."},{"name":"A9","text":"I think it's gone to another world wholly unlike ours...but still slightly like ours. A world of contrasts."},{"name":"NASHUMHAKARACCA","text":"I <span class=\"emphasis\">see</span>... Right. So can you go...there?"},{"name":"NASHUMHAKARACCA","text":"Great! In that case, I'll leave the soul searching to you!"},{"name":"NASHUMHAKARACCA","text":"I'm sure it goes without saying, but once you've arrived in this otherworldly world, look for a place that smells of mystery and intrigue, and chat with people there. That's standard agent of enquiry protocol!"},{"name":"NASHUMHAKARACCA","text":"Oh, and since this is Inspector Hildibrand we're talking about...don't be surprised if you find him asleep, or having forgotten a thing or two."},{"name":"NASHUMHAKARACCA","text":"But not to worry! I've prepared my traditional “medicine” just in case. Don't hesitate to use it! And with that, do take care out there!"},{"name":"NASHUMHAKARACCA","text":"When in doubt, use Nashu's Delights to blow the cobwebs right out! The inspector will thank you after, I'm sure."},{"name":"GLYNARD","text":"Welcome back, friend. I'd offer you a pint, but my barman's sense tells me that's not why you're here..."},{"name":"GLYNARD","text":"So this friend of yours has gone missing? Sorry to hear that, but plenty of travelers pass through these parts. Could you describe the fellow to me? "},{"name":"Q7","text":"What will you say?"},{"name":"A7","text":"Hume, burly, wears a monocle, well-meaning idiot."},{"name":"A7","text":"He was wearing a tattered suit, most like."},{"name":"GLYNARD","text":"Hmmm...yes, that sounds familiar. Mind you, I didn't see him myself─but I do believe one of our bounty hunters spied such a man when you were all battling that horde of spectral warriors."},{"name":"GLYNARD","text":"Giott! Come here a moment. There's someone who wants to speak with you!"},{"name":"GIOTT","text":"&lt;gulp&gt; That so? Make it─&lt;hic&gt;─quick. Thish ale ishn't going to drink itshelf..."},{"name":"GIOTT","text":"If it ain't <span class=\"highlight\">Forename</span>! What brings you back to our neck of the woods?"},{"name":"GIOTT","text":"Who're─ Wait. You're one of the Exarch's friends─the Warrior of Darkness! Fought by your side when the glowing bastards came to ruin our day─but we showed them, hah! But enough reminiscing─what's so important that you had to interrupt my regularly scheduled drinking?"},{"name":"GIOTT","text":"Now that you mention it, I did see someone like that. Back there on the battlefield, after you ran off to do more hero work."},{"name":"GIOTT","text":"At first, I thought he was going to attack me like the rest of the spirit wotsits. But no, he just stood there, striking a pose, trying to scare or seduce me. Damned if I could tell."},{"name":"GIOTT","text":"Still, he was glowing, and I wasn't about to take any chances, so I said, “Hey! Piss off, ghost!” and sent him packing."},{"name":"GIOTT","text":"\"Did he die,“ you ask? To which I say, ”What am I, a chirurgeon?“ Also, ”I've kept my mug waiting long enough.“ Good talk."},{"name":"SOLDIER03608","text":"(-???-)Could it be!? The Warrior of Darkness!"},{"name":"SOLDIER03608","text":"I thought that was your voice, but was convinced my ears were playing tricks on me. It's good to see you again."},{"name":"BRAVESOLDIER","text":"Didn't mean to eavesdrop, but we overheard you discussing the renegade poser. We've been searching for him for some time now."},{"name":"SOLDIER03608","text":"There have been sightings in Lakeland, you see. Vonard and I have been tasked with getting to the bottom of it."},{"name":"SOLDIER03608","text":"We've little in the way of useful information, though. All we know is that he appears without warning and strikes a disturbing pose."},{"name":"BRAVESOLDIER","text":"He's not caused any harm─if you discount the shock of a strange man gesticulating in your general direction, that is. Nevertheless, we're worried his behavior might escalate. Have you been tasked with apprehending the miscreant as well?"},{"name":"GLYNARD","text":"Not quite, Vonard. <span class=\"highlight\">Forename</span>'s come back to track down a missing friend."},{"name":"Q8","text":"What will you say?"},{"name":"A8","text":"Your “miscreant,” I regret to say, might be my friend..."},{"name":"A8","text":"I wouldn't call him a “friend” per se, but I too happen to be looking for a man prone to posing."},{"name":"GLYNARD","text":"Hmm. If the man you're looking for might be one and the same, then why not work together? Between the three of you, you're bound to have better luck."},{"name":"SOLDIER03608","text":"It would be an honor─and a great help! We were just about to leave to gather testimony, as it happens."},{"name":"BRAVESOLDIER","text":"Come and join us in Sullen when you've finished here. We'll solve this mystery in no time!"},{"name":"GLYNARD","text":"You always kept interesting company, that's for sure. I don't know if it would be better or worse if this “poser” is your friend, but I wish you the best of luck."},{"name":"SOLDIER03608","text":"Searching for this man might seem like a waste of time to some, but it's our duty to ease the people's worries─large or small."},{"name":"BRAVESOLDIER","text":"Maybe we're worrying over nothing if he's not hurt anyone yet, but you never know with some people. Better safe than sorry."},{"name":"SULLENA04542","text":"Did I see him? You bet I did. I was crossing through the Forest of the Lost Shepherd, on my way to deliver fish to the Ostall Imperative..."},{"name":"SULLENA04542","text":"Out of nowhere, this odd man leapt in front of me! I thought he was a bandit at first, but then he abruptly turned to the side, curled his neck, and put his fist to his head as if to say...I don't know. It was baffling. I ran when I realized he wasn't going to do anything else."},{"name":"SULLENB04542","text":"...Why, yes─I saw someone like that when I was out picking mushrooms in the forest. He even spoke to me!"},{"name":"SULLENB04542","text":"I was repulsed at first by his form, but he only wanted to warn me that fell beasts lurk in the forest, and that I should be wary."},{"name":"SULLENB04542","text":"Contrary to appearances, I'd say he was actually quite...gentlemanly."},{"name":"SULLENC04542","text":"Oh, <span class=\"emphasis\">that</span> fellow? Aye, I saw 'im the other day on the way home from Clearmelt. I'd enjoyed one too many libations after my bath, and ended up wanderin' off into the forest."},{"name":"SULLENC04542","text":"Before I knew it, the sun was dippin' low, and the sky turnin' dark, and I was beginnin' to wonder if I'd ever make it home. Then I felt a gentle tug at my arm."},{"name":"SULLENC04542","text":"And would you believe it? This odd-lookin' man led me out of the forest and set me back on the road! I thanked him profusely, but he said nothin' in reply, just struck this pose and walked off."},{"name":"SULLENA04542","text":"I do hope you find that strange man. He may just be a nuisance for now, but we shouldn't have to suffer posing vagabonds."},{"name":"SULLENB04542","text":"He may look scary, but he's quite the gentleman. Why else would he have warned me about the monsters?"},{"name":"SULLENC04542","text":"If you see the fellow, tell him to come and visit. I owe him a drink or two for his kindness."},{"name":"BRAVESOLDIER","text":"To be honest, I'm not sure what to make of all this..."},{"name":"SOLDIER03608","text":"Finished questioning the locals, have you? Were you able to learn anything?"},{"name":"SOLDIER03608","text":"...Not only has the poser caused no harm, he's even <span class=\"emphasis\">helped</span> people?"},{"name":"BRAVESOLDIER","text":"So he's a gentleman, albeit a suspicious one. Something of a contradiction you might say, but there's no reason to doubt what we heard."},{"name":"SOLDIER03608","text":"Everyone seemed to encounter him in the Forest of the Lost Shepherd, right? Then that's where we'll look next. Shall we?"},{"name":"BRAVESOLDIER","text":"On the other hand, some folks might argue a suspicious gentleman is more dangerous than a man more blatant in his villainy. This “gentlemanliness” could well be a ruse to mask all kinds of evil intentions."},{"name":"SOLDIER03608","text":"Well, here we are. But how exactly are we supposed to begin our search? These woods are, well...woods."},{"name":"BRAVESOLDIER","text":"Got a plan, do you? Far be it from me to doubt the Warrior of Darkness. Show us what you've got in mind, and we'll back you up to the best of our ability."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Perform the Manderville."},{"name":"A1","text":"Perform the Manderville Mambo."},{"name":"HILDIBRAND","text":"(-Familiar Voice-)Hark! What familiar gentlemanly gyrations are these!?"},{"name":"BRAVESOLDIER","text":"On your guard! It's a sin eater!"},{"name":"SOLDIER03608","text":"No, wait! That's no sin eater!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"It's Hildibrand!"},{"name":"A2","text":"It's the Gentleman of Light!"},{"name":"HILDIBRAND","text":"(-Forgiven Gentleman-)Hildibrand? Who is this Hildibrand of whom you speak? I am the Forgiven Gentleman, devourer of sins! Lightwarden extraordinaire!"},{"name":"HILDIBRAND","text":"(-Forgiven Gentleman-)Gentleman of Light? Who is this Gentleman of Light of whom you speak? I am the Forgiven Gentleman, devourer of sins! Lightwarden extraordinaire!"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"You're not a sin eater─you're Hildibrand, the gentleman inspector!"},{"name":"A3","text":"You might occasionally moonlight as a zombie overlord, but trust me, you're a gentleman inspector!"},{"name":"HILDIBRAND","text":"(-Forgiven Gentleman-)Urrrgggh... Hurrrggghhh...! Inspector... Sin eater... Inspector... Sin eater..."},{"name":"SOLDIER03608","text":"You're acquainted with this, er...gentleman?"},{"name":"SOLDIER03608","text":"...Right, then. Clearly, your friend has been through a lot. But still, how did he get it in his head he's a sin eater?"},{"name":"BRAVESOLDIER","text":"Is there no way to bring back his memories?"},{"name":"BRAVESOLDIER","text":"Explosives? We're still trying to <span class=\"emphasis\">save</span> him, right?"},{"name":"SOLDIER03608","text":"Wicked white, we've killed him!"},{"name":"HILDIBRAND","text":"I say, <span class=\"highlight\">Forename</span>! I had resigned myself to Nashu's ungentle methodology, but you too, my brutish friend!?"},{"name":"HILDIBRAND","text":"But never mind that. I do not recall the world being quite so purple..."},{"name":"HILDIBRAND","text":"Previously, I was with Nashu and Greg, wandering the bizarre, shadowy realm known as the “Interspectorial Rift”..."},{"name":"HILDIBRAND","text":"Hmm? Where am I...? <span class=\"emphasis\">Who</span> am I?"},{"name":"GIOTT","text":"That sickening light. That aggressive posturing. I know what you are. You're one of <span class=\"emphasis\">them</span>, ain't you?"},{"name":"GIOTT","text":"What you need is a good old-fashioned dwarven decking!"},{"name":"GIOTT","text":"Piss off, ghost!"},{"name":"SULLENRESIDENT","text":"R-Run for your lives! It's a sin eater!"},{"name":"HILDIBRAND","text":"A sin...eater?"},{"name":"BRAVESOLDIER","text":"I'll be damned. I saw a vision of the man's past. No wonder he became convinced he was a sin eater."},{"name":"SOLDIER03608","text":"I saw it too. It was, quite possibly, the most ridiculous memory I've ever glimpsed..."},{"name":"HILDIBRAND","text":"Answer me, my faithful assistant! Where are we─and why is it so <span class=\"emphasis\">purple</span>!?"},{"name":"HILDIBRAND","text":"...The “First”? The first what? Are you telling me we've somehow traveled to an entirely different <span class=\"emphasis\">world</span>?"},{"name":"HILDIBRAND","text":"Good gods! To think that I have transcended the very boundaries of time and space! But worry not, my adoring fans! Hildibrand─agent of enquiry, inspector extraordinaire─will return to you forthwith!"}],"reward":{"gil":1303},"reqs":{"jobs":[{"lvl":90,"id":34}],"questsType":"all","quests":[68704,70000]},"next":[70079]},"partials":[{"type":"npc","id":"1042487","obj":{"i":1042487,"n":"Excitable Youth","l":3707,"q":1}},{"type":"npc","id":"1042497","obj":{"i":1042497,"n":"Theyler","l":2953,"q":1}},{"type":"quest","id":"68704","obj":{"i":68704,"n":"Don't Do the Dewprism","g":70,"l":"Kugane","s":90,"f":1}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}},{"type":"quest","id":"70079","obj":{"i":70079,"n":"A Soulful Reunion","g":71,"l":"Lakeland","s":110,"f":1}}]}