{"quest":{"name":"Void Theory","location":"Thavnair","id":70070,"patch":6.1,"sort":627,"icon":101181,"eventIcon":71201,"issuer":1039624,"genre":12,"journal":["Y'shtola is eager to depart for the vault.","Y'shtola has returned from the city with not only Varshahn, but also Estinien in tow. Wondering what ominous danger the Archon might be expecting, you set off for Akyaali, and the vessel waiting to bear your little group to the ruins in the Bounty.","As promised, you find a ship moored at Akyaali. You board without further delay and depart for the vault, Y'shtola's quiet focus offset somewhat by Nidhana's infectious enthusiasm.<br><br>※In the event that you leave Weaver's Warding, you may re-enter by speaking with the veteran Radiant in Akyaali.","Announcing her intention to test the efficacy of the warding scale against the corrupting influence of the Thirteenth, Y'shtola summons forth two nixies with an unexpectedly light-hearted ritual. The Archon then embeds the talisman within one of the diminutive familiars before sending both through the gate into the void. For your part, you are charged with standing guard while the experiment is in progress, lest hostile entities attempt to slip through the open portal.","Judging the experiment has gone on long enough, Y'shtola recalls her nixies from the shadowy realm beyond. The results are plain─while the warded familiar appears unaffected, its unprotected comrade has already begun to transform into a creature of the void. Y'shtola notes that, although G'raha Tia's hypothesis appears to be correct, the talisman will require augmentation to withstand the relentless influence of the Thirteenth.<br><br>A question from Estinien prompts a brief lecture on the nature of the void, a world plunged into an eternal darkness when the Ascians failed catastrophically in their efforts to force a Rejoining. You add to the explanation, sharing your own memories of the Thirteenth and the aether-starved monstrosities which stalk its sunless expanse. Varshahn considers these horrors good reason to discourage your expedition, but something in his demeanor suggests he feels otherwise in his heart of hearts..."],"objectives":["Speak with the veteran Radiant.","Speak with Nidhana.","Stand guard at the designated location."],"dialogue":[{"name":"VARSHAHN","text":"Archon Y'shtola requested that I join you, but of her plans she offered scant detail..."},{"name":"ESTINIEN","text":"The boy Mehrahd was glad to hear the news of the foundation. It means a new life for him and his sister."},{"name":"NIDHANA","text":"Oh, I forgot to mention! The Font of Maya attracts aggressive wildlife, and you should watch out for them when, uh...you go there next time. My apologies."},{"name":"YSHTOLA","text":"Look who I came across. Estinien seemed in need of diversion, and we, in turn, may have need of his lance..."},{"name":"YSHTOLA","text":"Right, then. Now that our little party is assembled, let us make our way to the ruins."},{"name":"ESTINIEN","text":"Will we have need of Matsya's boat again?"},{"name":"VARSHAHN","text":"Not this time. Once Y'shtola informed me of our destination, I arranged for a vessel to be made ready at Akyaali."},{"name":"YSHTOLA","text":"Your Excellency is ever the gracious host. Shall we?"},{"name":"YSHTOLA","text":"Onto the boat, if you please. We can chat on the way there."},{"name":"ESTINIEN","text":"'Tis likely not needed with Vrtra along, but I held onto the map against the chance we might return to the ruins."},{"name":"VARSHAHN","text":"You need not keep your weapons close at hand. The guardians will not attack if I am present, so I pray you leave them be..."},{"name":"NIDHANA","text":"And all this time I thought the tales of Alzadaal's hoard were no more than drunken sailors' fancies!"},{"name":"WARRIOR04532","text":"The ship is yours to command."},{"name":"VARSHAHN","text":"Our thanks. We set sail at once."},{"name":"NIDHANA","text":"Oh, this is so exciting! Alzadaal's Legacy─to see the truth of a legend with mine own eyes!"},{"name":"WARRIOR04532","text":"All aboard for the treasure vault!"},{"name":"Q1","text":"Proceed to Weaver's Warding?"},{"name":"YSHTOLA","text":"Poor Vrtra─he really should have spoken with Estinien before we left. I shudder to think what we've cost them in terms of construct materials..."},{"name":"ESTINIEN","text":"I thought we cleared this place of constructs the last time we came through. 'Twould seem a few stragglers remained."},{"name":"VARSHAHN","text":"...He laid waste to them ere I could utter a single word. &lt;sigh&gt;"},{"name":"WARRIOR04532","text":"Will you be setting sail for the vault?"},{"name":"Q2","text":"Proceed to Weaver's Warding?"},{"name":"YSHTOLA","text":"We need to wait for a time to ensure a meaningful result. Be patient, and keep watch for any intruders."},{"name":"ESTINIEN","text":"I struggle to picture Y'shtola as a little girl. Easier to believe she sprang fully formed from one of Master Matoya's cauldrons."},{"name":"VARSHAHN","text":"Every time I come here, it reminds me of that dark portal above the Crystal Tower...and the final lash of Azdaja's tail as she plunged into the void."},{"name":"NIDHANA","text":"Sisters save me, I will never see Y'shtola the same way again! “Froth and foam,” indeed!"}],"reward":{"gil":1044},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70069]},"next":[70071]},"partials":[{"type":"npc","id":"1039624","obj":{"i":1039624,"n":"Y'shtola","l":3709,"q":2}},{"type":"quest","id":"70069","obj":{"i":70069,"n":"Restricted Reading","g":12,"l":"Old Sharlayan","s":626}},{"type":"quest","id":"70071","obj":{"i":70071,"n":"A Satrap's Duty","g":12,"l":"Weaver's Warding","s":628}}]}