{"quest":{"name":"The Face of an Explorer","location":"Rhalgr's Reach","id":70075,"patch":6.1,"sort":140,"icon":101161,"unlocksFunction":1,"eventIcon":71341,"issuer":1042285,"target":1042264,"genre":27,"journal":["Apprehension is writ plain upon Deryk's face.","Speaking plain, Deryk confesses that he isn't fond of working one-on-one with another, but he will dutifully do what is requested of him. Thus do you set forth─separately─for Arrzaneth Ossuary in Ul'dah, there to investigate the worship of Nald'thal.","Joining Deryk at the Ossuary, you establish that though the Nald'thal you encountered differs somewhat in appearance from the twins revered by Ul'dahns, they still share many similarities. However, Deryk's blithe mentioning of your recent activities begins to attract the attention of the pious folk nearby, and upon being alerted to their dismay, he sheepishly takes himself outside.","Deryk declares that your work in Ul'dah is done. Rather than wait for G'raha Tia to arrive, however, he suggests seeking your companion out at the Sunken Temple of Qarn, and you begin making your way to the ruins in southern Thanalan.  ","You arrive at the temple to find Deryk tending to a collapsed woman, by whose attire he posits is a scholar. She begs you to bring food and water from her bag, and you go to search for it in the area.","You soon come upon what appears to be the scholar's bag, but find only a skin with a meager amount of water inside. Though you doubt it will be enough, for now you decide to take the water to the woman.","As expected, the water doesn't suffice, and the woman begs for food. Before you can offer something, however, G'raha Tia arrives on the scene. After his initial shock at your presence, he turns his attention to the woman, one Snoegeim, who promptly springs back to life thanks to his gift of nutritious provender. Introduced as the mythologist Krile recruited, Snoegeim can barely contain her excitement as she hears your account of the phantom realm, and identifies similarities between the domains you visited and the heavens of legend. Having thus successfully rendezvoused with your new colleague, you make your way to join Krile in the Omphalos.","Upon arriving in the Omphalos, Snoegeim immediately begins making excited observations of the isle, which she believes to be the seventh heaven. Your party then reviews all that you have learned thus far and discuss a potential course, before taking a well-earned rest at the most fitting of venues─the Seventh Heaven in Mor Dhona─where you manage to catch a glimpse of Deryk with his guard down. Afterwards, your group disperses for a time, with the solitary explorer opting to go for a walk nearby. For want of an immediate task of your own, you decide to look in on him.","Deryk informs you that he intends to remain in Revenant's Toll while awaiting developments, and promises to share any tidings with you. Though you know not when, it's only a matter of time before your investigation resumes, and you look forward to drawing closer to solving the mystery of the Twelve."],"objectives":["Speak with Deryk at Arrzaneth Ossuary.","Speak with Deryk again.","Search for G'raha Tia in the vicinity of the Sunken Temple of Qarn.","Search for the collapsed scholar's bag.","Deliver the nigh-empty waterskin to the collapsed scholar.","Speak with Krile in the Omphalos.","Speak with Deryk."],"dialogue":[{"name":"DERYK","text":"What strange manners for the one who proposed the survey to so promptly abandon it."},{"name":"DERYK","text":"I'll not lie: I am not given to working one-on-one with another. But I suppose I agreed to this arrangement."},{"name":"DERYK","text":"&lt;sigh&gt; Well, we had best be on our way..."},{"name":"DERYK","text":"As I recall, Milvaneth Sacrarium is still closed for construction, so let us try our luck at Arrzaneth Ossuary."},{"name":"DERYK","text":"You have no objection to traveling separately, I trust? Good. I shall see you in Ul'dah."},{"name":"KRILE","text":"Raha has also shared his observations with me. Keeping your combined accounts in mind, I shall see what else I can learn here."},{"name":"BABYOPOOPO","text":"(-Baby Opo-opo-)Ook!"},{"name":"DERYK","text":"Ah, you're here."},{"name":"DERYK","text":"Of the deific twins Nald'thal, here they worship Thal, who keeps the realm of the dead and weighs the worth of men's souls."},{"name":"DERYK","text":"In contrast, Nald keeps the world of the living and oversees their financial fortunes."},{"name":"DERYK","text":"Their names are borne by many a location, and religious organizations─some extremely wealthy and powerful─exist to nurture faith in them."},{"name":"DERYK","text":"On the surface, it may seem strange that a hub of commerce such as Ul'dah could be home to such spiritual people. But it is actually quite logical when one considers that their religion is, in essence, commerce."},{"name":"DERYK","text":"In any event, Nald'thal is a truly unusual divinity."},{"name":"DERYK","text":"What was originally held to be one god came to be worshipped as twins."},{"name":"DERYK","text":"Indeed, rather than two distinct entities, that which we encountered was a single being possessed of two personalities."},{"name":"PRIEST04539","text":"D-Did I mishear? Did he just say they <span class=\"emphasis\">encountered</span> Nald'thal?"},{"name":"DERYK","text":"And while his appearance differs somewhat to the divinities worshipped, it cannot be denied that there are striking similarities in their nature."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We're starting to attract attention..."},{"name":"A1","text":"Perhaps we should avoid talking about that here."},{"name":"A1","text":"..."},{"name":"DERYK","text":"F-Forgive me, this is hardly the place for such a conversation... Let us continue it elsewhere!"},{"name":"DERYK","text":"'Twas careless of me to openly speak of our encounter with a divinity within a place where he is worshipped."},{"name":"DERYK","text":"Hereon, I shall exercise greater caution."},{"name":"DERYK","text":"I thank you for alerting me to my indiscretion...and ask that you keep it between us."},{"name":"DERYK","text":"Now then, to finish our conversation... As I mentioned, though the Nald'thal as worshipped by men appears somewhat different, there are undeniable similarities in their nature. I believe we may report this much to G'raha Tia."},{"name":"DERYK","text":"With that, our work here is done. Rather than waiting for our companion to arrive, perhaps we might seek him out at the Sunken Temple?"},{"name":"DERYK","text":"He mentioned needing to make a detour. Were we to set out now, we ought to be able to catch up to him."},{"name":"DERYK","text":"After all, we hardly know one another. Rather than loiter with an unfamiliar person, 'tis better to use our time productively. Wouldn't you agree?"},{"name":"DERYK","text":"Then let us head to the Sunken Temple of Qarn at once."},{"name":"DERYK","text":"Are you all right? If you hear me, please say something."},{"name":"SNOEGEIM","text":"Unnngh..."},{"name":"DERYK","text":"You're here, thank goodness. I found this woman collapsed, though I can see no obvious injuries. By her attire, she appears to be some manner of scholar."},{"name":"SNOEGEIM","text":"Water... Food... In my bag... Please..."},{"name":"DERYK","text":"I see... <span class=\"highlight\">Forename</span>─may I trouble you to find her bag? I will stand lookout in the meantime."},{"name":"DERYK","text":"If I understand her correctly, her bag is somewhere nearby. Please find it."},{"name":"SNOEGEIM","text":"My bag... Somewhere out there... Unnngh..."},{"name":"SYSTEM","text":"Examining the bag, you find a skin with a little water left, but there appears to be no provender."},{"name":"SYSTEM","text":"For now, you decide to take the water to the woman."},{"name":"SNOEGEIM","text":"So thirsty... So hungry... Unnngh..."},{"name":"SNOEGEIM","text":"Not enough... Food... I need food..."},{"name":"DERYK","text":"I have naught save dried meat, tough as leather. Do you have anything easier to consume?"},{"name":"GRAHATIA","text":"<span class=\"highlight\">Forename</span>, Deryk! What are you doing here?"},{"name":"GRAHATIA","text":"Actually, that can wait..."},{"name":"GRAHATIA","text":"Steady, Snoegeim! I've brought you Archon loaf and coffee─made sweet and creamy, just as you like it."},{"name":"SNOEGEIM","text":"(-Snoegeim-)Ahhhhhh, I am reborn! Washed down with a sweet beverage, the life-giving nutrients of Archon loaf permeate my being from head to toe!"},{"name":"SNOEGEIM","text":"(-Snoegeim-)Thank you, kind stranger! However you knew my preferred source of sustenance, you are truly a godssend!"},{"name":"SNOEGEIM","text":"(-Snoegeim-)...Oh, it's you, Raha! What brings you here? I don't recall mentioning my fieldwork. It's for my research into the Belah'dians' worship of Azeyma, you see..."},{"name":"GRAHATIA","text":"Haven't you heard from Krile? The Students are presently investigating the Twelve, and we would prevail upon your expertise."},{"name":"GRAHATIA","text":"May I introduce Snoegeim, expert mythologist. She is a collaborator of the Students, and like many a Sharlayan scholar, is passionate about her endeavors to the point of forgetting to eat."},{"name":"GRAHATIA","text":"Seeing as she has recovered, may I ask the two of you to tell her about the phantom realm?"},{"name":"SNOEGEIM","text":"(-Snoegeim-)The Twelve abide in the phantom realm...and you exchanged not only words with them, but blows besides!? Incredible!"},{"name":"SNOEGEIM","text":"(-Snoegeim-)And your description of the domains─a thunderous tower in one and a sweltering city in another─are precisely as the Heavens of Lightning and Fire are depicted in legend!"},{"name":"SNOEGEIM","text":"(-Snoegeim-)In ancient times, worshipers of the Twelve believed that there exist seven heavens and seven hells."},{"name":"SNOEGEIM","text":"(-Snoegeim-)Aetherology has since established that departed souls return to the aetherial sea..."},{"name":"SNOEGEIM","text":"(-Snoegeim-)But it seems those afterlife domains were more than just inventions of mortal imagination!"},{"name":"SNOEGEIM","text":"(-Snoegeim-)As a pursuer of myths, I must say it feels somewhat anticlimactic to suddenly have these revelations given to me..."},{"name":"SNOEGEIM","text":"(-Snoegeim-)But more than that, I'm dying to know more! Which is to say: please allow me to join your investigation!"},{"name":"GRAHATIA","text":"...Ahem. We would, of course, welcome your presence. Without further ado, then, let us head to the Omphalos. Krile awaits us there."},{"name":"KRILE","text":"Welcome back, everyone─and welcome, Snoegeim! I'm glad you could join us."},{"name":"SNOEGEIM","text":"Krile, how delightful to see you again! I understand you've been doing a fine job leading the Students."},{"name":"SNOEGEIM","text":"But may I say what a lovely place this is! At a glance, this appears to be the highest of the heavens of legend: the seventh heaven!"},{"name":"SNOEGEIM","text":"And oooh, if those aren't symbols representing the other heavens! I take it those are their respective gateways. I should like to pay them all a visit!"},{"name":"GRAHATIA","text":"For Snoegeim's benefit, let us review what we have learned thus far, and thence deliberate the next step."},{"name":"GRAHATIA","text":"...The gods reappeared before us in Rhalgr's Reach, though they were disguised as unassuming creatures; their laws forbid them from showing their true forms outside their realm. "},{"name":"GRAHATIA","text":"Yet in the event the ambient aether becomes unstable, such as during an Umbral Calamity, it is possible for the realm─and indeed, the gods themselves─to be glimpsed by mortals."},{"name":"GRAHATIA","text":"And such sightings, we believe, have given rise to the various faiths practiced throughout Eorzea."},{"name":"DERYK","text":"As we confirmed in Ul'dah, the Nald'thal worshipped by people and the Nald'thal we encountered here have more similarities than they do differences."},{"name":"KRILE","text":"In the course of exploring the Omphalos, two things caught my attention."},{"name":"KRILE","text":"The first is the gate which lies in the innermost area."},{"name":"KRILE","text":"If each of the other six gates lead to an elementally aspected heaven, and we stand in the seventh heaven as Snoegeim says..."},{"name":"KRILE","text":"What, then, lies beyond that last gate?"},{"name":"KRILE","text":"The second is this monument. It harbors some manner of magic, unlike anything I've seen before. I will endeavor to decipher it, but it will take time."},{"name":"GRAHATIA","text":"Divinities that have existed since time immemorial, who abide in domains resembling the heavens of legend... Why have they chosen to reveal themselves to mortals, seeking battle?"},{"name":"GRAHATIA","text":"Unless they favor us with more of their secrets, 'twould seem this monument holds the key to solving the mystery."},{"name":"KRILE","text":"Indeed. Much and more yet lies beyond our understanding, but we'll keep chasing the truth together."},{"name":"KRILE","text":"As I'm sure you'll agree, though, this is tiring work, both mentally and physically. We need to pace ourselves."},{"name":"KRILE","text":"To which end, might I suggest we return to Revenant's Toll and have a rest before we embark on the next stage of our investigation?"},{"name":"KRILE","text":"So rarely do I get to simply chat with colleagues, I had fairly forgotten what it felt like."},{"name":"GRAHATIA","text":"Indeed. And it's quite fitting that we should be doing so here at the Seventh Heaven."},{"name":"SNOEGEIM","text":"“Fitting”? That's an understatement if I have ever heard one! "},{"name":"SNOEGEIM","text":"The seventh and highest of the heavens, which rules over the remaining six, was right here in Mor Dhona all this time!"},{"name":"SNOEGEIM","text":"This isn't “fitting,” my friends! It's <span class=\"emphasis\">destiny</span>!"},{"name":"GRAHATIA","text":"You are obviously well versed in the myths surrounding the heavens and hells. If you don't mind, I should like to hear your thoughts on them."},{"name":"KRILE","text":"Invested as they are in their research, it doesn't take much to stoke their passions. My apologies if it makes you uncomfortable."},{"name":"DERYK","text":"Having always traveled alone, I'm admittedly not too familiar with such a lively atmosphere. But...I do not mislike it."},{"name":"GRAHATIA","text":"By the way, the two of you arrived at the Sunken Temple rather quickly. Did something happen?"},{"name":"KRILE","text":"Well, as pleasant as this has been, it's past time we returned to the annex. The paperwork for this commission isn't going to complete itself, alas."},{"name":"SNOEGEIM","text":"Then I shall take myself to the Omphalos. There's so much there that I'd like to see!"},{"name":"DERYK","text":"And I..."},{"name":"DERYK","text":"I believe I will go for a walk nearby. It's getting a little warm in here."},{"name":"KRILE","text":"All right. Do take care, now."},{"name":"DERYK","text":"Oh, <span class=\"highlight\">Forename</span>... It's pleasant, isn't it? The smells and sounds of a tavern. It makes one feel...alive."},{"name":"DERYK","text":"And afterwards stepping outside alone and breathing the cool air... I like that just as much."},{"name":"DERYK","text":"While we await developments, I shall remain here in Revenant's Toll. If there are any tidings, rest assured I will share them with you."},{"name":"DERYK","text":"Thank you for your help thus far─I doubt so much could have been accomplished without you."}],"reward":{"gil":2500},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70074]},"next":[70202]},"partials":[{"type":"npc","id":"1042285","obj":{"i":1042285,"n":"Deryk","l":2403,"q":2}},{"type":"npc","id":"1042264","obj":{"i":1042264,"n":"Deryk","l":67,"q":3}},{"type":"quest","id":"70074","obj":{"i":70074,"n":"A Divine Dilemma","g":27,"l":"The Omphalos","s":130,"f":1}},{"type":"quest","id":"70202","obj":{"i":70202,"n":"Return to the Phantom Realm","g":27,"l":"Mor Dhona","s":150,"f":1}}]}