{"quest":{"name":"A Satrap's Duty","location":"Weaver's Warding","id":70071,"patch":6.1,"sort":628,"icon":101182,"eventIcon":71201,"issuer":1039633,"target":1039645,"genre":12,"journal":["Y'shtola ponders the next stage of your preparations to enter the void.","Y'shtola, relieved at the safe conclusion to her experiment, deliberates how best to augment the talisman for your forthcoming expedition into the void. Not wanting to further burden the alchemists of the Great Work, you settle on bringing the problem to the Garlond Ironworks operation in Rhalgr's Reach. If anyone can find a solution, it will be Cid and his innovative engineers.","Fascinated by your commission, Cid agrees to fashion a protective case for the talisman, even promising to enlist the incorrigible Nero and his trove of data on the Thirteenth. With one solution pending, Y'shtola suggests a return to the Great Work, where Nidhana has hopefully made progress on the construction of the mock Atomos.","Nidhana is pleased to speak of her own good fortune in ascertaining the simulacrum's necessary components, as well as receiving unexpected offers of assistance from the High Crucible's alchemists. Despite the imminent possibility of travel to the void, however, Vrtra remains hesitant about resuming the search for his sister. Strong words of encouragement from Nahbdeen and the assembled Hannish crowd nearly convince him to reach a decision, but it is your contribution which finally moves the great wyrm to “take heart.” Thus bolstered in spirit, Vrtra announces he will trust Radz–at–Han to his people for a time, and attempt what he has dreamed of for five thousand long years.","Although glad of Estinien's participation, Y'shtola advises against involving the other ostensibly disbanded Scions in your impending venture into the void. Similarly, she would prefer to avoid attracting attention by basing the expedition out of the Rising Stones─an issue Varshahn means to remedy after a return to Meghaduta.","A quick word to a palace official, and it seems that guest chambers will soon be at your disposal for use as a new headquarters─once the occupying mounds of treasure have been formally allocated for the Khalzahl Foundation, that is. As your various preparations proceed apace, you can almost hear the door to the Thirteenth─and a new adventure─begin to creak open..."],"objectives":["Speak with the junior Ironworks engineer.","Speak with Nidhana at the Great Work.","Speak with Y'shtola.","Speak with Varshahn outside Meghaduta."],"dialogue":[{"name":"ESTINIEN","text":"Seeing the void's terrors firsthand was an experience. But I doubt fear of such creatures is at the root of Vrtra's hesitation..."},{"name":"WARRIOR04532","text":"Will you be setting sail for the vault?"},{"name":"Q3","text":"Proceed to Weaver's Warding?"},{"name":"YSHTOLA","text":"Once Nidhana succeeds in replicating the mock Atomos, this door into the Thirteenth will be ours to open."},{"name":"YSHTOLA","text":"Will you be crossing the threshold alongside us? I realize this is more my endeavor than yours..."},{"name":"ESTINIEN","text":"Hm. To be honest, I've no interest in visiting the void myself."},{"name":"ESTINIEN","text":"...Might we discuss this later? There is something I must do first."},{"name":"YSHTOLA","text":"Why does everyone insist on being so secretive? I at least had good reason for not wanting to explain my nixie ritual..."},{"name":"YSHTOLA","text":"Ahem. Shall we proceed with our other preparations, then?"},{"name":"YSHTOLA","text":"As we saw, the warding scale can be effective at protecting the bearer from other sources of aetheric corruption. Nevertheless, the talisman's durability will need to be improved if it is to withstand the void's influence for a prolonged length of time."},{"name":"YSHTOLA","text":"And I think that is a problem we can address without involving the brilliant but busy alchemists who created it. Who do we know who excels at this kind of structural augmentation?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Garlond Ironworks."},{"name":"A1","text":"The Allagans!"},{"name":"A1","text":"I'm...not sure?"},{"name":"YSHTOLA","text":"An excellent suggestion."},{"name":"YSHTOLA","text":"Perhaps they once did, but availing ourselves of Allagan insights tends to be an involved process in and of itself."},{"name":"YSHTOLA","text":"Nay, I believe a more straightforward approach is in order: consulting with the engineers of Garlond Ironworks."},{"name":"YSHTOLA","text":"What of Garlond Ironworks, then? They may have an engineer free to assist us."},{"name":"YSHTOLA","text":"As I recall, Cid himself is no stranger to the void and its volatile energies."},{"name":"YSHTOLA","text":"With his experienced hand at the helm, I have every confidence that the Ironworks can strengthen the warding scale."},{"name":"YSHTOLA","text":"Come, let us visit their operation in Rhalgr's Reach and commission their best and brightest."},{"name":"YSHTOLA","text":"Perhaps this young man can locate Cid for us."},{"name":"EMPLOYEE04535","text":"<span class=\"highlight\">Forename</span>! What brings you to the Ironworks?"},{"name":"YSHTOLA","text":"We have a commission for you and your president, actually. Assuming he's available...?"},{"name":"EMPLOYEE04535","text":"Master Cid? Certainly, I'll see if he has a moment free."},{"name":"CID","text":"A pleasure as always. I hear you have a job for us?"},{"name":"CID","text":"Heading into the void to find a lost dragon... That sounds almost pedestrian compared to your last adventure. Honestly, I don't know if you could say anything that would surprise me after Meteion and that bloody mess."},{"name":"CID","text":"All right, let's take a look at this talisman of yours. You said there were signs of degradation?"},{"name":"CID","text":"Hm, it seems some manner of corrosion has set in around a scratch on its surface─much as the void's corruption seeped into Nero through his wounds. In which case, our best bet may be to simply prevent the scale from being damaged in the first place."},{"name":"YSHTOLA","text":"And how might we achieve that?"},{"name":"CID","text":"We have a coating agent for strengthening trinkets and the like, but I'd be wary of applying any compound which might upset the scale's delicate alchemical balance. Far safer to dress it in armor."},{"name":"CID","text":"We'll construct a protective casing─one utilizing metal alloys with high aetherial conductivity, so as not to impede the talisman's primary function."},{"name":"YSHTOLA","text":"A suit of armor, as you said."},{"name":"CID","text":"Nero has compiled data on the Thirteenth, so I'll have him pitch in with the design just to be sure."},{"name":"CID","text":"If only it weren't such an ordeal to convince him to follow our safety protocols... I swear, I've never had such a reckless employee. In any case, we may need some time to untangle the particulars."},{"name":"CID","text":"If only it weren't such an ordeal to convince him to follow our safety protocols... In any case, we may need some time to untangle the particulars."},{"name":"YSHTOLA","text":"Understandable. We know how busy your schedule is, and the final result will doubtless be worth the wait."},{"name":"CID","text":"Hah, the hard part will be ducking Jessie and her constant barrage of demands while we sneak about doing the fun stuff. We'll see what we can do."},{"name":"YSHTOLA","text":"I think we can leave the rest in Cid's capable hands. Let's return to the Great Work, and see how Nidhana is getting on with the mock Atomos."},{"name":"YSHTOLA","text":"I hope Nidhana has good news for us."},{"name":"VARSHAHN","text":"The insatiable curiosity of our alchemists has ever amazed me...though I've largely left them to their own devices since we opened the gate together."},{"name":"VARSHAHN","text":"I will not squander this chance you have given me. I <span class=\"emphasis\">will</span> find Azdaja..."},{"name":"ESTINIEN","text":"Convincing others to follow their hearts is not my forte. I would have gladly let our more...philosophical comrades take the lead, had they been here."},{"name":"NIDHANA","text":"We'll have that Atomos built before you know it! When a project like this comes along, we give it our full and undivided attention. Sleep? Pah! Who needs it!"},{"name":"NIDHANA","text":"Oh, that reminds me! I really should finish that <span class=\"emphasis\">other</span> project I was working on for His Excellency..."},{"name":"NAHBDEEN","text":"What? Someone needed to give that boy a good talking to."},{"name":"NAHBDEEN","text":"(Uh, you don't suppose I'll be reprimanded, do you? I <span class=\"emphasis\">did</span> just yell at the satrap...)"},{"name":"YSHTOLA","text":"You surprise me, Estinien. For a lone wolf, you've shown an unusual degree of, shall we say, “involvement” in helping Vrtra reach this conclusion."},{"name":"ESTINIEN","text":"'Twas for the greater good. The wyrm's thundering sighs were keeping his citizens awake at night, and had travelers believing the palace wracked by some unnatural storm."},{"name":"YSHTOLA","text":"What of your own answer, then? You seemed disinclined to venture into the void..."},{"name":"ESTINIEN","text":"When I was one with Nidhogg, his vengeful thoughts were my thoughts. His endless rage my rage..."},{"name":"ESTINIEN","text":"And the soul-chilling grief he nursed for Ratatoskr's death..."},{"name":"ESTINIEN","text":"I would not wish such agony upon a foe, let alone a friend and ally. If there is a chance we can spare Vrtra that pain, then I will follow you."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"An unusual crew we have here."},{"name":"A2","text":"Any other “former” Scions we should call on?"},{"name":"A2","text":"Just the four of us...?"},{"name":"YSHTOLA","text":"Indeed, but perfect for our purpose, I should think. I'd rather not bother the Scions with aught less than a dire threat to the star."},{"name":"YSHTOLA","text":"I'd rather not bother our comrades with aught less than a dire threat to the star. We four should be sufficient for our purpose."},{"name":"YSHTOLA","text":"With things as they are, I'd rather not bother our comrades with aught less than a dire threat to the star."},{"name":"YSHTOLA","text":"It will make for an interesting journey besides. Traveling in a smaller party for a change─crowds can be a bit draining, don't you think?"},{"name":"YSHTOLA","text":"Now, on to specifics."},{"name":"YSHTOLA","text":"Unlike the First, where the Flood of Light was halted before its devastation was complete, the Thirteenth has been utterly subsumed by Darkness. My plan, as such, is to explore the void in stages, withdrawing to safety after each brief foray."},{"name":"YSHTOLA","text":"'Twould be more convenient had we some manner of base camp nearer to the gate itself..."},{"name":"VARSHAHN","text":"One of the palace chambers should serve. Come, let us reconvene outside Meghaduta."},{"name":"ESTINIEN","text":"I was put up in a guest room in the palace while I awaited my audience with Vrtra. I expect we'll be given the use of something similar."},{"name":"YSHTOLA","text":"Conducting our expedition out of the Rising Stones would raise just as many questions as recruiting too many Scions. At least here in Radz–at–Han, we might be expected to appear road-weary from our “local” explorations."},{"name":"OFFICIAL04535","text":"Please, may you aid the satrap in his endeavor, even as he aids you in yours."},{"name":"VARSHAHN","text":"...And so we will require suitable accommodations. Might we make something available for our guests?"},{"name":"OFFICIAL04535","text":"All the chambers are presently hosting the great mounds of treasure we carried out of the vault. Once the foundation's activities begin in earnest, however, we can redistribute the trove and make a room or two ready for habitation."},{"name":"VARSHAHN","text":"Good. Please inform me when you've completed the arrangements."},{"name":"VARSHAHN","text":"As you heard, we will have you settled in Meghaduta in due time."},{"name":"YSHTOLA","text":"As ever, you are most gracious, Your Excellency."},{"name":"VARSHAHN","text":"You risk yourselves to aid me in my search for Azdaja. Providing comfortable quarters is the least I can do."},{"name":"YSHTOLA","text":"I only wish we knew more about our destination. The gods only know how long our explorations might possibly take, or what our chances of success might possibly be..."},{"name":"VARSHAHN","text":"Succeed or fail, I am grateful to you for convincing me to make the attempt."},{"name":"YSHTOLA","text":"On that note, I will return to the Great Work and lend what help I can to Nidhana. If you've preparations to make ere we venture into the Thirteenth, now is the time."},{"name":"ESTINIEN","text":"All I need is my armor and my lance. Perhaps I'll train with the Radiant Host to pass the time before we depart."},{"name":"VARSHAHN","text":"You know what this means to me, <span class=\"highlight\">Forename</span>, but my purpose need not consume you as well."},{"name":"VARSHAHN","text":"We are headed to another world. Find what joy you can in the experience. For you are a traveler─an adventurer at heart. This I know."}],"reward":{"gil":1260,"items":[{"id":33918,"one":1},{"id":33919,"one":1},{"id":33920,"one":1}]},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70070]},"next":[70128]},"partials":[{"type":"npc","id":"1039633","obj":{"i":1039633,"n":"Y'shtola","l":4035,"q":1}},{"type":"npc","id":"1039645","obj":{"i":1039645,"n":"Varshahn","l":3707,"q":5}},{"type":"item","id":"33918","obj":{"i":33918,"n":"Heavens' Eye Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"33919","obj":{"i":33919,"n":"Savage Aim Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Critical Hit","category":0}}},{"type":"item","id":"33920","obj":{"i":33920,"n":"Savage Might Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Determination","category":0}}},{"type":"quest","id":"70070","obj":{"i":70070,"n":"Void Theory","g":12,"l":"Thavnair","s":627}},{"type":"quest","id":"70128","obj":{"i":70128,"n":"In Search of Azdaja","g":12,"l":"Radz-at-Han","s":629}}]}