{"quest":{"name":"The Realm of the Gods","location":"The Omphalos","id":70073,"patch":6.1,"sort":120,"icon":112466,"unlocksFunction":1,"eventIcon":71341,"issuer":1042275,"target":1042278,"genre":27,"journal":["G'raha Tia is pondering how best to proceed.","In order to solve the phantom realm's mysteries, G'raha believes that a thorough investigation is in order. But ere you are able to set off for Sharlayan to make the necessary arrangements, four mysterious beings appear who claim to be of the Twelve, the guardian deities of Eorzean myth. They declare that, in Hydaelyn's absence, they are the rightful rulers of the star, and you must prove your strength if mankind is to remain the master of his own destiny. After the gods take their leave, G'raha Tia expresses his uncertainty over the unexpected developments, but concedes that they may have far-reaching implications. So it is that you resolve to answer the gods' challenge, and formally accept the request to investigate the phantom realm.","Deryk reveals that he has previously explored the sanctums that lie beyond each gate in the Omphalos. Though he is no warrior, he offers to serve as your guide on your foray, while G'raha Tia chooses to work behind the scenes in a bid to improve your chances at victory. With your course thus decided, you see to your preparations ahead of whatever trials may await.<br><br>※Aglaia can be accessed via the Duty Finder.","Stepping through the gateway, you emerge in a domain of thunder and lightning not unlike that described in Eorzean legend. Soon you come face-to-face with the Builder, and after a furious struggle, succeed in bringing him to his knees. Yet your trials are far from over, for the deity bids you press on. And you do so, going on to encounter yet more divinities in the form of Rhalgr, Azeyma, and finally Nald'thal. Each provides you with stern contest, but you succeed in prevailing over them all. Your trials appearing to be at an end for now, you and Deryk make your way back to the Omphalos.","Back in the Omphalos, you are joined by G'raha Tia and Krile. No sooner do you begin recounting your encounter with the four gods than the entities themselves manifest before you. Having given their assurance that they are not primals, the beings reveal that they need to do battle with you in order to fulfill their objective. And though they cannot reveal the details of said objective, they encourage you to seek out the truth. With that, they return to their sanctums, leaving you and your companions to mull over recent events.","While much about the mighty beings remains shrouded in mystery, Krile takes some comfort in the fact that they seem reasonable. In considering your next step, she is eager to hear your detailed account of them."],"objectives":["Speak with G'raha Tia.","Enter Aglaia.","Speak with Krile."],"dialogue":[{"name":"DERYK","text":"Magically concealed..."},{"name":"DERYK","text":"In like manner, perhaps, to the ruins of Amdapor in the Twelveswood. The city, I understand, reappeared when the Seventh Umbral Calamity weakened the elementals."},{"name":"GRAHATIA","text":"Well, it seems there is but one solution for our ignorance: a thorough investigation!"},{"name":"GRAHATIA","text":"For this, we will require more manpower and supplies, among other things."},{"name":"GRAHATIA","text":"With your permission, we will confer with our representative, Krile, and make the necessary arrangements for a formal investigation."},{"name":"DERYK","text":"If that is what must be done to commence your work in earnest, then by all means."},{"name":"GRAHATIA","text":"Without further ado, then, let us return to Sharlayan."},{"name":"BYREGOT","text":"(-???-)Hold, mortals."},{"name":"BYREGOT","text":"(-???-)You profane this sacred realm with your very presence, and must answer for your irreverence."},{"name":"BYREGOT","text":"I am Byregot, the Builder."},{"name":"GRAHATIA","text":"Byregot!? Then...the Twelve are real!?"},{"name":"BYREGOT","text":"Let there be no doubt: we are not simulacra born of mortal faith."},{"name":"BYREGOT","text":"Nay, we Twelve are divinities true."},{"name":"BYREGOT","text":"And in Hydaelyn's absence, we are the star's rightful rulers. Its will."},{"name":"AZEYMA","text":"(-Spirited Woman's Voice-)Closely have we watched mankind."},{"name":"AZEYMA","text":"(-Spirited Woman's Voice-)And we have determined that you, champion of Hydaelyn, pose a threat to our ascension."},{"name":"RHALGR","text":"(-Sagely Man's Voice-)You were foolish to wander into our realm. We could destroy you with ease here and now...but as divinities, we must demonstrate grace and forbearance. "},{"name":"NALDTHAL","text":"(-Measured Men's Voice-)There is but one path. We must weigh this mortal's worth."},{"name":"AZEYMA","text":"(-Spirited Woman's Voice-)Hear, hear! Let there be a trial."},{"name":"BYREGOT","text":"Hmmm... While the mortal would invariably be destroyed, it would at least provide us with a diversion."},{"name":"GRAHATIA","text":"What!? You suddenly appear, and expect us to simply comply with your whims!?"},{"name":"BYREGOT","text":"Protest if you wish, but mortal logic means naught to gods. You will abide by our laws."},{"name":"BYREGOT","text":"Lo! The gateway to our sanctums lies open."},{"name":"RHALGR","text":"(-Sagely Man's Voice-)Show us the strength of mankind."},{"name":"AZEYMA","text":"(-Spirited Woman's Voice-)Show us the honor of mankind."},{"name":"NALDTHAL","text":"(-Measured Men's Voice-)Show us the spirit of mankind."},{"name":"BYREGOT","text":"If man would remain the master of his own destiny, then assemble your comrades and come. Come, and prove your worthiness."},{"name":"DERYK","text":"Seven hells... During my previous forays, nothing like this ever happened. I encountered not a single soul─and certainly not gods."},{"name":"DERYK","text":"And by their own admission, they mean to take over the star. What are we to do?"},{"name":"GRAHATIA","text":"The situation has indeed taken an unexpected turn...but we must try to think clearly."},{"name":"GRAHATIA","text":"The Twelve have long been revered and worshipped in Eorzea, and myths about Them abound."},{"name":"GRAHATIA","text":"But to my knowledge, They have never thus appeared so openly before people."},{"name":"GRAHATIA","text":"For these beings to suddenly reveal themselves just when we're here, claim supremacy over the star, and challenge <span class=\"highlight\">Forename</span> to a trial..."},{"name":"GRAHATIA","text":"Too much about this feels odd, and it gives me pause."},{"name":"DERYK","text":"Fair enough... Yet as it stands, it seems we can't dismiss the threat either."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Whatever they are, if they're issuing challenge, then challenge accepted!"},{"name":"A1","text":"Gaius van Baelsar once said that the Twelve, too, were simply primals."},{"name":"A1","text":"This is turning out to be another strange affair..."},{"name":"GRAHATIA","text":"Dependable as ever, my friend."},{"name":"GRAHATIA","text":"'Tis true that even Hydaelyn and Zodiark were primals, and we cannot discount the possibility, but we know too little to draw conclusions."},{"name":"GRAHATIA","text":"Well, if 'twas an adventure we sought, I daresay we've found it."},{"name":"GRAHATIA","text":"In any event, if these beings seek dominion over the star as they say, what happens here may have far-reaching implications."},{"name":"GRAHATIA","text":"To that end, I believe we should take action. Suffice it to say you are with me?"},{"name":"DERYK","text":"Then the Students of Baldesion will officially tend to the situation?"},{"name":"GRAHATIA","text":"Aye. In the course of studying the star's mysteries, we have undertaken to deal with any threats that may arise. This is no different."},{"name":"DERYK","text":"To think that we would encounter the Twelve..."},{"name":"GRAHATIA","text":"Right, let us deliberate a course of action. Deryk─know you aught of these beings' sanctums?"},{"name":"DERYK","text":"Aye, they are domains in the phantom realm that lie beyond each gate. I've explored them all."},{"name":"DERYK","text":"Perhaps due to aetheric instability, there are times when one can enter when ordinarily one cannot. But 'twould seem the way has been opened for us."},{"name":"DERYK","text":"While I encountered no gods during my previous forays, I saw enough to know my way around."},{"name":"DERYK","text":"I am but a humble explorer and cannot contend with gods. But if you would be willing to protect me, I will serve as your guide."},{"name":"GRAHATIA","text":"“Assemble your comrades,” Byregot bade us..."},{"name":"GRAHATIA","text":"As strong as I know you are, we know little and less about our foes. Neither their strength nor their true nature. 'Twould be decidedly reckless to contend with them unprepared."},{"name":"GRAHATIA","text":"And so, as much as I would like to accompany you, I shall do what affords us the best chance at victory."},{"name":"GRAHATIA","text":"While you set forth to answer the gods' challenge, I will work behind the scenes in my capacity as a Student."},{"name":"GRAHATIA","text":"For one, it would behoove us to arm ourselves with knowledge about the Twelve, and I shall begin by apprising Krile of the situation."},{"name":"GRAHATIA","text":"By thus utilizing our resources to the fullest, we shall overcome whatever trials await!"},{"name":"DERYK","text":"If you are ready to set forth, then so am I."},{"name":"KRILE","text":"You're safe! Thank goodness!"},{"name":"KRILE","text":"I rushed here as soon as I heard the tidings from Raha. Is this true? Beings claiming to be the Twelve have appeared?"},{"name":"GRAHATIA","text":"You defeated them all? Incredible!"},{"name":"GRAHATIA","text":"I had no doubt that you would succeed, but I'm no less impressed for it!"},{"name":"RHALGR","text":"Gahahaha! Seldom have I felt such exhilaration!"},{"name":"RHALGR","text":"To think that the day would come that we would put on an act for men... I must say, Byregot, you played the villain's role to perfection!"},{"name":"BYREGOT","text":"Come now, Master, I merely did what was necessary to compel the mortals to confront us."},{"name":"AZEYMA","text":"&lt;sigh&gt; Still, it pained me to speak to our beloved children so unkindly..."},{"name":"NALDTHAL","text":"So you say, Azeyma, yet you seemed happy enough to fight them. You did not forget the true purpose of the trial, I hope?"},{"name":"AZEYMA","text":"Well, I couldn't help but be excited. And do not tell me you felt differently!"},{"name":"AZEYMA","text":"Consider yourselves fortunate, children. 'Tis rare indeed to see Nald'thal in such high spirits."},{"name":"KRILE","text":"What in the world is happening? Didn't you say you had defeated them?"},{"name":"GRAHATIA","text":"Did they manage to flee...or perhaps were resummoned!?"},{"name":"RHALGR","text":"Put up your weapons. You have naught to fear from us."},{"name":"BYREGOT","text":"Rest assured we are not summoned beings. We do not drain the land of aether, nor do we take men into our thrall."},{"name":"GRAHATIA","text":"But...what of the gods who were summoned during the Calamity?"},{"name":"GRAHATIA","text":"The ones Master Louisoix called forth to protect the realm..."},{"name":"NALDTHAL","text":"That was not us, but a primal born of your fervent prayers for salvation."},{"name":"AZEYMA","text":"Indeed. That the worst of the Calamity was averted and the realm restored in its aftermath was a direct testament to the power of your hopes."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"If you aren't primals, then what are you?"},{"name":"A2","text":"Do you truly intend to rule the world?"},{"name":"A2","text":"Why choose to appear before us now?"},{"name":"BYREGOT","text":"...Just as men harbor hopes, so too do we gods."},{"name":"BYREGOT","text":"To realize our aspirations, 'tis essential that we do battle with you. Thus did I falsely claim that we sought to rule the world."},{"name":"BYREGOT","text":"'Twas deceitful conduct unworthy of a divinity, and I must apologize. Not only for that, but for using my power to do harm besides."},{"name":"KRILE","text":"These hopes of yours─won't you tell us what they are?"},{"name":"NALDTHAL","text":"We cannot. If you wish to know the truth, you must discover it for yourselves."},{"name":"AZEYMA","text":"'Tis not easy to move forward when there is seemingly no destination. But if you press on, you will eventually arrive at the answers you seek."},{"name":"RHALGR","text":"Aye, you will understand why we hold our peace, and far more besides. You will learn the very truth of our existence."},{"name":"BYREGOT","text":"Go forth, mortals, and seek knowledge of us. And when the time is right, we shall meet again in this place."},{"name":"GRAHATIA","text":"We have met and exchanged words with the Twelve... When I pause to think, I can scarce believe it."},{"name":"DERYK","text":"When I first explored the phantom realm, it appeared to be unoccupied. To think that it was home to the gods..."},{"name":"KRILE","text":"As if hearing about your battling the Twelve weren't shocking enough, to have them appear before my very eyes... Suffice it to say it's been an interesting day."},{"name":"KRILE","text":"While much about them remains shrouded in mystery, at least they seem open to reason. In considering our next step, I should very much like to hear your detailed account of them."},{"name":"KRILE","text":"Right after I have a word with our client, that is. Please give me a moment to introduce myself, and then we can review the situation."}],"reward":{"gil":5000,"instance":30115},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70072]},"next":[70074]},"partials":[{"type":"npc","id":"1042275","obj":{"i":1042275,"n":"G'raha Tia","l":4031,"q":1}},{"type":"npc","id":"1042278","obj":{"i":1042278,"n":"Krile","l":4031,"q":2}},{"type":"instance","id":"30115","obj":{"i":30115,"n":"Aglaia","c":61802,"t":"Raids","min_lvl":90,"max_lvl":90,"min_ilvl":565}},{"type":"quest","id":"70072","obj":{"i":70072,"n":"A Mission in Mor Dhona","g":27,"l":"Old Sharlayan","s":110,"f":1}},{"type":"quest","id":"70074","obj":{"i":70074,"n":"A Divine Dilemma","g":27,"l":"The Omphalos","s":130,"f":1}}]}