{"quest":{"name":"A Matter of Course","location":"Limsa Lominsa","id":70076,"patch":6.1,"sort":220,"icon":101162,"eventIcon":71221,"issuer":1042684,"target":1042707,"genre":201,"journal":["Mayaru Moyaru looks eager to regale you about all there is to know of the latest Moonfire Faire.<br>※This quest is available for a limited time only.","Noticing the sweat on your brow from the summer heat, Mayaru Moyaru motions you to visit Costa del Sol so you can cool down by taking a dip in its serene waters. He implores you to enjoy the Moonfire Faire festivities while you are there, and mentions the return of a mysterious attraction. To learn more, it seems you must speak with his colleague, Haermaga, in the seaside resort.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Haermaga quickly reveals to you that the mysterious returning attraction is none other than the Eorzean Nimble Warrior course─albeit reborn. He mentions that he has a request he wishes to make of you, if you are willing to help. Speak with him again to accept his request.","Haermaga's request concerns R'fhul Tia, whom he feels has let his early success get to his head. He wants you to act as a guiding star for the young adventurer, and set him back upon the right path. To do so, you will first need to speak with R'fhul Tia.","Both of R'fhul Tia's apprentices introduce themselves to you at his behest. Though he seems quite confident he will succeed in his attempt through the Eorzean Nimble Warrior course, you notice that the two of them and R'majha are worried about him. Proceed to the destination to watch how he performs.","R'fhul Tia's attempt ended in failure. After such a fall, he is in dire need of help. Render him aid with all haste.","R'fhul Tia's apprentices do not mince words in expressing their disappointment with him, and shortly thereafter take their leave. He cannot seem to understand what he did wrong, but fortunately for him, he still has you."],"objectives":["Speak with Haermaga in Costa del Sol.","Speak with Haermaga again.","Speak with R'fhul Tia.","Wait at the designated location.","Aid R'fhul Tia."],"dialogue":[{"name":"MAYARUMOYARU","text":"Ah, hello, hello! Just the adventurer I was looking for. Feeling the heat? Well, nothing like a good swim in Costa del Sol to cool down─and while you're there, you might as well enjoy the Moonfire festivities!"},{"name":"MAYARUMOYARU","text":"Hello there! You look to me like an adventurer who can enjoy a good festival when they see one. And if I may say so myself, the Moonfire Faire is the finest of them in all of Eorzea!"},{"name":"MAYARUMOYARU","text":"The faire has served to promote the Adventurers' Guild in recent years, and I expect plenty of folks'll join the fun this summer─no one will want to miss the exciting show we're putting on."},{"name":"MAYARUMOYARU","text":"That's right─due to popular demand and the wishes of Master Gegeruju himself, we brought back <span class=\"emphasis\">the challenge</span>!"},{"name":"MAYARUMOYARU","text":"Intrigued, aren't you? Sate your curiosity by speaking with Haermaga in Costa del Sol!"},{"name":"MAYARUMOYARU","text":"Look for Haermaga on the Isle of Endless Summer at Costa del Sol. He can tell you everything you need to know!"},{"name":"HAERMAGA","text":"Ah, <span class=\"highlight\">Forename</span>, here at last! You're here to give <span class=\"emphasis\">the challenge</span> a whirl, aren't you? That hulking monstrosity erected upon the shore..."},{"name":"HAERMAGA","text":"Welcome to the Moonfire Faire, fair adventurer! You're here to give <span class=\"emphasis\">the challenge</span> a whirl, aren't you? That hulking monstrosity erected upon the shore..."},{"name":"HAERMAGA","text":"The imposing fortress that turns grown men into weeping babes, the crucible which forges the fiercest of warriors or spits out their mangled remains─aye, the Eorzean Nimble Warrior course!"},{"name":"HAERMAGA","text":"We've had some issues here and there which prevented us from constructing the course anew for a time, but we made it work this year to satisfy the fierce demand from our patrons."},{"name":"HAERMAGA","text":"It hasn't merely returned, however─oh no, it's been updated and refined with a new circuit. I daresay it's a course...reborn!"},{"name":"HAERMAGA","text":"While the new circuit isn't physically demanding, it's no less a spectacle. We recruited the finest Gold Saucer technicians and a certain bomb expert to craft so many bombs into the new attraction, it feels like a damned volcano's erupting when they go off!"},{"name":"HAERMAGA","text":"Aye, 'tis a trial that tests the resolve of fledgling and experienced adventurers alike, as all are forced to not only calculate the timing of the impending explosions, but avoid the shockwaves that follow them too. If you think you're up to the task, then by all means, show everyone how it's done!"},{"name":"HAERMAGA","text":"Heh, you look eager to try your hand at it despite all the risks. And yet I don't get the sense that you're underestimating the challenge before you either... &lt;sigh&gt; It would do the young lad good to see the temperament of a veteran like yourself. Would that he could learn from your example..."},{"name":"HAERMAGA","text":"Ah, it's nothing─just, this talk about the course in all its newfound glory brought to mind a certain worrisome adventurer."},{"name":"HAERMAGA","text":"...Hm."},{"name":"HAERMAGA","text":"Look, you wouldn't mind lending me a hand with something, would you? When you're not busy running the course, naturally. Give me a shout after this if you're interested."},{"name":"HAERMAGA","text":"You'll lend a hand then? You have my gratitude. The matter in question is in regards to a certain new...ah, I suppose he isn't new anymore. Well, anyway, I want you to act as a model of sorts for a certain young adventurer."},{"name":"HAERMAGA","text":"He's no stranger to you of course─recall a fellow by the name of R'fhul Tia? Came to the Moonfire Faire with his little sister R'mahja before, remember? The lad went and became an adventurer, and seems to have some experience under his belt now, but..."},{"name":"HAERMAGA","text":"The lad's name is R'fhul Tia. Comes to the Moonfire Faire regularly with his little sister R'mahja, and seems to be a well-meaning fellow for the most part. Recently, though..."},{"name":"HAERMAGA","text":"Well, to be frank, he's putting on airs. You'd better see him for yourself to get the real picture. I saw him heading to the north of the island with his sister earlier─you should be able to find him there."},{"name":"HAERMAGA","text":"While he has his issues, there's no doubt in my mind that he has a promising future as an adventurer. I'll leave it up to you to decide how you want to go about it, but guide him back onto the right path, would you?"},{"name":"HAERMAGA","text":"R'fhul Tia should be somewhere on the north side of the island. How you go about it is up to you─just guide him back onto the right path."},{"name":"RMAJHA","text":"I begged my brother to bring me again this year, I just love it sooo much! And it's even more fun because he's with me!"},{"name":"ADVENTURERA04540","text":"W-Wait a minute, you're...I can't believe this, you're like one of my heroes!"},{"name":"ADVENTURERB04540","text":"Well, this is a pleasant surprise. Our mentor predicted you would join the festivities."},{"name":"RFHULTIA","text":"Long time no see, <span class=\"highlight\">Forename</span>! I had a feeling we'd meet again. Don't be shy now, Majha!"},{"name":"RMAJHA","text":"Hello, <span class=\"highlight\">Forename</span>! I'm so happy you're here. Today just keeps getting better and better!"},{"name":"RFHULTIA","text":"Ah, might you be <span class=\"highlight\">Forename</span>? It's an honor to finally meet you! O-Oh, and this right here is my little sister!"},{"name":"RMAJHA","text":"Pleased to meet you, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> Adventurer! My name is R'majha! Will you be playing with us today?"},{"name":"RFHULTIA","text":"Since you're here, there's something I want to tell you... Though I've only been an adventurer for a few summers, I've already made a name for myself. Hells, I even have a pair of apprentices!"},{"name":"RFHULTIA","text":"I suppose you'd expect as much for someone of my obvious talent, eh?"},{"name":"RFHULTIA","text":"Anyway, where was I? Oh, right─my apprentices. Go on, introduce yourselves!"},{"name":"ADVENTURERA04540","text":"Hello there, friend! The pair of us are just your average friendly ol' novice adventurers who wound up taking up an apprenticeship under our mentor here after he saved us from a sticky situation─he's a big fan of yours, by the way!"},{"name":"ADVENTURERA04540","text":"The mentor we respect respects you, so if you really think about it, we ought to respect you too! And anyone who commands that much respect is clearly incredible. It's an honor, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>─truly!"},{"name":"ADVENTURERB04540","text":"I've heard all kinds of amazing rumors about you, <span class=\"highlight\">Forename</span>. It's a pleasure to finally make your acquaintance."},{"name":"RFHULTIA","text":"So, I take it you also heard about <span class=\"emphasis\">the challenge</span> and decided to join in the festivities?"},{"name":"RFHULTIA","text":"I won't lie, I'm itching to give the course a go myself! I hear they've even added a new bombastic circuit to it. Though, for a prodigy like me who completed it as a novice..."},{"name":"RFHULTIA","text":"The real challenge'll be not to fall asleep from boredom. Heh, a rising star like me has nowhere to go but up, after all!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Good luck."},{"name":"A1","text":"You could try, you know, not being cocky as well?"},{"name":"A1","text":"...You've completed the course before?"},{"name":"RFHULTIA","text":"Heh, I appreciate the sentiment, but I'll be fine. It'll be easy enough to dazzle the audience."},{"name":"RFHULTIA","text":"Still, it's an honor to be encouraged by the person I look up to─thank you!"},{"name":"RFHULTIA","text":"Nonsense, I'm being confident, not cocky! It just comes naturally to me─I guess this is what happens when you become a respectable adventurer, eh?"},{"name":"RFHULTIA","text":"Watch me out there, <span class=\"highlight\">Forename</span>. When I tear through that course, you'll understand what I'm capable of!"},{"name":"RFHULTIA","text":"Wh-What are you saying, <span class=\"highlight\">Forename</span>! And in front of my impressionable apprentices no less! You should be well aware of my historic achievement!"},{"name":"RFHULTIA","text":"Make no mistake, I've completed the course. The old me who made one blunder after another is gone. You'll see, just watch!"},{"name":"RMAJHA","text":"Are you sure you're okay, Fhul? You've been acting odd lately..."},{"name":"RFHULTIA","text":"Am I okay? Hah! I'm better than ever. Don't you worry one bit, Mahjaーyour big brother's a fully fledged adventurer now. I'll give the crowd a show and be back before you know it."},{"name":"FHULTIA","text":"From the moment I became an adventurer, I've always looked up to you. There's no one I want witnessing my finest achievement more than you, so if you can spare a moment to watch, please wait for me on the beach."},{"name":"RMAJHA","text":"Fhul..."},{"name":"ADVENTURERA04540","text":"It'll be okay, Majha. It's your brother after all. He'll pull through, surely..."},{"name":"ADVENTURERB04540","text":"Yes, I'm sure you have nothing to worry about, my dear..."},{"name":"RMAJHA","text":"You'll come too, won't you? I'll feel better if you're there!"},{"name":"HAERMAGA","text":"Damn you, Beaudefoin..."},{"name":"HAERMAGA","text":"...Eh? Ah, it's nothing. Don't concern yourself with my problems. R'fhul needs all the help he can get."},{"name":"RMAJHA","text":"Fhul... I really hope he'll be okay."},{"name":"ADVENTURERA04540","text":"It wasn't so long ago─the day R'fhul rescued us, I mean. We didn't know left from right, but still thought we had the chops to take on a rampaging beast. We'd have died had R'fhul, who happened to be passing by, not put his life on the line for us."},{"name":"ADVENTURERA04540","text":"Thinking back on it, the way he fought was downright clumsy─even to my eyes. But I will never forget how desperately he fought to save us... He showed us what it truly means to be an adventurer."},{"name":"ADVENTURERA04540","text":"That's why we decided to follow him. I know he'll do his best out there today, because that's the kind of man he is!"},{"name":"ADVENTURERB04540","text":"Recently, R'fhul's been... Sorry. Forget I said anything."},{"name":"RMAJHA","text":"Do you see my brother? I can't see anything from here..."},{"name":"BEAUDEFOIN","text":"(-???-)Aha, I sense a damsel in distress! Fear not, young maiden, for we are here to the rescue!"},{"name":"BEAUDEFOIN","text":"(-Beaudefoin-)Ahem... Let the games begin! I, Beaudefoin, will humbly serve as herald of the proceedings."},{"name":"HAERMAGA","text":"(-Haermaga-)&lt;sigh&gt; ...And I, Haermaga, have been unjustly nominated to assist him."},{"name":"BEAUDEFOIN","text":"(-Beaudefoin-)Together, not even the slightest happening shall escape our ardent observation!"},{"name":"BEAUDEFOIN","text":"(-Beaudefoin-)Now then, let us look upon our contestant, the up-and-coming adventurer R'fhul Tia! With such a daunting trial before him, who knows what could be running through his mind right now. What do those stern blue eyes of yours see, Haermaga?"},{"name":"HAERMAGA","text":"(-Haermaga-)The lad looks eager to get up and at it, and in terms of physique, he looks to be in fine shape. That said, I can't help but notice some nervous energy in him as well."},{"name":"BEAUDEFOIN","text":"(-Beaudefoin-)Thank you, Haermaga. Let's wish him the best of luck out─ Ah! The contestant has just took off at a run, and is presently making his way to the first jet of water!"},{"name":"BEAUDEFOIN","text":"(-Beaudefoin-)And he soars through the sky expertly! Wow, just look at that landing!"},{"name":"HAERMAGA","text":"(-Haermaga-)A splendid feat indeed. He managed it all without losing his footing. This is proof of his experience as an adventurer─he's well accustomed to moving under pressure─or above it, as it were."},{"name":"BEAUDEFOIN","text":"(-Beaudefoin-)And now, he is faced with a decision that will change the course of his fate. Does he take the tried-and-true path, or try his luck at the new circuit..."},{"name":"BEAUDEFOIN","text":"(-Beaudefoin-)Which route do you think our sprightly contender will take, Haermaga?"},{"name":"HAERMAGA","text":"(-Haermaga-)The new circuit requires a contestant to be calm and collected in the face of a looming barrage of bombs. Unfortunately, I sense much fear in this one. If I were in his shoes, I would pick the old circuit without a second thought..."},{"name":"BEAUDEFOIN","text":"(-Beaudefoin-)Ah, he's on the move! It seems he's made his decision: the new circuit! The timing of his movements leave much to be desired, however..."},{"name":"HAERMAGA","text":"(-Haermaga-)Even the slightest moment's hesitation could lead to a messy result, and I fear he teetered for too long... Cover your eyes folks, this could get ugly."},{"name":"BEAUDEFOIN","text":"(-Beaudefoin-)He managed to dodge the first explosion! And the second, the third, and the─"},{"name":"BEAUDEFOIN","text":"(-Beaudefoin-)Gods be good, the shockwave of the fourth explosion has sent him flying like a shooting star!"},{"name":"BEAUDEFOIN","text":"(-Beaudefoin-)Ladies and gentlemen, even as the seawater salts his wounds, I regret to inform you that our contestant has been disqualified!"},{"name":"RMAJHA","text":"No, no, no, this is bad! This is really, really bad!"},{"name":"BEAUDEFOIN","text":"(-Beaudefoin-)Well, there goes our audience. This seems as fine a place as any to end the commentary. Please, go. R'fhul needs your help."},{"name":"HAERMAGA","text":"(-Haermaga-)Right. I hope you haven't forgotten my request. I'm counting on you."},{"name":"HAERMAGA","text":"Blast that Beaudefoin, the wily little bastard. I told him hundreds of times I'm not interested in this nonsense, but he still managed to get his way in the end... Er, mind if I ask what you thought of my─you know what, never mind. I don't want to know... "},{"name":"BEAUDEFOIN","text":"I leave the matter of R'fhul Tia's rescue in your capable hands! "},{"name":"RMAJHA","text":"Fhul! Are you hurt?"},{"name":"ADVENTURERA04540","text":"Not like this, R'fhul...not like this."},{"name":"ADVENTURERB04540","text":"I had my suspicions, but I hoped they wouldn't prove to be true..."},{"name":"RFHULTIA","text":"I-I owe you one, <span class=\"highlight\">Forename</span>..."},{"name":"RFHULTIA","text":"Ah, lest you all misunderstand, that wasn't a <span class=\"emphasis\">serious</span> attempt. If I really wanted to complete the course, I could've done it with my hands behind my back!"},{"name":"RFHULTIA","text":"But it'd hardly be entertaining if I just finished it in an instant. There's no drama. Now, when I go back and complete it with ease, the crowd'll go wild! Genius, eh?"},{"name":"ADVENTURERA04540","text":"Wait a minute, R'fhul... Is that what you really care about? If so, you're not the person I thought you were─the person I respected."},{"name":"RFHULTIA","text":"Oh, uh, erm, I mean... I'm not just your average adventurer, you know? I need to amaze everyone!"},{"name":"ADVENTURERB04540","text":"No, R'fhul... You're wrong. I guess you never understood what we admired about you. I'm sorry...but this is farewell."},{"name":"RFHULTIA","text":"Wh-What... What did I do wrong!?"}],"reward":{"gil":745},"reqs":{"jobs":[{"lvl":30,"id":1}]},"next":[70077]},"partials":[{"type":"npc","id":"1042684","obj":{"i":1042684,"n":"Mayaru Moyaru","l":28,"q":1,"t":"Moonfire Faire Chaperone"}},{"type":"npc","id":"1042707","obj":{"i":1042707,"n":"R'fhul Tia","l":32,"q":2}},{"type":"quest","id":"70077","obj":{"i":70077,"n":"Fhul Me Once","g":201,"l":"Eastern La Noscea","s":221}}]}