{"quest":{"name":"Fhul Me Once","location":"Eastern La Noscea","id":70077,"patch":6.1,"sort":221,"icon":101163,"eventIcon":71221,"issuer":1042707,"target":1042685,"genre":201,"journal":["R'fhul Tia is mired in the depths of despair.<br>※This quest is available for a limited time only.","R'fhul is unresponsive to the sound of your voice. He may need a bigger gesture to wake him from his stupor, such as an attempt to /comfort him.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","After speaking with you and Beaudefoin, R'fhul Tia finally understands where he went wrong in his initial attempt through the Eorzean Nimble Warrior course. To inspire him to do his best, you have opted to join him in tackling the course this time. Speak with Beaudefoin to get started.","You have begun your attempt through the Eorzean Nimble Warrior course. Speak with Hildelana upon reaching the halfway point.","You have made it past the halfway point. Speak with P'obyano upon reaching the end of the course.","After completing the course, you proudly watch on from ahead as R'fhul Tia, following your example, tries his best to complete the course─and successfully manages to do so. Seeking a moment to rest, he suggests you take this opportunity to give R'mahja the good news.","After seeing their mentor try his best, R'fhul Tia and his impassioned pair of apprentices were able to make up. Your work concluded, it's time to report the day's events to Haermaga.","You have reported everything that happened to Haermaga. For the time being, it seems there is no need to worry about R'fhul Tia and his apprentices. It's time to relax, don your reward, and enjoy the festivities."],"objectives":["/comfort R'fhul Tia.","Speak with Beaudefoin.","Speak with Hildelana.","Speak with P'obyano.","Speak with R'mahja.","Report to Haermaga."],"dialogue":[{"name":"RMAJHA","text":"Please <span class=\"highlight\">Forename</span>, you have to do something! I've never seen my brother like this..."},{"name":"RFHULTIA","text":"Wh-Why... What did I do wrong?"},{"name":"RMAJHA","text":"He's too upset to listen..."},{"name":"RMAJHA","text":"Maybe you could try to <span class=\"highlight\">comfort</span> him? You're his hero, so if that doesn't work, I don't know what will!"},{"name":"RMAJHA","text":"Please <span class=\"highlight\">comfort</span> him, <span class=\"highlight\">Forename</span>!"},{"name":"RFHULTIA","text":"&lt;sniff&gt; How could this happen... I don't understand..."},{"name":"SYSTEM","text":"R'fhul Tia is gravely despondent. Perhaps <span class=\"highlight\">comfort</span> from the person he admires will lift his spirits."},{"name":"RFHULTIA","text":"Thank you for showing me such kindness, <span class=\"highlight\">Forename</span>. I'm still trying to wrap my head around why those two left. Is it because I failed the course? Because I looked pathetic?"},{"name":"RMAJHA","text":"No, silly, that's not it at all!"},{"name":"RFHULTIA","text":"Really? It's <span class=\"emphasis\">not</span> because I looked pathetic?"},{"name":"RFHULTIA","text":"Erm... Say, <span class=\"highlight\">Forename</span>, do you have any idea why?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It's because you failed. Miserably."},{"name":"A1","text":"You weren't taking it seriously."},{"name":"A1","text":"You tried to hide from your mistakes."},{"name":"RMAJHA","text":"That's true, but that's not the point! It's because he wasn't taking it seriously!"},{"name":"RMAJHA","text":"Exactly, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>'s exactly right! You didn't take the challenge seriously at all!"},{"name":"RMAJHA","text":"Hide...from a mistake? I don't quite understand, but it sounds wise! You didn't look like you were taking it seriously, Fhul!"},{"name":"RFHULTIA","text":"I wasn't taking it seriously...? So what? Even if I had, I would've failed all the same. I thought if I did it on purpose, then maybe..."},{"name":"RMAJHA","text":"Ugh! Who would admire someone who gives up before they've even started? The brother I look up to always does his best, no matter how he looks or what others think of him!"},{"name":"RMAJHA","text":"If you can't understand that, maybe I'll try the course myself and show you what I mean!"},{"name":"BEAUDEFOIN","text":"(-???-)My, that is some <span class=\"emphasis\">remarkable</span> gumption you have there little miss! Alas, I'm afraid children may not, under absolutely any circumstances, participate in the competition."},{"name":"BEAUDEFOIN","text":"(-Beaudefoin-)I hope you don't mind, but I overheard your conversation. My opinion? You're a pathetic excuse for an adventurer, R'fhul. Just awful."},{"name":"RFHULTIA","text":"...Y-You're right. You taught me so much, yet I put on such a miserable performance. Everyone must think I'm so very pitiful..."},{"name":"BEAUDEFOIN","text":"(-Beaudefoin-)Just listen to yourself, lad. You want to know what your problem is? Vanity. You've lost sight of what's truly important."},{"name":"BEAUDEFOIN","text":"(-Beaudefoin-)Think back. Try to recall what Haermaga and I taught you─what it was that you admired about <span class=\"highlight\">Forename</span> in the first place."},{"name":"RFHULTIA","text":"I...I think I finally understand. I was so focused on trying to impress my apprentices that I didn't fully commit myself to overcoming the challenge, and stopped being an adventurer in so doing... Aye, I became a coward instead."},{"name":"RFHULTIA","text":"I─I betrayed their trust, and now they've seen me for what I truly am. There's no way I could make it up to them..."},{"name":"RMAJHA","text":"What if you tried the course again, but took it seriously this time? I bet those two would watch!"},{"name":"RFHULTIA","text":"Again? But I've never actually succeeded. If I were to fail once more, I'd lose their respect forever..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"It doesn't matter if you fail or succeed. What matters is that you try."},{"name":"A2","text":"Show us what you're made of, adventurer."},{"name":"RFHULTIA","text":"<span class=\"highlight\">Forename</span>... Thank you! I nearly made the same mistake all over again. This time, I promise you, I will do my best!"},{"name":"RFHULTIA","text":"Adventurer... You're right─I'm an adventurer! I need only focus on the challenge ahead!"},{"name":"RFHULTIA","text":"I'm sorry to ask more of you when you've already done so much, but can I ask you to serve as my inspiration once more? If possible, I would like you to go through the course ahead of me."},{"name":"RFHULTIA","text":"Seeing you test your mettle would rekindle my aspirations of becoming a great adventurer. Please, help me to reclaim that dream─let me follow in your footsteps!"},{"name":"RFHULTIA","text":"You doing this─it means the world to me, <span class=\"highlight\">Forename</span>. I will follow after you with everything I have! "},{"name":"RMAJHA","text":"You can do it, <span class=\"highlight\">Forename</span>!"},{"name":"RFHULTIA","text":"I know I can do my best if I'm following after you. When you begin your run through the course, I'll be there, right behind you."},{"name":"BEAUDEFOIN","text":"I appreciate you looking out for R'fhul like this. If you're ready to go, the jet of water yonder is roaring in anticipation of your arrival!"},{"name":"SYSTEM","text":"Should completing the Eorzean Nimble Warrior course prove difficult, seek out a faire adventurer for assistance."},{"name":"BEAUDEFOIN","text":"Forget about R'fhul while you're jumping through obstacles, dodging explosions, and what have you─just relax, and have a good time! That will prove more fruitful to the lad in the end, anyway."},{"name":"ADVENTURERA04541","text":"You look like you've seen your share of adventure. Hells, I wager you could get through a silly ol' course like this with your eyes closed. That would be something to see─care to show the amateurs how it's done?"},{"name":"SYSTEM","text":"Choosing to close your eyes will take you directly to the end of the first platforming section."},{"name":"Q4","text":"Amaze onlookers and yourself by undertaking the course with your eyes closed?"},{"name":"Q5","text":"Proceed to the end of the first platforming section?"},{"name":"HILDELANA","text":"Beaudefoin's kept me abreast of the situation, and after seeing the way you've carried yourself through the course so far, R'fhul's <span class=\"emphasis\">gotta</span> be fired up!"},{"name":"HILDELANA","text":"You're already at the halfway point, so it's not like you need to hear it from me, but good luck!"},{"name":"SYSTEM","text":"Should completing the Eorzean Nimble Warrior course prove difficult, seek out a faire adventurer for assistance."},{"name":"HILDELANA","text":"Just halfway to go! I'll be watching how you and R'fhul manage from here!"},{"name":"ADVENTURERB04541","text":"Well, well, well, what do we have here...an adventurer head and shoulders above the rest. If the remaining obstacles are to prove a challenge, I believe a handicap is in order. Why not do the rest of the course blind? You're not afraid of a little danger...are you?"},{"name":"SYSTEM","text":"Choosing to close your eyes will take you directly to the end of the course."},{"name":"Q6","text":"Prove your courage to the cheeky faire adventurer by undertaking the course with your eyes closed?"},{"name":"Q7","text":"Proceed to the end of the course?"},{"name":"POBYANO","text":"Congratulations on making it to the end! Ah, I should mention that I've heard about the situation with R'fhul. He pursued you the entire time, never giving up despite the fear in his eyes. Even now...hey, look behind you!"},{"name":"Q3","text":"What will you shout?"},{"name":"A3","text":"Come on, adventurer!"},{"name":"A3","text":"Do not waver! You can do this!"},{"name":"RFHULTIA","text":"I did it, <span class=\"highlight\">Forename</span>! I really did it! Thank you for leading the way!"},{"name":"RFHULTIA","text":"Hah, now that I've made it to the end, I suddenly feel lightheaded... Forgive me, I will return after I've had a moment to catch my breath. Would you mind relaying the good news to Mahja?"},{"name":"BEAUDEFOIN","text":"Bravo, bravo! A job well done─though I expected no less."},{"name":"HILDELANA","text":"Expertly done, <span class=\"highlight\">Forename</span>! Seems R'fhul managed to keep behind you the whole way. A seasoned adventurer like you can bring out the best in anyone, eh?"},{"name":"POBYANO","text":"I was absolutely moved by─well, the way you moved through the course! But I must admit, it was even more touching to see R'fhul gain confidence as he pushed on. Truly, this is the way adventurers are meant to be!"},{"name":"RFHULTIA","text":"Sorry I couldn't keep up with you to the very end. My heart may very well burst out of my chest if it beats any faster, so I'm going to rest here for a bit... In the meantime, please let Mahja know what happened."},{"name":"RMAJHA","text":"Oh, you're back! How'd it go? Beaudefoin and Haermaga were “comment-trading,” but I want to hear about it from you!"},{"name":"RMAJHA","text":"He did it─he really did it! I always believed Fhul could, but he never believed it himself. I'm so happy..."},{"name":"RMAJHA","text":"Fhul! <span class=\"highlight\">Forename</span> told me <span class=\"emphasis\">everything</span>. I'm so proud of you!"},{"name":"RFHULTIA","text":"Oh, I didn't do much. Just followed after <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>, really. Still...it felt good to try, and finally succeed at something."},{"name":"ADVENTURERB04541","text":"Please excuse us for interrupting, R'fhul. Do you have a moment?"},{"name":"ADVENTURERA04541","text":"We... We judged you too quickly, and too harshly. It was only when we saw you making your way through the course that it dawned on us how wrong we'd been."},{"name":"ADVENTURERA04541","text":"That's why..."},{"name":"RFHULTIA","text":"You don't have to finish that sentence. I'm the one in the wrong here, after all. I...I am so very sorry, both of you!"},{"name":"RFHULTIA","text":"I let my desire for recognition cloud my judgment, and lost sight of myself in the process. It's little wonder you both reacted the way you did."},{"name":"RFHULTIA","text":"That's why I'm starting over. This time, I will not waver from the path─nay, I shall follow wherever it leads, as a true adventurer should! With that said...do you think you could forgive me?"},{"name":"ADVENTURERB04541","text":"I'll be honest─you were a dismal sight up there at first, looking as if you might collapse at any moment. But you didn't. You pushed through like a true champion, and now we are keen to see how far you'll go. Just like when we first met you."},{"name":"ADVENTURERA04541","text":"Aye, that's why we want you to forgive us...for losing faith, instead of believing in you like we should've. Given the circumstances, I understand if you say no, but... Would you consent to being our mentor once again?"},{"name":"RFHULTIA","text":"Like you even have to ask. I couldn't be happier to have you both at my side!"},{"name":"RMAJHA","text":"Thank you for bringing Fhul back to his senses, <span class=\"highlight\">Forename</span>! If you hadn't, these three never would've made up, and I would still be really sad. So...thank you, so, so much! "},{"name":"RMAJHA","text":"I think we'll be okay now, so maybe you can do that “report” thing that Fhul always talks about? I don't really get it, but it seems important. And don't you worry about Fhul─I'll be watching him carefully!"},{"name":"RFHULTIA","text":"This whole ordeal started because of my own foolishness, yet you still held your hand out to me. I've said it before, and I'll say it again─you, my friend, are my inspiration!"},{"name":"ADVENTURERA04541","text":"Our mentor's mentor... Does that make you our grandmentor? It's like we're all one big family!"},{"name":"ADVENTURERB04541","text":"My entire life, everyone around me has called me cold...but watching you and R'fhul tackle the course lit a fire inside of me. I know now what I aspire to be."},{"name":"RMAJHA","text":"Did my brother thank you properly? Well, let me thank you again just to be safe! Oh, and please don't forget about the “report” thing!"},{"name":"BEAUDEFOIN","text":"My, what a satisfying conclusion to this tale! You simply <span class=\"emphasis\">must</span> regale it to Haermaga in all its glory!"},{"name":"HAERMAGA","text":"I could roughly see what happened from here, but I'd appreciate it if you filled in the blanks."},{"name":"HAERMAGA","text":"So the lad finally came to his senses in the end, eh? And he made up with those greenhorns while he was at it, too. You did well, <span class=\"highlight\">Forename</span>. I was right to count on you."},{"name":"HAERMAGA","text":"With that, he's truly made his first step as a proper adventurer─and better yet, I don't have to feel anxious about leaving the three of them to their own devices anymore."},{"name":"HAERMAGA","text":"Speaking of adventurers, I owe you a reward, don't I? Please, take this. You've more than earned it. And do try to enjoy the Moonfire Faire while it's around."},{"name":"HAERMAGA","text":"（★未使用／削除予定★）"},{"name":"BEAUDEFOIN","text":"（★未使用／削除予定★）"}],"reward":{"items":[{"id":36832},{"id":36833},{"id":36834},{"id":36835},{"id":36836}]},"reqs":{"jobs":[{"lvl":30,"id":1}],"quests":[70076]}},"partials":[{"type":"npc","id":"1042707","obj":{"i":1042707,"n":"R'fhul Tia","l":32,"q":2}},{"type":"npc","id":"1042685","obj":{"i":1042685,"n":"Haermaga","l":32,"q":1,"t":"Moonfire Faire Chairman"}},{"type":"item","id":"36832","obj":{"i":36832,"n":"Summer Sunset Bandana","l":1,"c":41978,"t":34,"p":1000}},{"type":"item","id":"36833","obj":{"i":36833,"n":"Summer Sunset Beach Cover-up","l":1,"c":42851,"t":35,"p":1000}},{"type":"item","id":"36834","obj":{"i":36834,"n":"Summer Sunset Wrist Torques","l":1,"c":44999,"t":37,"p":1000}},{"type":"item","id":"36835","obj":{"i":36835,"n":"Summer Sunset Bottoms","l":1,"c":47882,"t":36,"p":1000}},{"type":"item","id":"36836","obj":{"i":36836,"n":"Summer Sunset Sandals","l":1,"c":49481,"t":38,"p":1000}},{"type":"quest","id":"70076","obj":{"i":70076,"n":"A Matter of Course","g":201,"l":"Limsa Lominsa","s":220}}]}