{"quest":{"name":"A Soulful Reunion","location":"Lakeland","id":70079,"patch":6.15,"sort":110,"icon":101178,"unlocksFunction":1,"eventIcon":71341,"issuer":1042499,"target":1042512,"genre":71,"journal":["Hildibrand is back and full of spectral beans.","Inspector's Log:<br>I am myself again! Or am I? While I have come to realize the Forgiven Gentleman was no more than a figment of my imagination, the fact remains that my burly body and saintly soul have been separated from one another. I am trapped in this world of dazzling purple known as the First, unable to reunite with my physical form. But I have not yet begun to investigate─a solution will surely present itself in due course. You may rest assured, my good friends and beloved family, that Hildibrand Helidor Maximilian Manderville will not rest until he has been made whole!<br>　　　　　　　　　　　　*　*　*<br>Looking none the worse for wear despite taking an exploding projectile to the face, a moderately lucid Hildibrand declares his desire to return home to the Source. Though he appears to only tenuously grasp the process you explain this would entail, he is eager to forge ahead, heedless of any potential risks. Said process will require the assistance of Beq Lugg, who Theyler and Vonard assure you will be most happy to help. Course of action decided, you and your companions begin the trek back to the Crystarium and the Cabinet of Curiosity.","Hildibrand wastes no time in incurring the esteemed Nu Mou's ire by mistaking them for Moren's pet canine. In spite of this faux pas, Beq Lugg grudgingly agrees to help. Hildibrand's soul proves to be sufficiently resolute, and in short order you find yourself in possession of a spirit vessel bearing his memories and vital essence. After offering thanks and farewells, you prepare for a return journey to the Source.","Arriving back at Radz–at–Han, you are greeted by a panicking Nashu and a most distressing state of affairs: the sleeping Hildibrand has been kidnapped! With no clues or evidence as to the perpetrator, you and Nashu head out to the streets of Kama to conduct an investigation and locate the inspector before he comes to harm.","Questioning witnesses in Kama, you learn that while none saw anyone carrying the inspector's body, an individual carrying a massive sack was observed not a short while ago. With any luck, this knowledge will help you and Nashu narrow your search and find out whence─and by whom─Hildibrand has been spirited away.","In your absence, Nashu has made the acquaintance of one Delion, the editor of an occult periodical, who proffers the far-fetched theory that Inspector Hildibrand has been abducted by aliens. Doing your best to swiftly disabuse her of this notion, you prepare to take to the streets once more in search of the mysterious man with the oversized sack.","With Nashu at your side, you walk the streets of Kama in hopes of finding anyone who may have seen the sack-bearing suspect.<br><br>※You must be accompanied by Nashu to complete this task. Speak with her again should you become separated.","You learn the suspicious personage you seek was seen chatting with a merchant in the vicinity of the fountain on Alzadaal's Path. Perhaps a conversation with this man will enlighten you as to the identity of the kidnapper and Hildibrand's current whereabouts.","In good spirits due to his recent and unexpected windfall, the merchant is happy to inform you that he met with the individual you seek, and in fact sold the man his chocobo after having received a most generous offer. While the merchant knows naught of the mysterious sack's contents, he informs you that it and its bearer are bound for the beaches of Saltwind's Welcome. You and Nashu must make haste, before the inspector comes to harm!","From the shadows at Saltwind's Welcome, you watch as your quarry removes a comatose Hildibrand from his sack and offers the body to Jubraca─a revelation that is not surprising in the least given the merchant's previous chicanery. Moments later, he is joined by Doctor Lugae, an amalgamation of flesh and metal that you vaguely recall besting in the Tower of Babil. The doctor, who specializes in the creation of artificial life-forms, seeks the perfect physical specimen for use in his experiments─Hildibrand, apparently.<br><br>You and Nashu rush to your comrade's defense, prompting Lugae to attempt to flee with his prize, but a skillful toss of the spirit vessel serves to awaken the inspector. After an impressive display of agility, Hildibrand somehow finds himself atop Lugae's head, and subsequently triggers one of the doctor's shoulder-mounted missiles to launch. Straddling the projectile, the inspector is propelled beyond the heavens and briefly into the void beyond, before he begins his rapid descent. In a fit of desperation, Hildibrand mashes buttons on the missile itself, redirecting its course at the last instant into the fleeing Lugae's face.<br><br>When the ashes have settled, Lugae's head and Jubraca are taken into custody by the local authorities, while the miraculously not-dead Hildibrand dusts himself off and poses proudly atop the sands. His moment of triumph is short-lived, however, as a curious flying vessel not unlike the ones described by Delion descends from the heavens and entraps him with a beam of light before flying off to gods know where...","As she gazes at the sky, a dejected Nashu laments the inspector's disappearance after an all-too-brief reunion. With the excitement at an end for the time being, you follow her back to Radz–at–Han to offer what emotional support you may.","Nashu has never been one to remain in poor spirits for long, and so she vows to search high and low for information that will lead her to the abducted Hildibrand. Thanking you for your assistance, she bids you lend your aid once more when─not if─she finds herself with a credible lead."],"objectives":["Speak with Theyler in the Crystarium.","Deliver the gentlemanly spirit vessel to Nashu in Radz–at–Han.","Gather information in Kama.","Speak with Nashu.","Speak with Nashu and have her accompany you.","Gather information while Nashu is accompanying you.","Speak with the traveling merchant while Nashu is accompanying you.","Speak with Nashu at Saltwind's Welcome.","Speak with Nashu.","Speak with Nashu in Radz–at–Han."],"dialogue":[{"name":"SOLDIER03608","text":"I can't help but feel that this is <span class=\"emphasis\">not</span> what the Echo was intended for..."},{"name":"BRAVESOLDIER","text":"Explosions, dwarven deckings─is there nothing this man can't withstand?"},{"name":"NASHUMHAKARACCA","text":"Were you able to find the inspector's soul? I hope we can bring him back soon!"},{"name":"PARIGHA","text":"Oh, dear, I seem to be running low on amenities. I'll have to pay a visit to the markets after."},{"name":"HILDIBRAND","text":"While I've enjoyed what time I've spent in this far-flung First that I can remember, we should be getting back to our <span class=\"emphasis\">own</span> world soon. Would you happen to know how we might go about doing that?"},{"name":"HILDIBRAND","text":"Restore my soul...with a “spirit vessel”?"},{"name":"HILDIBRAND","text":"Say no more! Your cursory description was more than enough for me to grasp the concept completely. It is not unlike brewing the perfect cup of coffee. Which means our task is clear: we require the services of a skilled soul sommelier!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We require the services of Beq Lugg."},{"name":"A1","text":"I know a soul sommelier named Beq Lugg."},{"name":"HILDIBRAND","text":"Splendid! I see that even in this world, you rub shoulders with the cream. Let us pay this Beq Lugg a visit."},{"name":"SOLDIER03608","text":"I'm not sure what you're plotting to do with souls, but if you require Beq Lugg's assistance, we can help."},{"name":"BRAVESOLDIER","text":"Aye, they've aided us time and again, and I reckon they'd do the same for your friend here. Come with us to the Cabinet of Curiosity."},{"name":"HILDIBRAND","text":"Though I am eager to return home, I will miss this strange world. Perhaps we can visit it again someday? Surely there are cases here that require my preeminent powers of deduction!"},{"name":"BRAVESOLDIER","text":"Seeing as he's a friend of the Warrior of Darkness <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> I should've known, but this Hildibrand is no ordinary man..."},{"name":"SOLDIER03608","text":"If you're ready, I'll call for Beq Lugg."},{"name":"HILDIBRAND","text":"Ah, the genius soul sommelier! You come highly recommended by <span class=\"highlight\">Forename</span>. And what an adorable little puppy you have!"},{"name":"MOREN","text":"Soul what? <span class=\"emphasis\">Puppy</span>? I beg your pardon, but there seems to be some confus─"},{"name":"BEQLUGG","text":"Puppy!? Who is this imbecile, <span class=\"highlight\">Forename</span>!?"},{"name":"BEQLUGG","text":"I've half a mind to make him dig a hole so I can throw him in it! Hmph! But...I presume he is a friend of yours, and one in need no less?"},{"name":"BEQLUGG","text":"What!? <span class=\"emphasis\">Another</span> of your friends that needs to be sent back to the Source?"},{"name":"BEQLUGG","text":"Have you forgotten how complex and difficult it was to do it the last time? Yet you waltz in here and ask me this favor with the air of one shopping for a new hat..."},{"name":"BEQLUGG","text":"His case is no different from the others, at least... He is present only in soul, as they were."},{"name":"BEQLUGG","text":"We'll need another spirit vessel, of course. You don't happen to have one on you already, do you?"},{"name":"BEQLUGG","text":"Entrusted to you by the Crystal Exarch, you say? Heh. If only he knew how you were using it."},{"name":"BEQLUGG","text":"Fortunately, I have a porxie on hand. We've been using it to treat patients at risk of transforming into eaters, but I suppose it's due for a change of pace."},{"name":"BEQLUGG","text":"There is, however, one concern. In case I didn't make it clear before, the process can place great strain upon one's soul. If he is lacking in resilience, there is a chance his will not survive─that his very essence will be rent asunder..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"That's a risk I'm willing to take."},{"name":"A2","text":"After what he's lived through, it would be implausibly anticlimactic for him to die like that."},{"name":"HILDIBRAND","text":"Haha! <span class=\"highlight\">Forename</span> knows me all too well! I assure you, my good sommelier who is most certainly <span class=\"emphasis\">not</span> a dog─you needn't worry for Hildibrand Helidor Maximilian Manderville!"},{"name":"BEQLUGG","text":"...Yes. I get the distinct impression that the gods themselves could not kill him if they tried. And they have."},{"name":"BEQLUGG","text":"Come along, then, Hildi-I-can't-be-bothered-to-remember-that-name."},{"name":"HILDIBRAND","text":"A thousand thanks! Simply point me to the soul siphon, and I shall hop right in!"},{"name":"BEQLUGG","text":"The rest of you can wait here. I promise I won't hurt him...no matter how much I might be tempted."},{"name":"BEQLUGG","text":"You will be pleased to know that the process was smooth and uneventful. Honestly, I was hoping for more of a challenge..."},{"name":"BEQLUGG","text":"All you need do is to take his spirit vessel back to the Source and bring it in contact with his corporeal body. He should awaken immediately with his soul and memories intact."},{"name":"SOLDIER03608","text":"If there's nothing else, Vonard and I should be getting back to our duties."},{"name":"SOLDIER03608","text":"It was a pleasure, <span class=\"highlight\">Forename</span>─if all too brief. I won't pretend I understood even a fraction of what happened, but I'm glad I was there for it."},{"name":"BRAVESOLDIER","text":"Till we meet again! Rest assured that Theyler and I will be doing our damndest to look after the people here in your absence."},{"name":"PARIGHA","text":"I swear, we only left him alone for a moment! It's not possible!"},{"name":"NASHUMHAKARACCA","text":"You're back─and not a moment too soon! We have an emergency on our hands!"},{"name":"NASHUMHAKARACCA","text":"The inspector's soul is in this, you say? That's great, but we have another problem now─the inspector's <span class=\"emphasis\">body</span> has gone missing!"},{"name":"NASHUMHAKARACCA","text":"We went to the markets to do some shopping, and when we came back, he was nowhere to be seen!"},{"name":"PARIGHA","text":"I double-checked that every door was locked before we left! But there's nothing to suggest someone forced their way in..."},{"name":"NASHUMHAKARACCA","text":"We've got a case on our hands: the case of the evaporating inspector! We must begin our investigation at once!"},{"name":"NASHUMHAKARACCA","text":"Come on, let's start looking for witnesses!"},{"name":"PARIGHA","text":"Was anything else stolen? Oh, this is so distressing..."},{"name":"NASHUMHAKARACCA","text":"Tell me <span class=\"emphasis\">everything</span> you know! The inspector's life is in jeopardy!"},{"name":"DAVAAZ","text":"Did I see anyone get carried out of that house, you ask?"},{"name":"DAVAAZ","text":"I was too distracted with stocktaking to make note of any comings or goings. Sorry I couldn't be of more help."},{"name":"MEHBAHT","text":"I didn't see anyone carry a person out of that house, no..."},{"name":"MEHBAHT","text":"...But I <span class=\"emphasis\">did</span> see a man carrying a particularly large sack─so heavy he strained to lift it. I didn't think much of it at the time, but now that you mention it, it was a bit suspicious."},{"name":"DAVAAZ","text":"As I said, matters of inventory have commanded my full attention of late. Perhaps someone else will be of more help to you?"},{"name":"MEHBAHT","text":"I suppose the sack was large enough that it could have conceivably contained a full-grown person. It looked terribly heavy..."},{"name":"DELION","text":"Yes, this is a most distressing situation, indeed..."},{"name":"NASHUMHAKARACCA","text":"Ah, there you are! This man says he has vital information that will help us in our investigation!"},{"name":"DELION","text":"(-Delion-)A pleasure to make your acquaintance. I am Delion, editor in chief of <span class=\"emphasis\">The Thavnairian Truth</span>, a monthly publication devoted to exploring unexplained and otherworldly phenomena of our isle."},{"name":"DELION","text":"(-Delion-)Your companion shared with me the news of your friend's disappearance, and I happen to know precisely who is behind the incident. But I fear you may not like the answer, for the kidnapper...is not of this star."},{"name":"DELION","text":"(-Delion-)They come from the heavens─from beyond the great expanse. They descend in curious, saucer-shaped airships to <span class=\"emphasis\">study</span> our world... Our society, our buildings, our very <span class=\"emphasis\">bodies</span>..."},{"name":"DELION","text":"(-Delion-)...You shudder, no doubt, as you realize of whom I speak. “It couldn't be,” you protest! Oh, but it could...and it <span class=\"emphasis\">is</span>. Your dear friend the inspector...has been abducted by <span class=\"emphasis\">aliens</span>!"},{"name":"DELION","text":"(-Delion-)\"Oh, but he'll be fine,“ you assure yourself! ”After all, they just want to understand us better!“ You poor, deluded child. That they do, but to what end? Why else? That they might one day <span class=\"emphasis\">take over our world</span>!"},{"name":"DELION","text":"(-Delion-)What is worse, they plot to do so with the aid of <span class=\"emphasis\">collaborators</span>! For the Sharlayans are in league with our would-be overlords, providing the aliens with vital information on our vulnerabilities in exchange for a position of power within their regime."},{"name":"DELION","text":"(-Delion-)The “Final Days” was also the work of these alien invaders─an attempt to sow chaos, that our world would be easier to conquer. Blessedly, it was thwarted─if only by dumb luck, as those that did the thwarting were blissfully unaware of the true nature of the threat."},{"name":"DELION","text":"(-Delion-)I had hoped the setback would discourage the aliens from coming back, if not move them to abandon their ambitions. But it would seem events have only emboldened them, if they are indeed carrying out abductions here in Radz–at–Han!"},{"name":"DELION","text":"(-Delion-)Even as we speak, your friend lays prone on a sterile bed in their base on the surface of the moon, where they poke and probe him with inscrutable instruments as their floppy ears wiggle with fiendish delight! Ah, but I have said too much! I must continue my investigation in secret. The fate of our world is at stake!"},{"name":"NASHUMHAKARACCA","text":"Oh no! That sounded awful! We have to go to the moon and save the inspector at once!"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"I think he was a few materia short of a full meld."},{"name":"A3","text":"At least he got the floppy ears part right..."},{"name":"NASHUMHAKARACCA","text":"Hmm? So you <span class=\"emphasis\">don't</span> think the inspector is somewhere getting probed by aliens? But if not them, then who's probing him?"},{"name":"NASHUMHAKARACCA","text":"A man carrying a suspiciously large sack? That sounds promising! Maybe someone else can tell us more."},{"name":"DHARITRI","text":"I do so enjoy people watching, and there is no place more suited to the pastime than this bridge..."},{"name":"MERCHANT04543","text":"Hahaha! Talk about an unexpected windfall..."},{"name":"NASHUMHAKARACCA","text":"Someone up ahead may have seen something. Let's ask around!"},{"name":"SYSTEM","text":"Nashu is now accompanying you. Keep her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Nashu behind by entering a different area, or by speaking with her and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Nashu accompany you again, return and speak with her at the original location."},{"name":"DHARITRI","text":"The man with the sack? Indeed, I couldn't help but take note of him as he passed, trying so very hard to be inconspicuous as he was."},{"name":"DHARITRI","text":"He descended to Alzadaal's Path, then went over to the fountain, where he met with a merchant I believe. Such a hefty sack it was─my mind was racing with the possibilities of what it might contain."},{"name":"NASHUMHAKARACCA","text":"That had to be our man, right? We need to hunt down that merchant!"},{"name":"Q4","text":"What will you do?"},{"name":"A4","text":"Speak with Nashu."},{"name":"A4","text":"Part ways with Nashu."},{"name":"A4","text":"Nothing."},{"name":"NASHUMHAKARACCA","text":"If anyone can lead us to Inspector Hildibrand, it'll be that man with the large sack. I know it!"},{"name":"A5","text":"<span class=\"highlight\">Discuss the Arkasodara.</span>"},{"name":"NASHUMHAKARACCA","text":"Parigha and his family are the nicest people! They've got such gentle eyes and long snouts, too─longer than anyone I've ever met in Eorzea."},{"name":"A6","text":"<span class=\"highlight\">Discuss the fountain.</span>"},{"name":"NASHUMHAKARACCA","text":"It's incredible, isn't it? It reminds me of the giant statue of Lord Godbert at the Gold Saucer! Once the inspector's back on his feet, we'll have to show him!"},{"name":"SYSTEM","text":"Are you sure you wish to part ways with Nashu?"},{"name":"NASHUMHAKARACCA","text":"Don't tell me you've got another case? Well, if duty calls. I'll wait for you back in Kama. But come back soon─the inspector's counting on us!"},{"name":"NASHUMHAKARACCA","text":"Finished? Wonderful! Let's get back to our case. Where were we again...?"},{"name":"SYSTEM","text":"You must be accompanied by Nashu and have her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"Nashu has yet to arrive. Be sure she is at your side before attempting to continue."},{"name":"DHARITRI","text":"The man you're looking for descended to Alzadaal's Path, and was talking to a merchant by the fountain there. If you find out what was in the sack, please tell me─the mystery is too much to bear!"},{"name":"MERCHANT04543","text":"A man with a large sack? Hah! You bet I saw him. In fact, I sold him my chocobo!"},{"name":"MERCHANT04543","text":"At first, I told him to get lost. That bird and I go way back, and so forth. But he was in a hurry, and his offer was <span class=\"emphasis\">very</span> generous."},{"name":"MERCHANT04543","text":"When you're in my line of work, you can't afford to get too sentimental. And now I can buy a whole stable's worth of chocobos!"},{"name":"NASHUMHAKARACCA","text":"Did he say where he was planning to go next?"},{"name":"MERCHANT04543","text":"He was muttering something about having to get to Saltwind's Welcome in a hurry. Probably why he was desperate for a chocobo. It's a long way to go on foot, never mind the sack."},{"name":"NASHUMHAKARACCA","text":"Did you hear that, <span class=\"highlight\">Forename</span>!? We need to head to Saltwind's Welcome right away!"},{"name":"MERCHANT04543","text":"If you want to catch your man, you should look for him at Saltwind's Welcome. I can't imagine that he's moved on that quickly...unless he rode my bird to death. He did seem to be in a rush, but surely he would not have done such a terrible thing..."},{"name":"NASHUMHAKARACCA","text":"Here we are! Which means the mysterious man with the mysterious sack must be near! Keep your eyes peeled..."},{"name":"NASHUMHAKARACCA","text":"Over there! That man is definitely up to no good!"},{"name":"NASHUMHAKARACCA","text":"Maybe he's waiting for a co-conspirator? We should stay out of sight and watch what happens..."},{"name":"NASHUMHAKARACCA","text":"...Ah! Mister Chupacabra? But he expressly told us he had put the evil schemes behind him! He wouldn't <span class=\"emphasis\">lie</span>, would he...?"},{"name":"RADZATHANMERCHANT03168","text":"The goods appear to be none the worse for wear... Very well. Your payment, as promised."},{"name":"RADZATHANMERCHANT03168","text":"My client will be most pleased..."},{"name":"NASHUMHAKARACCA","text":"Oh no! Is he going to feed the inspector to that giant sea monster!?"},{"name":"RADZATHANMERCHANT03168","text":"It is an honor and a pleasure as always, Doctor Lugae. I have faith this <span class=\"emphasis\">specimen</span> will meet with your satisfaction."},{"name":"LUGAE","text":"So <span class=\"emphasis\">this</span> is the one said to be the strongest, most resilient in all the world? The Manderville man?"},{"name":"RADZATHANMERCHANT03168","text":"None other. He has weathered countless explosions and a multitude of martial abuses─including a devastating suplex I myself did witness. It is even said he survived a journey to Dalamud itself, and survived the lesser moon's fall with nary a scratch."},{"name":"RADZATHANMERCHANT03168","text":"Most fortunately for us, he has fallen into a coma from which I am assured he will never awake. You are free to do with his body as you please."},{"name":"LUGAE","text":"Wee hee hee! Even the mightiest of warriors can't fight while asleep!"},{"name":"LUGAE","text":"Those meddlers may have gotten the better of me and my beautiful boy in the Tower of Babil, but my next child will be all but invincible! With <span class=\"emphasis\">this</span> body mine to command, I will exact a bloody, glorious revenge!"},{"name":"RADZATHANMERCHANT03168","text":"...Ahem. Forgive me my boldness, Doctor Lugae, but when might I expect the rest of my payment? I have debts that must be repaid."},{"name":"LUGAE","text":"Worry not! With the Telophoroi gone for good, the vast fortune of House Brutus is entirely at my disposal. I shall shower you with wealth, my loyal minion!"},{"name":"RADZATHANMERCHANT03168","text":"And gladly shall I accept the spoils, Doctor, and resolve never to renounce my wicked ways, for surely <span class=\"emphasis\">this</span> time I will suffer no comeuppance!"},{"name":"LUGAE","text":"No, not you! Not now! Bah─I must away!"},{"name":"RADZATHANMERCHANT03168","text":"W-Wait! Doctor Lugae! M-My payment!"},{"name":"NASHUMHAKARACCA","text":"Wake up, Inspector!"},{"name":"HILDIBRAND","text":"Could...could it be? The world's no longer purple!"},{"name":"LUGAE","text":"Stop moving, damn you! You're supposed to be the comatose centerpiece of my glorious revenge!"},{"name":"HILDIBRAND","text":"Mummy!"},{"name":"HILDIBRAND","text":"Not agaaaaaain!"},{"name":"LUGAE","text":"Noooooooooooooooooo!"},{"name":"HILDIBRAND","text":"I say, that was a rather dramatic series of events to awaken to...but more importantly, after a brief detour, I find myself in my own world once more."},{"name":"HILDIBRAND","text":"My most sincere apologies for causing you such trouble, my loyal assistants. But rejoice, for Hildibrand, agent of enquiry, inspector extraordinaire, has made his triumphant return!"},{"name":"NASHUMHAKARACCA","text":"W-Wait! Inspector!"},{"name":"DELION","text":"I knew it! An alien abduction! And to think I would have the chance to witness one with my own eyes!"},{"name":"DELION","text":"This month's issue of <span class=\"emphasis\">The Thavnairian Truth</span> shall be the best one yet!"},{"name":"NASHUMHAKARACCA","text":"And just when I thought we finally had the inspector back, off he went...and then came back, and then floated off again..."},{"name":"NASHUMHAKARACCA","text":"I know it's not the first time that he's taken to the skies without warning, but still...it's always a little disappointing."},{"name":"NASHUMHAKARACCA","text":"Still, there's no use crying over flying inspectors. Let's return to Radz–at–Han."},{"name":"NASHUMHAKARACCA","text":"Oh, Inspector. Why have you left me again...and where have you gone?"},{"name":"NASHUMHAKARACCA","text":"No, this won't do! Get it together, Nashu─there's a case to be solved!"},{"name":"NASHUMHAKARACCA","text":"Just you wait, Inspector! Your loyal assistant Nashu will solve the mystery of your disappearance. Again!"},{"name":"NASHUMHAKARACCA","text":"And don't you worry, <span class=\"highlight\">Forename</span>! As soon as I have a new lead, you'll be the first to know. Till next time!"},{"name":"SYSTEM","text":"Meanwhile, in Mare Lamentorum..."},{"name":"SYSTEM","text":"With astute mind and explosive panache♪"},{"name":"SYSTEM","text":"He'll find the crime─crack the case in a flash♪"},{"name":"SYSTEM","text":"Dashing, debonair♪<br>Pure gentleman's flair♪<br>Our agent of enquiry─Hildibrand Manderville♪"},{"name":"SYSTEM","text":"Truth and justice never go out of style♪"}],"reward":{"gil":2036},"reqs":{"jobs":[{"lvl":90,"id":34}],"quests":[70078]},"next":[70177]},"partials":[{"type":"npc","id":"1042499","obj":{"i":1042499,"n":"Hildibrand","l":2953,"q":1}},{"type":"npc","id":"1042512","obj":{"i":1042512,"n":"Nashu Mhakaracca","l":3707,"q":2}},{"type":"quest","id":"70078","obj":{"i":70078,"n":"The Sleeping Gentleman","g":71,"l":"Radz-at-Han","s":100,"f":1}},{"type":"quest","id":"70177","obj":{"i":70177,"n":"Lunar Conspiracy","g":71,"l":"Radz-at-Han","s":210,"f":1}}]}