{"quest":{"name":"A Mission in Mor Dhona","location":"Old Sharlayan","id":70072,"patch":6.1,"sort":110,"icon":101159,"unlocksFunction":1,"eventIcon":71341,"issuer":1042267,"target":1042273,"genre":27,"journal":["The fresh-faced Student's face lights up at the sight of you.","After receiving you with a smile, the fresh-faced Student leaves to fetch Krile, who has been wanting you and G'raha Tia to assist with a certain task. Though the details are sparse, the request comes from none other than Rammbroes of the Sons of Saint Coinach, and you depart for Revenant's Toll to meet with him.","No sooner do you join G'raha at your destination than Rammbroes arrives, and the two former comrades enjoy a brief-but-warm reunion. The conversation then turns to business, with Rammbroes informing you that an explorer recently appeared who claimed to have discovered the phantom realm, an enigmatic place that has long persisted in Eorzean legend. Wishing to see the realm with your own eyes, you and G'raha Tia go to find the explorer in question, one Deryk, who should be somewhere near the banks of Silvertear Lake.","Your search leads you to a peculiar baby opo-opo, whom you definitely did not assume to be the explorer. It turns out, however, that the creature is associated with the man, as it promptly clambers on his shoulder when he appears with G'raha Tia. Having been introduced, Deryk offers to show you to the phantom realm's entrance, and you watch in awe as he takes one step, and then another, onto the shimmering water of Silvertear Lake. Keeping your amazement in check for a moment, you follow him across the lake and into the unknown.","You emerge in the phantom realm, a gasp escaping your lips as you take in the breathtaking scenery. Picking your jaw off the floor once more, you go to join your companions.","According to Deryk, the floating isle to which you have come is called “the Omphalos”─a name of his own conception, meaning “navel” in an ancient tongue in reference to Mor Dhona's location in the heart of Aldenard. The explorer hopes that you will be able to shed light upon this place, and to that end you and G'raha Tia split up to explore.","You take yourself around the Omphalos and make a note of its peculiarities. Having explored to your satisfaction, you head back to the waiting Deryk.","Shortly after you rejoin Deryk, G'raha Tia also returns, and you review your findings together. Based on available evidence, it would seem the isle lies a considerable distance above Silvertear Lake, and it served as a place of worship for the Twelve. However, there is no telling who created such a place, and concerted effort will be required to get to the heart of the mystery."],"objectives":["Wait at the designated location in Revenant's Toll.","Search for the explorer.","Speak with G'raha Tia in the Omphalos.","Explore the Omphalos.","Speak with Deryk."],"dialogue":[{"name":"BALDESIONSTAFF04536","text":"Ah, <span class=\"highlight\">Forename</span>, welcome back!"},{"name":"BALDESIONSTAFF04536","text":"Are you perchance here to see Krile? I'm given to understand she has a task for which she desires your assistance..."},{"name":"BALDESIONSTAFF04536","text":"Then I shall fetch her at once. Pray wait a moment!"},{"name":"KRILE","text":"<span class=\"highlight\">Forename</span>, my thanks for coming. If you're now available, I'd like you and Raha to assist me in the task I had mentioned."},{"name":"GRAHATIA","text":"For you to call on <span class=\"highlight\">Forename</span>, I assume the task in question is somewhat more exciting than sorting through paperwork─which, I am pleased to add, I have finished."},{"name":"GRAHATIA","text":"So if <span class=\"highlight\">Forename</span> is ready, then so am I. Our venture to the Bounty has only served to whet my appetite for fieldwork!"},{"name":"KRILE","text":"Not to oversell things, but I suspect you won't be disappointed. Ere I divulge the details, however, permit me to provide some background."},{"name":"KRILE","text":"As you know, our organization, the Students of Baldesion, was founded by my grandfather, Galuf."},{"name":"KRILE","text":"Our stated mission was to uncover the mysteries of Hydaelyn and interpret Her will, particularly through the study of Her gift to us."},{"name":"KRILE","text":"We've since learned the whole truth, and it might be said that we've fulfilled our mission. But our work is far from over."},{"name":"KRILE","text":"In the course of our endeavors, we've also sought to devise countermeasures against threats that come to light. Our involvement with the Crystal Tower is an example of such."},{"name":"KRILE","text":"In the course of our endeavors, we've also sought to devise countermeasures against threats that come to light. Our involvement with the Warring Triad is an example of such."},{"name":"KRILE","text":"'Tis my belief that, in continuing to seek out the unknown and dealing with threats, we best carry on the Students' mission."},{"name":"KRILE","text":"We best honor those we lost when the Isle of Val was destroyed..."},{"name":"KRILE","text":"We best honor Grandfather and his comrades, who made the ultimate sacrifice to protect the world..."},{"name":"KRILE","text":"Forgive me, I didn't mean to darken the mood. In saying all this, I simply wanted to clarify our organization's purpose for a new age."},{"name":"KRILE","text":"In line with said purpose, I've been reviewing new requests...and one in particular jumped out at me."},{"name":"KRILE","text":"It comes from none other than Rammbroes, of the Sons of Saint Coinach."},{"name":"GRAHATIA","text":"Truly!? Has something happened in Mor Dhona, then?"},{"name":"KRILE","text":"So it would seem, and he wishes to entrust the matter to us."},{"name":"KRILE","text":"While his missive is sparse on details, he writes that it lies beyond the Sons' expertise. “Uncharted territory” are the exact words he used."},{"name":"KRILE","text":"I'd like you to meet with Rammbroes and conduct a preliminary survey. What say you?"},{"name":"KRILE","text":"Wonderful. When you are ready, pray make your way to Revenant's Toll. I shall let Rammbroes know to receive you there."},{"name":"KRILE","text":"I must remain here to oversee our operations, but should it transpire that more hands are needed, don't hesitate to send word."},{"name":"GRAHATIA","text":"Well, there's no time like the present. If you could go on ahead to Revenant's Toll, I shall make ready and then be on my way."},{"name":"GRAHATIA","text":"There you are, <span class=\"highlight\">Forename</span>. 'Twould seem we're early."},{"name":"RAMMBROES","text":"My apologies for the wait."},{"name":"GRAHATIA","text":"Rammbroes, what a pleasure to see you again! How have you been?"},{"name":"RAMMBROES","text":"The pleasure is all mine, my friend. I've been well, and it gladdens me to see that you are too."},{"name":"RAMMBROES","text":"Now, I know you have many demands upon your time, so I shall explain the particulars of our request at once."},{"name":"RAMMBROES","text":"Recently, an explorer came to us who claimed to have discovered the phantom realm."},{"name":"GRAHATIA","text":"The phantom realm!? So this is what you meant by “uncharted territory”..."},{"name":"GRAHATIA","text":"You're not familiar? Perhaps unsurprising, given that it is a lesser-known legend."},{"name":"GRAHATIA","text":"This legend holds that, across Eorzea, there exists a realm that appears as a mirage. Though visible from a distance, it fades away as one draws near."},{"name":"GRAHATIA","text":"While it has featured in myth since ancient times, the realm's existence could not be proven, and thus it is seldom mentioned in literature."},{"name":"GRAHATIA","text":"In spite of this, fueled by rumors of the occasional sighting, the myth has persisted, and continues to capture the hearts and minds of explorers."},{"name":"GRAHATIA","text":"That you yourself should reach out to us... It is real, then?"},{"name":"GRAHATIA","text":"To be deleted."},{"name":"RAMMBROES","text":"When first the explorer in question approached us, we doubted him. But we couldn't doubt the evidence of our senses. Nay, the realm is real─as you will soon see for yourselves."},{"name":"GRAHATIA","text":"Good gods... A part of me still struggles to believe it, but we have no reason to doubt you."},{"name":"GRAHATIA","text":"Suffice it to say we are eager to see the realm too."},{"name":"RAMMBROES","text":"Whatever truth awaits, I pray you will succeed in finding it."},{"name":"RAMMBROES","text":"Seek out the explorer, one Deryk. He has seen more of the realm than us, and should be willing to serve as your guide."},{"name":"RAMMBROES","text":"I asked him to accompany me here, but he preferred to continue exploring on his own. He will be somewhere near the banks of Silvertear Lake, I expect."},{"name":"GRAHATIA","text":"Understood. Our thanks, Rammbroes!"},{"name":"GRAHATIA","text":"Come, let us split up and look for our explorer."},{"name":"SYSTEM","text":"The explorer doesn't appear to be in the area..."},{"name":"SYSTEM","text":"You see a small opo-opo. It couldn't possibly be the explorer...or could it?"},{"name":"GRAHATIA","text":"Just in case you were entertaining the thought, <span class=\"highlight\">Forename</span>, that opo-opo isn't our explorer. I have the man in question here with me."},{"name":"DERYK","text":"I am Deryk, the one who discovered the phantom realm. My apologies for making you search for me."},{"name":"DERYK","text":"Curious about this creature, are you?"},{"name":"DERYK","text":"I found him injured during one of my journeys and tended to him. Since then, he has taken to following me around. He's inquisitive but otherwise harmless, so pray pay him no mind."},{"name":"BABYOPOOPO","text":"To be deleted."},{"name":"DERYK","text":"You are the hero who delivered our star from doom, are you not? What good fortune that one as capable as you should lend <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> aid."},{"name":"GRAHATIA","text":"To be clear, our organization has yet to accept the commission. Before we can make a decision, we would conduct a preliminary survey. Will you guide us to the phantom realm?"},{"name":"DERYK","text":"Of course. I will show you to the entrance at once."},{"name":"DERYK","text":"The gate to a realm long dreamed of by explorers..."},{"name":"GRAHATIA","text":"What are you─!?"},{"name":"DERYK","text":"Impressive, isn't it? When the gate manifested, so too did this magick, allowing one to thus walk upon water."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Are you sure it's safe...?"},{"name":"A2","text":"This is just like Urianger's spell!"},{"name":"DERYK","text":"Someone conceived the means to do this at will? An intriguing individual..."},{"name":"DERYK","text":"It's perfectly safe, I assure you. Come."},{"name":"GRAHATIA","text":"By the Twelve, you truly can walk here! What magick is this? By what means is it perpetuated?"},{"name":"GRAHATIA","text":"F-Forgive me. Let us continue on!"},{"name":"Q3","text":"Enter the phantom realm?"},{"name":"GRAHATIA","text":"This is the phantom realm..."},{"name":"GRAHATIA","text":"To think that the entrance would lie over Silvertear Lake..."},{"name":"GRAHATIA","text":"There is nothing out of the ordinary with the environment. The sights, the sounds, the smells─all appear as they should be in nature. That is to say, this place is no illusion."},{"name":"DERYK","text":"I bid you welcome to the navel of the phantom realm: the Omphalos."},{"name":"DERYK","text":"Well? Is it what you were expecting?"},{"name":"BABYOPOOPO","text":"Ook! Ook!"},{"name":"GRAHATIA","text":"The Omphalos, you say this place is called?"},{"name":"DERYK","text":"A name of my own conception, I confess. I felt we needed something to call it by. Lest you wonder, the word means “navel” in an ancient tongue─an allusion to Mor Dhona's location in the heart of Aldenard."},{"name":"DERYK","text":"As you can see, there are man-made structures, and the place appears well kept. Yet there isn't a single soul in evidence."},{"name":"DERYK","text":"'Tis my hope that you will help me to shed light upon this realm. To learn who created it, and to what end."},{"name":"GRAHATIA","text":"I should also like to know why it has revealed itself now. Was it simply chance that kept it hidden...or something more?"},{"name":"GRAHATIA","text":"In any case, let us begin by taking a look around."},{"name":"GRAHATIA","text":"The opo-opo seems quite at home, wouldn't you say? How many times has Deryk come here, I wonder..."},{"name":"DERYK","text":"Pray do not mind me. Take a look around at your leisure."},{"name":"SYSTEM","text":"A stone monument has been erected here. By whose hand, you cannot say, but the motifs wrought into its base appear familiar..."},{"name":"SYSTEM","text":"A number of structures such as this can be seen in the area. What purpose could they possibly serve...?"},{"name":"GRAHATIA","text":"The architecture is unlike anything seen in Eorzea. Truly exquisite stuff..."},{"name":"SYSTEM","text":"In the distance, you see what appears to be the Crystal Tower. Though the clouds makes it difficult to be sure, it would seem that you are in the sky above Silvertear Lake."},{"name":"SYSTEM","text":"No such isle could be seen from the outside, however..."},{"name":"DERYK","text":"Finished looking around, have you? What are your impressions?"},{"name":"GRAHATIA","text":"We have had only a cursory glance, but this is truly a mysterious place."},{"name":"GRAHATIA","text":"The gleaming spire rising beyond the clouds─that is most certainly the Crystal Tower."},{"name":"GRAHATIA","text":"And judging by its aspect, we are a considerable distance above Silvertear Lake. Which would suggest the gate we entered is a teleporter."},{"name":"GRAHATIA","text":"However, if this isle lies where it appears to lie, then it couldn't have escaped the Battle of Silvertear Skies unscathed..."},{"name":"GRAHATIA","text":"Which is to say we are in Mor Dhona...and yet we are not. 'Tis as if we were displaced from our world, if only slightly."},{"name":"DERYK","text":"Displaced is an apt way to put it. Was there aught else you noticed?"},{"name":"GRAHATIA","text":"Aye. The motifs upon yonder structure─they are unmistakably the marks of the Twelve."},{"name":"GRAHATIA","text":"By which I posit that this was created to be a place of worship."},{"name":"GRAHATIA","text":"But by whom? I cannot think of any who could have possibly built such grand premises, never mind magically conceal it. At least, not in the wake of the Battle of Silvertear Skies."},{"name":"GRAHATIA","text":"Aye, this is a mysterious place indeed..."}],"reward":{"gil":2500},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70066]},"next":[70073]},"partials":[{"type":"npc","id":"1042267","obj":{"i":1042267,"n":"Fresh-faced Student","l":3706,"q":1}},{"type":"npc","id":"1042273","obj":{"i":1042273,"n":"Deryk","l":4031,"q":1}},{"type":"quest","id":"70066","obj":{"i":70066,"n":"A Brother's Grief","g":12,"l":"Weaver's Warding","s":623}},{"type":"quest","id":"70073","obj":{"i":70073,"n":"The Realm of the Gods","g":27,"l":"The Omphalos","s":120,"f":1}}]}