{"quest":{"name":"Do It for the Vine","location":"Thavnair","id":70089,"patch":6.15,"sort":103,"interval":"daily","repeatable":1,"beast":15,"eventIcon":71222,"issuer":1042301,"target":1042301,"genre":33,"journal":["Maru is gazing sadly at an empty crate.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Survey the area from the designated location and defeat any manjusaka that appear.","Deliver the bundle of thick manjusaka vines to Maru."],"dialogue":[{"name":"MARU","text":"Listen, <span class=\"highlight\">Forename</span>─an important part of ridin' is bein' ready to ride at all times. And that means keepin' up regular maintenance on your cart."},{"name":"MARU","text":"It so happens that we're runnin' low on certain spare parts, and gettin' more of 'em... Well, let's just say it's best suited for fightin' types, eh? Like you!"},{"name":"MARU","text":"If you could swing by the old Hamsa Hatchery an' fetch me some manjusaka vines, I'd be much obliged."},{"name":"MARU","text":"You're gonna have to take down some small fry to get to the gnarlier chap, but his are the vines we want. A healthy handful should do!"},{"name":"POPMESSAGE","text":"A gnarled manjusaka unfurls before you!"},{"name":"MARU","text":"You got those vines?"},{"name":"MARU","text":"These are perfect! Our hippos appreciate your kindness. As do I."},{"name":"MARU","text":"You see, these vines are what stand between the yoke and our precious hippos' skin─an' believe you me, you never wanna see a blistered hippo."},{"name":"MARU","text":"We always make sure to keep fresh vines in reserve, but go through 'em quicker than you might think. I hope you won't mind fetchin' some again when the time comes..."}],"reward":{"gil":655,"reputation":60,"items":[{"num":5,"id":44},{"id":36657}]},"reqs":{"beastrank":3,"jobs":[{"lvl":80,"id":34}]}},"partials":[{"type":"npc","id":"1042301","obj":{"i":1042301,"n":"Maru","l":3709,"q":28}},{"type":"item","id":"44","obj":{"i":44,"n":"Allagan Tomestone of Causality","l":1,"c":"t/65094","t":63}},{"type":"item","id":"36657","obj":{"i":36657,"n":"Arkasodara Pana","l":1,"c":"t/65091","t":100}}]}