{"quest":{"name":"Hippos Born to Run","location":"Thavnair","id":70081,"patch":6.15,"sort":1,"icon":101170,"beast":15,"unlocksFunction":1,"eventIcon":71341,"issuer":1041332,"target":1042313,"genre":32,"journal":["Kancana shifts from foot to foot with agitation. Your adventurer senses tingle with the tantalizing taste of a problem to be solved.<br>※The difficulty of this quest will be synced to your current level.","According to Kancana, there have been strange reports of hippos running wild on the highroad. In order to make sense of these bizarre sightings, you set out to question the residents of Yedlihmad.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Your interviews confirm the recent hippo sightings and provide you with some vague intelligence on a delinquent group of Arkasodara refugees. Seeking a clearer image of the situation, you decide to follow up on your most promising lead, a refugee named Trna, who is also in search of hippos around the Perfumed Rise. ","Trna, you discover, is no ordinary refugee─she is the leader of a crew of hippo-cart racers, whose reckless riding has been the very talk of the town you came to investigate. Despite an initially intimidating demeanor, Trna expresses her wish to formally apologize for causing trouble, so you accompany her to Yedlihmad to speak with Kancana.","Trna explains that she and her “associates” hail from Vanaspati. While intimidated by the prospect of attempting to fit in with greater Thavnairian society, Trna nevertheless voices her desire to positively contribute to the community in the wake of the Final Days. At this, you suggest that she and her band of racers make the most of their speedy hippo carts by becoming delivery workers, and in order to introduce Trna to the realities of the job, Kancana tasks you both with delivering a package to the Great Work. ","In an act of hippo-based hospitality, Trna offers you a ride to the Great Work on one of her custom-made carts. There, she experiences the joy of successfully delivering a package firsthand, and is able to ameliorate perceptions of her raucous crew somewhat thanks to your stellar reputation and a convenient misunderstanding.","While Trna is eager to report back to Kancana, the hippo that pulled your cart needs to rest before taking another journey. In light of this, she sends you back to Yedlihmad first on her prized set of wheels, pulled by her very own partner-in-ride, Saurya.","Having arrived safely in Yedlihmad with nary a scratch on Trna's prized cart, Saurya trundles away. Hydaelyn's champion though you may be, you must now bear the indignity of walking the several yalms to where Kancana awaits.","As you are relaying the details to Kancana, Trna arrives. It transpires that delivery work is a challenge that she and her associates would be willing to attempt, although the prospect of building trust still feels daunting. Kancana, ever encouraging of struggling hearts, nominates you as a supporting member of Trna's fledgling organization, and offers to lease Trna's crew the grounds of an old trading post to get started.","The trading post in question has seen better days, but Trna and her associates get straight to work fixing it up. Rechristening themselves with their old team name, the “Hippo Riders” set their sights on becoming legitimate and trusted delivery workers. As their advisor, help these aspiring deliverers achieve the success and sense of belonging they desire!"],"objectives":["Question the residents of Yedlihmad.","Search for Trna.","Speak with Kancana.","Speak with Trna.","Speak with Trna again.","Ride the hippo cart to Yedlihmad.","Speak with Kancana.","Speak with Trna."],"dialogue":[{"name":"KANCANA","text":"Ah, <span class=\"highlight\">Forename</span>! Just who I was hoping to see. Do you have a moment?"},{"name":"KANCANA","text":"Just when I thought normalcy had finally returned to us, I received word of some truly peculiar hippo sightings."},{"name":"KANCANA","text":"Yes, hippos! A veritable herd of hippos..."},{"name":"KANCANA","text":"Hurtling down the highroad, no less!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Hippos...hurtling?"},{"name":"A1","text":"How majestic!"},{"name":"A1","text":"Huh. I thought that was normal for Thavnair..."},{"name":"KANCANA","text":"Yes, well... Though hippos have long inhabited Vanaspati, it is quite unusual to see them in such numbers outside their natural habitat─let alone harrying travelers on the highroad!"},{"name":"KANCANA","text":"Yet harried the travelers are. If these hippos have been displaced by the fires that beset the jungle during the Final Days, we must find them a more suitable home for the sake of all concerned."},{"name":"KANCANA","text":"I would normally ask the Radiant Host for help with such affairs, but they already have so much on their hands. And Ogul happens to be away, so could I ask you to look into the matter?"},{"name":"KANCANA","text":"Oh, thank you! You are truly a blessing."},{"name":"KANCANA","text":"I don't know much more than what I have already told you, but I am sure others in Yedlihmad have spotted a hurtling hippo or two."},{"name":"KANCANA","text":"I can only repeat what I've told you─hippos, hurtling, et cetera─but with any luck, the other townsfolk will have more details for you."},{"name":"RESIDENTSA","text":"Hurtling hippos, you say? Oh yes, I saw them. Barreling down the highroad at tremendous speed. It was frightening just to watch."},{"name":"RESIDENTSA","text":"They kicked up so much dust that I couldn't get a clear look at them, but everyone on the island knows that smooth silhouette. An adorable-yet-fearsome creature, the hippo..."},{"name":"RESIDENTSB","text":"Is this about those dreadful Arkasodara up north? Hitching carts to their hippos, and Cinduruva knows what else..."},{"name":"RESIDENTSB","text":"If they've come down to join the other refugees, I don't doubt they'll be stirring up trouble. As if we don't have enough people leeching off our goodwill already..."},{"name":"RESIDENTSC","text":"Yes, I've seen hippos on a number of occasions, over by the Great Work─and this is the second time I've answered that question in as many bells!"},{"name":"RESIDENTSC","text":"One of the refugees came by asking the very same not moments ago. Trna, I think her name was."},{"name":"RESIDENTSC","text":"If you're looking for the same hippos, maybe she could help? She set off towards the Perfumed Rise, last I saw. "},{"name":"RESIDENTSA","text":"I wonder why those hippos chose the highroad... Perhaps they prefer running on the strait and narrow?"},{"name":"RESIDENTSB","text":"I can't believe they had the gall to bring their hippos! This town needs some limits on its charity, if you ask me."},{"name":"RESIDENTSC","text":"Trna headed up the highroad. If you're still looking for hippos, maybe you should go after her."},{"name":"TRNA","text":"...What're <span class=\"emphasis\">you</span> lookin' at? Can't you see I'm in the middle of somethin' here!?"},{"name":"TRNA","text":"Eh? You're lookin' for hippos?"},{"name":"TRNA","text":"...Damn. I was hopin' to put paid to this before it got outta hand."},{"name":"TRNA","text":"Well, those hippos you're lookin' for should be rollin' through any moment now. Just stand back an' watch."},{"name":"TRNA","text":"Here they come!"},{"name":"MARU","text":"(-Rider-)H-Hey! No stoppin'!"},{"name":"MARU","text":"(-Rider-)What? Why's there fruit in the middle of the...?"},{"name":"TRNA","text":"You've done it now, you hamsaheads!"},{"name":"TRNA","text":"Maru! What'd I tell you about ridin' this highroad? "},{"name":"MARU","text":"Augh! B-Boss!"},{"name":"MARU","text":"Erm... W-Well, the roads back home ain't good for ridin' no more, Boss. We ain't got much of a choice..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Hurtling hippos are dangerous!"},{"name":"A2","text":"Keep it off the highroad, will you?"},{"name":"TRNA","text":"Yeah! Roarin' down a main road, kickin' up dust storms─you're scarin' people!"},{"name":"TRNA","text":"What, you already forgot about the Tower of Zot? The fires and the screamin' and the people turnin'? You really think that raisin' a racket's what we need right now!? "},{"name":"TRNA","text":"In case you ain't got it through your heads yet, I'll spell it out for you─our racin' days are over. They were over yesterday, and they were over the day before that too!"},{"name":"TRNA","text":"...I take it this solves your hippo mystery."},{"name":"TRNA","text":"Now all that's left is to apologize for these sorry sods. Care to tell me where to direct our grovelin'? "},{"name":"TRNA","text":"Alright. Let's have a chat with this Kancana."},{"name":"TRNA","text":"You're comin' too, Maru! I left you in charge, an' the one in charge takes responsibility. That's how it goes. "},{"name":"TRNA","text":"You'll be there to give your report or somethin', right? See you soon enough, then. "},{"name":"KANCANA","text":"Now, who might these fresh faces be? I was expecting news about hippos, but perhaps you've brought back a few lost souls as well?"},{"name":"TRNA","text":"Somethin' like that. Trna's the name, an' on behalf of my hippos an'...associates here, I apologize for the commotion."},{"name":"TRNA","text":"We're used to racin' our hippo carts on the less-traveled paths of Vanaspati, you see. We never took much to “society” even before the sky started rainin' fire─mostly just kept to ourselves an' lived off the land."},{"name":"TRNA","text":"But bein' new to these parts is no excuse. We should've known better than to take the highroad at high speed, an' we're sorry for any, er...undue distress we might've caused."},{"name":"TRNA","text":"We ain't got much to offer, but we'll make it up to you however we can. Thavnair's in a bad way, so if we're ever goin' to do any good for anybody, now's the time."},{"name":"TRNA","text":"...Or at least I'd like to think. I ain't got much in the way of ideas concernin' how misfits like us can contribute."},{"name":"SYSTEM","text":"A crew of Arkasodara looking for purpose, and speedy hippos to steer them true..."},{"name":"SYSTEM","text":"Perhaps there <span class=\"emphasis\">is</span> something Trna and her associates can contribute to a recovering Thavnair..."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Have you ever considered delivery work?"},{"name":"A3","text":"I think driving hippo carts could be an incredibly useful skill."},{"name":"TRNA","text":"Delivery work? You think we could really do somethin' like that? I mean, a hippo cart's the fastest set of wheels there is, but..."},{"name":"TRNA","text":"...Skill? You think so? We've only ever seen it as a hobby, but..."},{"name":"KANCANA","text":"It's an excellent idea. Local trade is on its way to recovery, and the timely delivery of goods via hippo cart can only be a boon."},{"name":"KANCANA","text":"However, delivery work requires a great deal of trust. You are transporting someone's precious possessions, after all."},{"name":"KANCANA","text":"You will not only need to learn the trade, but earn the respect of the people as well."},{"name":"KANCANA","text":"Everyone starts somewhere, so there's no need to feel intimidated! If this sounds like something you'd like to try, then why not let <span class=\"highlight\">Forename</span> show you how it's done?"},{"name":"KANCANA","text":"It just so happens that a parcel intended for the Great Work was accidentally off-loaded here today. It's filled with medicinal herbs from Gridania, so I'd like it sent over as soon as possible."},{"name":"KANCANA","text":"Would you be a dear and deliver it with Trna? With your worldly experience, I'm sure you will serve as a shining example of professionalism."},{"name":"KANCANA","text":"I'll entrust the parcel to you, Trna. I have no doubt that you will see it safely to its destination."},{"name":"TRNA","text":"Sorry for takin' you outta your way, <span class=\"highlight\">Forename</span>, but I look forward to seein' a professional do...whatever it is a professional does."},{"name":"TRNA","text":"I'll be waitin' by the gates, so give me a shout when you're ready to go."},{"name":"KANCANA","text":"You truly have a gift for finding those in need. I can't help but want to nurture each and every one!"},{"name":"KANCANA","text":"I know it's a little more work than you bargained for, but do lend Trna and her associates a helping hand. I see great potential in them..."},{"name":"MARU","text":"Work? <span class=\"emphasis\">Respect</span>? Us!? "},{"name":"MARU","text":"Sure, we wouldn't have to scrounge for food anymore, and it'd keep us busy like the boss wants, but... If wishes were hippo carts, beggars'd ride, y'know?"},{"name":"TRNA","text":"We're ready when you are!"},{"name":"TRNA","text":"My partner Saurya here's pullin' the fastest cart on the island. I stowed the goods we're deliverin' under the seat, so they won't get damaged or nothin'."},{"name":"TRNA","text":"An' we ain't about to leave you high an' hippo-less─there's another cart just for you!"},{"name":"TRNA","text":"Our hippos are usually shy around strangers, but you were there with the fruit earlier, so you've got nothin' to worry about. They're smarter than to bite the hand that feeds."},{"name":"MARU","text":"We don't let just anybody ride our carts, but if Boss thinks you can handle it..."},{"name":"TRNA","text":"No need for bellyachin', Maru. We ain't <span class=\"emphasis\">racin' the carts down the highroad</span> like some hamsaheads I know. Now, off we go, slow an' steady..."},{"name":"Q4","text":"Ride in the hippo cart?"},{"name":"TRNA","text":"Not a bad way to travel, eh? My crew designed these carts from scratch, you know."},{"name":"TRNA","text":"Historically, we Arkasodara never went around in chocobo carriages and the like. But at some point I got to wonderin'...why not? "},{"name":"TRNA","text":"Sure, we're a heavy bunch, but nothin's impossible if you put your mind to it, right? Well, after auditionin' all kinds of critters, we finally came 'round to hippos."},{"name":"TRNA","text":"Hippo ridin's a team effort. Our hippos can sprint with the best of 'em, but they ain't got a lot of stamina, so a good rider knows when to push and when to let up."},{"name":"TRNA","text":"Here we are, safe an' sound. Now we hand over the goods, right?"},{"name":"ALCHEMIST04545","text":"(-???-)You wouldn't happen to be talking about an imported package, would you?"},{"name":"ALCHEMIST04545","text":"I've been expecting a delivery ship, but seen neither keel nor prow of it..."},{"name":"ALCHEMIST04545","text":"Wait...aren't you the one who saved Nidhana?"},{"name":"ALCHEMIST04545","text":"Ah, I see! Well, thank you both for going out of your way to bring this over. You've saved me considerable grief."},{"name":"ALCHEMIST04545","text":"No large trading vessels can dock here, you see?"},{"name":"ALCHEMIST04545","text":"Usually, our orders are off-loaded at Alnair and thence shipped by dhow, but they sometimes get mixed in with packages destined for Yedlihmad."},{"name":"ALCHEMIST04545","text":"And then the logistical nightmare begins, I'm afraid. May I check to see if you indeed have my herbs?"},{"name":"ALCHEMIST04545","text":"Yes, this is it!"},{"name":"ALCHEMIST04545","text":"Importing these is trying enough without delivery mishaps, so I'm relieved they made it here safely. "},{"name":"ALCHEMIST04545","text":"And to think that all of the hippo hubbub was, in fact, industrious delivery work! A little frightening to watch without proper context, but you've done a marvelous job. I'll be sure to call upon your services again."},{"name":"TRNA","text":"That wasn't a delivery...but I guess a little misunderstandin' never hurt anyone. "},{"name":"TRNA","text":"People sure do trust you, though. I got trusted just standin' next to you!"},{"name":"TRNA","text":"And he looked so happy about his herbs... Had me smilin' right along with him. Maybe we really <span class=\"emphasis\">can</span> make a difference with this delivery business! "},{"name":"TRNA","text":"Thanks for showin' me the ropes─and for doin' all the talkin', too."},{"name":"TRNA","text":"I'd like to get straight back to Kancana, but from the looks of it, your hippo needs a breather. No surprise, considerin' what it's been through lately."},{"name":"TRNA","text":"Here's what we'll do─I'll let this big boy rest up a bit, while you go on ahead with Saurya."},{"name":"TRNA","text":"I'm trustin' you with my prized set of wheels, so be careful. No scratches or nothin'. Just ride like you did comin' here and there shouldn't be any problems."},{"name":"SYSTEM","text":"Should you become separated from your cart, speak with Trna at the Great Work to ride it again."},{"name":"Q5","text":"Ride the hippo cart?"},{"name":"TRNA","text":"When Saurya came runnin' back by herself, I got worried! You want to give it another shot?"},{"name":"SYSTEM","text":"Her mission accomplished, a triumphant Saurya trundles away with the cart in tow. Kancana will be pleased to hear of your successful delivery."},{"name":"SYSTEM","text":"Speak with Trna at the Great Work to board the hippo cart, then ride it to Yedlihmad."},{"name":"KANCANA","text":"Welcome back! <span class=\"highlight\">Forename</span> just told me all about your successful delivery. Thank you for your help, Trna."},{"name":"KANCANA","text":"What did you think of your first job?"},{"name":"TRNA","text":"The delivery part seems pretty straightforward, even for our ilk. But the whole “buildin' trust” thing won't be easy."},{"name":"TRNA","text":"Still, it's not like we can give up an' go home to Vanaspati. Sooner or later, we'll have to get used to livin' with other folks."},{"name":"TRNA","text":"An' you should've seen how relieved that alchemist was when he got his supplies! Feels nice to know we did some good in the world..."},{"name":"KANCANA","text":"There is no greater reward for a job well done, in my experience. If you choose to continue on this path, I am certain the joy you bring will be returned to you tenfold. "},{"name":"KANCANA","text":"As this is a new endeavor for you and your associates, however, I do believe it best if someone oversees your progress."},{"name":"KANCANA","text":"<span class=\"highlight\">Forename</span>, you did so much for Ogul that I have to ask─will you lend your aid to Trna and her associates?"},{"name":"TRNA","text":"I know we're a right crew of misfits, <span class=\"highlight\">Forename</span>, but I promise you we're hard workers. Give us a chance, an' we'll make you proud."},{"name":"Q6","text":"What will you say?"},{"name":"A6","text":"You've got spirit, kid! I'm with you!"},{"name":"A6","text":"This is going to take a lot of work..."},{"name":"TRNA","text":"Thank you! I swear you won't regret this!"},{"name":"KANCANA","text":"Oh, I don't know about that. Something tells me that Trna and her associates are quick studies. I'm sure that if you all work together, you will make good progress in no time. "},{"name":"KANCANA","text":"Now that that's settled, I think it is time you saw your new home."},{"name":"KANCANA","text":"You see, I have come into possession of an old trading post that has since fallen into disuse."},{"name":"KANCANA","text":"The structures may be a little worse for wear, but the plot itself is very conveniently located. You are free to fix it up however you would like."},{"name":"MARU","text":"Y-You're just...gonna let us use it? Just like that?"},{"name":"KANCANA","text":"I will lease it to you for a small fee. That is to say, if your new business fails to turn a profit, I may have to rethink the use of that space one day."},{"name":"KANCANA","text":"But we can talk about the particulars later. For now, how about you go and take a look? I've marked its location on this map."},{"name":"TRNA","text":"Gladly! Thanks for everythin' you've done for us."},{"name":"TRNA","text":"Let's reconvene at our new headquarters! I'll round up my people."},{"name":"KANCANA","text":"I have high hopes for that one. If there is anything else I can do to help, do not hesitate to let me know."},{"name":"MARU","text":"It's bigger than I thought, but what a dump! I'm grateful, of course, but... &lt;sigh&gt;"},{"name":"TRNA","text":"<span class=\"highlight\">Forename</span>! Glad you turned up."},{"name":"TRNA","text":"As you can see, this place ain't no Meghaduta. But once we get the basics up an' runnin', it'll start feelin' like home in no time. "},{"name":"MARU","text":"We'll need a cart shed, for starters...and a place to store packages an' whatnot..."},{"name":"MARU","text":"If I'm honest, Boss, I'm still not sure about all this. But if you say we should give it a shot, I guess I can try..."},{"name":"TRNA","text":"Thanks, Maru. I'm countin' on you, y'know."},{"name":"TRNA","text":"Alright─as of today, we're makin' our name as reliable delivery workers. We've got a lot to learn, but don't go easy on us. Teach us everythin' you know!"},{"name":"TRNA","text":"Now, we need a name for our new business. Somethin' real...trustworthy. Hmm..."},{"name":"MARU","text":"Boss, we gotta fix this place up! We ain't got time to be worryin' about names. What's wrong with our team name, anyway?"},{"name":"TRNA","text":"Our team name? Y-You're right! We don't need to be fancy─just fast, reliable, and ridin' hippo carts. “Hippo Riders” it is!"},{"name":"SYSTEM","text":"Led by their charismatic leader, Trna, the Hippo Riders have retired from racing and rebranded themselves as speedy delivery workers!"},{"name":"SYSTEM","text":"However, they are still known on the island as local delinquents. Use your experience as an adventurer and trusted hero to help them better their reputation!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Friendly</span> reputation with the Hippo Riders."},{"name":"SYSTEM","text":"Arkasodara tribal quests are now available from Maru in Svarna."},{"name":"SYSTEM","text":"Furthermore, you may now purchase wares from Ghanta."}],"reward":{"gil":1495},"reqs":{"jobs":[{"lvl":80,"id":34}],"questsType":"all","quests":[70033,70000]},"next":[70082]},"partials":[{"type":"npc","id":"1041332","obj":{"i":1041332,"n":"Kancana","l":3709,"q":4}},{"type":"npc","id":"1042313","obj":{"i":1042313,"n":"Trna","l":3709,"q":1}},{"type":"quest","id":"70033","obj":{"i":70033,"n":"A Budding Adventure","g":122,"l":"Thavnair","s":2134,"f":1}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}},{"type":"quest","id":"70082","obj":{"i":70082,"n":"A Pachyderm's Promptitude","g":32,"l":"Thavnair","s":2,"f":1}}]}