{"quest":{"name":"Newfound Journey","location":"Ul'dah","id":70080,"patch":6.2,"sort":301,"icon":101167,"eventIcon":71221,"issuer":1042623,"target":1042629,"genre":202,"journal":["The wandering minstrel has a request for an experienced adventurer.<br><br>※This quest is available for a limited time only.","Making your way through the Ruby Road Exchange during the Rising, you encounter the wandering minstrel, who asks you to take a fledgling adventurer under your wing. Thus do you make your way to the Gate of Nald, there to await a soul who has just embarked upon the path of adventure.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","It doesn't take long for an aspiring adventurer to wander through the gate, nor for you to identify him. You approach the bright-eyed lad, who introduces himself as Nhagi'a Jakkya. He gratefully accepts your offer of help, and heads to the Quicksand to register with the Adventurers' Guild, as you yourself once did.","With the stroke of a pen and a few words of encouragement from Momodi, Nhagi'a's registration is complete. In view of your experience, the Quicksand proprietress then tasks you with giving the lad the grand tour, beginning with recommending a guild in Ul'dah to join.","Your sage advice helps Nhagi'a to settle on a guild. Wasting no time, he rushes off to add his name to its roll, but not before requesting to meet again afterwards. When the lad doesn't return after a good while, you decide to look in on him at the guild.","To your relief, you find Nhagi'a more than holding his own. After apologizing for keeping you waiting, he informs you that a peculiar minstrel had approached him with a task, and bade him come to the Ruby Road Exchange to speak further. Curiously, your own presence is also requested, and you make your way to see the client together.","As you had suspected, the client turns out to be the wandering minstrel. The man reveals that, in seeking inspiration for his next composition, he contrived to bring you and Nhagi'a together─an adventurer old and an adventurer new─in a reminder that the present owes its existence to the past. Having thus established his vision, the minstrel then asks each of you to bring him an object with a connection to the Calamity, the event which gave rise to the realm's rebirth. Excited for his first-ever task as an adventurer, Nhagi'a suggests taking your search to the Sapphire Avenue Exchange, where many vendors peddle their wares.","You join Nhagi'a at the Sapphire Avenue Exchange, and together begin looking for your objects.<br><br>※You must be accompanied by Nhagi'a Jakkya to complete this task. Speak with him again should you become separated.","You have visited a number of vendors and found promising wares for your purposes. Believing you've seen enough, Nhagi'a suggests heading to a quiet spot to discuss what you will bring to the minstrel.","You reveal your selection to Nhagi'a, but he chooses to keep his a surprise. Having then acquired your respective items, you head back to the Ruby Road Exchange, where the wandering minstrel awaits.","You present your acquisition to the minstrel, who declares its suitability for his composition before turning his attention to Nhagi'a. The lad reveals his object to be the scrapbook of articles taken from <span class=\"emphasis\">The Raven</span>, the Gridanian tabloid where his sister works as a reporter. During the Calamity, said sister traveled the realm, interviewing adventurers about their journeys, and her tales instilled in him the desire to see the world. Your combined contributions serve to inspire the minstrel, who conceives of a verse and proceeds to perform it. No sooner does he strum the first chord than you are transported to a place beyond time and space, where you meet with the mysterious Naoki Yoshida. The man thanks you for continuing to grace the realm with your presence, and hints that change is coming. Yet come what may, he hopes that your journey together shall ever continue.<br><br>Returning to reality, you bid Nhagi'a well as he sets off on his own. And after the young adventurer has disappeared from sight, the minstrel performs for you another song─one of futures unknown and journeys unending. Hardships may await upon the road ahead, and there may be times when you feel defeated. But so long as you harbor love for this world, ever shall there be a place for you in it."],"objectives":["Wait at the designated location.","Speak with Nhagi'a Jakkya.","Speak with Nhagi'a Jakkya again.","Check on Nhagi'a Jakkya at his chosen guild.","Speak with the wandering minstrel at the Ruby Road Exchange.","Speak with Nhagi'a Jakkya and have him accompany you.","Look around the Sapphire Avenue Exchange while accompanied by Nhagi'a Jakkya.","Accompany Nhagi'a Jakkya to the designated location and then speak with him.","Speak with the wandering minstrel."],"dialogue":[{"name":"WANDERINGMINSTREL","text":"Greetings, friend. By your dauntless bearing, I assume you are an adventurer."},{"name":"WANDERINGMINSTREL","text":"As for myself, I am a humble wandering minstrel. One who draws inspiration from the daring deeds of those in your calling."},{"name":"WANDERINGMINSTREL","text":"Ah, if it isn't my dear adventurer friend! Pleased am I to see you again. Have you perchance come to join us in remembering the Calamity?"},{"name":"WANDERINGMINSTREL","text":"If you have a moment, there is a favor I would ask of you. Will you not hear me out?"},{"name":"WANDERINGMINSTREL","text":"Of late, more people are seeking to take up adventuring."},{"name":"WANDERINGMINSTREL","text":"In part due to the promotional efforts during the recent Moonfire Faire, more people are seeking to take up adventuring."},{"name":"WANDERINGMINSTREL","text":"Not all are yet wise in the ways of the world, however, and I fear they might fall prey to less-principled types in Ul'dah."},{"name":"WANDERINGMINSTREL","text":"If one such as you were to help them on their way, I would feel more at ease. What say you? Will you not take a fledgling adventurer under your wing?"},{"name":"WANDERINGMINSTREL","text":"I'm truly grateful!"},{"name":"WANDERINGMINSTREL","text":"Now, I believe a carriage is due to arrive shortly. If you go and wait at the Gate of Nald, chances are a soul will wander in who has just embarked upon the path of adventure. Pray greet them and offer your help."},{"name":"WANDERINGMINSTREL","text":"Worry not, you'll have no trouble identifying them. You need but look for someone absorbed in their surroundings."},{"name":"WANDERINGMINSTREL","text":"Hehe, I daresay it will feel like glimpsing into the past─right to the part where you are greeted by a helpful stranger."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Oi, adventurer! Over here!"},{"name":"A1","text":"Is this your first trip to Ul'dah?"},{"name":"A1","text":"Welcome to Ul'dah!"},{"name":"NHAGIAJAKKYA","text":"(-Bright-eyed Youth-)Wh-Who are you?"},{"name":"NHAGIAJAKKYA","text":"(-Bright-eyed Youth-)An experienced adventurer, you say? And you want to help me on my way?"},{"name":"NHAGIAJAKKYA","text":"(-Bright-eyed Youth-)Well, I could certainly use some guidance. I've never been anywhere near as big and busy as Ul'dah..."},{"name":"NHAGIAJAKKYA","text":"My name is Nhagi'a Jakkya, but just “Nhagi” will do. And as you rightly guessed, I'm an aspiring adventurer. That's why I left my village and came here."},{"name":"NHAGIAJAKKYA","text":"So...I understand that you first need to register at the Adventurers' Guild. Do you know where it is?"},{"name":"NHAGIAJAKKYA","text":"Just through that door, is it? Thank you, I'll head there at once!"},{"name":"SYSTEM","text":"Nhagi rushes off before you can offer further explanation. Perhaps you should follow him to the Quicksand."},{"name":"NHAGIAJAKKYA","text":"In...and out... In...and out... Come on, Nhagi, you can do it..."},{"name":"NHAGIAJAKKYA","text":"Oh, it's you again... To be honest, I'm quite nervous. It's heartening to have you here too."},{"name":"MOMODI","text":"Why, hello there. What can I do for you today?"},{"name":"MOMODI","text":"The lad's here to register, is he?"},{"name":"NHAGIAJAKKYA","text":"Yes, madam, I wish to join the Adventurers' Guild! My name is Nhagi'a Jakkya, and I'm sixteen years old─practically a man grown!"},{"name":"MOMODI","text":"Hehe, aren't we a lively one? Momodi's the name, and if you want to be an adventurer, then you've come to the right woman."},{"name":"MOMODI","text":"There's nothing to it, really─you just need to write your name in the register. Come, come..."},{"name":"MOMODI","text":"With that, you're officially a member of the Adventurers' Guild. If you ever need a bit of advice about one thing or another, pay me a visit. Just don't go botherin' me every time you stub your bloody toe, all right?"},{"name":"MOMODI","text":"'Course, I <span class=\"emphasis\">do</span> enjoy hearin' tell of a gentleman's woes with the womenfolk from time to time..."},{"name":"MOMODI","text":"Now then, normally I'd offer you the grand tour..."},{"name":"MOMODI","text":"But in light of present company, I reckon you ought to have it from <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"MOMODI","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s your senior in adventurin', after all, and you could do worse than to get <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> advice."},{"name":"MOMODI","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s a renowned adventurer, after all─the bleedin' champion of Eorzea─and you could do far worse than to get <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> advice."},{"name":"MOMODI","text":"To begin with, mayhap you could recommend a guild here in Ul'dah for Nhagi to join?"},{"name":"MOMODI","text":"If it's too noisy in here, there are benches just outside where you can have a nice little chat."},{"name":"MOMODI","text":"With your experience, I reckon you could give Nhagi some sound advice on a guild to join. Go on, have a little chat and see what might suit him."},{"name":"NHAGIAJAKKYA","text":"I must confess, choosing a guild is quite daunting... I'd appreciate any advice you can offer."},{"name":"SYSTEM","text":"The following event cannot be skipped. You may wish to cancel any pending Duty Finder registrations."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"All right, let's talk guilds."},{"name":"A2","text":"Give me just a moment."},{"name":"NHAGIAJAKKYA","text":"I'm all ears, <span class=\"highlight\">Forename</span>!"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Adventuring can be dangerous. What attracted you to it?"},{"name":"A3","text":"Why did you want to become an adventurer?"},{"name":"NHAGIAJAKKYA","text":"A merchant who was in the carriage with me─a Bre...something─asked me much the same thing."},{"name":"NHAGIAJAKKYA","text":"At the time, I couldn't give a proper answer. I had a reason for leaving home, of course, but I couldn't express it in words."},{"name":"NHAGIAJAKKYA","text":"But having now set foot in Ul'dah, it's become clear in my mind."},{"name":"NHAGIAJAKKYA","text":"I wanted to know what lay beyond the horizon. Wanted to see it with my own eyes and be amidst it."},{"name":"NHAGIAJAKKYA","text":"You've been to many places, right? You like it, then? Traveling, that is..."},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"I love traveling. There's nothing like the thrill of seeing new sights."},{"name":"A4","text":"Traveling is nice, but I'd prefer to put my roots down somewhere."},{"name":"NHAGIAJAKKYA","text":"So you do, so you do..."},{"name":"NHAGIAJAKKYA","text":"I have an older sister. During the Calamity, we fled Gridania and took refuge in a village in the mountains."},{"name":"NHAGIAJAKKYA","text":"I ended up staying in that secluded place, and it's long been a dream of mine to travel the world."},{"name":"NHAGIAJAKKYA","text":"Truly? That's a little unexpected..."},{"name":"NHAGIAJAKKYA","text":"And yet...perhaps it's when we've seen the world that we know there's a perfect place for us. One we'd like to call home."},{"name":"NHAGIAJAKKYA","text":"But inexperienced as I am, I don't know if I could live a life on the road. Is there a guild that could equip me with the skills I need?"},{"name":"Q6","text":"What guild will you recommend?"},{"name":"A6","text":"One representing students of the fighting arts."},{"name":"A6","text":"One representing crafters and gatherers."},{"name":"NHAGIAJAKKYA","text":"I see, a place where I can learn how to protect myself and others... If I recall correctly, Ul'dah is home to the Pugilists' and Thaumaturges' Guilds."},{"name":"NHAGIAJAKKYA","text":"Of those two, I'd choose the pugilists. I've always enjoyed rigorous exercise, and am quite confident in my physical abilities. Yes, I believe this is the guild for me! I'll go and join at once!"},{"name":"NHAGIAJAKKYA","text":"I see, a place where I can learn a trade... Indeed, we can't always rely on fighting to make a living, and having the ability to gather or craft would be invaluable."},{"name":"NHAGIAJAKKYA","text":"If I recall correctly, Ul'dah is home to the Alchemists' Guild. I happen to have some familiarity with medicinal herbs, and I daresay I can put the knowledge to use. Yes, I believe this is the guild for me! I'll go and join at once!"},{"name":"Q7","text":"What will you say?"},{"name":"A7","text":"Will you be all right by yourself?"},{"name":"A7","text":"I can show you to the guild if you like."},{"name":"NHAGIAJAKKYA","text":"Thanks for your concern, but I should be fine."},{"name":"NHAGIAJAKKYA","text":"If you still have time, though, could we meet again afterwards? There are a few more things I'd like to ask you about."},{"name":"NHAGIAJAKKYA","text":"Great! I'll look for you here when I'm done!"},{"name":"SYSTEM","text":"You wait a good while, but there is no sign of Nhagi. Perhaps you should look in on him at the Pugilists' Guild."},{"name":"SYSTEM","text":"You wait a good while, but Nhagi is nowhere to be seen. Perhaps you should look in on him at the Alchemists' Guild."},{"name":"MOMODI","text":"Judgin' by how at ease the lad looks around you, I reckon you've got a knack for guidance. Mayhap you'd care to do my job for me? Hehehe..."},{"name":"HAMON","text":"That was a most impressive display, young one! Watching you, I'm reminded of myself in my youth─swift, strong, and handsome. Not to say that I'm not these things anymore, of course..."},{"name":"NHAGIAJAKKYA","text":"You're too kind, Master Hamon! And I'm sure you're still all those things and more!"},{"name":"CHUCHUTO","text":"Now, now, Nhagi, take care you don't flatter the old man overmuch. His neck couldn't bear his head getting any larger."},{"name":"NHAGIAJAKKYA","text":"Oh, <span class=\"highlight\">Forename</span>! I'm glad to say that pugilism agrees with me. My thanks for your recommendation!"},{"name":"HAMON","text":"Well now, <span class=\"highlight\">Forename</span>, to think that you're the one who sent Nhagi to us! The lad possesses rare talent, and I look forward to watching him grow in our art."},{"name":"HAMON","text":"So you're the one who sent Nhagi to us! The lad possesses rare talent, and I look forward to watching him grow in our art."},{"name":"HAMON","text":"Right then, my boy. Remember today's lesson well, and keep at your training. Next time, we shall try something a little harder!"},{"name":"NHAGIAJAKKYA","text":"I'm sorry for keeping you waiting. So engrossed was I in the combinations, I lost track of time..."},{"name":"NHAGIAJAKKYA","text":"Oh, I should mention something. As I was training, a peculiar minstrel approached me. He said that, if I'm resolved to walk an adventurer's path, I should seek him out for a task."},{"name":"NHAGIAJAKKYA","text":"Moreover, he asked that you accompany me. If you're willing, he's apparently waiting at the Ruby Road Exchange."},{"name":"HAMON","text":"Always a pleasure to see you, <span class=\"highlight\">Forename</span>. Come and shed some sweat with us again soon, do you hear?"},{"name":"HAMON","text":"Hm? If you want to shed some sweat too, then you're more than welcome."},{"name":"SEVERIAN","text":"Idiot! Had my mental faculties been diminished as a result, what then!? The world would have forever been deprived of my genius, that's what!"},{"name":"SEVERIAN","text":"Ah, my loyal assistant, you are come at a good time! This fool of a trainee switched my drinking water with some unknown fluid...which I unwittingly imbibed!"},{"name":"SEVERIAN","text":"Who are you supposed to be? This trainee's keeper? Well then, you should know that the fool switched my drinking water with some unknown fluid...which I unwittingly imbibed!"},{"name":"NHAGIAJAKKYA","text":"I-I'm sorry, Master Severian, but it was just a herbal tea. Y-You looked weary, and I thought that it might help..."},{"name":"SEVERIAN","text":"Why in the seven hells didn't you say so first!? That way I might have recorded my vital signs and ascertained the tea's effects!"},{"name":"SEVERIAN","text":"Such negligence ill befits an alchemist, and I ought to kick you out of my laboratory right now!"},{"name":"SEVERIAN","text":"Still...you completed the assigned tasks perfectly. In light of this, you have earned another chance. Very well, you may serve as my assistant─on a probationary basis."},{"name":"NHAGIAJAKKYA","text":"...Ahem. I'm sorry you had to see that, <span class=\"highlight\">Forename</span>. But it seems all is well...at least for now."},{"name":"NHAGIAJAKKYA","text":"Master Severian truly lives and breathes alchemy. Though the tea is quite bitter, he thought only of its effects and made no comment on its taste. I believe I stand to learn much under him, and I'll do my best not to incur his ire."},{"name":"NHAGIAJAKKYA","text":"I must also apologize to you for keeping you waiting. So engrossed was I in the potion making, I lost track of time..."},{"name":"NHAGIAJAKKYA","text":"Oh, and one other thing. As I was at my work, a peculiar minstrel approached me. He said that, if I'm resolved to walk an adventurer's path, I should seek him out for a task."},{"name":"NHAGIAJAKKYA","text":"Moreover, he asked that you accompany me. If you're willing, he's apparently waiting at the Ruby Road Exchange."},{"name":"SEVERIAN","text":"Hm, my body feels marginally warmer... It would seem the tea has the effect of promoting circulation..."},{"name":"NHAGIAJAKKYA","text":"Here he is, <span class=\"highlight\">Forename</span>─the minstrel."},{"name":"WANDERINGMINSTREL","text":"My friend, you have done a splendid job as a guide. I was right to entrust the task to you."},{"name":"NHAGIAJAKKYA","text":"What? Do you mean to say <span class=\"highlight\">Forename</span> approached me at your behest?"},{"name":"WANDERINGMINSTREL","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> did, I must confess. You see, for my next composition, I seek to capture the essence of the times. While any number of subjects would be worthwhile, of greatest interest to me is the recent rise in the ranks of adventurers."},{"name":"WANDERINGMINSTREL","text":"In thus bringing different generations of adventurers together, I had hoped for inspiration to strike...and I'm pleased to say that it has!"},{"name":"WANDERINGMINSTREL","text":"Drawing upon your experience walking your path, you have helped Nhagi to begin walking his─a reminder that the present owes its existence to the past."},{"name":"WANDERINGMINSTREL","text":"That is to say, the present and the past are deeply entwined. If we would capture the former, we cannot well disregard the latter. And this brings me to my next request..."},{"name":"WANDERINGMINSTREL","text":"I ask that you each find an object with a connection to the Calamity─the event which gave rise to the realm's rebirth─and present it to me with its tale."},{"name":"NHAGIAJAKKYA","text":"Well now, that sounds not unlike a treasure hunt...and it'd be my very first task as an adventurer! What do you say, <span class=\"highlight\">Forename</span>? Shall we do it?"},{"name":"WANDERINGMINSTREL","text":"Excellent. When you have your items, pray seek me out at the Ruby Road Exchange. I eagerly look forward to seeing what you bring."},{"name":"NHAGIAJAKKYA","text":"There are many vendors at the Sapphire Avenue Exchange, right? Chances are they'll have something, so let's begin our search there!"},{"name":"NHAGIAJAKKYA","text":"Come on, let's begin looking around!"},{"name":"SYSTEM","text":"Nhagi'a Jakkya is now accompanying you. Keep him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Nhagi'a Jakkya behind by entering a different area, or by speaking with him and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Nhagi'a Jakkya accompany you again, return and speak with him at the original location."},{"name":"SYSTEM","text":"While you are accompanied, you may encounter “conversation points” along the way which offer additional topics of discussion."},{"name":"SYSTEM","text":"Enter the glowing area and speak with your quest companions to initiate these bonus conversations. Enjoy exploring your surroundings together!"},{"name":"Q50","text":"What will you do?"},{"name":"A50","text":"Talk."},{"name":"A50","text":"Part ways."},{"name":"A50","text":"Nothing."},{"name":"NHAGIAJAKKYA","text":"An object with a connection to the Calamity... I wonder what manner of things we'll find!"},{"name":"Q52","text":"Are you sure you wish to part ways with Nhagi'a Jakkya?"},{"name":"NHAGIAJAKKYA","text":"Oh, you need to be somewhere? All right, I'll wait for you in the area."},{"name":"NHAGIAJAKKYA","text":"Ready to continue? Then let's go!"},{"name":"SYSTEM","text":"Nhagi'a Jakkya has yet to arrive. Be sure he is at your side before attempting to continue."},{"name":"SYSTEM","text":"You must be accompanied by Nhagi'a Jakkya and have him at your side in order to proceed with quest objectives."},{"name":"A50","text":"<span class=\"highlight\">Discuss the local cuisine.</span>"},{"name":"A50","text":"<span class=\"highlight\">Discuss the House of Splendors.</span>"},{"name":"NHAGIAJAKKYA","text":"Shall we look around some more? There's bound to be other things out there."},{"name":"NHAGIAJAKKYA","text":"So far, so good. Let's look around just a little more."},{"name":"NHAGIAJAKKYA","text":"...I daresay we've seen enough. Let's find a quiet spot to discuss what to bring back."},{"name":"SYSTEM","text":"You have seen enough objects and learned the stories behind them. Make your way to the end of the Sapphire Avenue Exchange with Nhagi'a and speak with him."},{"name":"LOLONU","text":"Welcome, welcome! What is it that you're after?"},{"name":"LOLONU","text":"Objects with a connection to the Calamity, you say? Why, I have just the thing─an amethyst ring from Ishgard, steeped in sentimental value!"},{"name":"LOLONU","text":"Five years ago, on the eve of the Battle of Carteneau, a young Temple Knight set out from his homeland, wishing to do his part for Eorzea when his nation would not."},{"name":"LOLONU","text":"Alas, the man never arrived in the Flats."},{"name":"LOLONU","text":"En route, he came upon a merchant being attacked by a dragon...and lost his life going to the stranger's aid. This was his ring─an heirloom passed down through his line."},{"name":"NHAGIAJAKKYA","text":"What a tragic tale... But I wonder─how did the ring find its way back? If the knight fell, it seems the merchant couldn't have survived unscathed..."},{"name":"LOLONU","text":"Um...er... A-Ah, I remember now! Though the knight was mortally wounded, he succeeded in striking down the dragon. And with his last breath, he entrusted the ring to the merchant. Y-Yes, that's how it happened!"},{"name":"LOLONU","text":"So, what do you say? If you're interested, I would be willing to part with the relic for a special price─but for today only!"},{"name":"NHAGIAJAKKYA","text":"Hmmm, this feels a bit dubious..."},{"name":"ANV07GOLDSMITH","text":"Greetings and welcome to my exhibit. Please feel free to browse at your leisure."},{"name":"ANV07GOLDSMITH","text":"Oh, if it isn't <span class=\"highlight\">Forename</span>! How have you been, my friend?"},{"name":"ANV07GOLDSMITH","text":"I'm still working at my craft, as you can see. And for the Rising this year, Astin has organized this street exhibit for me. Please feel free to browse at your leisure, and don't hesitate to let me know if you have any questions."},{"name":"ANV07GOLDSMITH","text":"Greetings and welcome to my exhibit. Please feel free to browse at your leisure, and don't hesitate to let me know if you have any questions."},{"name":"NHAGIAJAKKYA","text":"We're looking for objects that bear a connection to the Calamity. Do you have anything that fits the description?"},{"name":"ANV07GOLDSMITH","text":"As a matter of fact, I do! Yonder pane, entitled <span class=\"emphasis\">The Sultana's Seven</span>, depicts an inspiring event from the Calamity!"},{"name":"ANV07GOLDSMITH","text":"'Twas the final days before the fall of Dalamud, its inexorable approach foretelling our impending doom. Panic spread like wildfire, while many in their desperation turned on the sultanate. Looting and rioting broke out across Ul'dah."},{"name":"ANV07GOLDSMITH","text":"To quell the masses, Her Royal Majesty Nanamo Ul Namo took to the streets with a guard consisting of only seven subjects, for they alone had the courage to stand with their sultana. There, she addressed the rabble."},{"name":"ANV07GOLDSMITH","text":"\"Heed me, my beloved citizens! The realm lies upon the brink of the Seventh Umbral Era. Yet so long as we live, we must not forget our compassion. Now is not the time to take from your neighbor, but to proffer him the hand of succor.“"},{"name":"ANV07GOLDSMITH","text":"Brought to their senses by her words, the people laid down their arms and set about healing the wounds they themselves had inflicted on Ul'dah. And those who returned from the battlefield found their home much as they had left it: a gleaming jewel in the desert."},{"name":"NHAGIAJAKKYA","text":"Her Grace sounds like a great ruler."},{"name":"NHAGIAJAKKYA","text":"Ul'dah is fortunate to have her watching over it."},{"name":"NHAGIAJAKKYA","text":"Thanks for sharing the tale. It's indeed inspiring, and you've done an incredible job capturing it in glass!"},{"name":"ANV07GOLDSMITH","text":"Having an exhibit all to myself, I can't help but feel a bit self-conscious."},{"name":"ANV07GOLDSMITH","text":"But at the same time, I feel great satisfaction. And it encourages me to keep at my craft."},{"name":"NANABE","text":"Greetings! From daily necessities to unusual curios, I deal in all manner of wares. If there is something in particular you seek, you need but ask."},{"name":"NANABE","text":"Hmmm, objects to do with the Calamity... The two of you are adventurers, are you not? In which case, I have something that may be of interest."},{"name":"NANABE","text":"It's a journal I acquired from an adventurer who retired injured. The man recorded his experiences during the Calamity in detail, and I daresay it has value for students of history."},{"name":"NHAGIAJAKKYA","text":"Oho, an adventurer's firsthand account! I'd love to pore over it!"},{"name":"NHAGIAJAKKYA","text":"Do you keep a journal of your adventures as well, <span class=\"highlight\">Forename</span>? If so, I'd love to read it too one day. With your permission, of course..."},{"name":"NANABE","text":"Oh, for another historical piece, I also have a scrapbook of articles from <span class=\"emphasis\">The Raven</span>, Gridania's leading tabloid. These mainly cover events outside the Calamity, however..."},{"name":"NHAGIAJAKKYA","text":"Articles from <span class=\"emphasis\">The Raven</span>, you say? Hmmm..."},{"name":"NHAGIAJAKKYA","text":"Ooh, is this the local cuisine? Goodness, but everything looks amazing!"},{"name":"NHAGIAJAKKYA","text":"In the course of your journeys, you must have sampled all kinds of food. From simple fare to exotic feasts, I look forward to sampling everything too!"},{"name":"NHAGIAJAKKYA","text":"House of Splendors? What kind of place is this, I wonder..."},{"name":"ANV09MOB1","text":"I see you're not familiar with the House. We offer wares in exchange for scrips, but our services are available only to those whom we know and trust."},{"name":"NHAGIAJAKKYA","text":"So if I want to be a customer, I need to make a name for myself... One day, Nhagi! One day!"},{"name":"NHAGIAJAKKYA","text":"Right, this looks like as good a spot as any."},{"name":"NHAGIAJAKKYA","text":"I don't know about you, but that was all very new and exciting for me!"},{"name":"NHAGIAJAKKYA","text":"Talking to myriad people, learning the tale behind each object... It's been a great experience, and I won't soon forget it."},{"name":"NHAGIAJAKKYA","text":"Now then, we need to decide what we want to take to the minstrel. Have you made up your mind?"},{"name":"Q51","text":"What will you say?"},{"name":"A51","text":"The Ishgardian knight's ring."},{"name":"A51","text":"<span class=\"emphasis\">The Sultana's Seven</span> pane."},{"name":"A51","text":"The retired adventurer's journal."},{"name":"NHAGIAJAKKYA","text":"I see, I see. I did consider that too, but in the end settled on something else.<br>...What is it? Hehe, if you don't mind, I'd like to keep it a surprise."},{"name":"NHAGIAJAKKYA","text":"Come, let's purchase our respective items, and meet back where the minstrel awaits!"},{"name":"SYSTEM","text":"You obtain the Ishgardian knight's ring."},{"name":"SYSTEM","text":"You obtain <span class=\"emphasis\">The Sultana's Seven</span> pane."},{"name":"SYSTEM","text":"You obtain the retired adventurer's journal."},{"name":"NHAGIAJAKKYA","text":"Hehe, you'll find out what I chose soon enough!"},{"name":"WANDERINGMINSTREL","text":"Welcome back. You've each found an item, I trust?"},{"name":"WANDERINGMINSTREL","text":"Well now, what have we here...?"},{"name":"WANDERINGMINSTREL","text":"A knight who set out to fight for the realm and gave his life for a stranger... Be it fact or fiction, 'tis a moving tale of valor and sacrifice."},{"name":"WANDERINGMINSTREL","text":"It reminds us that, though many events may be beneath history's remembrance, they may have altered the lives of those who lived them."},{"name":"WANDERINGMINSTREL","text":"Ah yes, <span class=\"emphasis\">The Sultana's Seven</span>, I know it well. 'Tis an iconic tale of leadership amidst great adversity."},{"name":"WANDERINGMINSTREL","text":"It may be said that Her Grace's actions that fateful day helped to forge Ul'dah as it is now. In that sense, it well suits the theme for my composition."},{"name":"WANDERINGMINSTREL","text":"The journal of an adventurer, you say... Despite the vendor's claims, such records typically do not have much historical value, on account of their limited perspective and inherent partiality."},{"name":"WANDERINGMINSTREL","text":"Yet by the same token, they have great value to me, for they offer a glimpse into the writer's heart. There is no richer material for penning verses."},{"name":"WANDERINGMINSTREL","text":"Now then, what of you, young Nhagi?"},{"name":"WANDERINGMINSTREL","text":"And what might this be?"},{"name":"NHAGIAJAKKYA","text":"It's a scrapbook of articles from <span class=\"emphasis\">The Raven</span>."},{"name":"NHAGIAJAKKYA","text":"You see, my sister is a reporter for the tabloid. During the Calamity, she traveled the realm, interviewing adventurers about their journeys. And I loved nothing more than to hear her tales."},{"name":"NHAGIAJAKKYA","text":"They seemed like such a diverse crowd, adventurers. No two people were alike. And yet they were united in the free, unshackled lives they lived. It struck a chord with me, and in time I found myself admiring them."},{"name":"NHAGIAJAKKYA","text":"Looking back, it was my sister who instilled in me the desire to see the world─to become an adventurer. That's why I chose this scrapbook."},{"name":"WANDERINGMINSTREL","text":"I see... The footprints someone leaves on their journey become the starting point for another..."},{"name":"WANDERINGMINSTREL","text":"Yes, a verse comes to me─a blessing for those souls who are taking their first chary steps into the unknown. Pray, lend me your ears..."},{"name":"YOSHIDANAOKI","text":"(-???-)Greetings, Warrior of Light."},{"name":"YOSHIDANAOKI","text":"(-???-)This is a world that exists outside your reality. Could it be a dream? A flight of fancy conjured by your weary mind? Perhaps...or perhaps not."},{"name":"YOSHIDANAOKI","text":"'Tis a pleasure to make your acquaintance. My name is Naoki Yoshida, and I have beckoned you here that I might express my gratitude."},{"name":"YOSHIDANAOKI","text":"'Tis a pleasure to meet you again. As I have in the past, I have beckoned you here that I might express my gratitude."},{"name":"YOSHIDANAOKI","text":"First of all, I wish to thank you for continuing to grace us with your presence. You and your fellow adventurers are our inspiration, and this shall never change."},{"name":"YOSHIDANAOKI","text":"The world, however, is an ever-changing place, mysterious in its elusiveness."},{"name":"YOSHIDANAOKI","text":"Unexpected hardships may turn our lives upside down. And though we all desire peace deep in our hearts, the sparks of conflict never cease to be struck."},{"name":"YOSHIDANAOKI","text":"Like an adventurer's journey, the world is constantly moving towards the unknown, and it takes considerable courage to alter course."},{"name":"YOSHIDANAOKI","text":"Yet I ardently believe that it is a small-but-significant step in our quest to create new adventures."},{"name":"YOSHIDANAOKI","text":"Indeed, another great change is about to visit the world, and it shall open the way to exciting new journeys."},{"name":"YOSHIDANAOKI","text":"And 'tis our abiding hope that our journey together shall ever continue on, to the distant horizon and beyond."},{"name":"YOSHIDANAOKI","text":"...Now, the time has come for this vision to end; time for your eyes to open from this waking dream."},{"name":"YOSHIDANAOKI","text":"Return to walking your path, and know that you are in our hearts always."},{"name":"YOSHIDANAOKI","text":"Till next we meet, I bid you safe travels."},{"name":"NHAGIAJAKKYA","text":"Thank you for the generous reward─and the uplifting verse. It gives me courage for the road ahead."},{"name":"NHAGIAJAKKYA","text":"Speaking of which, it's time I set out on my own. Though it was brief, I enjoyed our time together, and I hope to see you again, somewhere out there!"},{"name":"Q99","text":"What will you say?"},{"name":"A99","text":"Come what may, never forget to smile."},{"name":"A99","text":"Pass my regards to your sister."},{"name":"A99","text":"I look forward to hearing your tales."},{"name":"WANDERINGMINSTREL","text":"Though much and more was lost in the Calamity, intrepid souls continue to set forth, paving the way unto the future. In such a moment in history do we stand, and for you I would perform another song."},{"name":"WANDERINGMINSTREL","text":"Your life is a riddle, to bear gladness and grief,<br>'Neath stars and through storms, the answers to seek.♪<br>Your footprints are threads, to be gathered and woven,<br>A song of dawn resplendent, dancing high to the heavens.♪"},{"name":"WANDERINGMINSTREL","text":"From the embrace of the gods though mankind has been torn,<br>Upon winds eternal lives and memories are borne.♪"},{"name":"WANDERINGMINSTREL","text":"The future is unwritten, bring it rapture or sorrow,<br>Our journey shall continue, unto tomorrow and tomorrow.♪"},{"name":"WANDERINGMINSTREL","text":"I wonder─how did you feel as you watched Nhagi set off? Did the sight fill you with worry for a fledgling adventurer? Or did it awaken fond memories of your own humble beginnings?"},{"name":"WANDERINGMINSTREL","text":"Whichever it may be, I know that yours is a journey more trying than most. There will be times when you are overcome by loneliness, and each step feels heavier than the last. In such a moment, I bid you remember this:"},{"name":"WANDERINGMINSTREL","text":"So long as you harbor love for this world, ever shall there be a place for you in it. Your adventures will never end."},{"name":"800","text":"You have unlocked the jigsaw puzzle mini-game. To play mini-games, open the toy chest found in any inn room."}],"reward":{"gil":544,"items":[{"id":36862}]},"reqs":{"jobs":[{"lvl":15,"id":1}]}},"partials":[{"type":"npc","id":"1042623","obj":{"i":1042623,"n":"Wandering Minstrel","l":40,"q":1}},{"type":"npc","id":"1042629","obj":{"i":1042629,"n":"Wandering Minstrel","l":40,"q":1}},{"type":"item","id":"36862","obj":{"i":36862,"n":"Clockwork Solus","l":1,"c":59855,"t":81}}]}