{"quest":{"name":"Leader to Leader","location":"Thavnair","id":70085,"patch":6.15,"sort":5,"icon":101174,"beast":15,"unlocksFunction":1,"eventIcon":71341,"issuer":1042300,"target":1042300,"genre":32,"journal":["Trna's shoulders are thrown back and her stance is braced. Her normally jovial gaze looks steeled for trouble. <br>※The difficulty of this quest will be synced to your current level.","Trna relates that the new meyhane is a hit with the locals, putting so many adventuring types at her disposal that she now receives direct requests from the Radiant Host itself. Perhaps predictably, Ghasa interrupts this good news with reports of a gaggle of Gajasura heading straight for Svarna, so she asks you to extend an adventurer's welcome to Acala's cohorts. While she doesn't yet explain her reasons, Trna leaves you with one, immovable condition: whatever fighting occurs must not end in tragedy.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You give your Gajasura guests the warmest welcome that will allow you to leave the confrontation unscathed. They will hopefully remain subdued for some time, allowing you to regroup with Trna.","When you arrive, Ogul has her weapon drawn and tensions are running high. Acala demands that the Hippo Riders forfeit Svarna and leave immediately. Trna retorts that Acala and his people should join the Riders instead of fighting them. Unable to reconcile their differences, Trna finally starts speaking Acala's language when she challenges him, leader to leader, to a race on hippo carts across a predetermined stretch of the island. Acala, confident in his abilities, accepts and heads directly to the starting line at Yedlihmad.","Trna immediately regrets challenging Acala to a race, fearing it will besmirch the Riders' hard-earned reputation. You assuage her concern by suggesting that the race be held as an official, public festivity. Citizens from across Thavnair are invited to witness the landmark competition between the Arkasodara and Gajasura, the first of its kind on the island─or, perhaps, anywhere. Bolstered by your reassurance, Trna bids you accompany her as she negotiates terms of engagement with Acala.","Since the outcome of the race will affect the lives of many, Trna offers Acala the option of drawing upon his battle brothers' strength during the race. Acala rebuffs her, insisting that he, and he alone, is strong enough to win. Trna, on the other hand, decides to rely upon not only her associates' guidance, but yours. She pulls you aside to share her strategy.","Trna explains her plan: Maru and Ghasa will keep you updated on the race's progress from key locations along the track, and you will use their intel to coach Trna as she rides. Additionally, Maru offers some colorful ingenuity to draw out the full extent of Saurya's enthusiasm when the time is right. Linkpearl in ear, you set off for the finish line by the Giantsgall Grounds and wait for history to begin...","Thanks to your advice and Trna's undeniable skill with a cart, she secures victory by a hippo's nose. Instead of lording her win over the frustrated Acala, however, Trna instead entreats him once more to join her. Besieged by a heartfelt speech and his own sense of duty towards his brothers, Acala accepts, and you extend to Trna your congratulations.","While the Hippo Riders were shocked by the Gajasura addition to their family, Trna says she was able to smooth things over with her associates. She has a racing gate installed in Svarna to commemorate the legendary race between her and Acala, with ambitions to hold more in the future. Your heart is filled with ever higher hopes for Trna and all her associates, old and new, as you continue to rebuild a thriving Thavnair."],"objectives":["Survey your surroundings and defeat any enemies that might appear.","Report back to Trna.","Speak with Trna.","Speak with Acala in Yedlihmad.","Speak with Trna.","Stand by at the finish line.","Speak with Trna."],"dialogue":[{"name":"TRNA","text":"<span class=\"highlight\">Forename</span>, am I glad to see you! Haven't made much headway on our Gajasura problem, but let me tell you about the rest of it."},{"name":"TRNA","text":"Like I said, no tearful reconciliation or nothin', but havin' folks at the meyhane's been givin' us peace of mind. Between our little outfit an' Kancana's contacts, we've got every sort of adventurer you could ever need."},{"name":"MARU","text":"Ogul's been stoppin' by when she can, too. She's gotten mighty good at ridin'. I think she's got the instincts of a racer..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Once Ogul finds her groove, she's unstoppable!"},{"name":"A1","text":"As a fellow adventurer, she makes me proud."},{"name":"A1","text":"If you say so..."},{"name":"TRNA","text":"There's no doubt she's been settin' a great example for our recruits."},{"name":"TRNA","text":"So much so that even the Radiant Host's been askin' us for guards an' lookouts to patrol the roads."},{"name":"TRNA","text":"Works out in our favor, seein' as we'll be the first to know if Acala ever decides to─"},{"name":"GHASA","text":"(-???-)B-Boss! Boss!"},{"name":"MARU","text":"Right on cue..."},{"name":"GHASA","text":"We just got word─a whole mob of Gajasura's closin' in on us. An' I don't think it's 'cause they got wind of our deal on lassis or nothin', neither."},{"name":"GHASA","text":"They'll be here any moment, Boss. What do we do!?"},{"name":"TRNA","text":"Ghasa, go and find Ogul at Palaka's Stand an' have her report here. Then, I want you to make the rounds and tell folks in this area to be on the alert. I've got a hunch Acala's only after us, but just to be safe."},{"name":"TRNA","text":"Maru, I want you to keep up your maintenance on the carts. No need to panic, but if matters should run awry, I want everyone ready to leave, understand?"},{"name":"TRNA","text":"I'm goin' to relay the situation to our friends at the meyhane. As for you, <span class=\"highlight\">Forename</span>, I'd like you to go an' graciously welcome our Gajasura guests."},{"name":"TRNA","text":"Any fights picked with you, you've got my permission to finish. But I don't want no blood on your hands. Don't mean to make things complicated, but that's how it's gotta be."},{"name":"TRNA","text":"I'll owe you one. Report back when you've a handle on things, yeah?"},{"name":"TRNA","text":"I sent off some extra fighters, but I'd like you to go an' make sure nothin' gets out of hand. Nothin' permanent, remember!"},{"name":"OGUL","text":"Ghasa apprised me of the s-situation─I came as quickly as I c-could! "},{"name":"OGUL","text":"I'm g-glad I made it in time, but t-to think a whole horde of bloodthirsty G-Gajasura may not be far behind... &lt;shudder&gt;"},{"name":"ACALA","text":"Bhaaa-ha-ha-haaa! Your home, conquest for Acala!"},{"name":"TRNA","text":"Welcome back. As you can see, we're at a bit of a deadlock with our favorite hippo enthusiast here."},{"name":"OGUL","text":"Th-This is hardly the time to be glib, Trna. B-But rest assured that I am prepared to do all that is necessary in s-self-defense─even if that should be a swift and decisive o-offense!"},{"name":"TRNA","text":"Hold on a moment."},{"name":"TRNA","text":"I'm angry, Ogul. When I think about what Acala's stolen and who he's hurt, I start boilin' like afternoon soup. But skewerin' him ain't gonna solve the bigger issue. "},{"name":"TRNA","text":"I say we talk, first. See if we ain't so different after all. "},{"name":"ACALA","text":"You too weak for Acala! Leave! Leave hippos, go!"},{"name":"TRNA","text":"You want us to leave Svarna? That ain't an option, an' you know that."},{"name":"TRNA","text":"But if you've got such a hankerin' for our hippo carts, there is another way─you could always join us."},{"name":"TRNA","text":"Me an' my associates─me an' my <span class=\"emphasis\">people</span>─we built this place to welcome us when nowhere else would. So there ain't no version of this where we simply up an' leave 'cause you demand it."},{"name":"TRNA","text":"But you know exactly what I'm talkin' about, don't you? You know what it's like to have no place to welcome you. To need to take care of your people, no matter what. That's why I don't wanna fight you. "},{"name":"ACALA","text":"Your people no place for home? But you protect people... You...same as Acala? "},{"name":"ACALA","text":"But Acala hit your people! Tell truth─you forgive no Acala!"},{"name":"TRNA","text":"Like I said, I'm angry. No one messes with my family and gets away with it. That's why I wanna settle things with you, leader to leader. Fair an' square."},{"name":"ACALA","text":"Bhaaa-ha-ha-ha! Acala hit stronger than weak you! Acala win!"},{"name":"TRNA","text":"Sure keen on violence, ain't you? When I say “settle things,” I'm not talkin' about a fight─I'm talkin' about a race. On hippo carts! "},{"name":"TRNA","text":"If I lose, I swear on my honor as a racer that I'll agree to your terms. But if I win, you repent for what you've done...and you join us. Peaceably. Deal?"},{"name":"ACALA","text":"You, fool! Acala win race, take hippos, take wagons!"},{"name":"TRNA","text":"You can try. We'll start the race from that harbor town right there, an' ride the highroad all the way up past the quarry further on."},{"name":"ACALA","text":"Agree. Acala wait at town. But Acala wait not long!"},{"name":"OGUL","text":"W-Well, he was more reasonable than I expected. But lest he decide to perpetrate any knavery, I shall keep a sharp eye over him!"},{"name":"TRNA","text":"I ain't gonna go back on what I said, but I really shouldn't have called Acala out like that..."},{"name":"TRNA","text":"Not 'cause I think I'll lose─not on your life! But we had to <span class=\"emphasis\">crawl</span> our way up from bein' nothin' but reckless misfits, and now that we've made somethin' of ourselves, I'm gonna ride the highroad an' blow whatever respect we earned to the wind..."},{"name":"TRNA","text":"What's done is done, I guess. Now we just gotta focus on keepin' things fair. Don't want Acala workin' a traverse around us, not when everyone's futures are at stake."},{"name":"TRNA","text":"Damn it all... How're we supposed to make this work? "},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"What if the race were a sanctioned event?"},{"name":"A2","text":"Invite a crowd to watch. Acala's not likely to work anything then."},{"name":"TRNA","text":"That's genius, <span class=\"highlight\">Forename</span>! An official hippo race between the Arkasodara and Gajasura... That'd be, well, <span class=\"emphasis\">legendary</span>! "},{"name":"TRNA","text":"If we do that, not only do we stay legitimate, but we'd be hostin' an event that everyone can enjoy─like a festival!"},{"name":"TRNA","text":"I know I said our racin' days were over, but this is goin' to be one for the chronicles, <span class=\"highlight\">Forename</span>. I'll show you a race you'll never forget!"},{"name":"TRNA","text":"Alright. I'll have Ogul smooth things over with the Radiant Host while my associates spread the word about our upcomin' scurry! Come an' meet me in Yedlihmad─can't keep Acala waitin' too long."},{"name":"TRNA","text":"Ogul said the Radiant Host was a little perplexed, but they gave us their blessin' nonetheless! Better to settle our differences peacefully, in their words."},{"name":"TRNA","text":"My associates are out gatherin' the locals, so let's talk terms with Acala while we can."},{"name":"OGUL","text":"Leave supervising Acala to me! Rest assured, I shall not be fainting any time soon─mind over matter, as Grandmother would say. Mind over matter!"},{"name":"ACALA","text":"You not ready? Acala ready. Acala no patience!"},{"name":"TRNA","text":"Keep your armor on. We've gotta wait for our audience to show up. Don't wanna start without our kinsfolk cheerin' us on, now do we?"},{"name":"ACALA","text":"Kins? Race, battle. Not show off! No kins!"},{"name":"TRNA","text":"C'mon, Acala─our “kins” are goin' to make sure both sides play fair. Besides, if you win, they'll officially be <span class=\"emphasis\">your</span> kins, right?"},{"name":"ACALA","text":"...Fine. Acala accept kins."},{"name":"TRNA","text":"Speakin' of which, I've got a proposition for you─seein' as this race is gonna determine the future of both our peoples, I'd like to declare it a cooperative effort."},{"name":"TRNA","text":"Only the two of us'll be ridin' the track, of course, but my team's gonna be backin' me up from the sidelines. You're welcome to do the same, if you'd like."},{"name":"ACALA","text":"Hmph! Battle, Acala win alone! Acala strong!"},{"name":"TRNA","text":"Is that so. Alright then."},{"name":"TRNA","text":"<span class=\"highlight\">Forename</span>! Let's talk. "},{"name":"ACALA","text":"Where kins!? Acala ready to win!"},{"name":"TRNA","text":"I think it goes without sayin' that this race ain't just about the Hippo Riders. The whole island─and all the people on it─are countin' on us to win this."},{"name":"TRNA","text":"So here's my plan─I'm gonna give you a linkpearl, like the ones me an' my associates use. That way we can be in contact durin' the race."},{"name":"TRNA","text":"I'll have Maru and Ghasa standin' by at key points along the track so that they can give you updates on our progress."},{"name":"TRNA","text":"I want you to use that information to advise me durin' the race. Sound okay?"},{"name":"TRNA","text":"Not to lay on the pressure, or anythin'. I take full responsibility for how I ride, but just in case I lose my head, I want you to keep me focused."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Chief Strategist, reporting for duty!"},{"name":"A3","text":"I think I already lost my head somewhere... But I'll do my best."},{"name":"A3","text":"Oh, if you insist."},{"name":"TRNA","text":"Thanks, pal. I'm countin' on you."},{"name":"TRNA","text":"All that's left is gettin' Saurya ready to run. Then there ain't nothin' stoppin' us."},{"name":"TRNA","text":"She likes those bright colors... What do you reckon the chances are of a rainbow conveniently poppin' out of nowhere, eh? If only..."},{"name":"MARU","text":"Hah...hah... I m-made it! Boss, I─ &lt;wheeze&gt;"},{"name":"TRNA","text":"Maru! What're you doin' here? And sweatin' like Ogul in that gaja head. What happened? What's the matter?"},{"name":"MARU","text":"N-Nothin', Boss. I brought you somethin' for your race..."},{"name":"MARU","text":"Saurya goes wild for bright colors, right? So I used some of our leftover gulal to make a rainbow! Just throw this, and she'll perk right up for sure..."},{"name":"TRNA","text":"If this ain't a sign from the divinities, I don't know what is. Maru, you hamsahead, you really came through! We're gonna win this thanks to you!"},{"name":"TRNA","text":"I'll save this for just the right moment. Can't hit the ground runnin' <span class=\"emphasis\">too</span> hard after all."},{"name":"TRNA","text":"Keep that in mind when you're coachin' me. Pacin' is important for a race this long. Anyway, go on ahead to the goalpost over by the Giantsgall Grounds. I'll see you when I bring home a victory!"},{"name":"TRNA","text":"Maru, I want you watchin' the highroad around the Great Work. I'll fill you in on the details by linkpearl."},{"name":"TRNA","text":"Even after all this time, I always get nervous before a race. But all I've gotta do is trust myself, trust my girl, an' ride!"},{"name":"TRNA","text":"Wait for me by the goalpost─Racashir's goin' to be callin' the race, so he should be there by now too."},{"name":"RACASHIR","text":"I really hope Trna wins the race..."},{"name":"RACASHIR","text":"From what teacher says, if the Gajasura end up taking over Thavnair, we're all in trouble."},{"name":"OGUL","text":"Ghhhnnnnnn! I sh-shan't be intimidated! I have cast all f-fear from my body now! Th-This time for certain!"},{"name":"RACASHIR","text":"Teacher, we're all ready over here."},{"name":"OGUL","text":"It seems that preparations at the goalpost are complete. Racers, are you ready?"},{"name":"OGUL","text":"Citizens of Thavnair─I welcome you to the very first Hannish Hippo Hustle!<br>Representing the Arkasodara and our very own Hippo Riders...Trna!!!<br>Representing the Gajasura, the mighty...Acala!!!<br>Racers, take your mark!"},{"name":"OGUL","text":"Get set!"},{"name":"OGUL","text":"GO!!!"},{"name":"ACALA","text":"Acala win! Run, run! Conquest for Acala!"},{"name":"GHASA","text":"(-Ghasa's Voice-)That Gajasura bastard! Pushin' our precious hippo that hard─I'm so mad, I'm sweatin' blood!"},{"name":"GHASA","text":"(-Ghasa's Voice-)The boss's eatin' dust, but the road's not lookin' too good up ahead... What's your call!?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"Don't lose to that bastard! Full speed ahead!"},{"name":"A4","text":"Save your strength! The road's lookin' rocky."},{"name":"TRNA","text":"A-Alright!"},{"name":"TRNA","text":"Ain't no good, the road's a mess. Sorry, but I'm gonna hang back for now!"},{"name":"TRNA","text":"Right! We'll hold fast!"},{"name":"MARU","text":"(-Maru's Voice-)They're passin' by the Great Work, an' it looks like Acala's hippo might be reachin' its limit. Not surprisin', seein' how hard he's pushin' it..."},{"name":"MARU","text":"(-Maru's Voice-)Chances are good Acala's not goin' to take much more of a lead, but it's your call... "},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"Go, Trna! Hippos are go!"},{"name":"A5","text":"Hold steady till the final spurt!"},{"name":"TRNA","text":"Ain't gotta tell me twice! C'mon, Saurya, let's show him what we've got!"},{"name":"TRNA","text":"Loud an' clear. We'll bide our time for a grand finish!"},{"name":"ACALA","text":"You! Fast, more fast! Run, run, run!"},{"name":"SYSTEM","text":"The two hippo carts are hurtling towards the goal at breakneck speed! Give your final piece of advice to Trna for the win!"},{"name":"Q6","text":"What will you say?"},{"name":"A6","text":"Boss! Give it everythin' you've got."},{"name":"A6","text":"Unleash the rainbow!"},{"name":"TRNA","text":"Hya-haaah! Been waitin' for this! Get ready to see lightnin'!"},{"name":"TRNA","text":"Saurya, let's go!"},{"name":"TRNA","text":"Who won? Who was it!?"},{"name":"ACALA","text":"Acala win!?"},{"name":"RACASHIR","text":"By a hippo's nose, the victor of the Hannish Hippo Hustle is...TRNA!!!"},{"name":"ACALA","text":"Acala lose... Why!? You trick Acala!?"},{"name":"TRNA","text":"No, we didn't trick you. We just know our hippos, that's all. What they like. How much they can take."},{"name":"TRNA","text":"Hippos are livin', breathin' creatures, same as us. Havin' to run that hard, for that long─all while pullin' a heavy bloke like you? No mystery why your hippo melted its grease. "},{"name":"ACALA","text":"Hippo slow because grease melt... Acala understand."},{"name":"TRNA","text":"And I <span class=\"emphasis\">did</span> say that your people could support you durin' the race. But you insisted on ridin' alone. They're your “battle brothers,” ain't they? I bet they would've loved to help."},{"name":"TRNA","text":"I might be in charge, but if I've gotta rely on others to protect my people, I'm not hesitatin'. You can only do so much by yourself."},{"name":"ACALA","text":"By...yourself..."},{"name":"TRNA","text":"Of course, trustin' folks enough to do that didn't exactly come naturally to me neither."},{"name":"TRNA","text":"Me and my people, we used to be nothin' but a bunch of misfits. We didn't really belong nowhere, an' no one really wanted us around in the first place. "},{"name":"TRNA","text":"People like us ain't got a lot of options─you either scrape by on the outskirts so that you ain't a bother, or leave for someplace new an' hope that you can prove yourself somehow."},{"name":"TRNA","text":"But it ain't gotta be like that. You can be you an' still build trust an' contribute somethin' positive, however small. Misfit or no, at some point you realize that none of us are really so different."},{"name":"TRNA","text":"So I believe in you, Acala. I think if no-good racers like us can turn things around, you an' your people can too. You ain't gotta conquer nothin' to protect your brothers now."},{"name":"TRNA","text":"A deal's a deal, right? Join us. Become a Hippo Rider an' see where the cart takes you."},{"name":"ACALA","text":"Acala your words understand. Acala, you, not different. But Acala Gajasura. This bad..."},{"name":"TRNA","text":"Our tribes may have their differences, but as for you an' me...that's just a racin' rivalry now. An' everyone watchin' saw how hard you were tryin' for your people. Might take some time, but I think you'll find a place here. "},{"name":"TRNA","text":"So, what do you say? Come back with us to Svarna?"},{"name":"ACALA","text":"Acala...accept..."},{"name":"ACALA","text":"Acala lose race... Sad. But for battle brothers, new home. Acala protect brothers. So Acala glad. Much glad."},{"name":"TRNA","text":"Thanks for the stellar advice! Couldn't have done it without you."},{"name":"TRNA","text":"Ain't no way I was losin', but I'm glad this didn't end with Acala's people bein' chased off the island."},{"name":"TRNA","text":"It got a little tense when a bunch of Gajasura came walkin' in, bold as brass, but I explained the situation an' everyone's bein' good-hearted about it. It's like I said─none of us are so different."},{"name":"TRNA","text":"But enough about that─people <span class=\"emphasis\">loved</span> the race! When was the last time I rode like that!? Wind against my face, crowds cheerin' me on... Heh, now that I think about it? Might've been a first."},{"name":"TRNA","text":"Next time the Hannish Hippo Hustle rolls around, we should start it from Svarna. Or finish it. Or both! Think of the traffic we'd get at the meyhane..."},{"name":"TRNA","text":"Who knew thinkin' up new ways to excite other folks would be so...well, excitin'? This─all of this─is thanks to you, <span class=\"highlight\">Forename</span>. I can't thank you enough."},{"name":"TRNA","text":"Alright, let's get to it! Our brand-new racin' gate ain't gonna build itself, after all!"},{"name":"SYSTEM","text":"In commemoration of the historic race between the representatives of the Arkasodara and Gajasura peoples─and the peace thereby achieved─a gate has been erected in Svarna!"},{"name":"SYSTEM","text":"The Hippo Riders' reputation has soared to legendary heights. Backed by their diligence and hard-earned skills, Trna and her associates will continue to spread joy throughout all of Thavnair!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Sworn</span> reputation with the Hippo Riders."},{"name":"SYSTEM","text":"You will receive an experience point bonus upon completion of the Arkasodara tribal daily quests."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from Ghanta."}],"reward":{"gil":1455},"reqs":{"beastrank":6,"jobs":[{"lvl":80,"id":34}],"quests":[70084]},"next":[70086]},"partials":[{"type":"npc","id":"1042300","obj":{"i":1042300,"n":"Trna","l":3709,"q":5}},{"type":"quest","id":"70084","obj":{"i":70084,"n":"Defiant Ogul, Deified!","g":32,"l":"Thavnair","s":4,"f":1}},{"type":"quest","id":"70086","obj":{"i":70086,"n":"The Hippo Riders","g":32,"l":"Thavnair","s":6,"f":1}}]}