{"quest":{"name":"Ridin' Flyers for Flyin' Riders","location":"Thavnair","id":70087,"patch":6.15,"sort":101,"interval":"daily","repeatable":1,"beast":15,"eventIcon":71222,"issuer":1042301,"target":1042301,"genre":33,"journal":["Maru wants YOU to promote the Hippo Riders.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Distribute the Hippo Rider handbills.","Report back to Maru."],"dialogue":[{"name":"MARU","text":"I promised the boss I'd try an' get the cart rollin', but lazin' about here ain't exactly goin' to make a job of it..."},{"name":"MARU","text":"It ain't much, but I tried makin' some handbills... You think you could pass 'em out around Yedlihmad?"},{"name":"MARU","text":"Tell folks that if they bring back one of these, they'll get a discount. That sounds professional, right? Anyhow, I'll leave the talkin' to you─I know you'll explain it good."},{"name":"DOCKER04551","text":"You have business with me?"},{"name":"DOCKER04551","text":"A start-up delivery service...by hippo cart? And here I thought chocobo carriages were the only viable option. What an intriguing angle."},{"name":"DOCKER04551","text":"I only off-load luggage, so delivery arrangements are out of my hands, but I'll take this to my friends at the harbor guild. They may yet find some use for it."},{"name":"DOCKER04551","text":"Oh, the Hippo Riders! Yes, my friend at the harbor guild tried them straightaway. Wouldn't stop gushing about their speedy carts. "},{"name":"DOCKER04551","text":"If you could spare a few more handbills, I know of some others who will appreciate that discount!"},{"name":"DOCKER04551","text":"I'll be sure to pass this along."},{"name":"TRADERWOMAN04551","text":"May I help you?"},{"name":"TRADERWOMAN04551","text":"A delivery service! By hippo cart, no less. This is perfect timing─it just so happens that I need a parcel delivered to the Giantsgall Grounds without delay."},{"name":"TRADERWOMAN04551","text":"“Fastest on the island,” are they? I shall certainly put them to the test! Thank you, I'll head over straightaway."},{"name":"TRADERWOMAN04551","text":"Those speedy Hippo Riders! No false advertising there─they had my package to its recipient in no time at all. Count me a satisfied customer!"},{"name":"TRADERWOMAN04551","text":"I daresay it's time to redeem my second discount. I wonder if I could persuade them into a fixed contract..."},{"name":"THINKINGARKASODARA04551","text":"Something for me?"},{"name":"THINKINGARKASODARA04551","text":"Oh! The Hippo Riders! I know a fellow who works there!"},{"name":"THINKINGARKASODARA04551","text":"Nothing would make me happier than supporting an Arkasodara-run business like this. I simply must find something for them to deliver!"},{"name":"THINKINGARKASODARA04551","text":"Out promoting the Hippo Riders again? I found something to deliver, and they had it in Radz-at-Han in no time at all─and at a discount! "},{"name":"THINKINGARKASODARA04551","text":"Of course, I'll be needing it shipped back now, so could I trouble you for another handbill? Oh, and some extras for my friends!"},{"name":"MARU","text":"Handed out the handbills, have you?"},{"name":"MARU","text":"I'm glad we piqued some interest. Handin' out adverts ain't glamorous, but it sure gets the job done..."},{"name":"MARU","text":"I'll keep thinkin' up new ways of gettin' our name out there. Come by again when you've got the time..."}],"reward":{"gil":655,"reputation":60,"items":[{"num":5,"id":44},{"id":36657}]},"reqs":{"beastrank":3,"jobs":[{"lvl":80,"id":34}]}},"partials":[{"type":"npc","id":"1042301","obj":{"i":1042301,"n":"Maru","l":3709,"q":28}},{"type":"item","id":"44","obj":{"i":44,"n":"Allagan Tomestone of Causality","l":1,"c":"t/65094","t":63}},{"type":"item","id":"36657","obj":{"i":36657,"n":"Arkasodara Pana","l":1,"c":"t/65091","t":100}}]}