{"quest":{"name":"Essential Eggredients","location":"Thavnair","id":70094,"patch":6.15,"sort":108,"interval":"daily","repeatable":1,"beast":15,"eventIcon":71222,"issuer":1042301,"target":1042301,"genre":33,"journal":["Maru has all his eggs in one hippo cart.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with the obliging Rider.","Obtain the sack of hamsa eggs.","Deliver the sack of hamsa eggs to Maru."],"dialogue":[{"name":"MARU","text":"<span class=\"highlight\">Forename</span>! We're in a delicate situation here─I need you to bring me a huge sack of hamsa eggs, straightaway!"},{"name":"MARU","text":"Nilopala Nourishments is makin' a riddance, so I had our man in the city buy a whole host of eggs while the buyin's good."},{"name":"MARU","text":"...Only, eggs are too fragile to transport by hippo cart, an' he's still out on delivery. Could you hustle over to him an' pick up that sack of eggy goodness for me?"},{"name":"MARU","text":"He's waitin' for you west of the Wakeful Torana. Make sure nothin' cracks on your way back!"},{"name":"DELIVERYMAN04558","text":"Maru got you the message! Good, 'cause I've been sittin' on these eggs. ...Not literally, of course."},{"name":"DELIVERYMAN04558","text":"I'll be back on the road as soon as I sort these packages, but make sure you get those to Maru before they spoil in this heat."},{"name":"DELIVERYMAN04558","text":"When I relayed how many Maru wanted, the hamsa handler thought I was jestin'. Careful not to crack any on your way back, eh? It's a full bag."},{"name":"MARU","text":"You're back! And the eggs!?"},{"name":"MARU","text":"Nothin' broken, nothin' spoiled! Another <span class=\"emphasis\">eggs</span>cellent job by <span class=\"highlight\">Forename</span>! ...Too much?"},{"name":"MARU","text":"Hamsa eggs are a standard ingredient in loads of Thavnairian recipes, but they spoil quicker than you might think."},{"name":"MARU","text":"Hence Nilopala's riddances─ever since they recovered those hamsa from the old hatchery, they've been overflowin' with eggs that have to sell without delay."},{"name":"MARU","text":"Luckily for us, our menu thrives on hamsa eggs! Rich masala omelettes...spicy kai-jiao...deep-fried telur balado... The possibilities are endless!"},{"name":"MARU","text":"Thanks for your help, <span class=\"highlight\">Forename</span>. An' feel free to pay a visit to our kitchen any time."}],"reward":{"gil":655,"reputation":60,"items":[{"num":5,"id":44},{"id":36657}]},"reqs":{"beastrank":4,"jobs":[{"lvl":80,"id":34}]}},"partials":[{"type":"npc","id":"1042301","obj":{"i":1042301,"n":"Maru","l":3709,"q":28}},{"type":"item","id":"44","obj":{"i":44,"n":"Allagan Tomestone of Causality","l":1,"c":"t/65094","t":63}},{"type":"item","id":"36657","obj":{"i":36657,"n":"Arkasodara Pana","l":1,"c":"t/65091","t":100}}]}