{"quest":{"name":"Seedy Affair","location":"Thavnair","id":70099,"patch":6.15,"sort":113,"interval":"daily","repeatable":1,"beast":15,"eventIcon":71222,"issuer":1042301,"target":1042301,"genre":33,"journal":["Maru seems distressed by pungent plant life.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Use Daemir's antidote on the asvattha seed.","Extract the asvattha seed.","Deliver the asvattha seed to Maru."],"dialogue":[{"name":"MARU","text":"<span class=\"highlight\">Forename</span>! There's an asvattha growin' over by Pavana's Remorse that I'd like to nip in the bud. Or seed, as it were."},{"name":"MARU","text":"Normally, we'd send someone to burn it─our jungles have enough of those things wigglin' around as it is."},{"name":"MARU","text":"Only this time, I hear from the kitchen that one of our cooks wants to use it for...well, just thinkin' about it gives me the creeps. Anyway, could you go 'round an' get it for me?"},{"name":"MARU","text":"Asvattha seeds are naturally coated in poison, so you'll need to douse it with this antidote first. Try an' bring it back in one piece, but don't lose a hand doin' it."},{"name":"SYSTEM","text":"The fizzling of the antidote subsides, and you successfully extract a round asvattha seed! Svarna's cook should be delighted. Report back to Maru with your find."},{"name":"MARU","text":"Uuugh! I ain't even gotta ask─you got that seed. Sisters spare me that wretched scent..."},{"name":"MARU","text":"Thanks, I guess. These ain't rare in Vanaspati, but there ain't no gettin' used to 'em..."},{"name":"MARU","text":"But the cook should be pleased─divinities help us all. Supposedly, drainin' the poison an' soakin' the rotten thing in spirits makes for some amazin' liquor."},{"name":"MARU","text":"Ain't no way <span class=\"emphasis\">I'd</span> ever drink it, but I suppose someone will..."}],"reward":{"gil":735,"reputation":60,"items":[{"num":5,"id":44},{"id":36657}]},"reqs":{"beastrank":4,"jobs":[{"lvl":80,"id":34}]}},"partials":[{"type":"npc","id":"1042301","obj":{"i":1042301,"n":"Maru","l":3709,"q":28}},{"type":"item","id":"44","obj":{"i":44,"n":"Allagan Tomestone of Causality","l":1,"c":"t/65094","t":63}},{"type":"item","id":"36657","obj":{"i":36657,"n":"Arkasodara Pana","l":1,"c":"t/65091","t":100}}]}