{"quest":{"name":"Gulal Generosity","location":"Thavnair","id":70093,"patch":6.15,"sort":107,"interval":"daily","repeatable":1,"beast":15,"eventIcon":71222,"issuer":1042301,"target":1042301,"genre":33,"journal":["Maru looks ready to get bright and messy.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with Vata.","Ride the hippo cart to Palaka's Stand and douse the residents with gulal.","Report back to Maru."],"dialogue":[{"name":"MARU","text":"Wanna go throw stuff at the locals? It's a lot more fun than you might imagine..."},{"name":"MARU","text":"...What's that look for? I ain't up to no good or nothin', if that's what you're thinkin'!"},{"name":"MARU","text":"There's an old island tradition that says peltin' folks with gulal─er, colored powder, very soft─protects 'em from evil an' brings good fortune. Each color even has its own particular blessin'─red for health, blue for tranquility, yellow for plenty, an' so on."},{"name":"MARU","text":"I thought we could throw some from our carts to promote the Hippo Riders. It'll get our name out there, plus give us an excuse to start communicatin' with more folks..."},{"name":"MARU","text":"But why not see for yourself? Maybe start at Palaka's Stand─they got hit hard by the Final Days, so feel free to start flingin' at all an' sundry."},{"name":"MARU","text":"Talk to Vata over there an' he'll set you up with one of our carts. Happy tossin'!"},{"name":"VATA","text":"Hallo, <span class=\"highlight\">Forename</span>─headin' over to Palaka's Stand, are we?"},{"name":"VATA","text":"I've loaded your cart with a classic selection of gulal. Here's an easy way of rememberin' what's what─fighters see <span class=\"emphasis\">red</span>, eh? An' nervous saps get the <span class=\"emphasis\">blues</span>. Heheh! An' yellow...well, you've just gotta remember yellow's for plenty, now don't you? Right then, off you go!"},{"name":"VATA","text":"You take a corner goin' too fast or somethin'? It's alright─I ain't the type to peach on a fellow daredevil. Just hold on tighter this time, eh?"},{"name":"RESIDENTS04557A","text":"All quiet on the jungle front... So far, anyway..."},{"name":"SYSTEM","text":"Speak with Vata in Svarna to board the hippo cart, then throw gulal at this unsuspecting personage."},{"name":"RESIDENTS04557A","text":"Gulal? What a pleasant surprise. You wouldn't happen to have any red, now, would you?"},{"name":"RESIDENTS04557A","text":"Such a beautiful, vibrant color! And that distinctive, pleasant aroma... It may take a while to wash off, but that's simply part of the fun."},{"name":"RESIDENTS04557A","text":"Red gulal is known to nurture good health and ward away injury. I daresay I'll be able to finish my patrol without incident today!"},{"name":"RESIDENTS04557B","text":"What's to become of the village's defenses? Not to mention the temples. There's far too much to do..."},{"name":"SYSTEM","text":"Speak with Vata at Svarna to board the hippo cart, then throw gulal at this unsuspecting personage."},{"name":"RESIDENTS04557B","text":"Wah! Y-You surprised me! ...Is that gulal? You wouldn't happen to be carrying blue, would you!?"},{"name":"RESIDENTS04557B","text":"Aaah! What a refreshing hue. Blue, for a peaceful spirit. I can't remember the last time I spared a moment for happiness like this..."},{"name":"RESIDENTS04557B","text":"There is still so much to be done, but it is precisely in such trying times that one must find and maintain an inner peace. Thank you for reminding me of this."},{"name":"RESIDENTS04557C","text":"Will our supplies last at this rate? But can we afford to order more? What to do..."},{"name":"SYSTEM","text":"Speak with Vata at Svarna to board the hippo cart, then throw gulal at this unsuspecting personage."},{"name":"RESIDENTS04557C","text":"It feels like an age since I last saw some gulal! I don't suppose you have any other colors? Yellow, perhaps?"},{"name":"RESIDENTS04557C","text":"How bright and brilliant! Like a shower of sunshine. Bringing us gulal during these hard times─you Hippo Riders know just what this island needs!"},{"name":"RESIDENTS04557C","text":"Watching our supplies dwindle had me in a state of great unease─but with this blessing for plenty, I feel more optimistic. I hope fortune favors you with the same kindness you have shown me."},{"name":"MARU","text":"Welcome back! Judgin' by your smudgy hands, I'm assumin' it went well?"},{"name":"MARU","text":"Our gulal is made from a Hannish recipe─it uses turmeric, bilva, an' some other medicinal herbs, so it's actually pretty good for you. Or so says the alchemist who taught me how to make it..."},{"name":"MARU","text":"But the most important ingredient─accordin' to that alchemist─is the prayer you've got in your heart for the person you're throwin' it at."},{"name":"MARU","text":"I dunno much about the science of it, but they say gulal works. An' if we were able to spread some cheer to even a few people, that's good enough for me!"}],"reward":{"gil":655,"reputation":60,"items":[{"num":5,"id":44},{"id":36657}]},"reqs":{"beastrank":3,"jobs":[{"lvl":80,"id":34}]}},"partials":[{"type":"npc","id":"1042301","obj":{"i":1042301,"n":"Maru","l":3709,"q":28}},{"type":"item","id":"44","obj":{"i":44,"n":"Allagan Tomestone of Causality","l":1,"c":"t/65094","t":63}},{"type":"item","id":"36657","obj":{"i":36657,"n":"Arkasodara Pana","l":1,"c":"t/65091","t":100}}]}