{"quest":{"name":"Ridin' Hazards","location":"Thavnair","id":70101,"patch":6.15,"sort":115,"interval":"daily","repeatable":1,"beast":15,"eventIcon":71222,"issuer":1042301,"target":1042301,"genre":33,"journal":["Maru has a mitey problem for you.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Survey the area from the designated location and defeat the starmites that appear.","Report back to Maru."],"dialogue":[{"name":"MARU","text":"You know what a starmite is, right? Those hulkin' bugs? Well, they're on my blacklist now!"},{"name":"MARU","text":"I got chased by one the other day over by the old Hamsa Hatchery. My hippo startled so badly, I thought for sure I was goin' overboard..."},{"name":"MARU","text":"The starmites themselves ain't as dangerous as the fear they instill in our poor hippos, but a hazard's a hazard. Think you could lend us your hand of judgment an' cull the buggers?"},{"name":"MARU","text":"You remember those starmites you squashed? Well...they're bein' avenged."},{"name":"MARU","text":"It's hard to tell what's more shaken─our sweet hippos' hearts or our cargo. Either way, all that's waitin' for us on those roads is bugs an' sorrow..."},{"name":"MARU","text":"You've gotta help us, <span class=\"highlight\">Forename</span>. Head back over to the Perfumed Rise an' reunite those starmites with their maker... "},{"name":"MARU","text":"You're a savior, <span class=\"highlight\">Forename</span>! We can ride easy now, knowin' there are fewer starmites on the roads..."},{"name":"MARU","text":"Bein' chased is bad enough, but if we were to hit one at any speed, the cart would be wrecked an' the darlin' hippo injured─if not worse."},{"name":"MARU","text":"Safe ridin's no trivial thing, so I might ask for your help smashin' starmites again sometime. Thanks for always lookin' out for us."}],"reward":{"gil":655,"reputation":60,"items":[{"num":5,"id":44},{"id":36657}]},"reqs":{"beastrank":5,"jobs":[{"lvl":80,"id":34}]}},"partials":[{"type":"npc","id":"1042301","obj":{"i":1042301,"n":"Maru","l":3709,"q":28}},{"type":"item","id":"44","obj":{"i":44,"n":"Allagan Tomestone of Causality","l":1,"c":"t/65094","t":63}},{"type":"item","id":"36657","obj":{"i":36657,"n":"Arkasodara Pana","l":1,"c":"t/65091","t":100}}]}