{"quest":{"name":"A Hippo's Best Friend","location":"Thavnair","id":70107,"patch":6.15,"sort":121,"interval":"daily","repeatable":1,"beast":15,"eventIcon":71222,"issuer":1042301,"target":1042301,"genre":33,"journal":["Maru is keeping his distance from a nearby crate.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Use the Daemir Demolishers on the mudstone mound in the Shroud of the Samgha.","Obtain the hunk of Ksiroda mudstone.","Deliver the hunk of Ksiroda mudstone to Maru."],"dialogue":[{"name":"MARU","text":"I've been meanin' to ask you this for some time, <span class=\"highlight\">Forename</span>, but truth be told, I was nervous. Thought it might be too dangerous..."},{"name":"MARU","text":"But then Kancana told me that your adventures've tossed you into the maw of death an' back again. I figure handlin' some explosives is child's play compared to that...right?"},{"name":"MARU","text":"...Well, you're still here, so I'll take that as a sign of tacit agreement. We need someone to break up the mudstone around Ksiroda an' bring back a piece. The alchemists keep tellin' me this is the best way, but...just mind your fingers, alright?"},{"name":"MARU","text":"There you are─an' with fingers an' toes still attached! I take it that means the alchemists were right after all."},{"name":"MARU","text":"Good, good─these'll do it. Mixin' mudstone into water makes a paste that keeps the skin safer from sun an' wind than just about anythin'."},{"name":"MARU","text":"You might not think it to look at 'em, but hippos have a delicate hide. If you don't keep it nice and moist, it'll crack like so much mud on a hot day. We're really in your debt this time."},{"name":"MARU","text":"Sure, maybe you could've just broken up the stone with a hammer an' chisel...but now I don't gotta worry about someone accidentally settin' those demolishers alight an' blowin' us all into the next life, neither."}],"reward":{"gil":655,"reputation":60,"items":[{"num":5,"id":44},{"id":36657}]},"reqs":{"beastrank":5,"jobs":[{"lvl":80,"id":34}]}},"partials":[{"type":"npc","id":"1042301","obj":{"i":1042301,"n":"Maru","l":3709,"q":28}},{"type":"item","id":"44","obj":{"i":44,"n":"Allagan Tomestone of Causality","l":1,"c":"t/65094","t":63}},{"type":"item","id":"36657","obj":{"i":36657,"n":"Arkasodara Pana","l":1,"c":"t/65091","t":100}}]}