{"quest":{"name":"An Explosive Brew","location":"Thavnair","id":70108,"patch":6.15,"sort":122,"interval":"daily","repeatable":1,"beast":15,"eventIcon":71222,"issuer":1042301,"target":1042301,"genre":33,"journal":["Maru seeks a hunter to brave the wilderness.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Keep lookout at the designated locations and slay any odqan that appear.","Deliver the odqan fragments to Maru."],"dialogue":[{"name":"MARU","text":"Next up's a bit of huntin'─a task I'm woefully unfit for. You're just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> we need, though."},{"name":"MARU","text":"Your prey're creatures that make even the hardiest Radiant squirm in terror or...somethin'. I don't rightly know, but I wager the prospect of that kinda foe gets your juices flowin'."},{"name":"MARU","text":"Make your way, weapon in hand, to the Shroud of the Samgha, and be on the lookout for the odqan that stalk the area. Stalk them in turn, and collect two fragments of their hardened skin. ...That sound good? It does, don't it?"},{"name":"MARU","text":"Welcome back. You're lookin' fierce─I guess the fever of battle still hasn't left you. Hope you didn't slay more odqan than you needed..."},{"name":"MARU","text":"Ah, you've really outdone yourself this time, <span class=\"highlight\">Forename</span>. After I grind these up to a fine powder, I reckon the spirits we brew from 'em will have people talkin'─and drinkin'─long past hippo bedtime."},{"name":"MARU","text":"They say an alchemist stumbled upon the recipe after a string of failures─he was tryin' to make an explosive liquid out of the powder, you see, but only got a liquidy liquid. At his wit's end, he decided to drown his sorrows with the tepid mixture."},{"name":"MARU","text":"Imagine his surprise when the first drop hit his tongue, showin' that what the solution lacked in blastin' power, it made up for in flavor! Wasn't long before his libation spread to every corner of the island and he was hailed as a genius."},{"name":"MARU","text":"That's the story, anyroad. Believe it or not, the brew disappears almost as fast as we can make it, so I'm sure I'll be askin' for your help again sooner rather than later..."}],"reward":{"gil":655,"reputation":60,"items":[{"num":5,"id":44},{"id":36657}]},"reqs":{"beastrank":6,"jobs":[{"lvl":80,"id":34}]}},"partials":[{"type":"npc","id":"1042301","obj":{"i":1042301,"n":"Maru","l":3709,"q":28}},{"type":"item","id":"44","obj":{"i":44,"n":"Allagan Tomestone of Causality","l":1,"c":"t/65094","t":63}},{"type":"item","id":"36657","obj":{"i":36657,"n":"Arkasodara Pana","l":1,"c":"t/65091","t":100}}]}