{"quest":{"name":"Hells Hath No Fury as a Hippo Scorned","location":"Thavnair","id":70104,"patch":6.15,"sort":118,"interval":"daily","repeatable":1,"beast":15,"eventIcon":71222,"issuer":1042301,"target":1042301,"genre":33,"journal":["Maru is searching for a hungry fugitive.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Choose some hippo feed.","Feed the hungry hippo.","Report back to Maru."],"dialogue":[{"name":"MARU","text":"We've got a runaway on our hands, <span class=\"highlight\">Forename</span>. A hippo runaway, that is..."},{"name":"MARU","text":"One of our 'pots has a really robust appetite, but recently it's been a little <span class=\"emphasis\">too</span> robust. We've started rationin' him─'cause it ain't good to overfeed─but he didn't take well to that an' ran off in a huff."},{"name":"MARU","text":"One of our Riders spotted him barrelin' towards the jungle─I think he's frustrated an' angry at all of us, but maybe he'll hear reason if it's comin' from you?"},{"name":"MARU","text":"Take him some feed as a peace offerin'─we've got three kinds you can choose from. Tell him we ain't tryin' to make him suffer, we just wanna make sure he's healthy..."},{"name":"HIPPO04568","text":"Pohhhhhh. Poh, poh-pohhh..."},{"name":"HIPPO04568","text":"Pohhh! Poh, poh!!!"},{"name":"SYSTEM","text":"The hippo inhales the dried grass with alarming speed, then trots away in the direction of Svarna."},{"name":"HIPPO04568","text":"Poh, po-poh... Pooohhh!!!"},{"name":"SYSTEM","text":"The hippo demolishes the vegetables with rapturous gusto, then skips away in the direction of Svarna."},{"name":"HIPPO04568","text":"Pohhh? Poh poh, poh poh poh! Poh..."},{"name":"SYSTEM","text":"The hippo masticates Ghasa's formula with a complicated expression of wounded gratitude, before faithfully plodding away in the direction of Svarna."},{"name":"SYSTEM","text":"You should report back to Maru and see if reconciliation has been achieved."},{"name":"MARU","text":"You're back! An' right on the tail of our runaway─I knew he'd come around if you explained it."},{"name":"MARU","text":"Oh, you decided to go with the dried grass blend? I can smell it on your hands..."},{"name":"MARU","text":"Dried grass might not seem like enough food for big critters like hippos, but it's actually got a lot of nutrients an' goes easy on the stomach. Stores well too, so it's a handy sort of feed to have around..."},{"name":"MARU","text":"Oh, you chose the vegetable mix? Your hands smell like tubers..."},{"name":"MARU","text":"Our hippos like the crunch on that one, plus it's got loads of vitamins... We even tried addin' those imported─what're they called? Carrots of happiness? Perks the hippos up every time..."},{"name":"MARU","text":"Oh, you brought him Ghasa's special recipe, didn't you? I'd know that fruity smell anywhere..."},{"name":"MARU","text":"Our man Ghasa, he loves hippos more than anyone I've ever met. He spent ages comin' up with the perfect combination of nutrients and medicinal herbs to fill our hippos' bellies while keepin' 'em refreshed an' healthy..."},{"name":"MARU","text":"Anyroad, all's well that ends well, I guess. Thanks for bein' our mediator─we'll be sure to work out an agreement with our hungry 'pot."}],"reward":{"gil":735,"reputation":60,"items":[{"num":5,"id":44},{"id":36657}]},"reqs":{"beastrank":5,"jobs":[{"lvl":80,"id":34}]}},"partials":[{"type":"npc","id":"1042301","obj":{"i":1042301,"n":"Maru","l":3709,"q":28}},{"type":"item","id":"44","obj":{"i":44,"n":"Allagan Tomestone of Causality","l":1,"c":"t/65094","t":63}},{"type":"item","id":"36657","obj":{"i":36657,"n":"Arkasodara Pana","l":1,"c":"t/65091","t":100}}]}