{"quest":{"name":"Olfactory Warfare","location":"Thavnair","id":70100,"patch":6.15,"sort":114,"interval":"daily","repeatable":1,"beast":15,"eventIcon":71222,"issuer":1042301,"target":1042301,"genre":33,"journal":["Maru is vexed by monkey business.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with Vata.","Throw yellow gulal at hanuman langurs while riding the hippo cart.","Report back to Maru."],"dialogue":[{"name":"MARU","text":"Havin' fresh food around the place is truly a blessin', but our kitchen's caught the attention of some hanuman langurs─an' the boss wants it sorted <span class=\"emphasis\">now</span>."},{"name":"MARU","text":"I reckon if we've been reelin' 'em in with the scent of our Hippo Rider Specials, we can use a different sort of smell to drive 'em out..."},{"name":"MARU","text":"Namely, gulal! It ain't toxic, but certain jungle critters can't stand its, er, unique aroma."},{"name":"MARU","text":"Talk to Vata an' he'll tell you what sort of gulal makes a hanuman langur gag. Oh, an' take a cart while you're at it─we want those langurs to know that our hippos mean business. <span class=\"emphasis\">Stenchy</span> business."},{"name":"VATA","text":"How's it rollin'? Out to fling pigment at langurs, are we?"},{"name":"VATA","text":"Through proper research and suchlike, I've learned that yellow gulal is most effective for drivin' away hanuman langurs. Or maybe I accidentally hit one when I was throwin' a blessin' for plenty one day, an' haven't stopped laughin' since. Who's to say?"},{"name":"VATA","text":"Just don't forget─you've got a live hippo yoked to your cart, eh? In the immortal words of my mum, “Those who don't hold on, fall off.” Ta-ta!"},{"name":"VATA","text":"The secret to throwin' the perfect arc of gulal? Don't throw yourself with it."},{"name":"MONKEY04564","text":"(-Fleeing Hanuman Langur-)Khe-kheeeeee!"},{"name":"MONKEY04564","text":"(-Shocked Hanuman Langur-)Khe-khe-kheee!?"},{"name":"MONKEY04564","text":"(-Disgruntled Hanuman Langur-)Khhheee! Khhheeeeee!!!"},{"name":"SYSTEM","text":"According to Vata, yellow gulal is best for driving away hanuman langurs. Summon the color wheel to your mind's eye and try again!"},{"name":"SYSTEM","text":"Speak with Vata in Svarna to mount the hippo cart, then throw yellow gulal at hanuman langurs."},{"name":"MARU","text":"You're yellow up to your elbows! I'll bet the langurs can smell you from malms away."},{"name":"MARU","text":"Still, somethin' tells me we haven't seen the last of 'em, so I might borrow your throwin' arm again before long..."}],"reward":{"gil":735,"reputation":60,"items":[{"num":5,"id":44},{"id":36657}]},"reqs":{"beastrank":4,"jobs":[{"lvl":80,"id":34}]}},"partials":[{"type":"npc","id":"1042301","obj":{"i":1042301,"n":"Maru","l":3709,"q":28}},{"type":"item","id":"44","obj":{"i":44,"n":"Allagan Tomestone of Causality","l":1,"c":"t/65094","t":63}},{"type":"item","id":"36657","obj":{"i":36657,"n":"Arkasodara Pana","l":1,"c":"t/65091","t":100}}]}