{"quest":{"name":"Blood from a Stonemason","location":"Thavnair","id":70110,"patch":6.15,"sort":124,"interval":"daily","repeatable":1,"beast":15,"eventIcon":71222,"issuer":1042301,"target":1042301,"genre":33,"journal":["Something seems to be troubling Maru.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["/doubt the stonemasons at the Giantsgall Grounds.","Deliver the sacks of gil owed to Maru."],"dialogue":[{"name":"MARU","text":"Our meyhane setup's been bringin' in folk from all over the island and beyond. It's hard work, but the proprietor couldn't be happier to keep the libations flowin'."},{"name":"MARU","text":"That bein' said, no paradise is without its faults. We've got more than a few regulars who keep promisin' to pay, yet keep showin' up with empty purses and goin' home with full bellies."},{"name":"MARU","text":"We keep askin' them to pay up, but it seems our words slip their mind as soon as the liquor slides down their gullet. I was wonderin' if maybe you could help us out with this little problem."},{"name":"MARU","text":"Three of these delinquents are at this very moment workin' at the Giantsgall Grounds. I think if a fierce-lookin' <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> like yourself were to <span class=\"highlight\">doubt</span> their intentions to settle with us, they might think twice before shirkin' their debt again."},{"name":"BUSYMAN04574","text":"Hey, I'm workin' here! I don't have time for chitchat!"},{"name":"SYSTEM","text":"This man has no interest in conversation, but a healthy dose of <span class=\"highlight\">doubt</span> might earn his attention."},{"name":"BUSYMAN04574","text":"Huh? The Hippo Riders sent you? H-Hey now, you don't have to scowl at me like that. I have their money—here, take it."},{"name":"BUSYMAN04574","text":"I should've settled up earlier, but you know how things go...right? I'll make the proper apologies soon enough, so you go and tell them how cooperative I was, eh? ...Please?"},{"name":"ONABREAKMAN04574","text":"What, you think I'm some kind of thief!? I'll have you know a friend of mine works at the meyhane, and he's been hounding me to no end. Don't worry—if I was going to run, I'd have done it already."},{"name":"SYSTEM","text":"He doesn't seem too worried about his mounting debt. Perhaps you make him <span class=\"highlight\">doubt</span> his current financial strategy."},{"name":"ONABREAKMAN04574","text":"...Huh? You're really in a fit of pique, aren't you? I didn't know the meyhane needed funds <span class=\"emphasis\">that</span> badly."},{"name":"ONABREAKMAN04574","text":"All right, all right, I'll pay what I owe. Don't know what I'd do with my evenings if I couldn't spend them at the meyhane. You go ahead and tell Maru I'll be along with his money within the bell."},{"name":"CHECKINGWOMAN04574","text":"Excuse me, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>, but as you can see, I'm quite busy..."},{"name":"SYSTEM","text":"She seems distracted by her work. Make her <span class=\"highlight\">doubt</span> her priorities."},{"name":"CHECKINGWOMAN04574","text":"What!? You said I owe <span class=\"emphasis\">how</span> much!? I'm embarrassed to say, but I'm always four sheets to the wind by the time I settle the bill..."},{"name":"CHECKINGWOMAN04574","text":"Can you take this to the kind people at Svarna? I've even put in a bit extra by way of apology for my...oversight. And while I'll tell them myself when next I see them, for now I'd be grateful if you apologized in my stead."},{"name":"MARU","text":"I hope there wasn't any trouble. While they can be surly with a few drinks in 'em, they're good-natured in the daylight. Or so I hope."},{"name":"MARU","text":"Well, well─you're still plenty persuasive, it seems. Truth be told, more'n a few of the quarriers comin' to the meyhane to blow off steam are friends and relatives of the good folks helpin' us out here in Svarna."},{"name":"MARU","text":"In the interest of maintainin' good relations, I never pestered them overmuch, but now I'm comin' to realize that some just can't help takin' a malm if you give them an ilm."},{"name":"MARU","text":"I'll have a talk with the proprietor about how we should deal with this problem in the future... I'm thinkin' we'll be needin' a solution sooner rather than later. Thanks for your help today, <span class=\"highlight\">Forename</span>."}],"reward":{"gil":655,"reputation":60,"items":[{"num":5,"id":44},{"id":36657}]},"reqs":{"beastrank":6,"jobs":[{"lvl":80,"id":34}]}},"partials":[{"type":"npc","id":"1042301","obj":{"i":1042301,"n":"Maru","l":3709,"q":28}},{"type":"item","id":"44","obj":{"i":44,"n":"Allagan Tomestone of Causality","l":1,"c":"t/65094","t":63}},{"type":"item","id":"36657","obj":{"i":36657,"n":"Arkasodara Pana","l":1,"c":"t/65091","t":100}}]}