{"quest":{"name":"Steep the Legs","location":"Thavnair","id":70114,"patch":6.15,"sort":128,"interval":"daily","repeatable":1,"beast":15,"eventIcon":71222,"issuer":1042301,"target":1042301,"genre":33,"journal":["Maru reeds a resupply for a bustling business.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Place the fragrant fish at the designated locations and slay any Akyaali crabs that appear.","Deliver the Akyaali crab legs to Maru."],"dialogue":[{"name":"MARU","text":"The meyhane has drawn people of all stripes to our little corner of the realm, and for that I'm grateful. That bein' said, the strain on our supplies grows with every new face, and I need your help to stave off an impendin' shortage."},{"name":"MARU","text":"I'm talkin' about Akyaali crab legs─as popular as they are pointy! Still, the creature that bears 'em should be easy prey for you. I reckon they'll know it, too, so don't be stingy with the bait if you want 'em to come scuttlin'."},{"name":"MARU","text":"Just to be on the safe side, you'd best set down three of these fish, eh? Space 'em out, too, so as to better your chances. Safe huntin', friend."},{"name":"SYSTEM","text":"There don't appear to be any hungry crabs in the area."},{"name":"MARU","text":"Ah, there you are. I hope you had a chance to enjoy the spray of salt water on your face durin' your hunt. Did you get the legs?"},{"name":"MARU","text":"Ah, yes... These are exactly what I was lookin' for. Thank you for bringin' me such fine specimens─we'll feed many a hungry Hippo Rider with these."},{"name":"MARU","text":"...An' plenty of visitors besides, no doubt. Not a lot of cooks linin' up to duel those spindly buggers, even if their meat makes for some of the most mouthwaterin' seafood on the island."},{"name":"MARU","text":"Toss 'em in a curry and their flavor still sings through the spices, or throw 'em in a biryani for some delightful texture. And that's just the beginnin'..."},{"name":"MARU","text":"'Course, if they ain't fresh, they ain't nearly as tasty, so it may not be long before we're needin' more. Until then!"}],"reward":{"gil":655,"reputation":60,"items":[{"num":5,"id":44},{"id":36657}]},"reqs":{"beastrank":6,"jobs":[{"lvl":80,"id":34}]}},"partials":[{"type":"npc","id":"1042301","obj":{"i":1042301,"n":"Maru","l":3709,"q":28}},{"type":"item","id":"44","obj":{"i":44,"n":"Allagan Tomestone of Causality","l":1,"c":"t/65094","t":63}},{"type":"item","id":"36657","obj":{"i":36657,"n":"Arkasodara Pana","l":1,"c":"t/65091","t":100}}]}