{"quest":{"name":"Frozen Hope","location":"Garlemald","id":70116,"patch":6.1,"sort":2,"icon":101176,"eventIcon":71221,"issuer":1042733,"target":1042746,"genre":189,"journal":["Artoirel is eager to begin his inquiry.","Hoping to cover more ground, Artoirel suggests splitting up to speak with as many Garleans as possible. He asks you and Fourchenault to speak with the people at Victors' Spoils, while he and the Gridanian sentry carry out their inquiries at Liminal Station IV.","Fourchenault suspects the Garleans, having chosen frozen squalor over the comforts of camp, will not be amenable to conversation. Nevertheless, you must press on and speak with anyone willing to talk.","The Garleans have painted a rather grim picture of their lives, making it clear how their countrymen might succumb to despair. You go and speak with Fourchenault to see what he has learned, though you have little hope he has heard anything better.","There are no glad tidings to be had when you confer with Fourchenault. Before you can decide your next plan of action, however, a shrill cry in the distance interrupts your train of thought.","Following the sound of the scream, you happen upon one of the Garlean refugees. He tells you his comrade transformed into grisly horror and wandered off in the direction of the Tower of Babil. Fearing the worst, Fourchenault bids you give chase while he stays behind to account for all those who yet remain.","You find the wayward beast and slay it before anyone comes to harm. Fourchenault will be glad for the news.","Witnesses to the transformation noted that the man affected was listening to a radio which continues to play a strange, cryptic message. As you consider who could be sending this broadcast, you are soon joined by Aymeric, Merlwyb, Artoirel, and the Gridanian sentry. You listen to the radio together once more, and part of its message strikes a chord with the sentry─he recalls it being the mantra of Nerva yae Galvus of the IIIrd Legion. With this newfound information, Fourchenault is now convinced that Nerva is the blasphemy they are searching for.<br><br>Before long, the group's attention turns to the more immediate concern of the Garlean refugees. Though reluctant at first, they are soon convinced to discuss forming an interim governing body, as well as the possibility of rebuilding Garlemald or immigrating to Sharlayan. The Grand Company leaders have much to think about, affording you the opportunity to rest until there is new word of the blasphemy."],"objectives":["Speak with Fourchenault.","Speak with the refugees.","Speak with Fourchenault.","Speak with the sullen refugee.","Seek out and defeat the fell beast.","Speak with Fourchenault."],"dialogue":[{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"I am not Garlean by blood, but having been raised in the imperial provinces, I would be lying if I said I am not moved by their plight."},{"name":"FOURCHENAULT","text":"Locus Amoenus suffered greatly in the wake of the Final Days─'tis only natural they would have sought shelter at the capital. I can but imagine their horror upon arrival..."},{"name":"ARTOIREL","text":"Time being of the essence, I believe it prudent we split into two groups and cover as much ground as we may, as quickly as possible."},{"name":"ARTOIREL","text":"If you and Master Fourchenault would inquire after the people at Victors' Spoils, the two of us shall see what we may learn at Liminal Station IV. When you have finished, pray meet us there."},{"name":"FOURCHENAULT","text":"Victors' Spoils is to the east of here, yes? Let us be off."},{"name":"FOURCHENAULT","text":"That they should choose to reside here in the cold, I can but presume they will not be amenable to conversation. Even so, we must not be deterred. Come."},{"name":"FOURCHENAULT","text":"Shall we meet back here when we have finished?"},{"name":"PRICKLYRETURNEE","text":"Come to hear our grievances, have you? Hmph. We've more than you have time to hear them, I'm sure."},{"name":"PRICKLYRETURNEE","text":"We've lost not one, but <span class=\"emphasis\">two</span> homes. Our loved ones, our livelihood... There's nothing left."},{"name":"PRICKLYRETURNEE","text":"I served my time with the military, aye. For what? To lose all my friends. My son... And there was naught to show for it but our claim to Locus Amoenus."},{"name":"PRICKLYRETURNEE","text":"Or so we thought. Calamity was visited upon us for reasons we know not, and when we thought to flee, it followed on our heels to Garlemald. Ruin and ash at every turn..."},{"name":"YOUNGRETURNEE","text":"Can't imagine why you or anyone else would feign interest in our troubles, but if you insist..."},{"name":"YOUNGRETURNEE","text":"You'll find a great many of the people here were in the military at one time or another. Some retiring with honors, and others without. Sadly, I'm one of the latter─bore one too many scars in battle. Even so, my contributions were enough to warrant leave to move to Locus Amoenus."},{"name":"YOUNGRETURNEE","text":"It was a land of warmth and bounty. The Corvosi rebellion, admittedly, proved troublesome for a time, but it didn't take long for the IInd Legion to quell their uprising. You could practically drown in the calm and quiet."},{"name":"YOUNGRETURNEE","text":"And then one day the skies came alive with flame. We were overrun by all manner of foul beasts born of our brothers and sisters. The IInd Legion barely had time to assemble their forces before they were overrun and snuffed out. We barely escaped with our lives."},{"name":"YOUNGRETURNEE","text":"But we were greeted only with more wrack and ruin on our arrival here, and we've not the strength to take our home back from the Corvosi a second time... There's nothing left for us anywhere."},{"name":"EMACIATEDRETURNEE","text":"Talk? What is there to talk about? We've no home. No future... Nothing. This doom spells the end for us all."},{"name":"PRICKLYRETURNEE","text":"What are we to do with nothing left to live for?"},{"name":"YOUNGRETURNEE","text":"If it's all the same to you, I'd like to be alone right now."},{"name":"EMACIATEDRETURNEE","text":"How... How did it come to this...?"},{"name":"FOURCHENAULT","text":"Did you learn aught of how they came to be in such dire straits?"},{"name":"FOURCHENAULT","text":"I see. I heard much of the same."},{"name":"FOURCHENAULT","text":"The military forces of Locus Amoenus were defeated in the wake of the Final Days. Desperate to survive, they naturally fled to Garlemald seeking sanctuary."},{"name":"FOURCHENAULT","text":"It was their hope the might of the Empire would allow them to reclaim the home they were forced to abandon... But the capital was already in ruin when they arrived. "},{"name":"FOURCHENAULT","text":"Needless to say, the lands they have long believed to be the ancestral home of the Garlean people may remain forever lost to them."},{"name":"FOURCHENAULT","text":"Those unfamiliar with history would believe they have always resided in the bitter cold climes of northern Ilsabard, but that was only after the Corvosi invaded eight hundred years prior."},{"name":"FOURCHENAULT","text":"With the advent of magitek, I imagine it was all too easy for Emperor Solus to rally his people and take back what they believed to be rightfully theirs."},{"name":"FOURCHENAULT","text":"Yet history would tell us true─that the land they call Locus Amoenus has been known by other names, and served as home to myriad peoples."},{"name":"FOURCHENAULT","text":"Indeed, one need only look back to the Allagans' reign in the Third Astral Era to give the lie to Garlean claims of sovereignty."},{"name":"FOURCHENAULT","text":"Yet even had they such ancestral ties to Locus Amoenus, antecedence cannot justify their animosity to foreign peoples."},{"name":"FOURCHENAULT","text":"Animosity poorly veiled by delusions of justice, as has been the case for so many nations throughout history. Would that man had the sense and strength of will to break free from such chains of hatred."},{"name":"PRICKLYRETURNEE","text":"(-Shrill Cry-)Help! Someone help! They...they've turned!"},{"name":"FOURCHENAULT","text":"Another monster!? Quickly, <span class=\"highlight\">Forename</span>. We haven't a moment to lose!"},{"name":"FOURCHENAULT","text":"Gods... What happened?"},{"name":"PRICKLYRETURNEE","text":"One of my mates seemed unwell, so I thought to come over and look in on him."},{"name":"PRICKLYRETURNEE","text":"Next thing I knew, he...he..."},{"name":"FOURCHENAULT","text":"No one appears to be injured... Did he not attack?"},{"name":"PRICKLYRETURNEE","text":"He just walked off in the direction of the tower. In a daze, as if it was calling to him."},{"name":"FOURCHENAULT","text":"He could not have gone far. If you would go after him, I will remain here and see that all are accounted for."},{"name":"PRICKLYRETURNEE","text":"Have we not suffered enough...?"},{"name":"FOURCHENAULT","text":"I will see to matters here. Go and find that beast before it can reach the tower."},{"name":"FOURCHENAULT","text":"The beast is slain, then. Thank the heavens..."},{"name":"FOURCHENAULT","text":"For a blessing, no others have turned, and a measure of calm has been restored, if only for the moment."},{"name":"FOURCHENAULT","text":"Witnesses were able to offer a clue as to the source of the transformation. They claim the afflicted was listening to this radio."},{"name":"FOURCHENAULT","text":"Even now it continues to play the same, cryptic message."},{"name":"NERVA","text":"(-Radio-)...Empire...no more. Never again...rise...ashes."},{"name":"SYSTEM","text":"Though distorted by radio static, you can hear a voice saying “The Empire is no more. Never again shall it rise from the ashes.”"},{"name":"FOURCHENAULT","text":"But how is this possible? There are no facilities left standing that could possibly deliver a broadcast."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Anima was capable of sending such a message."},{"name":"A1","text":"The last time this happened, the signal came from the Tower of Babil."},{"name":"FOURCHENAULT","text":"Be that as it may, Anima is no more, and the Tower of Babil has fallen into disrepair. By your hand, no less."},{"name":"FOURCHENAULT","text":"Which begs the question: who─or perhaps, what─could be behind this?"},{"name":"ARTOIREL","text":"<span class=\"highlight\">Forename</span>. Master Fourchenault. A moment, if you would."},{"name":"ARTOIREL","text":"Shortly after we finished our inquiry at Liminal Station IV, Lord Aymeric and Admiral Merlwyb arrived, and requested an audience."},{"name":"AYMERIC","text":"Apologies for our late arrival. Knowing firsthand the devastation of which blasphemies are capable, I discussed the matter with the Admiral, and we were of one mind that the situation warranted our immediate presence."},{"name":"MERLWYB","text":"Is it safe to presume a representative of the survey team has already arrived?"},{"name":"FOURCHENAULT","text":"Indeed I have. Thank you for coming all this way on such short notice."},{"name":"FOURCHENAULT","text":"Recent events here at the camp have proved most enlightening."},{"name":"AYMERIC","text":"And this is the aforementioned radio?"},{"name":"NERVA","text":"(-Radio-)...Empire...no more. Never again...rise...ashes."},{"name":"AYMERIC","text":"A harsh reminder of their misfortune. Sufficient to push some wayward few over the edge, it would seem."},{"name":"MERLWYB","text":"Yet there still remains the question of who is sending this message, and from where."},{"name":"NERVA","text":"(-Radio-)...Glory...everlasting... Garlemald."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"“For glory everlasting. For Garlemald.” No, it couldn't be..."},{"name":"AYMERIC","text":"You recognize this message?"},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"A mantra often spoken by Lord Nerva. Anyone who lived in the provinces under his authority could scarcely forget those words."},{"name":"MERLWYB","text":"He sought to claim the throne after the assassination of Emperor Varis, did he not?"},{"name":"MERLWYB","text":"After civil war broke out, he all but disappeared according to the intelligence we managed to gather. How could he have managed to breach the tower undetected?"},{"name":"FOURCHENAULT","text":"To have done so and remain unnoticed by the creatures infesting the tower seems a nigh-impossible task. Unless..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Do you think the voice on the radio is the blasphemy?"},{"name":"A2","text":"Do you think the voice on the radio is Nerva?"},{"name":"FOURCHENAULT","text":"I do. And as it was with Anima, these radios are somehow attuned to whatever signal it emits from the tower."},{"name":"FOURCHENAULT","text":"What's more, I believe the true identity of the blasphemy is Nerva. Robbed of the throne, and forced to watch the Empire he longed to command crumble before his very eyes... If such loss did not drive him to the same fate as Quintus, the despair he felt no doubt overcame and turned him."},{"name":"FOURCHENAULT","text":"In a manner of speaking, yes."},{"name":"FOURCHENAULT","text":"Not as the man he once was, but as a blasphemy. Robbed of the throne, and forced to watch the Empire he longed to command crumble before his very eyes... If such loss did not drive him to the same fate as Quintus, the despair he felt no doubt overcame and turned him."},{"name":"MERLWYB","text":"Nerva's delusions of grandeur aside, the Garleans' plight sounds not unlike the Sahagin, desperate to preserve their spawning grounds."},{"name":"AYMERIC","text":"Indeed. Though unscrupulous by any measure, the Garleans found solidarity in their ideology, as did the people of Ishgard in the church. Adrift without home or purpose, it is all too easy for despair to take hold."},{"name":"MERLWYB","text":"Would that a remedy were as simple as offering them land as we did the Sahagin."},{"name":"FOURCHENAULT","text":"In all likelihood, the Garleans would refuse to settle for aught less than what they believe to be their ancestral homeland of Locus Amoenus, a claim the Corvosi would readily take arms to denounce. We would do well not to further fan the flames of animosity 'twixt them."},{"name":"AYMERIC","text":"Then perhaps, at the very least, we can offer them peace of mind, and a means to regain some semblance of stability in their lives. "},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"To offer them true comfort and stability, Garlemald must be rebuilt."},{"name":"A3","text":"..."},{"name":"AYMERIC","text":"By no means an easy solution, but perhaps the only one worthy of pursuit. Of course, this new Garlemald must remain a sovereign nation, free from the oversight of others."},{"name":"AYMERIC","text":"'Tis by no means an easy solution, but I fear we have little recourse but to see Garlemald rebuilt. As a sovereign nation, of course─free from the oversight of others."},{"name":"MERLWYB","text":"Aye, they would see no meaning in it otherwise."},{"name":"MERLWYB","text":"If I'm not mistaken, Alphinaud and Alisaie have already made strides in helping the people here regain some normalcy in their day-to-day living. A most important first step, but it will mean little without proper leadership."},{"name":"FOURCHENAULT","text":"Rather than a single individual, perhaps a governing body of sorts would prove more effective."},{"name":"ARTOIREL","text":"There are a number of former senate members among the refugees at Camp Broken Glass, as I recall. With their help, creating the framework for new governance is not an impossibility."},{"name":"ARTOIREL","text":"Then let us call the people together, and see what they make of our proposal."},{"name":"MERLWYB","text":"The Final Days has taken much from you all. I can but imagine the pain you feel in the face of such immeasurable loss."},{"name":"MERLWYB","text":"And though the Final Days have been averted, its effects yet linger, and a blasphemy has been born of your suffering. Decisive action must be taken before further harm is wrought upon you."},{"name":"AYMERIC","text":"To overcome such adversity is too great a task for any one person. But as a people united, there may yet be hope for the morrow."},{"name":"AYMERIC","text":"While it is not our place to decide how you will move forward, we would offer a small measure of guidance."},{"name":"AYMERIC","text":"We were told a number of former members of your senate yet remain among you. Would you be amenable to an interim government led by these individuals, until such time as Garlemald can be rebuilt?"},{"name":"KINDLYRETURNEE","text":"Rebuild Garlemald...? Is such a thing truly possible?"},{"name":"PRICKLYRETURNEE","text":"Hmph. Even if we do cobble together some governing council, they won't be making anything of that pile of ash we dare call Garlemald."},{"name":"PRICKLYRETURNEE","text":"There's no going back to Locus Amoenus, either. Wrack and ruin... Those are our only options."},{"name":"FOURCHENAULT","text":"I realize to rebuild Garlemald is a seemingly impossible task, but you needn't undertake it alone."},{"name":"FOURCHENAULT","text":"My children are working with members of the Ist Legion as we speak to begin an organized relief effort."},{"name":"FOURCHENAULT","text":"And there are others from the provinces no doubt willing to lend their expertise."},{"name":"FOURCHENAULT","text":"You need but ask─not as would-be conquerors, but as brothers and sisters of this star─and others will heed your call."},{"name":"FOURCHENAULT","text":"If you should still see no merit in the rebuilding of Garlemald, then I would instead offer you residency in Sharlayan. I promise you will be welcomed with open arms."},{"name":"PRICKLYRETURNEE","text":"Sharlayan? So now you'd expect us to go and lick boots in some country we've never even heard of?"},{"name":"FOURCHENAULT","text":"My apologies if I appeared overly forward in my proposition. Considering our strict policies on nonintervention until but recently, it is not surprising that you are unfamiliar with my homeland."},{"name":"FOURCHENAULT","text":"It is an island nation to the north, home to myriad peoples. Which is why I believe it would not prove difficult to accommodate you and yours."},{"name":"FOURCHENAULT","text":"To be clear, you would not be migrating to Sharlayan to live in servitude. You have my word that each and every one of you would be guaranteed citizenship upon entry."},{"name":"PRICKLYRETURNEE","text":"And why, exactly, would you go to such lengths for us? For the “conquerors” you barely know?"},{"name":"FOURCHENAULT","text":"Sharlayan was long aware of the coming doom that would be the Final Days, and so we were preparing to evacuate this star, taking as many people and resources as our stores would allow."},{"name":"FOURCHENAULT","text":"Initially, it was our intent to save the people of Garlemald as well... But we had not forgotten your transgressions invading Ala Mhigo. Your rejection of our entreaties for peace."},{"name":"FOURCHENAULT","text":"After a great deal of deliberation, it was decided that we would forgo an invitation to Garlemald. A determination made with great trepidation."},{"name":"FOURCHENAULT","text":"We had convinced ourselves it was ultimately for the greater good, though I can think of at least one individual who would continue to protest."},{"name":"FOURCHENAULT","text":"“To ignore the plight of those one might conceivably save is not wisdom─it is indolence.”"},{"name":"FOURCHENAULT","text":"Sage counsel I brazenly cast aside when confronted with the Final Days in earnest."},{"name":"FOURCHENAULT","text":"But <span class=\"highlight\">Forename</span> here and <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> companions refused to forsake those we were otherwise unwilling to save. With great risk to themselves, they achieved the impossible, and opened my eyes to the error of the Forum's decision."},{"name":"KINDLYRETURNEE","text":"If all other roads lead to ruin regardless... Perhaps we should at least consider it."},{"name":"AYMERIC","text":"Then it would be my pleasure to invite you all to Camp Broken Glass, where you shall have warm food and beds both."},{"name":"AYMERIC","text":"Admiral Merlwyb and I shall speak with Maxima and the others, and consider how best to assist the Garleans moving forward. Should we broach the subject of the blasphemy, however, we will not hesitate to call upon you."}],"reward":{"gil":1260,"items":[{"num":3,"id":36109,"one":1},{"num":3,"id":36110,"one":1},{"num":3,"id":36111,"one":1},{"num":3,"id":36112,"one":1},{"num":3,"id":36113,"one":1}]},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70115]},"next":[70117]},"partials":[{"type":"npc","id":"1042733","obj":{"i":1042733,"n":"Artoirel","l":3710,"q":2}},{"type":"npc","id":"1042746","obj":{"i":1042746,"n":"Fourchenault","l":3710,"q":2}},{"type":"item","id":"36109","obj":{"i":36109,"n":"Grade 6 Tincture of Strength","l":580,"c":20710,"t":44}},{"type":"item","id":"36110","obj":{"i":36110,"n":"Grade 6 Tincture of Dexterity","l":580,"c":20709,"t":44}},{"type":"item","id":"36111","obj":{"i":36111,"n":"Grade 6 Tincture of Vitality","l":580,"c":20707,"t":44}},{"type":"item","id":"36112","obj":{"i":36112,"n":"Grade 6 Tincture of Intelligence","l":580,"c":20706,"t":44}},{"type":"item","id":"36113","obj":{"i":36113,"n":"Grade 6 Tincture of Mind","l":580,"c":20708,"t":44}},{"type":"quest","id":"70115","obj":{"i":70115,"n":"Bitter Snow","g":189,"l":"Radz-at-Han","s":1}},{"type":"quest","id":"70117","obj":{"i":70117,"n":"Misguided Few","g":189,"l":"Garlemald","s":3}}]}