{"quest":{"name":"Forlorn Glory","location":"Garlemald","id":70118,"patch":6.1,"sort":4,"icon":101176,"eventIcon":71221,"issuer":1042765,"target":1039543,"genre":189,"journal":["Fourchenault is eager to regroup and make ready for battle.","Thinking on Nero's words from earlier, Fourchenault does not wish to waste time before striking the Tower of Babil. He asks you join him back at Camp Broken Glass to reconvene with the others and prepare.","You return to Camp Broken Glass where Raubahn and Hien have also arrived to assist with the assault on the tower. Soon after, Kan-E-Senna is contacted by Lorens with glad tidings─Varis's heart has been reclaimed, meaning the barrier protecting the blasphemy will soon be no more. She goes on to say that Merlwyb and Aymeric will await you at the tower's entrance, and so you make to leave. But not before Nero─and more surprisingly, Fourchenault─voice a desire to join you.","Your party thus assembled, you brace yourselves and enter the Tower of Babil.","After an arduous climb, you and your allies at last find yourselves face-to-face with the blasphemy born of Nerva's despair. A grueling battle ensues, but in the end, he proves no match for your combined strength. With the path to the moon now open, and the lands of Ilsabard now safe from the spire's aether-draining effects, you return back to camp victorious.","Fourchenault and the refugees thank you for all your help, though Nero finds their praise unnecessary. Word of your victory soon reaches the ears of Livingway, who appears equal parts excited and terrified to finally have people living on the moon. Before they depart, Fourchenault asks you to return to Radz-at-Han, and inform Shirabaht of the blasphemy's defeat.","Shirabaht is gladdened to hear the blasphemy is no more, though hardly surprised knowing you had a hand in vanquishing it. With no other outstanding reports of blasphemy sightings, she dares to hope Nerva was indeed the last. Perhaps now the scars of the Final Days can finally begin to heal."],"objectives":["Speak with Fourchenault.","Speak with Fourchenault again.","Speak with Shirabaht in Radz-at-Han."],"dialogue":[{"name":"NERO","text":"&lt;sigh&gt; I told myself I would not get overly involved. And yet here I am..."},{"name":"FOURCHENAULT","text":"From what Nero has told us, time is now a luxury we can ill afford. Let us return to Camp Broken Glass, if only for the moment. The others are no doubt finishing their preparations for battle."},{"name":"FOURCHENAULT","text":"I should hope the others' absence means all proceeds apace."},{"name":"KANESENNA","text":"Good. You're here. With the recent arrival of reinforcements, our preparations are all but complete."},{"name":"RAUBAHN","text":"Apologies for our lateness. It seems we are at least in time to help deliver the crushing blow."},{"name":"HIEN","text":"Aye, and if the fates are kind, this will be the last we see of these damnable blasphemies."},{"name":"FOURCHENAULT","text":"Commander Aldynn. Lord Hien. Thank you both for coming."},{"name":"KANESENNA","text":"Yes... Yes, of course. Understood."},{"name":"KANESENNA","text":"Lorens and the others have reclaimed Varis's heart. The barrier protecting the blasphemy should soon dissipate."},{"name":"RAUBAHN","text":"Then the time has come at last to storm the Tower of Babil."},{"name":"KANESENNA","text":"Admiral Merlwyb and Lord Aymeric await our arrival at its base."},{"name":"NERO","text":"Then we should be about it, eh?"},{"name":"NERO","text":"I suppose this is as good an opportunity as any to keep my hammer from rusting over."},{"name":"FOURCHENAULT","text":"I will accompany you as well. As the Forum's representative and a member of the survey team, I feel it my responsibility to see this through to the end."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Are you sure you wouldn't rather wait here?"},{"name":"A1","text":"I didn't take you for the fighting type."},{"name":"FOURCHENAULT","text":"Despite appearances, I am no stranger to the battlefield. Indeed, I have seen my fair share, traveling the world in service to the Forum."},{"name":"FOURCHENAULT","text":"Though I may not be the equal of Alphinaud or Alisaie, we shall not find ourselves wanting, I can promise you that much."},{"name":"FOURCHENAULT","text":"When you have all finished your preparations, we shall reconvene at the Enceladeum."},{"name":"FOURCHENAULT","text":"All are present and accounted for. Shall we proceed?"},{"name":"SYSTEM","text":"Your progress through the battle will be saved at certain points. In the event that you are defeated, you will be able to try again from the most recent of these."},{"name":"SYSTEM","text":"Please note that if you enter battles associated with other quests or log out from the game, this progress will be lost."},{"name":"FOURCHENAULT","text":"Our objective is simple─locate and eliminate the blasphemy, Nerva."},{"name":"FOURCHENAULT","text":"Though the barrier guarding him is no more, a number of beasts will surely block the way at the auxiliary sector."},{"name":"NERO","text":"Off to a smashing start, I see."},{"name":"NERO","text":"It would seem the tower will reach its limit sooner than I anticipated."},{"name":"NERO","text":"If we're to save the transporter, we must hurry and find Nerva. Now!"},{"name":"RAUBAHN","text":"Is that the last of them?"},{"name":"RAUBAHN","text":"Of course not..."},{"name":"HIEN","text":"We can't afford for them to impede our advance any further. Commander Aldynn, let us hold them here."},{"name":"RAUBAHN","text":"Master Fourchenault, take the others and go. Quickly!"},{"name":"FOURCHENAULT","text":"Understood!"},{"name":"NERVA","text":"Leave... Leave now... Garlemald...is mine..."},{"name":"NERVA","text":"Mine!!!"},{"name":"NERO","text":"For glory, everlasting, indeed..."},{"name":"HIEN","text":"Is it over...? Has the danger passed?"},{"name":"NERO","text":"By a hair's breadth, perhaps, but yes. I'd say we've managed to avoid a fiery ruin."},{"name":"FOURCHENAULT","text":"Our path to the moon is open once more."},{"name":"FOURCHENAULT","text":"The duty of Sharlayan has ever been to chart the course of history, not to change it. Thus did we fervently hold to our policies of neutrality and nonintervention."},{"name":"FOURCHENAULT","text":"In truth, it was all in service to our plans of exodus. To abandon this star to its ruinous fate."},{"name":"FOURCHENAULT","text":"Harsh though it may sound, I still believe it was ultimately for the greater good."},{"name":"FOURCHENAULT","text":"Thanks to you and your comrades, however, it was a fate that did not come to pass."},{"name":"FOURCHENAULT","text":"Sharlayan will now find a new way forward. Not merely for the preservation of knowledge, but for the betterment of this star, and all who call it home."},{"name":"FOURCHENAULT","text":"I believe I speak for all of the Forum when I say it would be an honor and a privilege to work toward such a goal alongside the allied nations."},{"name":"RAUBAHN","text":"Aye. An age of true and everlasting peace is finally within our grasp. And we will seize it─together."},{"name":"NERO","text":"As much as I would enjoy a riveting conversation with Eorzea's champion, I really must make ready for the moon. Now, if you'll excuse me..."},{"name":"FOURCHENAULT","text":"'Tis a relief to know we've no longer a need for battle. Despite my experience, I must confess I am ill-suited to it. The allied nation leaders, meanwhile, demonstrated an aptitude for combat far and above what I might expect from diplomatic figures."},{"name":"FOURCHENAULT","text":"And you, my friend... I see now why you are so well regarded as Eorzea's champion."},{"name":"FOURCHENAULT","text":"The others have already begun the arduous journey home. But before you go, I would offer a word of thanks to the both of you."},{"name":"FOURCHENAULT","text":"If not for your timely assistance, our plans would be forfeit, and the lands of Ilsabard forever defiled by the blasphemy."},{"name":"NERO","text":"Please, I've no need for your platitudes. I labor only to further my own ends, nothing more."},{"name":"YOUNGRETURNEE","text":"We heard the news. Thank you, for everything. With Lord Nerva laid to rest, we've the peace of mind to move on without regret."},{"name":"LIVINGWAY","text":"There you are! Now, what's this I've heard about you cleaning out the Tower of Babil? Are we finally ready to return to the moon?"},{"name":"FOURCHENAULT","text":"Ah, what fortuitous timing. Allow me to introduce you to Livingway of the Loporrits, moondweller and overseer of the survey team."},{"name":"FOURCHENAULT","text":"Livingway, these good people will be the moon's first residents. I trust you and the other Loporrits will take good care of them."},{"name":"YOUNGRETURNEE","text":"Pleased to...meet...you?"},{"name":"LIVINGWAY","text":"Residents!? Oh no!"},{"name":"LIVINGWAY","text":"I-I mean, oh yes! Splendid! After many, many long years of planning and preparation, the moon is absolutely, most definitely, ready to accommodate your stay."},{"name":"FOURCHENAULT","text":"Glad to hear it, and apologies for the delay. I must first confer with Lorens and see to our final preparations, but your residents-to-be and the survey team shall be along ere long."},{"name":"FOURCHENAULT","text":"Might I trouble you to relay word of our success to Shirabaht in Radz-at-Han? I should think the tidings all the more heartening coming from you. Until next we meet."},{"name":"NERO","text":"W-Wait! You're not leaving for the moon without me!"},{"name":"SHIRABAHT","text":"So it's true, then? The blasphemy in Garlemald has been struck down? They were right to call on you, it seems."},{"name":"SHIRABAHT","text":"And with no other outstanding reports of blasphemy sightings, I daresay you've slain the last of them. Perhaps now we can finally start to put the Final Days behind us, strange though that may sound."},{"name":"SHIRABAHT","text":"On behalf of my fellow delegates and the Radiant Host, I extend to you our humblest thanks. I hope when next I call on you, it will be under more fortuitous circumstances."}],"reward":{"gil":3923,"items":[{"num":3,"id":33931,"one":1},{"num":3,"id":33932,"one":1},{"num":3,"id":33933,"one":1}]},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70117]}},"partials":[{"type":"npc","id":"1042765","obj":{"i":1042765,"n":"Fourchenault","l":3710,"q":1}},{"type":"npc","id":"1039543","obj":{"i":1039543,"n":"Shirabaht","l":3707,"q":2}},{"type":"item","id":"33931","obj":{"i":33931,"n":"Heavens' Eye Materia X","l":560,"c":20289,"t":58,"materia":{"tier":9,"value":36,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"33932","obj":{"i":33932,"n":"Savage Aim Materia X","l":560,"c":20289,"t":58,"materia":{"tier":9,"value":36,"attr":"Critical Hit","category":0}}},{"type":"item","id":"33933","obj":{"i":33933,"n":"Savage Might Materia X","l":560,"c":20289,"t":58,"materia":{"tier":9,"value":36,"attr":"Determination","category":0}}},{"type":"quest","id":"70117","obj":{"i":70117,"n":"Misguided Few","g":189,"l":"Garlemald","s":3}}]}