{"quest":{"name":"Small Business, Big Dreams","location":"Old Sharlayan","id":70119,"patch":6.15,"sort":10,"icon":101153,"eventIcon":71221,"issuer":1042599,"target":1042599,"genre":80,"journal":["Mehdjina seems inordinately eager to speak with you.","You are hailed by Mehdjina, freshly apprenticed to the proprietress of Tataru Taru's Boutique. The young woman has barely begun to beg your assistance in her employer's new endeavor when Tataru herself arrives with a flourish to explain her grand plan─to build trade relationships with allies across the star for the good of all. With little choice but to accept your role of impromptu sales<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, you soon find yourself sent off to Limsa Lominsa with several sacks of product samples in tow.","Aboard the <span class=\"emphasis\">Astalicia</span>, Sicard is more than happy to accept Tataru's apparel samples in return for a promise to show them off wherever the Bloody Executioners' journeys take them. In fact, as this aligns so perfectly with his crew's newfound purpose of delivering precious cargo to distant shores, he also offers to seek out new destinations for Tataru's wares─in exchange for an exclusive shipping contract, of course. He is certain that he will find Emmanellain both willing and able to assist in locating potential buyers, and no amount of gil is worth intervening in <span class=\"emphasis\">that</span> relationship, so you simply take him at his word and inform Tataru of your success by linkpearl.","You travel to the Black Shroud, where you approach Gridania's best source of gossip─Mother Miounne. She advises you that A–Ruhn–Senna has been making frequent trips to the Ixali and sylphic settlements lately, and thus the most suitable place to waylay him may be the Blue Badger Gate.","With Miounne's guidance, you succeed in ambushing A–Ruhn–Senna with your samples. Unexpectedly, he takes to the idea of importing wares from abroad immediately, citing a newly improved understanding of the world and his place in it. With assurances that he will contact Tataru shortly, he makes for the Lotus Stand to seek the approval of the Elder Seedseer in establishing mercantile ties.","The last stop of your journey─for now─is Ul'dah, where you seek out Pipin at the Coliseum. He, too, accepts Tataru's wares without hesitation, expounding upon his hopes to outfit the Immortal Flames with armaments beloved and inspiring. He does, however, insist on offering Tataru something in return for her samples─settling, after some consideration, on a necklace that he but recently acquired. It transpires that the accessory once belonged to Tataru's mother, and the erstwhile coinkeeper has long searched for it in vain. Alas, it is currently in a state of utter disrepair, so you conspire with Pipin to see it reborn ere presenting it to your friend.","Samples seen safely into the hands of your allies, you return to Old Sharlayan. You find Mehdjina and Varsarudh eager to assist in restoring Tataru's heirloom, suggesting that you use materials acquired from the boutique's new trading partners in its crafting. For her part, Tataru is gratified to hear of the early success of her endeavor, and pleased to learn that those who joined the Ilsabard contingent are the better for it. She promises more opportunities for you to represent the boutique abroad and forge ties that will serve all the star's people in the days to come.","（★未使用／削除予定★）","（★未使用／削除予定★）"],"objectives":["Speak with Hasthwab in Limsa Lominsa.","Speak with Miounne in Gridania.","Wait at the destination.","Speak with the Coliseum usher.","Speak with Mehdjina in Old Sharlayan.","（★未使用／削除予定★）"],"dialogue":[{"name":"MEHDJINA","text":"<span class=\"highlight\">Forename Surname</span>! Welcome, welcome!"},{"name":"MEHDJINA","text":"I am Mehdjina, assistant shopkeep and apprentice seamstress here at Tataru Taru's Boutique."},{"name":"MEHDJINA","text":"I doubt you remember my face─as I am merely one of many who owe you our lives─but you will always have my gratitude for saving me that day on the Eblan Rime."},{"name":"MEHDJINA","text":"You are too kind. And while I hate to ask aught more of you...please say that you're here to assist in Mistress Tataru's new endeavor."},{"name":"TATARU","text":"Not yet, but <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> soon shall be!"},{"name":"TATARU","text":"What ever would we do without your penchant for turning up precisely when you're needed, eh?"},{"name":"TATARU","text":"Now, to make the long story of our solvency short─we've secured the resources to produce the new designs I developed in cooperation with guilds near and far, and in sufficient quantity to meet rising demand."},{"name":"TATARU","text":"We cannot rest on our laurels, however. To serve passing adventurers and the occasional intrepid Sharlayan is all well and good, but we're hardly taking the world by storm. No..."},{"name":"TATARU","text":"Much like yourself, we must ever look to new horizons!"},{"name":"TATARU","text":"The Scions proved that cooperation on a star-wide scale is possible, and we would be fools not to capitalize on that to build the grandest trade network in the history of Hydaelyn. All for the greater good, of course..."},{"name":"MEHDJINA","text":"Yes, this is a wonderful opportunity to bring people together!"},{"name":"MEHDJINA","text":"I often think back to that incredible moment when the Garlean army came to our rescue."},{"name":"MEHDJINA","text":"Perhaps our efforts, too, will one day lead to a miracle like that which took place on the Eblan Rime..."},{"name":"TATARU","text":"I have no doubt that they shall. But we mustn't expect such alliances to form themselves."},{"name":"TATARU","text":"We must be proactive. And who better to woo our future partners in commerce than our current number one customer...you!"},{"name":"TATARU","text":"Our erstwhile comrades-in-arms know that when it comes to good equipment and better ideas, few have such keen eyes as our adventurer extraordinaire."},{"name":"TATARU","text":"Even should they hesitate at first, I'm certain you can convince them using the samples I've prepared!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Well, I see that my mind is made up!"},{"name":"A1","text":"If you'll cover my aetheryte expenses..."},{"name":"TATARU","text":"But of course! With your assistance, we'll have both coin and goodwill flowing in no time."},{"name":"MEHDJINA","text":"Everything is falling into place! ...Where shall we send <span class=\"highlight\">Forename</span> first?"},{"name":"TATARU","text":"Muahaha... Don't you worry─I have it all planned out."},{"name":"TATARU","text":"First─Limsa Lominsa! Sicard has the Bloody Executioners working harder than ever, so he is sure to appreciate any extra supplies."},{"name":"TATARU","text":"Next─Gridania. The Seedseers are a source of trusted authority and insight into the Shroud, so we'd not go amiss in cultivating the investment of, say...A–Ruhn–Senna."},{"name":"TATARU","text":"His insular station has likely given him little opportunity for dealings outside of Gridania in the past, so you'll want to leverage that Ilsabard contingent camaraderie to assure him of the value of our venture."},{"name":"TATARU","text":"I hear tell that he has some interest in affairs abroad, so the novelty of our samples may persuade him to our side."},{"name":"TATARU","text":"As for Ul'dah, I feel confident in pinning our hopes on Pipin. He's always been a stalwart ally, and it goes without saying that he has more than a little sway in the sultanate."},{"name":"TATARU","text":"Between his involvement with the Immortal Flames, the Syndicate, and the Coliseum, he's bound to find a use for quality accoutrements."},{"name":"TATARU","text":"With that out of the way─Mehdjina, would you do the honors?"},{"name":"TATARU","text":"Never let it be said that Tataru Taru is stingy with her samples! Now, if you make your way to Limsa and climb aboard the <span class=\"emphasis\">Astalicia</span>, I'm certain someone will point you in Sicard's direction..."},{"name":"TATARU","text":"I have my own avenues of inquiry to attend to, but I'll check in periodically to see how your journey is coming along. Let's get to it!"},{"name":"MEHDJINA","text":"As Mistress Tataru says─trust is the foundation of a stable business. And we trust in you!"},{"name":"HASTHWAB","text":"Aye, I recognize ye. What do ye want?"},{"name":"HASTHWAB","text":"...Long as it's not about another bloody apocalypse, I don't see why not. Wait 'ere. "},{"name":"SICARD","text":"Well, bugger me!"},{"name":"SICARD","text":"Thought we'd seen the last of you for a while. What brings you aboard?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Your crew seems...busy."},{"name":"A2","text":"Can I interest you in some fine garb today?"},{"name":"SICARD","text":"No rest for the wicked and all. We're gettin' so many shippin' requests that we've hardly put down anchor since Old Sharlayan."},{"name":"SICARD","text":"Heh. Your sales pitch needs some work, but I see what you're gettin' at. We're already travelin' halfway across the world every half-moon─may as well earn a little extra for our trouble, eh?"},{"name":"SICARD","text":"You know, there was a time I thought piratin' was the whole world. That bein' the best of 'em all meant somethin'..."},{"name":"SICARD","text":"Goin' to Ilsabard made me see how small my world was, compared to the real one. Standin' next to the star's finest, I started to wonder what I had to brag about."},{"name":"SICARD","text":"Then the Bloody Executioners went and did me proud─by bringin' in a bigger godsdamned haul of adamantite than anyone else in the realm!"},{"name":"SICARD","text":"Between that and the new metalworks we've got goin' with the kobolds, it seemed like the right time for the Executioners to change our sails, so to speak."},{"name":"SICARD","text":"Between that, and the new metalworks we've got goin' with the kobolds, and the Sahagin lookin' to export their own wares...it seemed like the right time for the Executioners to change our sails, so to speak."},{"name":"SICARD","text":"...Which is all to say that if you've got wares for promotin', I'd be happy to show 'em off across the realm and beyond."},{"name":"SICARD","text":"Masterworks from Tataru Taru's Boutique, guaranteed by the Warrior o' Light <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span>..."},{"name":"SICARD","text":"Almost seems a waste to wear 'em. Folk'd be linin' up at the docks for these."},{"name":"SICARD","text":"...Literally, seein' as Old Sharlayan's only accessible by sea. Now, if we got ourselves an exclusive shippin' contract..."},{"name":"SICARD","text":"Aye, I see the course clear as day! Now we just need Emmanellain on board..."},{"name":"SICARD","text":"He's right useless when there's work to be done, but talk's another matter. And he still owes me one for keepin' his sorry arse out o' trouble, so I'll have him put me in touch with a few savvy salesman types on the continent."},{"name":"SICARD","text":"Tell Tataru I look forward to settin' sail on this new tide o' hers. May the winds o' change guide us aright!"},{"name":"TATARU","text":"<span class=\"highlight\">Forename</span>? It's me! How goes our little venture thus far?"},{"name":"TATARU","text":"Oho! Sicard's eyeing the shipping routes, is he? All according to plan..."},{"name":"TATARU","text":"But our work has only just begun!"},{"name":"TATARU","text":"I'll keep after my own contacts while you work on A–Ruhn. I hear he's not often in the city, but I don't doubt that Mother Miounne can sniff him out."},{"name":"HASTHWAB","text":"Ol' Sicard's been odd o' late. Almost...pleasant-like."},{"name":"MIOUNNE","text":"Why, if it isn't <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>! Struck with a sudden craving for eel pie, were you? Or is it information you fancy?"},{"name":"MIOUNNE","text":"Oh yes, word of our Seedseers' comings and goings never fails to reach my ears."},{"name":"MIOUNNE","text":"I'm told that ever since he returned from his foray to Ilsabard, he's been roaming back and forth between our neighboring tribes' settlements and the Lotus Stand."},{"name":"MIOUNNE","text":"You'll miss him if you make for one or the other, like as not, so I suggest you waylay him at the Blue Badger Gate."},{"name":"MIOUNNE","text":"A–Ruhn is never in one place for long, so you need only be patient a little while. Cup of tea while you wait?"},{"name":"ARUHNSENNA","text":"Curious..."},{"name":"ARUHNSENNA","text":"Might I ask why you're loitering at the gates, <span class=\"highlight\">Forename</span>? And with such an enormous sack..."},{"name":"ARUHNSENNA","text":"I admit you've piqued my interest. To integrate the tradition and ingenuity of guilds throughout Eorzea in such a fashion is no small feat."},{"name":"ARUHNSENNA","text":"As it happens, I'm of the mind to do something similar myself─assuming I secure the other Seedseers' approval."},{"name":"ARUHNSENNA","text":"As it happens, I'm of the mind to do something similar myself─though I could not blame you should you doubt my understanding of such endeavors."},{"name":"ARUHNSENNA","text":"Absent a special dispatch like that which the Elder Seedseer ordered for Ilsabard, 'tis vanishingly rare for one of my station to leave the Shroud."},{"name":"ARUHNSENNA","text":"You are doubtless aware that historically, Gridania has placed the peace of the Twelveswood and our covenant with the elementals above all else─often to the detriment of our relationship with other peoples."},{"name":"ARUHNSENNA","text":"Yet much as we are one with the Shroud, are we not also part of the star entire?"},{"name":"ARUHNSENNA","text":"Our ventures in Garlemald made plain the strength of a world united. This attire you carry demonstrates much the same truth."},{"name":"ARUHNSENNA","text":"...Ah, but perhaps you assumed you would need to talk me round to the idea? If so, I apologize for the disappointment. If 'tis any comfort, I'm nearly as surprised myself."},{"name":"ARUHNSENNA","text":"No longer am I content to hear the words of the elementals alone. I wish to know the voices of men... Though our time in Garlemald has shown me that my ability to listen is average at best."},{"name":"ARUHNSENNA","text":"These horns may mark me as gifted in the Twelveswood, but beyond, they inspire neither fear nor awe. I have been mistaken several times for a Xaela─and may as well be one, for all the difference my status as Seedseer makes to those who want for succor."},{"name":"ARUHNSENNA","text":"Yet 'twas this selfsame insignificance that allowed me, for the first time in my life, to truly feel part of a greater whole..."},{"name":"ARUHNSENNA","text":"I am but one life among myriads upon this star. I daresay I should behave accordingly."},{"name":"ARUHNSENNA","text":"With luck, my elder sister shall agree. Tell Mistress Tataru that her gift is accepted with gratitude, and she ought to hear from us soon."},{"name":"TATARU","text":"Guess who! Did you speak with A–Ruhn yet?"},{"name":"TATARU","text":"That sounds promising. I'm beginning to understand what makes our Seedseer friend tick..."},{"name":"TATARU","text":"But we can discuss that later─you need to catch Pipin ere his duties take him from Ul'dah once more. I believe he spends much of his time at the Coliseum, so perhaps you should pay a visit to the Gold Court? I'll be awaiting your full report at the boutique!"},{"name":"COLISEUMMAN","text":"I see... Marshal Tarupin is currently engaged in another meeting, but I shall tell him that <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span> awaits his convenience."},{"name":"PIPIN","text":"My apologies for keeping you waiting. I did not expect you here <span class=\"alternative-container\"><span class=\"alternative\">this evening</span><span class=\"alternative\">this morning</span><span class=\"alternative\">today</span></span>!"},{"name":"PIPIN","text":"Tataru is offering quality materiel, is she?"},{"name":"PIPIN","text":"I can hardly say no to that. It fits almost too perfectly with my plans for the Flames..."},{"name":"PIPIN","text":"I have long striven for mastery of the blade. I required the trials of Ilsabard, however, to truly see Tizona for what it is."},{"name":"PIPIN","text":"The fire that warms the coldest night. The spark that ignites a blaze of hope. And, most of all, an unbreakable testament to Father's faith in me."},{"name":"PIPIN","text":"More ally than tool, it is a treasure beyond price."},{"name":"PIPIN","text":"...Does every soldier of the Immortal Flames not deserve allies such as this? Arms and armor to remind them of what they fight to protect─to help them stand when they might otherwise fall?"},{"name":"PIPIN","text":"Indeed, works made possible only through the ingenuity and dedication of allies across the star may be just the sort of inspiring armaments we need."},{"name":"PIPIN","text":"I anticipate that I will be sending along an order for custom equipment ere long. In the meantime, would you mind if I use these samples for a few trials here at the Coliseum?"},{"name":"PIPIN","text":"My thanks. We shall put them to use immediately."},{"name":"PIPIN","text":"As a child of Ul'dah, however, naught strikes fear into my heart like the prospect of receiving valuable goods for “free.” I must insist you accept something in return."},{"name":"PIPIN","text":"Hmm... I <span class=\"emphasis\">had</span> been meaning to gift that necklace to Tataru... Its poor condition aside, she might rather have it than not..."},{"name":"PIPIN","text":"I have spoken with Tataru at some length about our pasts, you understand... In many ways, we are quite similar."},{"name":"PIPIN","text":"As you may recall, her family was bankrupted when she was very young─a consequence of her father's business failing. They were forced to put all their wealth toward paying off his debts, and then some."},{"name":"PIPIN","text":"One asset they reluctantly parted with was a necklace treasured by her mother─for which Tataru has long searched to no avail..."},{"name":"PIPIN","text":"Strangely enough, I recently discovered jewelry of the very same description amidst a store of neglected Coliseum prizes."},{"name":"PIPIN","text":"Assuming it is the same piece, I should like to see it returned to her. It is significantly worse off for having changed hands, though, and only the sapphire centerpiece remains unlost and undamaged..."},{"name":"PIPIN","text":"She may appreciate the sentiment nevertheless, but it's difficult to say. What do you think?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"The memories it holds for her aren't lost or damaged."},{"name":"A3","text":"Could it be repaired? Or perhaps remade?"},{"name":"PIPIN","text":"True enough. Though if it's to be a gift, I would prefer to at least clean it up a bit."},{"name":"PIPIN","text":"Possibly. Either would be a sight better than leaving it in its current state, at least."},{"name":"PIPIN","text":"In that case..."},{"name":"PIPIN","text":"I had considered asking the Goldsmiths' Guild, but you ought to be able to turn the necklace into a piece that Tataru would wear, if not precisely what she remembers."},{"name":"PIPIN","text":"I imagine you will have the opportunity to pick up gems and other suitable materials on your travels."},{"name":"PIPIN","text":"From there, it is merely a matter of unifying the pieces. Are you willing?"},{"name":"PIPIN","text":"Then I will have the sapphire removed from its setting and sent to the boutique with all haste. I doubt even Tataru would dare open a private package addressed to you..."},{"name":"PIPIN","text":"Best of luck in finding matching materials─and in your mercantile endeavors, of course. May the Traders guide you to fortune fair."},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"MEHDJINA","text":"You've returned! With your bag all the lighter for having given away our samples, I hope."},{"name":"MEHDJINA","text":"Speaking of which─a parcel from one Pipin Tarupin arrived not bells ago, addressed to you. Could it be that our newfound partnerships are already bearing fruit?"},{"name":"MEHDJINA","text":"Her mother's necklace? Why, that's a wonderful idea."},{"name":"MEHDJINA","text":"Please allow me to assist─I swear I won't breathe a word of this to Mistress Tataru!"},{"name":"MEHDJINA","text":"（★未使用／削除予定★）"},{"name":"MEHDJINA","text":"（★未使用／削除予定★）"},{"name":"MEHDJINA","text":"I do wonder what parts you will need... Do you know what style Mistress Tataru prefers?"},{"name":"VARSARUDH","text":"(-???-)If this necklace is to be a keepsake, why not focus on that?"},{"name":"VARSARUDH","text":"Ah─apologies! I could not help but overhear."},{"name":"MEHDJINA","text":"That's quite all right, but do please keep your voice down! What was it you were saying?"},{"name":"VARSARUDH","text":"It simply occurred to me that, since you were gifted the sapphire so readily, our other partners in this endeavor may wish to offer up something for Mistress Tataru as well."},{"name":"VARSARUDH","text":"With such gifts, you could turn the necklace into a memento of not just her past and its trials, but her present successes as well."},{"name":"MEHDJINA","text":"That's perfect!"},{"name":"MEHDJINA","text":"If our plans for the boutique proceed apace, we should soon have more than enough tokens from friends across the seas. What do you think, <span class=\"highlight\">Forename</span>?"},{"name":"TATARU","text":"Well, well. Were you waiting for little old me?"},{"name":"MEHDJINA","text":"M-Mistress Tataru! We were, erm...just discussing the successful delivery of the samples! Yes."},{"name":"TATARU","text":"Good to hear. How fares dear Pipin?"},{"name":"TATARU","text":"I knew he would come through! Though I admit that I wasn't expecting to outfit a whole host of Immortal Flames quite so soon..."},{"name":"TATARU","text":"I suppose it goes to show that even the most hardened warrior can always learn a thing or two..."},{"name":"TATARU","text":"And Sicard and A–Ruhn have changed as well, if your tales are any indication."},{"name":"TATARU","text":"I imagine their personal growth bodes well for that of our network! Thank you for checking up on them."},{"name":"TATARU","text":"We must sort through our current commissions before deciding who to approach next, but I know I can count on you to be ready when we are!"},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"TATARU","text":"（★未使用／削除予定★）"},{"name":"TATARU","text":"（★未使用／削除予定★）"},{"name":"TATARU","text":"（★未使用／削除予定★）"},{"name":"MEHDJINA","text":"（★未使用／削除予定★）"},{"name":"TATARU","text":"（★未使用／削除予定★）"},{"name":"TATARU","text":"（★未使用／削除予定★）"},{"name":"MEHDJINA","text":"（★未使用／削除予定★）"},{"name":"MEHDJINA","text":"（★未使用／削除予定★）"},{"name":"MEHDJINA","text":"（★未使用／削除予定★）"},{"name":"MEHDJINA","text":"（★未使用／削除予定★）"},{"name":"MEHDJINA","text":"（★未使用／削除予定★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用／削除予定★）"},{"name":"Q4","text":"（★未使用★）"},{"name":"A4","text":"（★未使用★）"},{"name":"A4","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"Q7","text":"（★未使用★）"},{"name":"A7","text":"（★未使用★）"},{"name":"A7","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"Q8","text":"（★未使用★）"},{"name":"A8","text":"（★未使用★）"},{"name":"A8","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"Q9","text":"（★未使用★）"},{"name":"A9","text":"（★未使用★）"},{"name":"A9","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"TATARU","text":"（★未使用★）"},{"name":"MEHDJINA","text":"（★未使用／削除予定★）"},{"name":"MEHDJINA","text":"（★未使用／削除予定★）"},{"name":"MEHDJINA","text":"（★未使用／削除予定★）"}],"reward":{"gil":4774},"reqs":{"jobs":[{"lvl":90,"id":1}],"quests":[70062]},"next":[70186,70198]},"partials":[{"type":"npc","id":"1042599","obj":{"i":1042599,"n":"Mehdjina","l":3706,"q":3}},{"type":"quest","id":"70062","obj":{"i":70062,"n":"Newfound Adventure","g":12,"l":"The Rising Stones","s":619}},{"type":"quest","id":"70186","obj":{"i":70186,"n":"Soaring Profits","g":80,"l":"Old Sharlayan","s":20}},{"type":"quest","id":"70198","obj":{"i":70198,"n":"An Auspicious Opportunity","g":80,"l":"Old Sharlayan","s":30}}]}