{"quest":{"name":"Manusyan for a Day","location":"Thavnair","id":70113,"patch":6.15,"sort":127,"interval":"daily","repeatable":1,"beast":15,"eventIcon":71222,"issuer":1042301,"target":1042301,"genre":33,"journal":["Maru needs someone to investigate a piece of troubling news.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with the perturbed Rider.","While wearing the disguise and with the chat mode in <span class=\"highlight\">Say</span>, enter “Your god is come” to call out to the foreboding figure.","Speak with the perturbed Rider.","Report to Maru."],"dialogue":[{"name":"MARU","text":"One of our Riders sent word about a strange figure harassin' him durin' a delivery in the Shroud of the Samgha. Might be yet another rovin' Gajasura out for “conquest”...or, knowin' him, just shadows playin' tricks on the eye."},{"name":"MARU","text":"Still, I ain't about to ignore his cry for help, no matter how prone to panickin' he might be. Mind goin' over there and checkin' up on him? If this “figure” is somethin' we should worry about, I trust you'll find the best way to handle it."},{"name":"DELIVERER04577","text":"Oh, it's you! My savior! Please do somethin' about that stranger followin' me!"},{"name":"DELIVERER04577","text":"They keep bangin' on trees and callin' out to the Manusya. I dunno what they want from 'em, but it can't be good! I swear I heard that voice comin' from every direction at once..."},{"name":"DELIVERER04577","text":"They scared me so bad I ran all the way here, an' I ain't keen on goin' back out again. Can't deliver nothin' with those whispers stalkin' my every step."},{"name":"DELIVERER04577","text":"I'd put my pana on it bein' one of those no-good Gajasura the boss was talkin' about. That means dressin' up as a divinity's the only way to get through to 'em─accordin' to Ogul, anyway."},{"name":"DELIVERER04577","text":"I crafted a guise just like she said, an' I've been bringin' it everywhere in case someone brave enough to wear it came by. Maybe if you put it on an' tell 'em, “Your god is come,” or somethin' mystical like that, you can get 'em to let me deliver in peace."},{"name":"SYSTEM","text":"You must continue wearing the Manusya disguise in order to progress."},{"name":"SYSTEM","text":"You will change back to your normal garments if you move too far away. Look to your map for the garment change's area of effect."},{"name":"SYSTEM","text":"Speak with the perturbed Rider to restore or prolong the garment change."},{"name":"DELIVERER04577","text":"Looks like the disguise fits you perfectly, eh? If you find that Gajasura, start proclaimin', “Your god is come,” and do whatever it takes to get 'em to stop scarin' me half to death."},{"name":"DELIVERER04577","text":"Ready to play at bein' divine? Well then, put this on!"},{"name":"SAYTODO","text":"Your god is come"},{"name":"GAJASURA04577","text":"...O divine that guide! Heed woeful plea!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase containing the words “Your god is come” to assert your divinity."},{"name":"SYSTEM","text":"You must wear the Manusya disguise in order to progress."},{"name":"GAJASURA04577","text":"O divine Manusya! Here after search for so long! Please...listen to problem. Big problem!"},{"name":"GAJASURA04577","text":"Talk hard. No can make friends. What do?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Just approach with a smile."},{"name":"A1","text":"Just be kind."},{"name":"GAJASURA04577","text":"Advice good! Divine Manusya wise. Thanks to Manusya!"},{"name":"GAJASURA04577","text":"Thank you, O divine! Question awkward, but... All Gajasura in village walk naked, but here Matanga cover bodies... What do?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Just be yourself."},{"name":"A2","text":"Why not try a leaf?"},{"name":"GAJASURA04577","text":"Manusya wisdom precious indeed! Try advice! Thank you, O divine."},{"name":"GAJASURA04577","text":"See pretty Au Ra in Palaka village...heart pounding in chest. But Au Ra are hated of Gajasura. Not know what feel..."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"It's time to forget the hatred you feel toward the Au Ra."},{"name":"A3","text":"Why not gift her some beautiful flowers?"},{"name":"GAJASURA04577","text":"Oh, the insight of divinities! Will try hard to follow. Thank you!"},{"name":"ARKASODARA04577","text":"Bless me with your wisdom, divine Manusya! Hear my words!"},{"name":"ARKASODARA04577","text":"That voice...? You're <span class=\"highlight\">Forename</span>, aren't you!? What in the world are you doing dressed like that?"},{"name":"ARKASODARA04577","text":"Oh, a fellow Arkasodara was frightened by my prayers? My apologies, but I often recite my prayers absent-mindedly while I go about my work gathering herbs."},{"name":"ARKASODARA04577","text":"The alchemists of the Great Work often call out to the island's divine protectors so as to receive their blessing. However, I now realize how passersby may get the wrong impression... I shall be more mindful in the future!"},{"name":"DELIVERER04577","text":"Did you find that terrible monster!? Did you!? Please say yes!"},{"name":"DELIVERER04577","text":"Ah, so my life wasn't in danger... Good news, to be sure. Thanks for investigatin' in my stead."},{"name":"DELIVERER04577","text":"You can tell Maru I'll be deliverin' that shipment just as soon as my heart stops poundin' from the terror of it all."},{"name":"DELIVERER04577","text":"Looks like I can continue with the delivery... Soon as I get a moment to calm down, that is. Tell Maru I won't be long!"},{"name":"MARU","text":"So, did you find out who our mysterious figure was?"},{"name":"MARU","text":"As I suspected, a whole pile of nothin'. Still, better that than monsters, or worse─more food thieves! We should be givin' thanks to the divinities for their protection."},{"name":"MARU","text":"An' to you, of course. I'll try to get our mutual friend to stop jumpin' at every sound he hears, but I wouldn't count on it..."}],"reward":{"gil":655,"reputation":60,"items":[{"num":5,"id":44},{"id":36657}]},"reqs":{"beastrank":6,"jobs":[{"lvl":80,"id":34}]}},"partials":[{"type":"npc","id":"1042301","obj":{"i":1042301,"n":"Maru","l":3709,"q":28}},{"type":"item","id":"44","obj":{"i":44,"n":"Allagan Tomestone of Causality","l":1,"c":"t/65094","t":63}},{"type":"item","id":"36657","obj":{"i":36657,"n":"Arkasodara Pana","l":1,"c":"t/65091","t":100}}]}