{"quest":{"name":"Bitter Snow","location":"Radz-at-Han","id":70115,"patch":6.1,"sort":1,"icon":101176,"eventIcon":71221,"issuer":1039543,"target":1042733,"genre":189,"journal":["The glint in Shirabaht's eyes suggests she was hoping you might pass through.","Though efforts to thwart blasphemies born of the Final Days proceed apace, trouble yet lurks in the snows of Garlemald. Much to Shirabaht's surprise, Sharlayan has requested aid for the Garleans, and though the Ilsabard contingent has already deployed forces to aid them, Shirabaht asks if you might also lend a hand. No sooner do you nod your head in consent than she bids you make for Camp Broken Glass to speak with their intelligence officer.","As Fourchenault explains, a survey team was assembled to assess the moon and its capacity for serving as a repository of knowledge. The presence of what they believe to be a blasphemy, however, keeps them from ascending the Tower of Babil and traveling to their destination. As such, nation leaders, both near and far, have elected to combine their forces to root out this threat. To better assess the situation, Lucia suggests speaking with members of the reconnaissance team that first encountered the blasphemy that bars their path.","Lorens recounts their journey into the tower where they spied the blasphemy and a horde of beasts seemingly at its beck and call. Their attempts to strike it from a distance were foiled by a barrier of unknown origin. Lorens intends to confer with<br>Kan-E-Senna as to how this protection may be overcome. In the meantime, he asks you to investigate reports of Garleans transforming into monsters. To that end, Fourchenault suggests reconvening with Artoirel.","An investigation into the sightings of newly transformed monsters reveals they were Garleans who hailed from Locus Amoenus, their ancestral homeland. Those who yet remain unchanged by the aftereffects of the Final Days have elected to fend for themselves on the outskirts of the capital. Hoping to learn more of what has caused their countrymen to be overcome by despair, Artoirel has a mind to go and speak with them, and he would be grateful for your company."],"objectives":["Speak with the intelligence officer at Camp Broken Glass.","Speak with Yugiri.","Speak with Artoirel."],"dialogue":[{"name":"SHIRABAHT","text":"Well, if it isn't <span class=\"highlight\">Forename</span>, all-around good egg and champion of...well, the whole world, I suppose."},{"name":"SHIRABAHT","text":"Word travels fast, my friend. We've heard all about your exploits defeating the blasphemies that plagued the good people of Eorzea and Doma."},{"name":"SHIRABAHT","text":"Sadly, there are other fell beasts that yet want for slaying, but fear not─our efforts to bring them low proceed apace, and we've had naught but glad tidings from our allies."},{"name":"SHIRABAHT","text":"In fact, we but recently received word from the Resistance forces in Bozja that a blasphemy was slain, thanks in no small part to Lord Hien's timely assistance."},{"name":"SHIRABAHT","text":"Perhaps the most surprising report came from Werlyt, where soldiers led by the infamous Black Wolf fought alongside Ala Mhigan troops for yet another hard-earned victory."},{"name":"SHIRABAHT","text":"Reports from Garlemald, however, suggest another blasphemy threat lurks in the snows, and we received a petition for assistance."},{"name":"SHIRABAHT","text":"Strange, don't you think? When the effects of the Final Days began to spread in earnest, we encountered a great many monsters in Garlemald, but never a blasphemy."},{"name":"SHIRABAHT","text":"And to make matters worse, they say the Garleans who chose to remain and rebuild have begun transforming into yet more hideous creatures."},{"name":"SHIRABAHT","text":"From what I understand, it was you and your comrades who brought an end to the source of the Final Days, is that right?"},{"name":"SHIRABAHT","text":"Even so, it would appear its effects will linger a while longer."},{"name":"SHIRABAHT","text":"Until this malevolent influence on akasa subsides, I daresay this won't be the last time we hear of such sightings."},{"name":"SHIRABAHT","text":"As for the blasphemy, we have reason to believe it is a great deal stronger than any we've faced thus far. Your strength and experience would prove quite valuable. If you're willing to help, of course."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Why, of course I'll help!"},{"name":"A1","text":"Is the Ilsabard contingent not equipped to handle this threat?"},{"name":"SHIRABAHT","text":"Truly? Our contacts in Sharlayan will be thrilled to hear it. Though they did not explicitly request your presence, it was clear from the first they were hoping for it."},{"name":"SHIRABAHT","text":"I should certainly think so. No sooner did we receive the request from Sharlayan than they began making preparations to dispatch their forces. That said, it was clear from the first they were hoping you might also take up the hunt."},{"name":"SHIRABAHT","text":"Though if I may be frank, I was not expecting Sharlayan of all places to be so concerned with the present state of Garlemald, what with their strict policies on nonintervention. Perhaps we'll find out the reason before this is all over."},{"name":"SHIRABAHT","text":"But that's an inquiry for another time. I'll not keep you any longer. Once you arrive in Garlemald, I should think the intelligence officer stationed there will be more than happy to apprise you of the situation."},{"name":"SHIRABAHT","text":"Keep your wits about you out there. To have eluded us for so long, this blasphemy is like to be more cunning than most."},{"name":"SOLDIER04120","text":"<span class=\"highlight\">Forename</span>? <span class=\"emphasis\">The</span> <span class=\"highlight\">Forename</span>? It's an honor to have you with us, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>! I presume you're come to assist in our hunt for the blasphemy?"},{"name":"SOLDIER04120","text":"Maxima and Lucia will be pleased to hear it. If you would come this way."},{"name":"MAXIMA","text":"It is good to see you, <span class=\"highlight\">Forename</span>. Though I wish it were under more fortuitous circumstances."},{"name":"LUCIA","text":"We were reluctant to call upon you, knowing you but recently returned from the far reaches of the heavens, but we are no less glad for your aid."},{"name":"LUCIA","text":"Now then, I believe it best if the man who first discovered this blasphemy explained the situation."},{"name":"FOURCHENAULT","text":"Ah, <span class=\"highlight\">Forename</span>. Good. We may forgo introductions, then. Thank you for answering our call for assistance."},{"name":"FOURCHENAULT","text":"As for the situation at hand, it concerns a joint effort between the Forum and the Loporrits to find new purpose for the moon."},{"name":"FOURCHENAULT","text":"While there is no longer need for a vessel to evacuate this star, we believe the moon may yet prove of use to the people of Etheirys."},{"name":"FOURCHENAULT","text":"After much contemplation, a rather ingenious proposal was put forward─to transform the moon into a repository for man's knowledge. An archive of hitherto unseen scale."},{"name":"FOURCHENAULT","text":"Sharlayan has long had the honor of boasting incomparable repositories of the world's knowledge, but it is far from perfect."},{"name":"FOURCHENAULT","text":"Should calamity befall us, natural or otherwise, the wisdom of ages we have long labored to preserve would be lost."},{"name":"FOURCHENAULT","text":"But the moon is beyond any such risk. What's more, it is beyond the jurisdiction of any one nation."},{"name":"FOURCHENAULT","text":"Thus did we consult the allied nations of Eorzea, the Far East, and Radz-at-Han. They agreed to assembling a survey team to take measure of the moon and its potential as a repository."},{"name":"FOURCHENAULT","text":"Our plans for assessment were forestalled, however, by the presence of an entity we believe to be a blasphemy in the Tower of Babil."},{"name":"MAXIMA","text":"Claims of Garlean citizens transforming into monsters shortly after its discovery only gave further credence to our initial supposition."},{"name":"LUCIA","text":"But we've not only ill tidings to share. Reinforcements have been dispatched to aid us in quelling the blasphemy threat."},{"name":"MAXIMA","text":"Lord Artoirel and a member of Gridania's Keepers of the Entwined Serpents have already begun an investigation into the catalyst of these transformations. "},{"name":"MAXIMA","text":"Though the skies no longer burn, and the spread of this affliction is much curtailed, we must remain vigilant."},{"name":"MAXIMA","text":"Until the blasphemy threat has been quelled, Alphinaud and Alisaie have graciously offered to help keep calm the people of Tertium while we attend to the people here."},{"name":"LUCIA","text":"But the matter of the blasphemy is not so easily resolved, I am afraid."},{"name":"LUCIA","text":"We recently met with certain...complications that have hindered our plans. Yugiri and Fordola are presently deliberating how best to resolve the situation. Perhaps it would be best if you heard the details directly from them."},{"name":"FOURCHENAULT","text":"I should like to join you, if I may. As this endeavor was originally undertaken on Sharlayan's behalf, I feel it is my responsibility to see this through to its conclusion."},{"name":"FORDOLA","text":"Hmph. Somehow I should've known <span class=\"emphasis\">you</span> would turn up eventually."},{"name":"YUGIRI","text":"I did not expect to see you here of all places, but I am no less glad for your presence."},{"name":"YUGIRI","text":"I presume word of the blasphemy is what brought you here. In which case, I believe it may be best if a member of the reconnaissance team's guard explained the situation."},{"name":"FOURCHENAULT","text":"An acquaintance of yours?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Long time no see, Lorens."},{"name":"A2","text":"Aren't you the captain of the Company of Heroes?"},{"name":"LORENS","text":"I'd heard tell ye were the worldly sort, but bugger me if I know where ye heard my name before. Ahem..."},{"name":"LORENS","text":"I'm just a lowly sword for hire, hopin' to fatten my purse with a touch o' mercenary work after takin' my leave from Limsa. The job sounded simple enough, but...well. I'm sure ye wouldn't be here if it were, eh?"},{"name":"LORENS","text":"Who? Me? Heavens no! Just a lowly sword for hire, hopin' to fatten my purse with a touch o' mercenary work after takin' my leave from Limsa."},{"name":"LORENS","text":"I reckon ye'd sooner find Mistbeard's treasure than the Company o' Heroes' captain, and neither have reason to make themselves known, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"LORENS","text":"But ye didn't come all this way to hear about me, did ye? The blasphemy we're after is making its nest in the upper reaches of the Tower of Babil. The auxiliary sector, I believe it was."},{"name":"LORENS","text":"But it wasn't alone─a sizable horde o' beasts were circlin' about like knights protectin' their queen. Naturally, we thought to strike from a distance before engagin' in earnest, but not a single bullet reached its mark."},{"name":"LORENS","text":"They were protected by some manner o' mystical shroud as far as I could figure. Without a keen eye for magic, I don't see anyone gettin' through."},{"name":"LORENS","text":"By the time we understood the futility o' the situation, we'd been spotted. Retreat was our only option."},{"name":"LORENS","text":"Pains me to say it, but there won't be any brute forcin' our way through this one."},{"name":"FOURCHENAULT","text":"My understanding was that, once transformed, these blasphemies are completely devoid of aether. With what energies could it create such a barrier?"},{"name":"LORENS","text":"That's the question, isn't it? My first thought was some heretofore unknown technique for conjurin' shields. Needless to say, I'm out o' my depth when it comes to matters o' magic."},{"name":"LORENS","text":"Which is precisely why I plan to speak with the Elder Seedseer when she arrives. If anyone can help us find a way to overcome the blasphemy's protection, it's her."},{"name":"LORENS","text":"In the meantime, could we trouble you to help with the not-so-small matter o' people changin' into beasts? The blasphemy's horde was large enough when first we found it. We can't afford for more to join its ranks."},{"name":"FOURCHENAULT","text":"Very well. We shall reconvene with Lord Artoirel and discuss strategy."},{"name":"LORENS","text":"Ah, before you go... There's somethin' else you should know about the tower. From the moment we set foot inside, I could swear there was someone...or some<span class=\"emphasis\">thing</span> watchin' us."},{"name":"LORENS","text":"I shrugged it off, thinkin' it a figment o' my imagination, but... In hindsight, I'm not so sure."},{"name":"LORENS","text":"Nothin' to worry ourselves about now, but best keep on your guard when we do finally return to the tower, eh?"},{"name":"LORENS","text":"Gods... Wh-What I wouldn't give f-for a nice, hot bowl of s-s-soup."},{"name":"YUGIRI","text":"Lord Hien will be arriving ere long. Aptly dressed for the cold, I should hope. Gosetsu would no doubt count himself fortunate to be absent if he knew we were here."},{"name":"FORDOLA","text":"Arenvald sends his regards, by the way. He asked me to tell you not to push yourself, but we all know what a waste of breath that'll prove to be."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Under normal circumstances, I would never dream of leaving the Elder Seedseer's side, but considering the nature of these blasphemies and the calamity they bring, she insisted a representative for Gridania precede her arrival."},{"name":"FOURCHENAULT","text":"It would appear their investigation into the recent reports of refugees transforming is well underway."},{"name":"ARTOIREL","text":"Ah, <span class=\"highlight\">Forename</span>. 'Tis good to have you with us, my friend."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"Indeed. The road before us is not an easy one, and a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of your talents will prove invaluable to our efforts."},{"name":"ARTOIREL","text":"We but recently returned from reconnaissance, wherein we made a few rather surprising discoveries."},{"name":"ARTOIREL","text":"First and foremost, we were pleased to discover that no one residing within Camp Broken Glass or Tertium have turned, no doubt thanks to the concerted efforts of Maxima, Alphinaud, and Alisaie."},{"name":"ARTOIREL","text":"However, we have reason to believe those who <span class=\"emphasis\">did</span> turn all hail from Locus Amoenus."},{"name":"FOURCHENAULT","text":"You mean Corvos, the Garleans' ancestral home?"},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"The very same. When the ill effects of the Final Days began to manifest there, a number of Garlean refugees from the region sought sanctuary in Garlemald."},{"name":"KEEPEROFTHEENTWINEDSERPENTS","text":"But the capital was already in ruins when they arrived. They were offered asylum, but many refused and instead chose to fend for themselves on the outskirts of the city."},{"name":"ARTOIREL","text":"We are of a mind to go and speak with them directly if you would care to join us. Perhaps together we can learn what of their recent circumstances has triggered such terrible change among their people."}],"reward":{"gil":2069},"reqs":{"jobs":[{"lvl":90,"id":142}],"questsType":"all","quests":[69643,69649]},"next":[70116]},"partials":[{"type":"npc","id":"1039543","obj":{"i":1039543,"n":"Shirabaht","l":3707,"q":2}},{"type":"npc","id":"1042733","obj":{"i":1042733,"n":"Artoirel","l":3710,"q":2}},{"type":"quest","id":"69643","obj":{"i":69643,"n":"A Path Unveiled","g":184,"l":"Gridania","s":151,"f":1}},{"type":"quest","id":"69649","obj":{"i":69649,"n":"The Gift of Mercy","g":185,"l":"The Lochs","s":251,"f":1}},{"type":"quest","id":"70116","obj":{"i":70116,"n":"Frozen Hope","g":189,"l":"Garlemald","s":2}}]}