{"quest":{"name":"Goodbye, ε̆│̆│Δ","location":"Radz-at-Han","id":70123,"patch":6.15,"sort":31,"icon":101158,"eventIcon":71221,"issuer":1042807,"target":1042822,"genre":20,"journal":["Omega has selected a new destination.","Omega expresses a desire to understand the seemingly illogical relationship between the Ilsabard contingent and the imperial population. In order to explore this inconsistency, it bids you teleport your group to Camp Broken Glass in Garlemald.","Your demanding mechanical companion insists that understanding its current issue will require questioning a representative of both the contingent and the Empire. With the implacable Omega and the shivering Alpha in tow, you set off to find some suitable interviewees.<br><br>※You must be accompanied by Omega and Alpha to complete this task. Speak with either of them at Camp Broken Glass should you become separated.","The men you question both remember you from an earlier visit, although with distinctly different emotions. Both, however, react to Omega's assessments in similarly unexpected fashion, providing the confused machine with a bounty of data to analyze. Once again, Omega asks that you relocate to a quiet place where it can process this new input.<br><br>※You must be accompanied by Omega and Alpha to complete this task. Speak with either of them at Camp Broken Glass should you become separated.","In the midst of discussing the interviewees' “inconsistent” responses and the unpredictability of mortal hearts, Omega exhibits a precipitous drop in energy supply─it would seem the cold weather affected its inner workings more than it anticipated. Omega commands you to apply friction to its outer frame, in an effort to raise its critically low core temperature.","Crisis averted, you confirm the direction of Omega's next destination: Victors' Spoils. The diminutive model clatters off with the feathery Alpha in close proximity, determined to learn more of burial customs and cognitive complications.","You arrive at Licinia's gravesite to find an imperial soldier paying his respects. Manius introduces himself, and Omega immediately subjects him to a barrage of probing questions. Although taken aback, Manius nevertheless does his best to respond, his honest answers leading Omega to the conclusion that it is not man who commands the strength of his heart, but rather emotion that controls the man...","Satisfied that no further revelations are forthcoming from Camp Broken Glass, Omega indicates its readiness to proceed to its third and final query. This last issue concerns the dearth of information regarding the ancients, and what their full impact on the Final Days might have been. Omega determines that the moon-dwelling Loporrits represent the best source of additional data, and your teleportation spell soon has you materializing inside Bestways Burrow.","In a stroke of good fortune, Omega's need for observational assistance is immediately filled by the appearance of an enthusiastic Growingway. They set off to examine the burrow's technology, and Omega returns from his Loporrit-guided tour with further questions about the ancients' near-ideal society. The ever-inquisitive machine now wishes to speak with “the watcher,” and agrees to your suggestion to ride Argos to the entity's tower.","Putting aside the potential ramifications of a fluff-based hierarchy, you manage to convince the stubborn Argos to bear you and your companions to the watcher's abode. The being in question patiently waits to be addressed, seemingly bemused by his unexpected visitors.","In response to Omega's query, the watcher suggests that a recounting of your experiences might paint a more vivid picture of the ancients and their deeds. The tales you share only serve to confound Omega further, however, as it struggles to reconcile its objective assessment of events with your highly personal perspective. The oft-beeping model nevertheless accepts the data which you and the watcher have provided, and states that its investigation is now completed. The time has come to make a return to Thaumazein.","Barely have Biggs and Wedge welcomed you back to Sharlayan when they explain that an urgent matter calls them away. You accompany them to their waiting airship, with Omega sharing the results of its investigations while you walk. Omega concludes that Sir's illogical actions strongly indicate the presence of a “heart,” which it has now defined as “a phenomenon which influences one's interpretation of reality.”<br><br>Upon arriving at the vessel, Biggs presses Omega to hold up its part of the bargain, and it finally provides you with a translation of the mystery transmission. It is a simple message, of hope and shared joy, the spiritual value of which appears lost on the ever-practical Omicron.","With the investigation over and its promised duty discharged, Omega returns to traveling the star with Alpha. Sharlayan, Radz–at–Han, Garlemald─the wide world and its many peoples await. There are questions yet to be answered, and the road ahead is long..."],"objectives":["Speak with Omega and have it accompany you.","Speak with a contingent member while accompanied by Omega and Alpha.","Speak with an imperial citizen while accompanied by Omega and Alpha.","Accompany Omega to the designated location and then speak with it.","Rub some warmth back into Omega's frame.","Speak with Omega at Victors' Spoils.","Speak with Omega.","Speak with Omega again.","Speak with Omega at the entrance to Bestways Burrow.","Speak with the watcher.","Speak with Biggs at Thaumazein.","Speak with Omega."],"dialogue":[{"name":"ALPHA","text":"Kweh, kwe-kwe kweh!"},{"name":"OMEGA","text":"Our next destination will be Camp Broken Glass."},{"name":"OMEGA","text":"I desire elaboration on the dealings between the Ilsabard contingent and the citizens of Garlemald."},{"name":"OMEGA","text":"The report described the contingent's purpose as the salvation of the local populace. Furthermore, both factions faced a common enemy in the Telophoroi. Why did they not immediately combine forces to their mutual benefit?"},{"name":"OMEGA","text":"This inconsistency requires closer examination. <span class=\"highlight\">Forename</span>, initiate teleportation."},{"name":"ALPHA","text":"Kweh-k-k-k-k-k-kweeeh..."},{"name":"OMEGA","text":"Teleportation successful. Evaluating immediate environs. A cold-weather region by Etheirys standards, but significantly less extreme than a star with ice planet classification."},{"name":"OMEGA","text":"This body should not be unduly impeded. In contrast to Alpha and his uncontrollable shivering, my frame appears highly resistant to low temperatures."},{"name":"OMEGA","text":"Retrieving data. Records indicate that remnants of the contingent force and a number of imperial citizens yet inhabit this location."},{"name":"OMEGA","text":"We must speak with representatives from both factions, and explore their respective attitudes. &lt;blip&gt; Proceed."},{"name":"SYSTEM","text":"Omega and Alpha are now accompanying you. Keep them at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave your quest companions behind by entering a different area, or by speaking with them and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have your companions join you again, return and speak with them at the original location."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Talk."},{"name":"A1","text":"Part ways."},{"name":"A1","text":"Nothing."},{"name":"OMEGA","text":"Please approach a contingent member and an imperial citizen. I require input from both perspectives."},{"name":"OMEGA","text":"I recommend you move at a brisk pace. The exertion will raise your body temperature, preventing you and Alpha from freezing to death."},{"name":"ALPHA","text":"Kw...kwe...kwe-choo!"},{"name":"Q2","text":"Are you sure you wish to part ways with your companions?"},{"name":"OMEGA","text":"&lt;blip&gt; Has your organic body reached its limit for cold exposure? Restore your temperature equilibrium, then find us again at the center of the camp."},{"name":"ALPHA","text":"Kwe-kweh..."},{"name":"SYSTEM","text":"Alpha races off towards the middle of Camp Broken Glass, breath steaming in the freezing air."},{"name":"OMEGA","text":"&lt;blip&gt; You are functional again? Then let us resume our objective."},{"name":"ALPHA","text":"Kweh-k-k-k-k-k-kweh!"},{"name":"SYSTEM","text":"Omega and Alpha have yet to arrive. Be sure they are at your side before attempting to continue."},{"name":"HUNGRYGARLEAN","text":"A shadow from the past...?"},{"name":"SYSTEM","text":"You should have Omega and Alpha accompanying you before initiating conversation."},{"name":"HUNGRYGARLEAN","text":"A shadow from the past...? Yes, I know you from Victors' Spoils!"},{"name":"HUNGRYGARLEAN","text":"Have you come to laugh at me!? A wretch who chose to lose Licinia and her sister rather than accept your help...? The fool who ended up reliant upon your charity nonetheless...?"},{"name":"HUNGRYGARLEAN","text":"Well, perhaps I <span class=\"emphasis\">deserve</span> your derision. My compatriots surely scorn my failed conviction."},{"name":"HUNGRYGARLEAN","text":"I have shamed my people, and brought dishonor upon my nation. I am no better than a kept beast, my pride sold for a bowl of feed..."},{"name":"HUNGRYGARLEAN","text":"But my soul, nay, <span class=\"emphasis\">that</span> you shall not have! I've refused your honeyed offers of a new home! This land is where I belong, and this is where I shall remain!"},{"name":"OMEGA","text":"&lt;blip&gt; You demonstrate opposition to the contingent's overtures."},{"name":"OMEGA","text":"On what basis do you refuse this cooperation? The data suggests the local populace is struggling to produce the bare minimum of sustenance."},{"name":"OMEGA","text":"Have you some secret strategy for survival? Or do your orders compel you to accept your present misfortune?"},{"name":"HUNGRYGARLEAN","text":"Wha─? Must I be mocked by a magitek toy now!?"},{"name":"HUNGRYGARLEAN","text":"No, I have no secret strategy! No binding orders! I but comport myself as any true Garlean patriot would! Uncompromising...unbending..."},{"name":"HUNGRYGARLEAN","text":"...Blast it all."},{"name":"OMEGA","text":"Once again, this input is...unanticipated. Let us move aside and process what we have heard."},{"name":"HUNGRYGARLEAN","text":"There is naught for me here! I know this! But if I surrender my homeland, then what was it all for...?"},{"name":"ALAMHIGANDELEGATION","text":"<span class=\"highlight\">Forename</span>...?"},{"name":"ALAMHIGANDELEGATION","text":"<span class=\"highlight\">Forename</span>...? Come to see how things are progressing, have you?"},{"name":"ALAMHIGANDELEGATION","text":"I can't speak for the overall strategy, but communication with the locals has become a damn sight easier since Jullus and his soldiers stepped in to help."},{"name":"ALAMHIGANDELEGATION","text":"Oh, we still face our fair share of distrust, of course. Some folk even think we're enslaving minds with our “foreign magicks.” Hmph. We have Anima to thank for putting that idea in their heads."},{"name":"ALAMHIGANDELEGATION","text":"But all things considered, I'd say we're doing pretty well. Establishing an open dialogue was the first big step..."},{"name":"OMEGA","text":"Query. You consider this level of progress...acceptable?"},{"name":"OMEGA","text":"The reality of your efforts falls far short of the ideal. If your aim is to provide efficient succor to the local populace, then absorbing their numbers into your command structure would be the optimal path."},{"name":"ALAMHIGANDELEGATION","text":"Oh, I wouldn't want to go that far. We're not looking to take over their nation."},{"name":"ALAMHIGANDELEGATION","text":"If we're to do this the right way, we need to recognize and respect each other's way of life."},{"name":"ALAMHIGANDELEGATION","text":"So while it may not be the easiest solution, I agree with the contingent's slow-and-steady approach. I'm just happy we're saving lives."},{"name":"ALAMHIGANDELEGATION","text":"I'm Ala Mhigan, but I was also an imperial conscript until not so long ago. Though I was lucky enough to have a decent commanding officer, many Garleans treated “provincials” like we were less than people."},{"name":"ALAMHIGANDELEGATION","text":"On the other hand, natives of Ala Mhigo didn't think much of us, either. I guess that's my roundabout way of saying I'm surprised this contingent was even formed in the first place. I feel fortunate to be a part of it."},{"name":"OMEGA","text":"I require time and distance to process this data. Scanning for suitable locations..."},{"name":"ALPHA","text":"Kweh...? Kwe-kweh, kweeeh?"},{"name":"OMEGA","text":"&lt;bloop&gt; Alpha is absent."},{"name":"SYSTEM","text":"Omega seems reluctant to continue without Alpha present. Be sure to have the chocobo with you."},{"name":"OMEGA","text":"Accessing and analyzing recorded data... Integration complete."},{"name":"OMEGA","text":"I have evaluated this most recent input, and made comparisons to our discoveries in Radz–at–Han."},{"name":"OMEGA","text":"Consistent only in their inconsistency, the responses from both contingent member and imperial citizen were highly irrational. Conversely, any Omicron considering their predicaments would have echoed my assessment exactly."},{"name":"OMEGA","text":"The divergence from self-evident logic is key..."},{"name":"OMEGA","text":"Hypothesis. The illogical relationship between would-be saviors and suffering populace is another result of the unpredictable nature of mortal hearts."},{"name":"OMEGA","text":"&lt;blip&gt; Any property or ability has inherent advantages and disadvantages."},{"name":"OMEGA","text":"Yet never have I encountered such a unique detriment. It appears that those who share your metaphysical capabilities are prone to complicating simple cognitive processes."},{"name":"OMEGA","text":"An undesirable quality. I will, however, persist in furthering my understanding of the subject."},{"name":"OMEGA","text":"Query. Prior to formulating our next step, I wish to know: who is this “Licinia” the imperial mentioned?"},{"name":"OMEGA","text":"Acknowledged. To summarize, insufficient data on foreign culture resulted in inadvisable and ultimately fatal action."},{"name":"OMEGA","text":"I witnessed such self-destructive behavior during the course of our planetary conquests. Overwhelmed enemy forces would voluntarily withdraw into perilous regions, leading to a succession of inevitable losses."},{"name":"OMEGA","text":"...Tangential data request. I wish to learn about burial customs. The practice has ever seemed nonsensical, but new data suggests it arises from the same source as your cognitive complications."},{"name":"OMEGA","text":"Take me to this Licinia's burial site. It may aid me in understand...stand... &lt;bloop&gt; &lt;bloooooop&gt;"},{"name":"OMEGA","text":"Energy delivery systems compromised... Core temperature critically low..."},{"name":"OMEGA","text":"&lt;bleep&gt; Warning! Immediate heating required. Request. Apply friction to outer frame..."},{"name":"ALPHA","text":"Kweeeh!? Kweh, kwe-kwe-kweh!"},{"name":"OMEGA","text":"&lt;bloop&gt; &lt;blip&gt; Temperature nominal. Energy levels stabilizing..."},{"name":"OMEGA","text":"The creators of this model must have experienced impaired cognitive reasoning during the design process."},{"name":"OMEGA","text":"Upon our return, I will request additional climate shielding, as well as an accurate temperature sensor array. This will not affect my combat capabilities, but should improve my basic survival rate."},{"name":"OMEGA","text":"Reconfirming sub-destination. In which direction will we find Victors' Spoils?"},{"name":"OMEGA","text":"&lt;blip&gt; Acknowledged."},{"name":"OMEGA","text":"Alpha, you are to remain in close proximity. Close enough to envelop me in your feathers. You are permitted to carry me on your back, if you so choose."},{"name":"ALPHA","text":"Kweh, kwe-kweh...?"},{"name":"COLLEAGUESOLDIER","text":"..."},{"name":"OMEGA","text":"&lt;blip&gt; A deceptively deep snowdrift almost defeated me, but we have successfully arrived at the location you indicated."},{"name":"OMEGA","text":"&lt;blip&gt; Caution advised."},{"name":"OMEGA","text":"An unknown individual appears to be investigating the object of my interest."},{"name":"COLLEAGUESOLDIER","text":"(-Ist Legion Soldier-)Hm...? You're Eorzea's champion, aren't you? <span class=\"highlight\">Forename Surname</span>."},{"name":"COLLEAGUESOLDIER","text":"(-Ist Legion Soldier-)Oh, I never introduced myself, did I...?"},{"name":"COLLEAGUESOLDIER","text":"I am Manius, soldier of the Ist Legion and comrade of Jullus."},{"name":"COLLEAGUESOLDIER","text":"Perhaps you remember me from Tertium? We spoke about collecting ceruleum, and again later on, after Lord Quintus had...passed."},{"name":"OMEGA","text":"Manius. Explanation requested. What is the reason for your presence here?"},{"name":"COLLEAGUESOLDIER","text":"That must be the tiniest magitek weapon I─ Ah, no, it's just an oddly shaped communicator, isn't it?"},{"name":"COLLEAGUESOLDIER","text":"In any case, I have nothing worthy to report. I heard that the sisters who used to live in my sector were buried here, so I thought I'd come and pay my respects."},{"name":"COLLEAGUESOLDIER","text":"Alphinaud and Alisaie told me the story─complete with profuse apologies─though they were adamant that no amount of remorse could erase the tragedy of what came to pass."},{"name":"COLLEAGUESOLDIER","text":"Not that my fellow soldiers and I are in any place to judge. We were manipulated─fooled into starting an insurrection which led to countless deaths among our own countrymen."},{"name":"OMEGA","text":"Objection. The casualties incurred through your infighting are distinct from those caused by the Ilsabard contingent."},{"name":"OMEGA","text":"To restate, you are justified in seeking restitution from the contingent for causing the deaths of Licinia and her sister. Retaliation for damages sustained is also a logical progression."},{"name":"OMEGA","text":"I can deduce two reasons why you do not initiate hostilities with <span class=\"highlight\">Forename</span> and <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> allies."},{"name":"OMEGA","text":"One. You judge your remaining forces too weakened to contend effectively with the contingent."},{"name":"OMEGA","text":"Two. Your...emotions...are complicating the issue."},{"name":"OMEGA","text":"Tell me. Which of these is correct?"},{"name":"COLLEAGUESOLDIER","text":"Well, when you lay it out like that..."},{"name":"COLLEAGUESOLDIER","text":"Ahem. I'm afraid my answer isn't like to win me any medals, so would you mind keeping this to yourselves?"},{"name":"COLLEAGUESOLDIER","text":"There's the unspoken thought that we're outmatched on the battlefield, certainly. But the real reason I'm not demanding restitution has little to do with weighing the odds."},{"name":"COLLEAGUESOLDIER","text":"The simple truth is I'm so caught up with simple survival that I've no strength to spare for past grievances."},{"name":"COLLEAGUESOLDIER","text":"The same goes for avenging any comrades we've lost, be that my brothers-in-arms or Lord Quintus himself."},{"name":"COLLEAGUESOLDIER","text":"...Although it seems everyone has an opinion about the manner of <span class=\"emphasis\">his</span> passing."},{"name":"COLLEAGUESOLDIER","text":"Some say he should've fought until the end. That he abandoned us to the enemy."},{"name":"COLLEAGUESOLDIER","text":"Others praise him for taking the full burden of responsibility, and freeing us to walk our own path."},{"name":"COLLEAGUESOLDIER","text":"I don't know who's right and who's wrong, but I'm inclined to side with the latter. He gave us the choice of freedom, and that's the choice I made."},{"name":"COLLEAGUESOLDIER","text":"I could cry and rant and rage, but what would be the point? I'll save my energy for worrying about my next meal, my next task."},{"name":"COLLEAGUESOLDIER","text":"I need to focus on the ones left behind─on making some kind of life for my comrades and me."},{"name":"COLLEAGUESOLDIER","text":"And if I need to lean on the contingent to do that, then that's what I'll do. Even if their aid comes at a price, I'm willing to pay it."},{"name":"COLLEAGUESOLDIER","text":"Even amongst your own, there are times when cooperation demands compromise. What matter that they're outsiders?"},{"name":"COLLEAGUESOLDIER","text":"Besides, I think I could grow to like Alphinaud and Alisaie. They've reached out to us with kindness and compassion from the very beginning."},{"name":"OMEGA","text":"Summation. Your desire to survive, even should it mean allying with the contingent, was a feeling you already harbored."},{"name":"OMEGA","text":"That your side had committed worse atrocities was the logic you invented later to justify your reasoning."},{"name":"COLLEAGUESOLDIER","text":"Blunt but accurate, I suppose. The heart is honest about what it wants, even if the mind takes a while to reconcile the decision."},{"name":"COLLEAGUESOLDIER","text":"Well, this has been oddly cathartic, but I must return to my duties. There are wild beasts to cull, watch fires to light, supplies to transport... Even without an Emperor, there's no rest for an imperial."},{"name":"COLLEAGUESOLDIER","text":"Be well and stay safe."},{"name":"OMEGA","text":"&lt;blip&gt; Upon review of recent input, I have arrived at an unexpected conclusion."},{"name":"OMEGA","text":"I have been formulating my assessments on the premise that it was man who commanded the strength of his heart...but the data suggests the opposite is true."},{"name":"OMEGA","text":"The surge of spirit, of feelings, of <span class=\"emphasis\">emotions</span> can entangle your thoughts to such a degree that even control over your own behavior is compromised. It seems a most counterproductive specification."},{"name":"OMEGA","text":"This also explains why my interactions with mortal subjects have produced more confusion than clarification. It presents a formidable barrier to understanding..."},{"name":"ALPHA","text":"Kweh... Kweh, kwe-kweh..."},{"name":"OMEGA","text":"&lt;blip&gt; My earlier hypothesis has been borne out. The suboptimal operation being conducted here is the result of emotionally compromised reasoning."},{"name":"OMEGA","text":"I am ready to progress to my third and final query."},{"name":"OMEGA","text":"I would learn more about those referred to as “ancients.” It is clear that this group was a crucial factor of the Final Days, but the information contained in the report was insufficient to form an overview."},{"name":"OMEGA","text":"The Loporrits are creations of the ancients, and are said to maintain repositories of their knowledge. By my calculations, the base of these moondwellers will provide the best source of additional data."},{"name":"OMEGA","text":"Teleport us to their “burrow,” <span class=\"highlight\">Forename</span>. Preferably before my battery freezes over..."},{"name":"ALPHA","text":"Kweh! Kwe-kweh!"},{"name":"OMEGA","text":"&lt;blip&gt; Your teleportation spell was successful. We appear to have arrived at the location described as “Bestways Burrow.”"},{"name":"OMEGA","text":"An inspection of the technology in use here would give me detailed insight into the ancients and their civilization."},{"name":"OMEGA","text":"This body, however, lacks my previous frame's advanced observational functionality. I will require external assistance..."},{"name":"GROWINGWAY","text":"Hm? No, it can't be..."},{"name":"GROWINGWAY","text":"It <span class=\"emphasis\">is</span> you! Oh, <span class=\"highlight\">Forename</span>, I've missed you so!"},{"name":"GROWINGWAY","text":"&lt;gasp&gt; Wh-What's this you've brought with you?"},{"name":"GROWINGWAY","text":"This soft, feathery vision!?"},{"name":"GROWINGWAY","text":"We... We've been out-fluffed! Pack up the moon─it's all over!"},{"name":"GROWINGWAY","text":"Why bother with burrow-building bunnies when you could walk around with this adorable avian engineer. Just bake me into a pie and be done with it!"},{"name":"GROWINGWAY","text":"Inspect our inventions? Wait, so...you're not done with us?"},{"name":"GROWINGWAY","text":"Hah, I wasn't truly worried, of course! And I certainly wasn't about to roll myself in dough and dive into Cookingway's new oven!"},{"name":"GROWINGWAY","text":"Ahem. If a technical breakdown is what you need, then I am your Loporrit! As the resident atmospheric regulation expert, I can field any question or query you might care to pose!"},{"name":"OMEGA","text":"&lt;blip&gt; Acceptable. I will employ this being to guide me around the facilities."},{"name":"OMEGA","text":"Your presence is not mandatory. Even locked within my current chassis, I am still an autonomous construct that has endured hundreds of your life cycles. I am capable of completing this simple objective alone."},{"name":"OMEGA","text":"Objective complete."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Was the tour helpful?"},{"name":"A3","text":"What happened to Growingway?"},{"name":"OMEGA","text":"Affirmative. I observed a representative cross section of the Loporrits' engineering capabilities."},{"name":"OMEGA","text":"My guide required more time to confirm the answer to certain questions, but overall, we made efficient progress."},{"name":"OMEGA","text":"After my fiftieth question, his responses began to suffer noticeable delays..."},{"name":"OMEGA","text":"By that stage, we had viewed a representative cross section of Loporrit engineering, thus I deemed it unnecessary to retain his company."},{"name":"OMEGA","text":"Conclusion. Extrapolating from the fraction of technology on display, the full spectrum of the ancients' advancements was, at minimum, equivalent to a level four civilization."},{"name":"OMEGA","text":"A fact which demands further investigation."},{"name":"OMEGA","text":"Despite establishing a near-ideal society, these beings nevertheless harbored a weakness which invited self-destruction. In studying them, I stand to gain a greater understanding of Sir's anomalous decision."},{"name":"OMEGA","text":"Growingway informed me that another type of ancient-made entity exists upon this satellite. The one they call “the watcher.”"},{"name":"OMEGA","text":"I would speak to him."},{"name":"OMEGA","text":"&lt;blip&gt; Then conserve your aether. We will ride this “Argos” to our destination, as you have suggested."},{"name":"SYSTEM","text":"Argos is pointedly ignoring the existence of Omega and Alpha."},{"name":"ALPHA","text":"Kweh-kweh! Kweeeh kwe-kweh!"},{"name":"OMEGA","text":"&lt;bloop&gt; Impedance detected. The creature identified as Argos refuses to acknowledge our presence."},{"name":"OMEGA","text":"Hypothesis. Upon our arrival, Growingway expressed concern that he had been “out-fluffed.” This suggests the existence of a fluff-based hierarchy."},{"name":"OMEGA","text":"My station in such a system would be predictably low, but Argos is adamant in ignoring even Alpha. Its fluffiness level is impossible to gauge."},{"name":"SYSTEM","text":"Argos turns to you with an impassive gaze. It seems you will need to intervene..."},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"Just...think of them as luggage."},{"name":"A4","text":"You're the fluffiest of them all, dear Argos!"},{"name":"SYSTEM","text":"Argos gives an exasperated snort before motioning to his back. It seems you have permission to climb aboard!"},{"name":"OMEGA","text":"&lt;bloop&gt; You have secured the creature's permission? <span class=\"alternative-container\"><span class=\"alternative\">Curious. You must have special standing in the fluffiness hierarchy.</span><span class=\"alternative\">Curious. I suppose your body does exhibit a special kind of fluffiness.</span><span class=\"alternative\">Curious. Is it your fluffy tail which provides such exemplary standing in the hierarchy?</span><span class=\"alternative\">Your fluffiness rank must be significant indeed.</span><span class=\"alternative\">Curious. Is it your fluffy ears which provide such exemplary standing in the hierarchy?</span></span>"},{"name":"OMEGA","text":"&lt;bleep&gt; I have allowed myself to become distracted. Let us continue on to the watcher at once."},{"name":"OMEGA","text":"&lt;blip&gt; The watcher located. An estimate of this being's height explains the inconvenient scale of Bestways Burrow..."},{"name":"ALPHA","text":"Kweeeh! Kwe-kweh kweeeh!"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">I was bemused by the arrival of these small visitors, but I see they are companions of yours.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">What a rare thing for my abode to be thus crowded... How may I be of service to you?</span>"},{"name":"OMEGA","text":"Hello, watcher. My purpose here is to learn more about the ancients."},{"name":"OMEGA","text":"I would know of their deeds, their philosophies─the very nature of their hearts. I would understand why the Final Days was visited upon my home star."},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">A worthy endeavor. But there is another better suited to assisting you with that task.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Perhaps you might favor us with a tale or two of the ancients you met during your travels, <span class=\"highlight\">Forename</span>?</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">My fragmented memories would be a pale substitute indeed for the clarity of your more recent experiences.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Yes, I can envision every detail. Your meeting with Venat and Emet-Selch and Hythlodaeus. The sorrow and determination of Hermes.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">I am a creation of Hydaelyn, and as such, I believed the age of the ancients would fade and be forgotten...</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Yet knowing that their memory lives so vividly within you...it brings me great joy. I pray you keep them close to your heart.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">At the time of your journey to the past, the one whose essence I embody would have been a scholar at Anyder. A shame. Had you reason to go there, perhaps you might have met.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">As a man of learning, he was firm friends with Venat. They spent long hours trading theories, or debating the laws of the universe.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">I “remember” joining her faction as the Final Days bore down upon us. Yet of the events surrounding that tragedy, I recall precious little.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Hydaelyn wished for the people of your age to decide their own path, thus I suspect my recollection was limited by design.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Yet even She could not cut away one persistent memory...</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">I feel most distinctly his sadness at what was to come to pass. That in becoming Hydaelyn's heart, Venat would forever stand apart from the people she so loved.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">If she were so resolved in her convictions, then he, too, would share her sleepless vigil over the future yet to unfold. Thus was the vow he made to Venat as her transformation took hold.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">His fervent wish must have reached her in some fashion... For though his life was drained away by the summoning, he was reborn with new form and new purpose when <span class=\"emphasis\">I</span> awoke as the watcher of the moon.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">And you heard, <span class=\"highlight\">Forename</span>. You felt. You thought. And in seizing the future for yourselves have you brought full circle the saga which Venat began.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">What you accomplished was no divine miracle. It was but the beacon of hope, passed down from one generation to the next; a succession of wishes and prayers reshaping the star into the world we knew you deserved.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">You have our deepest gratitude. I thank you not only as myself, but as the man I once was, and on behalf of those who devoted themselves to Venat's vision.</span>"},{"name":"OMEGA","text":"&lt;bloop&gt; &lt;blooop&gt;"},{"name":"OMEGA","text":"I understand the facts of your story, <span class=\"highlight\">Forename</span>..."},{"name":"OMEGA","text":"...But not how you have chosen to process them. On what grounds do you speak of Venat with such fondness?"},{"name":"OMEGA","text":"By sundering the world, she ultimately guided your kind to victory, yet in doing so caused irreparable damage to its individual members."},{"name":"OMEGA","text":"The full scale of that act is beyond calculation. It is evident, however, that it resulted in a protracted period of suboptimal existence for Emet-Selch and his brethren."},{"name":"OMEGA","text":"Query. If the survival of your kind is the deciding factor in your evaluation, then should you not also admire Hermes and his decision to subject man to a trial? Forcing you to change or perish, as was the fate of countless civilizations before you."},{"name":"OMEGA","text":"From my perspective, his determination was similar to that of the Omicrons' ancestors─those who first began trading flesh for machine, so that our people might stand against the onslaught of aggression from other races."},{"name":"OMEGA","text":"It was an unprecedented attempt, accompanied by much failure and sacrifice. Their early experiments were crude. Primitive."},{"name":"OMEGA","text":"Had they not made those first advances, however, we would have remained vulnerable to our environment. The violence would have utterly consumed us."},{"name":"OMEGA","text":"And what of Emet-Selch himself? Judging by your retelling, he was a benevolent ally saddled with tragic fate."},{"name":"OMEGA","text":"Yet I remember the years when my instruments fed me data from events across the entire star. During that time, I witnessed his Ascians engineer multiple instances of cataclysmic strife."},{"name":"OMEGA","text":"These “calamities,” as you know them, were responsible for planet-wide destruction. A man whose endgame relied upon the extinction of all modern mortals must, by definition, be your worst enemy."},{"name":"OMEGA","text":"I require an answer. As a being of heart and soul, how do you classify each of these pivotal figures?"},{"name":"OMEGA","text":"From your perspective, which of them was most justified in their actions?"},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"They were all justified in their own way."},{"name":"A5","text":"Venat."},{"name":"A5","text":"Hermes."},{"name":"A5","text":"Emet-Selch."},{"name":"A5","text":"None of them were."},{"name":"OMEGA","text":"I...think I understand."},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">You seek a definitive answer. Yet based on our experiences, <span class=\"highlight\">Forename</span> and I might develop very different opinions.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">In the same fashion, you are free to form your own thoughts on the matter. Do not be so swift to consider them without merit.</span>"},{"name":"OMEGA","text":"I do not have my “own thoughts” on the matter. I assess each situation with the same logic pathways available to every Omicron."},{"name":"OMEGA","text":"Even if a thousand Omicrons were asked to analyze the same event, they would all return the same result...regardless of individual experience. There is no strength to be found in fractured reasoning."},{"name":"OMEGA","text":"Nonetheless, I find your input valuable. Recording data alongside interview results..."},{"name":"OMEGA","text":"This concludes my investigation into the incomplete elements of the Final Days report."},{"name":"OMEGA","text":"I will reanalyze the accumulated information, and examine the factors which led to Sir's incomprehensible decision."},{"name":"OMEGA","text":"&lt;blip&gt; Let us return to Thaumazein."},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">It was pleasant to hear your tales of Elpis. Should you ever need an audience familiar with the subject, I would be glad to listen to more of your recollections.</span>"},{"name":"WATCHEROFMOON","text":"<span class=\"highlight-purple\">Even with one's gaze fixed upon the future, we ofttimes find our thoughts drifting to the past. 'Tis a shame that Hydaelyn never chose to speak of it...</span>"},{"name":"WEDGE","text":"<span class=\"highlight\">Forename</span>! I wasn't sure you'd be back in time!"},{"name":"SCIENTIST04586","text":"You had a fruitful trip, I hope? I am absolutely <span class=\"emphasis\">bursting</span> to ask about your experiences with Omega, but I don't wish to be a pest."},{"name":"SCIENTIST04586","text":"I will swallow my questions for now, and maintain my academic decorum. Besides, it seems our engineering friends are in a hurry to leave..."},{"name":"OMEGA","text":"&lt;blip&gt;"},{"name":"ALPHA","text":"Kwe-kweh, kweeeh!"},{"name":"BIGGS","text":"Ah, there you are─right at the last moment!"},{"name":"BIGGS","text":"Your journey with Omega was properly educational, I hope?"},{"name":"BIGGS","text":"We'd planned to ask you all about it and that mystery transmission besides, but I'm afraid something urgent has come up..."},{"name":"BIGGS","text":"Seems one of our Ironworks associates has fouled up a job elsewhere, and Jessie needs Wedge and me to rush in and lend a hand."},{"name":"BIGGS","text":"There's an airship already waiting for us out in the harbor, in fact. Do you think you could escort us over there, and talk as we walk?"},{"name":"OMEGA","text":"&lt;blip&gt; Acceptable. I am fully capable of speech during ambulation."},{"name":"BIGGS","text":"I figured you might be. Right, let's get a move on, then."},{"name":"BIGGS","text":"So...you've cleared up all those points of confusion, then?"},{"name":"OMEGA","text":"...I had mistakenly classified your intangible “heart” as an ability of some kind."},{"name":"OMEGA","text":"An uncanny power that Omicrons could neither learn nor even measure."},{"name":"OMEGA","text":"Even now, its full nature yet eludes my comprehension."},{"name":"OMEGA","text":"Based upon our investigations, however, I have decided to alter my definition."},{"name":"OMEGA","text":"“A phenomenon which influences one's interpretation of reality.”"},{"name":"OMEGA","text":"That is as close to an answer as I have found."},{"name":"OMEGA","text":"Accordingly, Sir's actions upon meeting Meteion strongly indicate the presence of a “heart.”"},{"name":"OMEGA","text":"Sir did not follow routine logic, but formulated an independent assessment based upon the reality it perceived."},{"name":"OMEGA","text":"It “felt” that the best recourse for the Omicrons was to cease their expansion, and terminate all functions..."},{"name":"WEDGE","text":"Well, here's our ship!"},{"name":"BIGGS","text":"Aye, we need to be going...but first, I'll hold you to your bargain, Omega."},{"name":"BIGGS","text":"It's time you told us what was in that transmission from the flight logs."},{"name":"OMEGA","text":"&lt;blip&gt; Acknowledged. I will uphold the terms of our agreement."},{"name":"OMEGA","text":"The recording salvaged from the <span class=\"emphasis\">Ragnarok</span> was a simple one."},{"name":"OMEGA","text":"The message is so basic, in fact, that the time spent listening to it may result in a net loss of value. Shall I continue?"},{"name":"WEDGE","text":"Now you're just teasing! Tell us the message already!"},{"name":"OMEGA","text":"Acknowledged. Converting dialect coding to local language..."},{"name":"OMEGA","text":"“To whomever receives this message out there in the vast reaches of the cosmos..."},{"name":"OMEGA","text":"“To someone, I hope, who looks up at the stars with the same wistful gaze as mine..."},{"name":"OMEGA","text":"“To you I say...forge ahead. May all our tomorrows be blessed with joy.”"},{"name":"OMEGA","text":"This message had no designated recipient. It lacks purpose."},{"name":"OMEGA","text":"The concept of “joy” is overly abstract. The vocal supplication to manifest said joy is unrealistic in its optimism."},{"name":"OMEGA","text":"Yet based upon their expressions, my assessment of the transmission's value conflicts with its apparent impact."},{"name":"OMEGA","text":"And still, I fail to understand you, Sir. Your “heart” still confuses me."},{"name":"OMEGA","text":"Was termination of everything the correct course? How did you arrive at this conclusion?"},{"name":"OMEGA","text":"It defies all my attempts at reasoning..."},{"name":"OMEGA","text":"But I was designed to evolve. If I continue to learn, the probability that I eventually comprehend this phenomenon is greater than zero."},{"name":"OMEGA","text":"So I will put the dilemma of your decision aside for now..."},{"name":"OMEGA","text":"...And continue my existence upon this distant star. As I dwell among these many life-forms, so will I continue to piece together the complete shape of their mortal hearts."},{"name":"OMEGA","text":"I must document their progress..."},{"name":"ALPHA","text":"Kwe-kweeeh!"},{"name":"OMEGA","text":"Your contribution to my education is appreciated, <span class=\"highlight\">Forename</span>. Indeed, I have amassed a satisfying quantity of valuable data."},{"name":"OMEGA","text":"Now that our negotiated business is complete, however, Alpha and I will return to traveling the world."},{"name":"OMEGA","text":"Drawing on recent experience, I am confident we can expand the radius of our ventures by a significant margin."},{"name":"OMEGA","text":"We need not limit ourselves to Eorzea. I am now familiar with Sharlayan and Radz–at–Han, and would also like to revisit the freezing climes of Garlem─ &lt;blooop&gt;"},{"name":"OMEGA","text":"I neglected to instruct Biggs and Wedge to upgrade my climate shielding. &lt;blip&gt; I will reroute my request to Deputy President Jessie."},{"name":"OMEGA","text":"Engaging ambulation and parting salutations. Farewell, <span class=\"highlight\">Forename</span>."},{"name":"SYSTEM","text":"Alpha gives a vigorous shake, and draws forth a scrap of paper from under his wing."},{"name":"ALPHA","text":"Kweh!"},{"name":"SYSTEM","text":"It seems he wants you to have it. Perhaps this is his way of thanking you...?"},{"name":"OMEGA","text":"(-Omega-)&lt;blip&gt; Swiftly, Alpha! The road is long and we have barely begun our journey!"}],"reward":{"gil":1864,"items":[{"id":37414}]},"reqs":{"jobs":[{"lvl":90,"id":34}],"quests":[70122]}},"partials":[{"type":"npc","id":"1042807","obj":{"i":1042807,"n":"Omega","l":3707,"q":1}},{"type":"npc","id":"1042822","obj":{"i":1042822,"n":"Omega","l":3706,"q":1}},{"type":"item","id":"37414","obj":{"i":37414,"n":"Flow Together Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"quest","id":"70122","obj":{"i":70122,"n":"A Heartless Hypothesis","g":20,"l":"Old Sharlayan","s":30}}]}