{"quest":{"name":"The Box of Fortune","location":"Limsa Lominsa","id":70124,"patch":6.3,"sort":204,"icon":101165,"eventIcon":71221,"issuer":1042651,"target":1042653,"genre":194,"journal":["The usagi bugyo sees great fortune in your future.<br><br>※This quest is available for a limited time only.","This Heavensturn, the usagi bugyo, a member of a Far Eastern delegation come from Hingashi, is eager to introduce the good people of Eorzea to a tradition sure to change their fortune for the better. Eyeing you carefully, he ascertains that you are an adventurer, and mentions a request he would make of you. Dangling the opportunity to acquire your very own set of Far Eastern armor before you, he bids you speak with his colleague, an omikujishi standing near the Tempest Gate.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","As you approach the Far Eastern omikujishi, you find him with a dismayed expression on his face, and soon learn that he has experienced difficulty in getting the townspeople to take an interest in omikuji, a form of fortune-telling native to the Far East. Never one to turn down a soul in need─and with a set of your very own yoroi on the line─you agree to assist him by spreading word of the attraction to any who will listen on the upper decks of Limsa Lominsa.","From the Drowning Wench to the Missing Member, you have spread word of the fortune-telling spectacle to people from all walks of life, including a storm lieutenant of the Maelstrom, and even the pirate captain of the Sanguine Sirens herself. You can only hope that enough folk were enticed by your words to give the omikujishi the audience he deserves.","Upon returning to the omikujishi, he thanks you for your assistance, and asks that you remain at his side to see the fruits of your labor. As the townspeople amass and read their fortunes, you observe reactions both of glee and despair. Should you find yourself with a moment to spare, there may be another matter you can assist the omikujishi with."],"objectives":["Speak with the Far Eastern omikujishi.","Spread word of the wonders of omikuji.","Speak with the Far Eastern omikujishi."],"dialogue":[{"name":"OMIKUJISHI","text":"If only I could garner more interest..."},{"name":"RABBITMISSIONARY","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. From your bearing, I gather you are an adventurer. If so, there is a matter I would discuss with you!"},{"name":"RABBITMISSIONARY","text":"Ah, but where are my manners? I am the usagi bugyo, a member of a delegation hailing from Hingashi, a nation in the Far East. Each year, we travel across the seas to share our tradition of Heavensturn with the peoples of Eorzea."},{"name":"RABBITMISSIONARY","text":"In this realm, it is held that the gods raise up one amongst their number each year to serve as a herald of good fortune. In the Far East, however, 'tis not a god, but one of twelve noble beasts that is chosen."},{"name":"RABBITMISSIONARY","text":"In previous Heavensturn celebrations, we gifted participants kabuto fashioned after the presiding beast. But this year, we have an even greater reward: an entire set of armor!"},{"name":"RABBITMISSIONARY","text":"Lest you wonder, I am wearing the very prize we offer. Magnificent, is it not? Surely you wish to claim a set for yourself?"},{"name":"RABBITMISSIONARY","text":"If you do, I encourage you to speak with the omikujishi standing near the Tempest Gate. He is a member of our delegation, and would be honored to present you with the armor. You need but heed his request."},{"name":"RABBITMISSIONARY","text":"Seek out the omikujishi near the Tempest Gate. He is in charge of this year's celebration, and will tell you how to participate─and win yourself this magnificent armor!"},{"name":"OMIKUJISHI","text":"Greetings, friend. I take it you have spoken with my associate, the usagi bugyo, and are willing to lend your assistance."},{"name":"OMIKUJISHI","text":"Before I make any request of you, may I ask if you are at all familiar with the word “omikuji”?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"As a matter of fact, I am."},{"name":"A1","text":"Omiku-what?"},{"name":"OMIKUJISHI","text":"Truly? To know omikuji, you must be familiar with the culture of the Far East indeed! That being so, I will keep my explanation of it brief."},{"name":"OMIKUJISHI","text":"Omikuji, my friend. 'Tis an old tradition of the Far East, one I would not expect the people of this land to know."},{"name":"OMIKUJISHI","text":"A form of fortune-telling, omikuji may be translated as “sacred lots” in your tongue. One receives a lot at random, and with it a message from the divine upon a piece of parchment."},{"name":"OMIKUJISHI","text":"The message contains principles that describe what will bring one fortune─or misfortune. By taking these principles to heart, one will be visited with happiness."},{"name":"OMIKUJISHI","text":"Omikuji are an indispensable part of the Heavensturn celebration in the Far East, and I'm honored for the opportunity to share this tradition with the people of Eorzea."},{"name":"OMIKUJISHI","text":"Alas, perhaps due to a lack of familiarity, but a few souls have stopped to have their fortune told thus far... And this brings me to my request. If you are willing, I ask that you spread word of this auspicious opportunity to the townsfolk."},{"name":"OMIKUJISHI","text":"You have my thanks! As a local, I trust you know where to look for potential participants. I look forward to receiving those souls you send my way!"},{"name":"OMIKUJISHI","text":"My thanks again for spreading word of the omikuji. I look forward to receiving those souls you send my way!"},{"name":"ITOLWANN","text":"Far Eastern fortune-telling, you say? I'd wager some of our patrons would be keen. Fortune favors the bold, after all, and most here don't want for audacity─sense be damned."},{"name":"ITOLWANN","text":"I'll nudge a few customers your way while taking orders. It's the least I can do in return for the extra business we get thanks to Heavensturn."},{"name":"ITOLWANN","text":"Folk need no encouragement to drink themselves under the table, but they need even less this time of year. I'll be mindful of who I send your way."},{"name":"HILDELANA","text":"Just like that, another Heavensturn's upon us. As much as Beaudefoin and I enjoy chaperoning the Moonfire Faire, I must say it's nice to simply lose yourself in a festival."},{"name":"BEAUDEFOIN","text":"A traditional test of luck for the new year? Consider me intrigued! As proud chaperones of the Moonfire Faire, we have a responsibility to learn what we can from other festivals."},{"name":"HILDELANA","text":"The idea of entrusting one's fortune to chance is a bit too superstitious for my liking, but I'm certainly curious. We'll be sure to let our colleagues in the Adventurers' Guild know about it."},{"name":"RHOSWEN","text":"I'd known the Far Easterners were back fer 'Eavensturn, but they're doin' fortune-tellin' as well this time, ye say?"},{"name":"RHOSWEN","text":"These fortunes... They say anythin' about relationships? Ye know, between a man an' a woman?"},{"name":"RHOSWEN","text":"J-Just curious, is all. D-Don't get any strange ideas."},{"name":"RHOSWEN","text":"Reckon I'll go an' check out this omikuji. N-Not that I put any store by such nonsense, mind ye. I've got free time, is all..."},{"name":"TRACHRAET","text":"I've seen my fair share of 'Eavensturn celebrations, but I can't say I've 'eard o' this omikuji business afore. Does sound interestin', though."},{"name":"TRACHRAET","text":"When me shift ends, I'll head over with some comrades. Might make a nice diversion, an' I'll take the opportunity to welcome the Far Eastern delegation on behalf o' the Maelstrom."},{"name":"TRACHRAET","text":"The Far Easterners come 'ere every year to share their culture with us. Least I can do is greet 'em properly on behalf o' the Maelstrom."},{"name":"OMIKUJISHI","text":"You have finished spreading word of the omikuji? My heartfelt thanks!"},{"name":"OMIKUJISHI","text":"I daresay we can expect some participants to appear soon. Please stay and observe the proceedings!"},{"name":"OMIKUJISHI","text":"Welcome, one and all! It is my pleasure to introduce to you a time-honored fortune-telling tradition of the Far East: the omikuji!"},{"name":"OMIKUJISHI","text":"The process is simple. Begin by shaking yonder box until it dispenses a stick. There will be a number on the stick, which indicates which of these drawers you are to open."},{"name":"OMIKUJISHI","text":"Take a piece of paper from that drawer. Upon it your fortune is written."},{"name":"OMIKUJISHI","text":"Once you have read your fortune, you may tie the parchment to the rack yonder. By doing so, good fortune will become better still, whilst misfortune will be cleansed. Alternately, you may also keep the parchment with you to guide you throughout the year."},{"name":"OMIKUJISHI","text":"So...who wishes to learn their fortune first?"},{"name":"HILDELANA","text":"Yesss! Mine says “great fortune”─the luckiest you can get! There isn't a single negative thing written on it. Hehe, I can throw myself wholeheartedly into adventuring this year!"},{"name":"BEAUDEFOIN","text":"D-Damn it all! Mine says...“grave misfortune.” I'm doomed... Doomed, I tell you!"},{"name":"RHOSWEN","text":"“The one yer waitin' fer is on their way”...? “The love o' yer life will appear”...? Th-This is all too sudden!"},{"name":"OMIKUJISHI","text":"Ahhh, 'tis a fine feeling to have others experience and enjoy your culture... Now, what of you, my friend? Would you care to learn your own fortune? As thanks for your help, the first lot will be free of charge."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Yes, please!"},{"name":"A2","text":"No thanks─I determine my own fortune."},{"name":"OMIKUJISHI","text":"I must say, there is something to be admired in those who would make their own way. But should you change your mind during the festivities, you are always welcome to give it a try."},{"name":"OMIKUJISHI","text":"Then go on, give the box a good shake!"},{"name":"OMIKUJISHI","text":"Allow me to thank you once more. Without your help, these folk may never have discovered omikuji. Whatever the divine may have in store for you, I pray the coming year will bring you happiness."}],"reward":{"gil":277},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[70125]},"partials":[{"type":"npc","id":"1042651","obj":{"i":1042651,"n":"Usagi Bugyo","l":28,"q":1}},{"type":"npc","id":"1042653","obj":{"i":1042653,"n":"Far Eastern Omikujishi","l":28,"q":2}},{"type":"quest","id":"70125","obj":{"i":70125,"n":"With Great Fortune Comes Great Responsibility","g":194,"l":"Limsa Lominsa","s":205}}]}