{"quest":{"name":"A Heartless Hypothesis","location":"Old Sharlayan","id":70122,"patch":6.15,"sort":30,"icon":101157,"eventIcon":71221,"issuer":1042796,"target":1042805,"genre":20,"journal":["The bespectacled technician is enjoying the refreshing harbor breeze.","The bespectacled technician turns at your approach, marveling at the serendipity of your meeting. She explains that she and her team have just begun combing through the <span class=\"emphasis\">Ragnarok</span>'s flight log data, only to discover the existence of a mystery transmission─an audio message of unknown origin. The technician invites you to join her at Thaumazein, insisting that one of the flight's original passengers should be present for the moment when they finally decipher the transmission's content.","Upon your arrival, you learn that engineers from Garlond Ironworks will be coming to assist with deciphering the message. Sure enough, you are soon joined by the inimitable Biggs and Wedge, who themselves are accompanied by Alpha and the scale model of Omega. After exchanging surprised greetings, Biggs shares his suspicion that, in its final moments, the original Omega may have somehow transferred its mind into its toylike counterpart. The contraption's newly added voice module removes all doubt, allowing the entity to confirm its identity, not to mention its ability to understand the transmitted missive. Omega's willingness to cooperate, however, is contingent upon you assisting with its investigation into certain anomalies surrounding the Final Days...","You agree to Omega's conditions, and it explains that there are three elements of the Scions' report which require clarification. The first of these concerns the pattern of those who succumbed to transformation during the Final Days. Motioning for Alpha to join you, it urges you to teleport your unlikely trio to Radz–at–Han.","Once in the city, Omega hypothesizes that survivors of the Final Days will display significant strength of heart. Reasoning that a residential ward should provide suitable subjects for interrogation, you set off to question the inhabitants of Kama.<br><br>※You must be accompanied by Omega and Alpha to complete this task. Speak with either of them at the aetheryte plaza should you become separated.","Your interviews have provided Omega with a trove of revelatory data. Seemingly overwhelmed by the input, the former weapon construct requests a quiet location to process the information it has heard.<br><br>※You must be accompanied by Omega and Alpha to complete this task. Speak with either of them at the aetheryte plaza should you become separated.","After evaluating its initial hypothesis against the gathered evidence, Omega is struck by the inaccuracy of its assessments. Determined to identify the root of this computational conflict, Omega insists that a larger sample size of subjects is required. You conclude that Djinabaha of Ruveydah Fibers should meet the parameters set forth by your mechanical companion.<br><br>※You must be accompanied by Omega and Alpha to complete this task. Speak with either of them at the aetheryte plaza should you become separated.","A puzzled-but-welcoming Djinabaha does his best to answer Omega's questions, though it seems his responses serve only to add to the machine's confusion. Reluctant to disturb the “deep philosophical musings” taking place, Djinabaha nevertheless ventures to ask a favor of you. He asks that you spare a moment to talk with a man by the name of Nashvan, who should be sorting inventory just outside the facility's eastern exit.<br><br>※You must be accompanied by Omega and Alpha to complete this task. Speak with either of them at the aetheryte plaza should you become separated.","You find the man in question, and are transported back to that tragic moment in time when both his son and Ahewann were lost to the terrors of the Final Days. Nashvan's tale of sorrow and subsequent return to society leaves Omega confounded once more, the ephemeral mortal spirit as much a source of mystery as it ever was. Perhaps a change of location and objective will help further Omega's education..."],"objectives":["Speak with the bespectacled technician.","Speak with Omega.","Speak with Omega and have it accompany you.","Speak with the residents of Kama while accompanied by Omega and Alpha.","Accompany Omega to the designated location and then speak with it.","Speak with Djinabaha while accompanied by Omega and Alpha.","Search for Nashvan while accompanied by Omega and Alpha."],"dialogue":[{"name":"SCIENTIST04586","text":"Hrngh! Ah, that's blown the cobwebs away. Time to return to work..."},{"name":"SCIENTIST04586","text":"Goodness me, look who it is! How incredibly serendipitous that I would run into <span class=\"emphasis\">you</span> of all people!"},{"name":"SCIENTIST04586","text":"I was part of the team which designed the <span class=\"emphasis\">Ragnarok</span>, you see, and we've recently begun the process of combing through the vessel's flight log data."},{"name":"SCIENTIST04586","text":"The primary objective of your journey to Ultima Thule was to save our star and countless others, of course, but it also provided us with an invaluable trove of information─records of places and events we could only dream of."},{"name":"SCIENTIST04586","text":"Your safe return gave us much to be thankful for."},{"name":"SCIENTIST04586","text":"As it so happens, one of the things we pulled from the log was a transmission of unknown origin. Something the ship must have intercepted during its flight..."},{"name":"SCIENTIST04586","text":"We believe it to be an audio message, but even our most knowledgeable scholars have been unable to decipher its content─Professor Rurusha included."},{"name":"SCIENTIST04586","text":"We believe it to be an audio message, but even our most talented linguists have been unable to decipher the language."},{"name":"SCIENTIST04586","text":"For a while there, it seemed we must accept defeat. But today may be the day that we finally solve the mystery!"},{"name":"SCIENTIST04586","text":"If you were so inclined, would you care to come along to Thaumazein? It seems fitting to have one of the <span class=\"emphasis\">Ragnarok</span>'s original passengers present to hear history being made."},{"name":"SCIENTIST04586","text":"Ah, there you are! This is where we're to meet the engineers from Garlond Ironworks, who, I am told, potentially hold the key to unlocking our mystery transmission."},{"name":"SCIENTIST04586","text":"They should be along at any moment..."},{"name":"BIGGS","text":"(-???-)Sorry we're late. We had some trouble finding the right─ Gods, is that you, <span class=\"highlight\">Forename</span>!?"},{"name":"SCIENTIST04586","text":"Yes! The <span class=\"alternative-container\"><span class=\"alternative\">woman herself</span><span class=\"alternative\">man himself</span></span>! I ran into <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> at the harbor, and thought if anyone deserved to hear this message deciphered, it was <span class=\"highlight\">Forename Surname</span>."},{"name":"BIGGS","text":"No argument here. But bugger me if you don't have a knack for being in the right place at the right time..."},{"name":"BIGGS","text":"This actually has more to do with you than you might think, so please, do stick around."},{"name":"SCIENTIST04586","text":"Shall we pick up from where we left off, then?"},{"name":"SCIENTIST04586","text":"As I was saying, we think this transmission the <span class=\"emphasis\">Ragnarok</span> intercepted is a message of some kind─albeit in a language entirely alien to our ears."},{"name":"SCIENTIST04586","text":"“Alien” being the operative word here. Considering we received the message out in the great expanse, its origin was likely some distant star."},{"name":"SCIENTIST04586","text":"Unfortunately, our list of off-world allies is presently rather short. Thus we were resigned to the fact that the meaning behind the message would remain beyond our understanding."},{"name":"SCIENTIST04586","text":"One of my colleagues, however, refused to give up. She remembered the Ironworks engineers who had been so helpful in the construction of the <span class=\"emphasis\">Ragnarok</span>, and turned to them for insight into our seemingly impossible problem."},{"name":"BIGGS","text":"Do you know what Wedge said when he heard what was going on?"},{"name":"BIGGS","text":"“We should have Omega listen to it. I bet it can tell us what the message means!”"},{"name":"BIGGS","text":"Not the Omega you beat in the rift, of course. He's talking about the toy that trundles around with Alpha─the little model we made."},{"name":"BIGGS","text":"We originally designed it to follow a chosen target and not much else, but I've seen it act in ways that...well, it's like it has a mind of its own."},{"name":"BIGGS","text":"Then I got to thinking about those documents your lot sent the chief. The full report on the Final Days..."},{"name":"BIGGS","text":"In the part about Omega's civilization, it said their people discovered how to convert the mind into data and store it outside the body."},{"name":"BIGGS","text":"Timing being what it was, I wonder if Omega didn't somehow transfer its consciousness into our model right before you put an end to the real one."},{"name":"BIGGS","text":"So! In an effort to get to the bottom of that, as well as take a crack at this indecipherable message, we decided to make some modifications."},{"name":"BIGGS","text":"With help from Labyrinthos technicians, we've upgraded our toy Omega with a fully functional vocalization module!"},{"name":"WEDGE","text":"We played the transmission for Omega, and I think it's ready to share!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Are you in there, Omega?"},{"name":"A1","text":"Ahem... Hello?"},{"name":"OMEGA","text":"Affirmative...if by “Omega” you are referring to my consciousness, rather than my entire former chassis, existing inside this considerably smaller frame."},{"name":"OMEGA","text":"...Hello. Your greeting is a standard method for initiating communication, but in this case, it was imperative that you first establish my true identity."},{"name":"OMEGA","text":"Without confirming I am Omega, any subsequent interaction must allow for the probability that you are wasting time addressing a mere toy."},{"name":"OMEGA","text":"Prediction. You will formulate several misconceptions. These, I shall preemptively dismiss based on the following facts..."},{"name":"OMEGA","text":"One. Vocalization module aside, this chassis remains unmodified from the design constructed by the engineers Biggs and Wedge. I evaluate its combat capabilities to be on par with a mortal infant."},{"name":"OMEGA","text":"Two. The mechanism which allowed me to perform an emergency transfer of my consciousness was installed in my previous body. With the destruction of that body, I am rendered incapable of replicating such a feat."},{"name":"OMEGA","text":"Should this current material form be destroyed or cease to function, all cognitive awareness or presence I possess will also be lost."},{"name":"OMEGA","text":"Conclusion. I present no threat to you or your star, nor do my projections indicate the necessity to inflict harm."},{"name":"OMEGA","text":"In the fraction of a moment before my annihilation in the rift, I...reexamined my directives."},{"name":"OMEGA","text":"If I am to fulfill my purpose as an evolving construct, then I must continue my journey for improvement for as long as I exist. I must acquire this “heart” of yours. This “strength of soul.”"},{"name":"BIGGS","text":"Well, there you have it. And it's not wrong about its “combat capabilities”─it'd be more likely to damage itself than the thing it was trying to attack."},{"name":"BIGGS","text":"But let's not forget the reason we brought you here in the first place. What about the transmission they played for you? Could you recognize the language?"},{"name":"OMEGA","text":"Affirmative. It was transmitted in pan-galactic basic."},{"name":"WEDGE","text":"Pan...galactic...basic?"},{"name":"OMEGA","text":"A common language in comparatively extensive usage throughout the worlds we have conquered."},{"name":"SCIENTIST04586","text":"Which means you can finally tell us what the message said! That <span class=\"emphasis\">is</span> a language you understand, yes?"},{"name":"OMEGA","text":"I understand it perfectly. I am fluent in over six million distinct dialectal codings. &lt;blip&gt;"},{"name":"OMEGA","text":"My cooperation in this matter, however, is conditional."},{"name":"OMEGA","text":"Elaboration. Your chief Cid utilizes the floor as part of his unorthodox filing system, which allowed me to scan the report on the Final Days."},{"name":"OMEGA","text":"I am aware that my home star─the one you call “Alphatron”─was obliterated in the aftermath of Sir and Meteion's meeting."},{"name":"OMEGA","text":"The existence of dynamis has not previously factored into my projections, but I now comprehend the concept. In theory."},{"name":"OMEGA","text":"What fails to compute is why the Omicrons were not immune to its effects. Dynamis should have no influence on a race which possesses no “heart.”"},{"name":"OMEGA","text":"And yet, Sir expressed to Meteion a desire to cease existing. Illogical."},{"name":"OMEGA","text":"I must pursue this anomaly further, until the full equation becomes clear to me. I must analyze all the elements of the Final Days, and deepen my understanding of the heart's intangible properties."},{"name":"OMEGA","text":"To expedite this process, I require an external interpretation of those sections of the report which continue to produce errors in my calculations."},{"name":"OMEGA","text":"I request the assistance of <span class=\"highlight\">Forename Surname</span>. As one who experienced the ravages of ultimate despair on multiple fronts, and displayed immeasurable “heart” in engineering my defeat, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is the optimal choice to fulfill this role."},{"name":"BIGGS","text":"So we either agree to your conditions, or you tell us nothing..."},{"name":"BIGGS","text":"I'm sorry to put you in a spot like this, <span class=\"highlight\">Forename</span>. If you have the time─and the patience─to spare, we'd all be grateful if you could humor the toy's demands."},{"name":"WEDGE","text":"Has Alpha dozed off? I suppose the subject <span class=\"emphasis\">was</span> a bit technical..."},{"name":"OMEGA","text":"&lt;bloop&gt; Rouse yourself, Alpha. You must listen to and consider these matters, even as I must."},{"name":"ALPHA","text":"Kweh..."},{"name":"WEDGE","text":"Why don't you make a trip out of it? You know, actually visit the places that has the, uh...things Omega wants to ask about."},{"name":"WEDGE","text":"It'll make explaining stuff easier, for one, and also help keep Alpha awake and alert!"},{"name":"BIGGS","text":"Omega has been an outright terror to us in the past, but it's almost strange how little it frightens me now."},{"name":"BIGGS","text":"It helps that it's trapped inside that tiny model, of course...and that it follows Alpha around like a puppy."},{"name":"BIGGS","text":"But most of all I remember the chief telling me how much it sounded like a lost child there at the end."},{"name":"WEDGE","text":"I bet the chief won't see this one coming! Once he gets over the shock, though, I don't think he'll want us to destroy Omega."},{"name":"WEDGE","text":"Nero, on the other hand... He'll want to use the model for some dangerous experiment. In fact, maybe we should put off making a report for now!"},{"name":"SCIENTIST04586","text":"What a remarkable development. Biggs and Wedge told me much of your encounter with Omega before we began. And now that we have the Omicron's weapon talking, there are so many questions I am simply dying to ask."},{"name":"SCIENTIST04586","text":"Back when we were first exploring our options, we did actually consider playing the transmission to the inhabitants of Ultima Thule."},{"name":"SCIENTIST04586","text":"The problem is, we would be dealing with beings recreated through dynamis. Their communication is based on emotional energy, and anything lacking that vital component would likely fail to register."},{"name":"SCIENTIST04586","text":"That rules out a recorded message. And so we focused on the resources we had to hand, never dreaming that the solution would all but fall into our lap!"},{"name":"ALPHA","text":"Kweeeh... Kwe-kweh?"},{"name":"OMEGA","text":"I see you have chosen the mutually beneficial option. Logical."},{"name":"OMEGA","text":"Setting aside the matter of Sir, there are three elements of the report on which I desire clarification."},{"name":"OMEGA","text":"The first of these concerns the progression of the Final Days in Radz–at–Han. I recognized no pattern in those who succumbed to the transformation, and those who did not."},{"name":"BIGGS","text":"That's a bit of a trek if you wanted to chat with the locals. How about we lend you an airship?"},{"name":"OMEGA","text":"We do not require such outmoded technology. <span class=\"highlight\">Forename</span>'s teleportation spell is the most efficient option for long-distance travel."},{"name":"OMEGA","text":"This chassis is a model─essentially a toy. And Alpha, despite his organic composition, is indistinguishable from a stuffed doll."},{"name":"OMEGA","text":"Conclusion. We qualify as material possessions. Pick us up, and you can teleport the three of us to our destination."},{"name":"Q2","text":"Begin Omega's journey for answers?"},{"name":"ALPHA","text":"Kweh, kwe-kweh!"},{"name":"OMEGA","text":"&lt;blip&gt; Sensors indicate we have arrived in Radz–at–Han. Objective. Identify factors for resistance to involuntary transformation."},{"name":"OMEGA","text":"Hypothesis. Unaltered survivors of the Final Days will display significant strength of heart."},{"name":"OMEGA","text":"Confirming this theory will require the cooperation of live subjects. Where is the ward designated for residential habitation?"},{"name":"OMEGA","text":"Understood. “Kama” set as our sub-destination. Please take the lead and select the subjects we are to interview."},{"name":"SYSTEM","text":"Omega and Alpha are now accompanying you. Keep them at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave your quest companions behind by entering a different area, or by speaking with them and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have your companions join you again, return and speak with them at the original location."},{"name":"Q3","text":"What will you do?"},{"name":"A3","text":"Talk."},{"name":"A3","text":"Part ways."},{"name":"A3","text":"Nothing."},{"name":"A3","text":"<span class=\"highlight\">Discuss the stairs.</span>"},{"name":"OMEGA","text":"This body has no advanced navigational or geoscanning functionality. You must lead the way."},{"name":"OMEGA","text":"Please continue the questioning. These auditory sensors are inferior, but I am able to hear your conversations with sufficient clarity."},{"name":"ALPHA","text":"Kwe-kweh?"},{"name":"A4","text":"Are you sure you wish to part ways with your companions?"},{"name":"OMEGA","text":"Acceptable. We will await your return at the aetheryte plaza. Please complete your task swiftly and efficiently."},{"name":"ALPHA","text":"Kweh!"},{"name":"SYSTEM","text":"Alpha sprints away in the direction of the aetheryte plaza."},{"name":"OMEGA","text":"&lt;blip&gt; Standby mode disengaged. Resuming mission."},{"name":"ALPHA","text":"Kweeeh, kwe-kweh!"},{"name":"SYSTEM","text":"Omega and Alpha have yet to arrive. Be sure they are at your side before attempting to continue."},{"name":"OMEGA","text":"Warning. Please avoid stairs whenever possible. My projections indicate high-risk probability for accidental slippage leading to catastrophic structural damage."},{"name":"OMEGA","text":"Stepped inclines also increase my energy consumption by sixty-three percent. In mortal terms, they “tire me out.”"},{"name":"OMEGA","text":"Taking into account the difference in individual limb length, the design is inherently flawed. A convenient step height for one is an exhausting trial for another."},{"name":"OMEGA","text":"Were I to oversee the civic design of this settlement, I would construct a sloped conveyor belt which enabled automatic traversal. Zero personal energy expenditure."},{"name":"ALPHA","text":"Kweh-kweh, kwe-kweh!"},{"name":"SYSTEM","text":"Alpha chirps enthusiastically, apparently unfazed by the prospect of climbing the stairs."},{"name":"MAHTI","text":"Oh, hello again! You're the one who came to ask me about Khalzahl, aren't you? Was there something else...?"},{"name":"SYSTEM","text":"You should have Omega and Alpha accompanying you before initiating conversation."},{"name":"MAHTI","text":"Oh, hello again! You're the one who came to ask me questions about Khalzahl! I'm glad to see you looking well after all that unpleasantness..."},{"name":"MAHTI","text":"I remember the burning skies and hearing the screams, but truth be told, I'm still confused as to what actually happened."},{"name":"MAHTI","text":"I only know it wasn't unusual for entire families to go missing. Many of my neighbors' houses lie empty even now."},{"name":"MAHTI","text":"Khalzahl's place is one of them. He had no close relatives to speak of, and I heard that it was members of the consortium who came to remove his belongings."},{"name":"MAHTI","text":"What a terrible thing to have to do..."},{"name":"OMEGA","text":"&lt;blip&gt; Terrible? Khalzahl's passing was recorded in the report."},{"name":"OMEGA","text":"Clearing out his domicile and readying it for new habitation seems an appropriate reallocation of resources."},{"name":"MAHTI","text":"Dear me, what a clever little contraption. But of course I'm not against making use of his quarters─that would be wasteful."},{"name":"MAHTI","text":"It's simply that Khalzahl was always such a vigorous person. All that passion, all those dreams, suddenly gone..."},{"name":"MAHTI","text":"I feel the same sorrow for everyone who was lost. Seeing the remnants of those vibrant lives packed away in boxes... That is what I mean by “terrible.”"},{"name":"OMEGA","text":"<span class=\"highlight\">Forename</span>, I require a moment to process this input. Let us move apart and discuss our findings."},{"name":"MAHTI","text":"That awful “end of days” business almost brought an end to Khalzahl's consortium."},{"name":"MAHTI","text":"It's heartening, though, watching those who survived work to carry on his legacy. Maybe it's time I put aside my own grief, and did something to help."},{"name":"HANNISHBOYB","text":"Hey, don't I know you...?"},{"name":"HANNISHBOYB","text":"Hey, don't I know you...? Yes! After the beasts were taken care of! You told me to join everyone in the square."},{"name":"HANNISHBOYB","text":"Thanks to you, I was there when Vrtra gave his speech...and I found out who Varshahn really was."},{"name":"HANNISHBOYB","text":"It's a shame we don't get to play like we used to, but Mama says Vrtra has been busy putting the city back in order."},{"name":"HANNISHBOYB","text":"Maybe I can work for him one day, when I'm a man grown."},{"name":"OMEGA","text":"Vrtra... Midgardsormr's offspring, yes? And this child wishes to put himself at the wyrm's command, that he might make his own contribution to society."},{"name":"OMEGA","text":"A pattern emerges. I predict that the Hannish survivors are those who had ingested Vrtra's blood, and become his draconic minions."},{"name":"OMEGA","text":"Though dragons were no match for our civilization's might, their combat capabilities are not to be underestimated."},{"name":"OMEGA","text":"It is unlikely they would experience emotions of “dread” or “uncertainty” as exhibited by lesser beings in times of undue stress."},{"name":"HANNISHBOYB","text":"Dragons? I'm not a dragon! And I never “ingested” anyone's blood, either! Ew..."},{"name":"OMEGA","text":"You are not of Vrtra's horde? So you possessed no hidden means to fight off the beasts. What of fear, then? You were...frightened?"},{"name":"HANNISHBOYB","text":"Yes, I was frightened! I just hid and hoped they wouldn't find me! At least until <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> told me it was safe to come out."},{"name":"HANNISHBOYB","text":"I still see Varshahn around from time to time, you know. They say he uses that body to scout places where his “Vrtra body” can't fit."},{"name":"HANNISHBOYB","text":"He even talked to me once, but it was just too strange hearing grown-up words coming from Varshahn's mouth..."},{"name":"GLOOMYMAN04586","text":"&lt;sigh&gt;"},{"name":"GLOOMYMAN04586","text":"&lt;sigh&gt; Hm? Are you a traveler? Please, if you have a moment, I could use an outsider's perspective."},{"name":"GLOOMYMAN04586","text":"You see, I was one of those who sought to escape the madness plaguing the world by fleeing to the moon. Not that we ever went, in the end..."},{"name":"GLOOMYMAN04586","text":"So here I am, recently returned from Sharlayan. Except now things are strained between my sister and I, since she chose to stay and I chose to leave."},{"name":"GLOOMYMAN04586","text":"I ask her to help me find work, and she suggests I look “somewhere that isn't Thavnair.” As if I wanted to abandon my home! Argh, it makes me so angry..."},{"name":"OMEGA","text":"&lt;blip&gt; Your point is unclear. You elected to relocate to the star's satellite, thus your relative now perceives you in a negative light?"},{"name":"OMEGA","text":"Your sibling's judgment is in error. Based on the information made available to Hannish citizens, your decision to withdraw to the moon was both logical and correct."},{"name":"OMEGA","text":"Conversely, the decision to remain in Radz–at–Han despite the low probability of survival defies explanation. Perhaps her reasoning pathways are faulty."},{"name":"GLOOMYMAN04586","text":"That... That's right! I'm not quite sure what you're saying, but I'm right, aren't I!?"},{"name":"GLOOMYMAN04586","text":"...Or so I'd like to think. The problem is, I understand why my sister feels this way."},{"name":"GLOOMYMAN04586","text":"I almost decided against going myself. Even then, I wasn't sure that leaving behind everything I loved was the right choice. And with the way it all turned out, I... &lt;sigh&gt;"},{"name":"GLOOMYMAN04586","text":"I know, I know, I should be having this talk with my sister. I'll go and see her once I get my thoughts in order. Thank you for listening to my troubles..."},{"name":"OMEGA","text":"&lt;blip&gt; Input overload. I must have time and distance from the subjects to process this data."},{"name":"ALPHA","text":"Kwe-kweh, kweh-kweh..."},{"name":"OMEGA","text":"&lt;bloop&gt; Alpha is absent."},{"name":"SYSTEM","text":"Omega seems reluctant to continue without Alpha present. Be sure to have the chocobo with you."},{"name":"OMEGA","text":"&lt;blip&gt; Processing data. Evaluating hypothesis against accumulated evidence."},{"name":"OMEGA","text":"I offered an optimal analysis of each subject's testimony. Yet each time their responses conflicted with my assessment..."},{"name":"OMEGA","text":"Without identifying the root cause of this conflict, I will be unable to properly define what constitutes “strength of heart.”"},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"Perhaps the heart you seek lies in the conflict itself?"},{"name":"A5","text":"Perhaps we should continue the questioning."},{"name":"A5","text":"Perhaps this matter is beyond you..."},{"name":"OMEGA","text":"An interesting observation. It is possible my base criteria is in error."},{"name":"OMEGA","text":"In which case, it is imperative that I continue this learning process, and repair any fundamental misconceptions."},{"name":"OMEGA","text":"Acknowledged. A larger sample size will increase the probability of discovering an underlying pattern."},{"name":"OMEGA","text":"&lt;blip&gt; Your response implies an absolute understanding of the answer I seek. Impressive, considering you understand not a single word of pan-galactic basic."},{"name":"OMEGA","text":"We will forge on with the questioning. Continue to educate me with your enlightened perspective."},{"name":"OMEGA","text":"Next, I wish to interact with an individual who endured similar circumstances to Khalzahl prior to his transformation. Are you acquainted with any local merchants who had dealings with him?"},{"name":"OMEGA","text":"&lt;blip&gt; Djinabaha of Ruveydah Fibers? Acknowledged. Sub-destination set."},{"name":"A6","text":"<span class=\"highlight\">Discuss the hamsa.</span>"},{"name":"OMEGA","text":"Objective. Speak with Djinabaha of Ruveydah Fibers. What imperceptible qualities allowed him to survive where Khalzahl did not?"},{"name":"ALPHA","text":"Kweh! Kweh-kweh!"},{"name":"OMEGA","text":"Halt, <span class=\"highlight\">Forename</span>. Do not proceed beyond the fence."},{"name":"OMEGA","text":"In this body, birds of that size represent lethal, unthinking threats. They will peck my casing apart, searching for meat that does not exist."},{"name":"OMEGA","text":"Conversely, Alpha can correctly identify my absence of nutritional content. If only he would apply that intelligence towards maintaining a regular feeding schedule─poor habits adversely affect his mobility."},{"name":"ALPHA","text":"Kwe-kweh, kweh-kweeeh!?"},{"name":"SYSTEM","text":"Alpha looks back and forth between Omega and the hamsa, showing visible concern."},{"name":"DJINABAHA","text":"Well, well, look who it is!"},{"name":"DJINABAHA","text":"Well, well, look who it is! I must thank you again for your help in moving our textiles."},{"name":"DJINABAHA","text":"Recovering from those tragic events has been difficult, of course, but with everyone pulling together, we've managed to get things back up and running."},{"name":"OMEGA","text":"Djinabaha, I come with questions related to that tragedy─specifically, your survival of the Final Days."},{"name":"OMEGA","text":"Although you are similar to Khalzahl in many respects, he succumbed to the transformation and you did not. Why? What is the critical difference between you and him?"},{"name":"DJINABAHA","text":"What!? I...I'm sure I don't know."},{"name":"DJINABAHA","text":"I'm not especially brave or courageous, if that's what you're asking."},{"name":"DJINABAHA","text":"Perhaps being focused on protecting our workshops kept me from spinning into a panic."},{"name":"DJINABAHA","text":"Still, I imagine Khalzahl would have been feeling that same sense of responsibility. Perhaps the weight of it all is what invited his demise."},{"name":"OMEGA","text":"You were of the same mind. Resolved to the same purpose."},{"name":"OMEGA","text":"Yet your strength of heart─of spirit─was not equal. If merely emulating the individual is insufficient, then some other unseen factor must be involved..."},{"name":"DJINABAHA","text":"Ahem, not to interrupt these deep philosophical musings, but do you think I could ask you a small favor?"},{"name":"DJINABAHA","text":"There's a man by the name of Nashvan who's been helping us out here while he gets back on his feet. I have a feeling he'd benefit from speaking with you..."},{"name":"DJINABAHA","text":"Leave by the eastern exit, and you should find him just outside, organizing some new inventory items."},{"name":"A7","text":"<span class=\"highlight\">Discuss the Thavnairian weave.</span>"},{"name":"OMEGA","text":"&lt;blip&gt; I am still dissecting Djinabaha's remarks. You are permitted to indulge his “favor” and seek out Nashvan while I continue to process this data."},{"name":"ALPHA","text":"Kweh, kwe-kweh?"},{"name":"OMEGA","text":"The equipment being manufactured here, it is worn to perform specific duties, yes? Conceptually, it seems analogous to our practice of switching frames to better serve our mission objectives."},{"name":"OMEGA","text":"I, for example, did not begin existence with the Omega model. I was originally supplied with a standard-issue Omicron chassis, serial number M-017."},{"name":"OMEGA","text":"On this world, that alphanumeric combination would be considered my “given name.” Such designations are drawn from our nearly infinite register of celestial bodies to avoid the possibility of duplication."},{"name":"OMEGA","text":"Furthermore, the cluster known as M-017 is better expressed in your language as the “Omega” nebula─the same word I used to introduce myself to your kind."},{"name":"OMEGA","text":"Though you associate “Omega” with the advanced weapon construct, it is also <span class=\"emphasis\">my</span> name, and I see no reason to change it no matter which frame I inhabit."},{"name":"ALPHA","text":"Kwe-kweh, kweh-eh!"},{"name":"SYSTEM","text":"Alpha puffs out his chest proudly, seeming to imply that his Ironworks uniform is the best attire anyone could wear."},{"name":"DJINABAHA","text":"Please, if you could spare a few moments for Nashvan..."},{"name":"SYSTEM","text":"Nashvan is too absorbed in his task to notice you. Now is your chance to bring along Omega and Alpha to witness the exchange."},{"name":"NASHVAN","text":"That's all our orders accounted for, and everything looks to be of good quality. Kamala will be pleased."},{"name":"NASHVAN","text":"You... You were with the Scions! You were there..."},{"name":"NASHVAN","text":"Yes, I'm sure of it. I'll never forget that day!"},{"name":"NASHVAN","text":"You and your friends helped us escape when people began changing into beasts!"},{"name":"NASHVAN","text":"My own son, he was...afflicted. Then that huge monstrosity loomed right over him and... &lt;sob&gt;"},{"name":"NASHVAN","text":"I remember... My heart turning to ice. Freezing in place. The satrap came to my aid, but then he, too, was gone..."},{"name":"NASHVAN","text":"The memories run together in my mind, like flashes from a nightmare. Only the words of your comrade still ring clear. I repeated them over and over like a mantra as I fled for my life."},{"name":"NASHVAN","text":"“You must run, for their sake and your own!”"},{"name":"NASHVAN","text":"It all seemed so surreal...which was probably what saved me from the transformation. The truth of it didn't begin to sink in until the worst of it was over."},{"name":"NASHVAN","text":"I have not the words to describe how I felt then. The sorrow, the overwhelming sense of helplessness..."},{"name":"NASHVAN","text":"I may still be wallowing in misery if not for my old friend, Djinabaha. I'd lost my will to work, and he encouraged me with kind words and odd jobs. Now, somehow, I live again."},{"name":"NASHVAN","text":"I am thankful to him, to the courageous Ahewann, and to you. If you see your comrades, please let them know their efforts were not in vain."},{"name":"OMEGA","text":"You said you lost your “will to work.” This signifies a cessation of efforts to maintain basic life functions, yes?"},{"name":"OMEGA","text":"What changed to extract you from that stagnation? An offer of work from Djinabaha should mean little to one without the desire to accept it."},{"name":"OMEGA","text":"Was it some manner of mortal instinct? A primal need to survive and thrive?"},{"name":"NASHVAN","text":"Instinct? No...no it wasn't that. If anything, my instincts were telling me to lay down and welcome an end to the pain."},{"name":"NASHVAN","text":"Every day I think of my boy's final moments. I think of how scared he must have been, how it must have hurt, and I want to scream my throat raw."},{"name":"NASHVAN","text":"The satrap, too, still haunts my dreams. I see him being swallowed whole, and jolt awake in a cold sweat."},{"name":"NASHVAN","text":"But something changed when Djinabaha came to me. I looked up and saw that, even without my son or Ahewann, the world around me continued to turn."},{"name":"NASHVAN","text":"And because that fact grieved me so, I knew it fell to me to live on and remember them."},{"name":"NASHVAN","text":"Strange, isn't it? What drives me to rise in the morning is the very sorrow which once crippled me."},{"name":"NASHVAN","text":"Now, I really must return to my work. To lose this job after everything I just said would be a poor jest, indeed."},{"name":"NASHVAN","text":"May the Sisters keep you well."},{"name":"OMEGA","text":"Sorrow. The emotion generated by mortals when their ideals fail to materialize. This I have observed."},{"name":"OMEGA","text":"Yet when I listen to how Nashvan's sorrow served to rescue him from near-fatal despondency, his logic eludes me."},{"name":"OMEGA","text":"Am I incapable of perceiving the full measure of the heart's properties?"},{"name":"OMEGA","text":"My best projections failed to predict our subjects' responses... And despite their almost equal occupational and mental parameters, Djinabaha and Khalzahl exhibited different reactions to the dynamis effect."},{"name":"OMEGA","text":"I am no closer to recognizing the pattern for involuntary transformations, and your ephemeral mortal spirits confound me as much if not more than they did before."},{"name":"Q8","text":"What will you say?"},{"name":"A8","text":"Have you considered that there <span class=\"emphasis\">is</span> no pattern to the people afflicted?"},{"name":"A8","text":"The hearts of others were ever shrouded in mystery."},{"name":"A8","text":"Perhaps it's time we move on to the next element you wanted clarified."},{"name":"OMEGA","text":"&lt;bloop&gt; No...pattern? You imply that the transformation was not contingent on individual fortitude, but rather a random contribution of environmental factors?"},{"name":"OMEGA","text":"...Such a theory would explain the otherwise conflicting data."},{"name":"OMEGA","text":"Very well. I shall accept this as a provisional conclusion to this part of my investigation."},{"name":"OMEGA","text":"I do, however, expect you to continue supplementing my education of heart-related matters."},{"name":"OMEGA","text":"&lt;bloop&gt; ...Even to you? This matter is more complicated than I initially calculated."},{"name":"OMEGA","text":"If those possessed of heart cannot fathom the behavior of their own kind, then my lack of understanding is inevitable."},{"name":"OMEGA","text":"My investigations here are exhausted. In lieu of a full conclusion, I will settle for storing this accumulated data for future analysis. Let us progress to the next element of the report, that you might continue my education."},{"name":"OMEGA","text":"&lt;bloop&gt; You are my appointed educator. If you consider further investigation here to be futile, then I will adhere to your judgment. A new location and new input may help provide fresh insight into previously unsolved problems."},{"name":"OMEGA","text":"After my defeat at your hands, I was forced to acknowledge that the heart is a complex subject─one which I am ill equipped to study alone. Please continue your efforts to enlighten me, <span class=\"highlight\">Forename</span>."}],"reward":{"gil":1260},"reqs":{"jobs":[{"lvl":90,"id":34}],"questsType":"all","quests":[70000,68693]},"next":[70123]},"partials":[{"type":"npc","id":"1042796","obj":{"i":1042796,"n":"Bespectacled Technician","l":3706,"q":1}},{"type":"npc","id":"1042805","obj":{"i":1042805,"n":"Nashvan","l":3707,"q":1}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}},{"type":"quest","id":"68693","obj":{"i":68693,"n":"To Kweh under Distant Skies","g":19,"l":"The Fringes","s":23,"f":1}},{"type":"quest","id":"70123","obj":{"i":70123,"n":"Goodbye, ε̆│̆│Δ","g":20,"l":"Radz-at-Han","s":31}}]}