{"quest":{"name":"A Prickly Plaint","location":"Ul'dah","id":70120,"patch":6.1,"sort":201,"icon":101164,"eventIcon":71221,"issuer":1042834,"target":1043121,"genre":200,"journal":["Ollier is in dire need of an adventurer's assistance.<br>※This quest is available for a limited time only.","Ollier and his fellow attendants have been hard at work spreading the word across the realm of all the Gold Saucer has to offer, but it seems there is a rub─one of his colleagues has lost his confidence entirely, and the man refuses to admit that there is a problem. Ollier would have you inquire with the poor man as an impartial third party, and begs that you accompany him to Limsa Lominsa, where the individual in question is currently on assignment.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Speaking to Ollier upon your arrival in Limsa Lominsa, you learn that the dispirited colleague of whom he spoke is none other than Senor Sabotender─the Gold Saucer's star mascot and mood-maker. Whatever could be responsible for his uncharacteristic lack of motivation? All you can do is speak to the succulent staff member and inquire for yourself.","You inquire with Senor Sabotender in hopes of gleaning the reason behind his recent malaise, but receive only a knowing gaze and beckoning arm in response. It would appear the Gold Saucer's mascot would prefer to discuss the matter out of the earshot of any potential eavesdroppers.","As you survey your surroundings in search of Senor Sabotender, you are greeted instead by one Nanaphon─the young thespian inside the succulent green suit. The lad explains that while he has traveled with his colleagues here to Limsa in hopes of spreading the word about the Gold Saucer, he has found himself unable to sufficiently express the full extent of its wonders, as he has been sworn to a vow of silence so as to conceal Senor Sabotender's true identity. He rejoices when you offer to be his voice, and promises to share his finely honed sales pitch that you may contribute to the promotional effort.","Fully enlightened by Nanaphon as to all the Saucer has to offer, you are now prepared to share the joy of Eorzea's foremost entertainment destination with the denizens of the city. You stride towards the Aftcastle ready to join Senor Sabotenor in your effort to reel in a host of new paying customers.","At the Aftcastle, you are rejoined by Nanaphon, who once again has donned his Senor Sabotender suit and sealed his lips tight. Exchanging a determined glance with your succulent friend, you prepare to go forth into the city and give the sales pitch of your life.","Through your earnest efforts, the residents of Limsa Lominsa now are well versed in the vast array of wonders that await them at the Manderville Gold Saucer. You prepare to reconvene with Senor Sabotender, in the hopes that your spiny companion is satisfied with your achievements.","Though he speaks not a word, Senor Sabotender's intent gaze makes it clear that he is deeply appreciative of all you have done to help make his mission a success. Ollier, as well, arrives on the scene, announcing that all staff have been summoned back to the Saucer at once. Your work in Limsa Lominsa done, you are free to join them in the return voyage.","Back at the Saucer, Ollier expresses his profound gratitude for having won over a plethora of new patrons for the establishment─some of whom it would seem have already made the trip. Senor Sabotender, for his part, welcomes the new guests in his inimitable style. Accepting a small token of thanks from the Saucer staff, you take your leave, satisfied that you have done right by your friends─smooth-skinned and prickly alike."],"objectives":["Speak with Ollier in Limsa Lominsa.","Speak with Senor Sabotender.","Seek out Senor Sabotender at the designated location.","Speak with Nanaphon.","Wait for Senor Sabotender at the designated location.","Spread word of the Gold Saucer on the Upper Decks.","Spread word of the Gold Saucer on the Lower Decks.","Speak with Senor Sabotender.","Speak with Ollier at the Gold Saucer."],"dialogue":[{"name":"OLLIER","text":"Wait...I know you! You're the case-cracking adventurer who came to our aid in the past! It's me, Ollier! Gold Saucer attendant and de facto investigator, at your service."},{"name":"OLLIER","text":"...Though truth be told, it's your services that we really need─if you can spare the time, that is. What do you say?"},{"name":"OLLIER","text":"Pardon me, my good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. My name is Ollier, and I am employed as an attendant at the Manderville Gold Saucer. Could I perhaps trouble you for a moment of your time?"},{"name":"OLLIER","text":"Truth be told, we are in desperate need of a capable adventurer to assist us in a task of the utmost import. Might you perchance be willing to offer your aid?"},{"name":"OLLIER","text":"As you may have realized, we are currently in the midst of the Make It Rain Campaign, a yearly festival during which we hold a number of exclusive, limited-time events."},{"name":"OLLIER","text":"Though you may be surprised to hear it, there are still those who have yet to experience all the wonders the Saucer has to offer. Thus have we─the staff of the Saucer─decided to take our show into town and spread the word."},{"name":"OLLIER","text":"However, there has been one troubling development. Ever since we began this little campaign, one of my colleagues has been visibly out of sorts. Normally, he's the most cheerful of all of us, so let it suffice to say that we're deeply concerned."},{"name":"OLLIER","text":"My colleagues and I have tried to look into the matter ourselves, but I fear the man is too proud for his own good, and refuses to admit anything is the matter. And so, I thought, perhaps an accomplished sleuth like yourself might succeed where we have failed. So...what do you say?"},{"name":"OLLIER","text":"My colleagues and I have tried to look into the matter ourselves, but I fear the man is too proud for his own good, and refuses to admit anything is the matter. And so, I thought, perhaps an experienced adventurer like yourself might succeed where we have failed. So...what do you say?"},{"name":"OLLIER","text":"Thank you, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! Your generous offer is most appreciated."},{"name":"OLLIER","text":"The man in question is currently on assignment in Limsa Lominsa. I will be heading there myself shortly after this─let us rendezvous by the Aftcastle as soon as you are able."},{"name":"OLLIER","text":"...Oh, but I've gotten ahead of myself. If you've yet to visit the Gold Saucer, you'll be needing a ticket for admission. In that case, I recommend you try speaking with that young man over there. He's been gloating endlessly of his winnings, and seems to be in the mood to share his good fortune."},{"name":"SYSTEM","text":"In order to continue this quest, you must first complete the quest “It Could Happen to You,” which can be undertaken at level 15."},{"name":"OLLIER","text":"Ah, there you are!"},{"name":"OLLIER","text":"Majestic, isn't it? Of all the displays we painstakingly erected, this may be one that best showcases the Saucer's myriad refined delights."},{"name":"OLLIER","text":"As for the fellow I mentioned... Ah, that's him right over there."},{"name":"GUESTA04584","text":"It keeps spinning in circles... Do you think it's quite all right?"},{"name":"GUESTB04584","text":"All I know is it's making me dizzy just looking at it. Hey, you! Can't you do anything else!?"},{"name":"GUESTA04584","text":"Look, you've angered it! Or perhaps that was some manner of impromptu dance performance..."},{"name":"GUESTB04584","text":"In any case, I can't say that I'm terribly keen to see what it does next. Not when we have a table waiting for us at the Bismarck!"},{"name":"GUESTB04584","text":"So long, spiny whatever-you-are."},{"name":"SYSTEM","text":"The bystanders having departed, Senor Sabotender slumps his shoulders in visible dismay."},{"name":"OLLIER","text":"He's been like this ever since he got here. What say you? Will you speak with Senor Sabotender for me and see if you can ascertain what ails him?"},{"name":"OLLIER","text":"I'd give anything to see Senor Sabotender in his usual high spirits again..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Are you feeling all right?"},{"name":"A1","text":"How goes the campaign?"},{"name":"A1","text":"Give me a spin, will you?"},{"name":"SYSTEM","text":"Senor Sabotender strikes a pose, but speaks no words. It's unclear if your message reached him..."},{"name":"SYSTEM","text":"Senor Sabotender rushed off to the west. Perhaps he wishes to speak with you in a more secluded location?"},{"name":"NANAPHON","text":"(-???-)My apologies for dragging you all the way over here."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Um...who are you?"},{"name":"A2","text":"Nanaphon! Why the long face?"},{"name":"A2","text":"Senor Sabotender isn't a real sabotender!?"},{"name":"NANAPHON","text":"Oh, but of course! The name's Nanaphon. I play the role of Senor Sabotender─the Gold Saucer's beloved mascot. At least, I <span class=\"emphasis\">thought</span> he was beloved..."},{"name":"NANAPHON","text":"Have you forgotten so soon, <span class=\"highlight\">Forename</span>? It's me, Nanaphon! I play the role of Senor Sabotender─the Gold Saucer's beloved mascot. At least, I <span class=\"emphasis\">thought</span> he was beloved..."},{"name":"NANAPHON","text":"Ah, <span class=\"highlight\">Forename</span>. So you noticed? As an actor, you think I'd be better at concealing my emotions..."},{"name":"NANAPHON","text":"Surely you jest? Everyone knows it's a Lalafell in a costume. The name's Nanaphon, and I happen to be that Lalafell."},{"name":"NANAPHON","text":"Trying to lift my spirits with a jest, are you? I appreciate the sentiment, but I fear I'm not really in the mood..."},{"name":"NANAPHON","text":"You saw that just now, didn't you? I did my damnedest to convey the sheer splendor of the Gold Saucer with my usual grandiose gestures, but my audience was clearly unimpressed."},{"name":"NANAPHON","text":"Alas, my gyrations and undulations are merely perplexing poses without the spectacles of the Saucer itself! Would that I could explain in my own words all that they are missing out on!"},{"name":"NANAPHON","text":"Why don't I, then? Is it not obvious? Because we don't want to reveal to future patrons that Senor Sabotender isn't a real sabotender! ...Not until we've secured their patronage, at the very least."},{"name":"NANAPHON","text":"Whilst donning my costume, I am forbidden from uttering even a single word!"},{"name":"NANAPHON","text":"Such is my plight, you see..."},{"name":"NANAPHON","text":"At this rate, I will be forced to depart this place having succeeded at nothing but causing quizzical looks and utter confusion. I simply want to join my colleagues in spreading word of the Saucer's splendors across the realm!"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"I could explain it for you."},{"name":"A3","text":"...And that's where I come in! Somehow."},{"name":"NANAPHON","text":"What's this? You'd be willing to assist us in our cause!?"},{"name":"NANAPHON","text":"What a kind and generous soul you have, my adventuring friend! Why, your sheer magnanimity brings a tear to my eye..."},{"name":"NANAPHON","text":"...More than a few tears, even. But what am I doing here crying? I must prepare to welcome you to our little troupe. Pray let me know whenever you are ready!"},{"name":"NANAPHON","text":"Ready for your first task? Excellent. Before that, however, allow me to give you an overview of our promotional campaign."},{"name":"NANAPHON","text":"We began with a survey asking for people's impressions of the Gold Saucer. Reviewing the responses, we noted that the vast majority of patrons cited the attractions as one of the venue's main selling points."},{"name":"NANAPHON","text":"While it is true that our attractions are a highlight, there is─as you are well aware─so much more to the Saucer! So we got to thinking about how best to go about informing the world of our lesser-known delights."},{"name":"NANAPHON","text":"I came up with four main features of the Saucer that I hope to promote to people. Which shall I explain first?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"The allure of the Cactpot!"},{"name":"A4","text":"How easy it is to get there!"},{"name":"A4","text":"The Saucer's best-kept secret!"},{"name":"A4","text":"The lavish costumes of the staff!"},{"name":"A4","text":"Nothing."},{"name":"NANAPHON","text":"Ah, indeed! Whether it's the Mini Cactpot─which casual players can enjoy as many as three times a day─or the lucrative Jumbo Cactpot─available once per week─both offer Gold Saucer patrons a chance to test their luck and reap lavish prizes!"},{"name":"NANAPHON","text":"Easy to enter and with incredible fortunes for the taking, the Mini and Jumbo Cactpots are among the most popular ways to rack up MGP─which can then be exchanged for a host of alluring prizes. Dream big and enter the Cactpot today─only at the Manderville Gold Saucer!"},{"name":"NANAPHON","text":"Tell me about it! Though the Saucer may seem far away to many─being located at the edge of the Sagolii Desert─did you know that airship passage is available entirely free of charge from all of Eorzea's major cities?"},{"name":"NANAPHON","text":"And though the wonders that await you in the Saucer's halls are the main attraction, I'll have you know that the journey via airship is a singular delight in its own right. So why not invite that special someone to soar through the skies on the way to the realm's premiere leisure destination? The Manderville Gold Saucer─only a coin's toss away!"},{"name":"NANAPHON","text":"Oho! Clearly I stand before a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of discerning taste. While the Saucer offers no end of games and attractions, refined patrons such as yourself are known to enjoy slipping away to our full-service bar for a refreshing libation or two."},{"name":"NANAPHON","text":"That's right! We've assembled the realm's best barkeeps to prepare a plethora of potables sure to wet your whistle and put you in the mood to marvel at the Saucer's many wonders. Do be sure to stop by!"},{"name":"NANAPHON","text":"Ah─a keen eye for fashion, I see. Then you're sure to appreciate the unique costumes and couture worn by our staff─a wardrobe prepared by the sultanate's most esteemed tailors to meet the demanding aesthetic sensibilities of our owner, the incomparable Godbert Manderville."},{"name":"NANAPHON","text":"Be sure to bring something to cover your eyes─the sheer gorgeousness of these ornate outfits is likely to blind you if you do not! Yes, that's right─the Manderville Gold Saucer is a veritable gallery of the most glamorous garb our civilization has ever seen!"},{"name":"NANAPHON","text":"...Well? How did that sound? I daresay I've done a remarkable job of distilling the essence of the Saucer's appeal into concise verbiage. Simply remember all of that verbatim, and you'll be ready to help us spread the word of the Saucer wherever you go."},{"name":"NANAPHON","text":"And with that, I do believe it's time for us to get this show on the road. Allow me to see to my preparations, and we can convene at the Aftcastle when we both are ready. Good? Good."},{"name":"SYSTEM","text":"You can feel Nanaphon's intense gaze upon you from within the Senor Sabotender costume."},{"name":"SYSTEM","text":"You are filled with determination to share the wonders of the Gold Saucer with the residents of Limsa Lominsa alongside your succulent companion."},{"name":"LYNGSATH","text":"What 'ave we got 'ere? Yer a fair share...<span class=\"emphasis\">pricklier</span> than the folks what usually show up 'ere at the Bismarck."},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"This is Senor Sabotender!"},{"name":"A5","text":"This is the realm-renowned mascot of the Manderville Gold Saucer!"},{"name":"LYNGSATH","text":"The what now? Ah, yer from that eyesore in the desert. Never been there meself─'fraid I'm much too busy fer them silly games. New dishes don't think 'emselves up!"},{"name":"SYSTEM","text":"It's time to put what you've learned to use and spread the word about the wonders about the Saucer. Succeed in drawing the interest of influential Lominsans, and Nanaphon will surely be heartened."},{"name":"Q6","text":"What will you say?"},{"name":"A6","text":"But it's the perfect place to bring that special someone!"},{"name":"A6","text":"But haven't you dreamed of winning a fortune in the Cactpot!?"},{"name":"A6","text":"But you could partake in libations to delight even the most discerning epicure!"},{"name":"LYNGSATH","text":"Bah! No culinarian worth their salt has the time for that sort o' distraction. I suggest ye try yer luck elsewhere."},{"name":"SYSTEM","text":"Your sales pitch seems to have missed its mark. Perhaps a different approach might be more effective?"},{"name":"LYNGSATH","text":"Ye don't say? Hmm... Me inspiration could do with some refreshin'..."},{"name":"LYNGSATH","text":"Aye, I'll pay this Saucer o' yours a visit...jus' as soon as I know me apprentices won't burn this place down in the meanwhile."},{"name":"RHOSWEN","text":"The 'ells ye want, drylander? State yer business quick, an' ye'd best hope it's worth me while!"},{"name":"RHOSWEN","text":"The Gold <span class=\"emphasis\">bloody</span> Saucer!? Why would any pirate in 'er right mind set foot in that twinklin' hellhole!?"},{"name":"Q7","text":"What will you say?"},{"name":"A7","text":"Haven't you dreamed of winning a fortune in the Cactpot!?"},{"name":"A7","text":"It's the perfect place to bring that special someone!"},{"name":"A7","text":"Don't you want to feast your eyes on the realm's most gorgeous garb!?"},{"name":"RHOSWEN","text":"Let me tell ye plain: no! I don't bloody care. Now get out afore I gut ye an' send ye to sleep with the fishes."},{"name":"SYSTEM","text":"Your sales pitch seems to have missed its mark. Perhaps a different approach might be more effective?"},{"name":"RHOSWEN","text":"<span class=\"emphasis\">Special someone</span>? An' just who in the hells would that be!?"},{"name":"Q8","text":"What will you say?"},{"name":"A8","text":"Perhaps your crew could use a respite?"},{"name":"A8","text":"A certain pirate captain might appreciate the gesture."},{"name":"RHOSWEN","text":"Me <span class=\"emphasis\">crew</span>!? That's yer big idea? Then again...me girls what've retired from active duty could always use a break from tendin' to their little ones. I'd wager an excursion would do 'em well."},{"name":"RHOSWEN","text":"<span class=\"emphasis\">Who</span> now!?"},{"name":"RHOSWEN","text":"If yer implyin' what I think ye are, I'd sooner keelhaul meself than spend one instant with than lyin' whoreson! Aye, ye'd not catch me dead goin' to yer stinkin' Gold Saucer with─bah! Just bugger off, already!"},{"name":"WAWALAGO","text":"Here 'chovy, 'chov─ye gods! You're no 'chovy."},{"name":"WAWALAGO","text":"Nay─from crayfish to catfish, goby to gudgeon, I've seen my share of sea creatures...but there's not a puffer in these parts so pointy as you."},{"name":"Q9","text":"What will you say?"},{"name":"A9","text":"If it is spectacular spines you seek, none are senior to Senor Sabotender!"},{"name":"A9","text":"And he makes a <span class=\"emphasis\">marvelous</span> Manderville mascot!"},{"name":"WAWALAGO","text":"You're one suave sabotender, certainly. So much so, I suspect you sailed in from the Gold Saucer..."},{"name":"WAWALAGO","text":"But I'm sorry to say that salt-of-the-sea types like yours truly aren't suited to sordid gil-seeking. Simpler pleasures are my preference."},{"name":"Q10","text":"What will you say?"},{"name":"A10","text":"But you could partake in libations to delight even the most discerning epicure!"},{"name":"A10","text":"But haven't you dreamed of winning a fortune in the Cactpot!?"},{"name":"A10","text":"But don't you want to feast your eyes on the realm's most gorgeous garb!?"},{"name":"WAWALAGO","text":"Can't say I care much for such flights of fancy, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. If you're looking for someone to bite that bait, you'd be better off speaking with Sisipu."},{"name":"SYSTEM","text":"Your sales pitch seems to have missed its mark. Perhaps a different approach might be more effective?"},{"name":"WAWALAGO","text":"What's this you say? Can I assume that this gorgeous garb adorns the figures of lasses both buxom and bonny?"},{"name":"WAWALAGO","text":"Well, why didn't you say so sooner!? I'll net the next airship to this Saucer of yours. Still, we should keep this between you, me, and the sabotender─let Sisipu assume I'm off on an extended angling excursion."},{"name":"KYOKYOROON","text":"Kyokyoroon welcomes well-come customer! Customer, be welcome!"},{"name":"KYOKYOROON","text":"Not customer? Not come with custom?"},{"name":"KYOKYOROON","text":"Sparklies? Kyokyoroon love sparklies! Kyokyoroon can find sparklies at this Gold Saucer?"},{"name":"Q11","text":"What will you say?"},{"name":"A11","text":"You could learn how to dazzle and delight your customers!"},{"name":"A11","text":"You could hit the Cactpot and become a gillionaire!"},{"name":"A11","text":"You could drink the tastiest libations in the realm!"},{"name":"KYOKYOROON","text":"Kyokyoroon puzzled by puzzling customer. Kyokyoroon not so interested now... Kyokyoroon busy with business. Too busy for bafflement."},{"name":"SYSTEM","text":"Your sales pitch seems to have missed its mark. Perhaps a different approach might be more effective?"},{"name":"KYOKYOROON","text":"Sparklies! Lots of sparklies! Kyokyoroon love sparklies more than customer. Kyokyoroon go to Gold Saucer straightway. Come back with many sparklies!"},{"name":"SYSTEM","text":"You have done your best to spread word of the Gold Saucer among the residents of Limsa. All that is left is to reconvene with the staff by the Aftcastle and hope that your efforts bear fruit."},{"name":"LYNGSATH","text":"Aye, I reckon a fancy new cocktail or two might be a fittin' addition to the Bismarck's menu! I'll be makin' the trip to the Gold Saucer soon as I'm able."},{"name":"RHOSWEN","text":"Hmph. I suppose this Saucer place <span class=\"emphasis\">might</span> make for an amusin' jaunt sometime..."},{"name":"WAWALAGO","text":"I'm off to the Gold Saucer to see the sights! If Sisipu mentions me, mum's the word."},{"name":"KYOKYOROON","text":"Kyokyoroon love sparklies! Saucer has many sparklies? Kyokyoroon go look for sparklies at Saucer straightaway!"},{"name":"SYSTEM","text":"You cannot help but feel that the crowd is sparser than it was just before."},{"name":"OLLIER","text":"Senor Sabotender! There you are!"},{"name":"OLLIER","text":"I have urgent orders from our superiors. All staff are to conclude their missions and make preparations to return to the Saucer posthaste!"},{"name":"SYSTEM","text":"You can feel Senor Sabotender's piercing gaze upon you. It would seem that he strongly wishes you to return to the Saucer with him."},{"name":"OLLIER","text":"I take it you'll be coming back as well? If so, pray come to the landing as soon as you're able."},{"name":"SYSTEM","text":"In order to continue this quest, you must first complete the quest “It Could Happen to You,” which can be undertaken at level 15."},{"name":"SYSTEM","text":"Senor Sabotender says nothing, but gazes earnestly in your eyes. You get the distinct sense he is counting on your aid."},{"name":"LYNGSATH","text":"So, where can a man get 'imself one o' those drinks that they're sayin' are the talk o' the realm?"},{"name":"STAFFA04584","text":"Ah! Clearly, you are an individual of discerning tastes. Right this way, my good sir..."},{"name":"OLLIER","text":"As you can see, business is booming. I'm pleased to say that we've even welcomed quite a few new guests from Limsa Lominsa."},{"name":"OLLIER","text":"Clearly, the efforts of my colleagues have paid off in more ways than one─and they could not have done it without you. Master Roland will doubtless be thrilled."},{"name":"OLLIER","text":"Would that we could continue our promotion efforts afield for a while longer... But I fear that we need every able-bodied attendant here at home to deal with the ever-burgeoning crowds."},{"name":"OLLIER","text":"That's your cue, Senor Sabotender! Let's give our guests a warm welcome─Gold Saucer-style!"},{"name":"OLLIER","text":"In any event, I thank you. Not only have you helped us to expand our clientele, but─as you can see with your own eyes─Senor Sabotender is back to his typical energetic self."},{"name":"OLLIER","text":"As his colleague and his friend, I cannot begin to express my gratitude."},{"name":"OLLIER","text":"I can, however, offer you this as a small token of our thanks. Till our paths cross again, may fortune smile upon you at the Saucer!"}],"reward":{"items":[{"id":36922}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[66043,66064]}},"partials":[{"type":"npc","id":"1042834","obj":{"i":1042834,"n":"Ollier","l":40,"q":1}},{"type":"npc","id":"1043121","obj":{"i":1043121,"n":"Ollier","l":1484,"q":1}},{"type":"item","id":"36922","obj":{"i":36922,"n":"Ballroom Etiquette - Soliciting Applause","l":1,"c":26435,"t":85}},{"type":"quest","id":"66043","obj":{"i":66043,"n":"The Gridanian Envoy","g":1,"l":"Gridania","s":86}},{"type":"quest","id":"66064","obj":{"i":66064,"n":"The Ul'dahn Envoy","g":1,"l":"Ul'dah","s":88}}]}