{"quest":{"name":"The Steps of Faith","location":"Coerthas Central Highlands","id":70127,"patch":6.2,"sort":91,"icon":100372,"eventIcon":71201,"issuer":1006454,"target":1010897,"genre":2,"journal":["Ser Marcelain wishes to prepare you for the siege of Ishgard.","Ser Marcelain explains that the damage Iceheart inflicted on Ishgard's arcane barrier has allowed the dragons to land directly upon the Steps of Faith─the bridge which spans the Sea of Clouds between the Gates of Judgement and the city proper. You are to take up position on the Steps of Faith, and aid the Temple Knights in defending the vital structure against the Dravanian Horde.","You have succeeded in driving the Dravanian Horde from the Steps of Faith. Return in triumph to the Gates of Judgement.","As the remnants of the Dravanian Horde take to the skies in disarray, Ishgard's weary defenders breathe a sigh of relief. The siege is ended. Speak with Alphinaud at the Gates of Judgement and find out how your allies fared in the battle at the Steel Vigil.","Moments after greeting Alphinaud, you are joined by a grateful Ser Aymeric, who humbly thanks you for your service. When the lord commander subsequently takes his leave, Alphinaud triumphantly declares that the stage has been set for Ishgard's return to the Eorzean Alliance. Make your way back to Revenant's Toll, and report your success to Minfilia.","Minfilia greets your return with a mixture of triumph and relief. Having snuffed out the Dravanian threat, it is time to enjoy a well-earned rest."],"objectives":["Speak with Marcelain.","Speak with Alphinaud at the Gates of Judgement.","Speak with Minfilia at the Rising Stones."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"MARCELAIN","text":"Ere you commit yourself to the siege, you should know what it is you are tasked with defending. Beyond the Gates of Judgement lie the Steps of Faith─a great bridge of stone that leads directly to the city of Ishgard."},{"name":"MARCELAIN","text":"More than simply a means to cross the Sea of Clouds, the bridge serves as a foundation for the arcane wards that form the barrier we call Daniffen's Collar."},{"name":"MARCELAIN","text":"Alas, in dispelling the barrier's outermost layer, that thrice-damned witch Iceheart stripped the bridge of its protection, and thus are the dragons now able to land unhindered upon the Steps of Faith."},{"name":"MARCELAIN","text":"Should the Dravanians succeed in destroying the remainder of the wards, the winged devils will be free to swarm within the city itself."},{"name":"MARCELAIN","text":"Needless to say, we cannot suffer that to happen. It shall be our task as defenders to prevent any harm from coming to those parts of the bridge wherein the wards are sealed."},{"name":"MARCELAIN","text":"Three yet remain, and we have dispatched our forces accordingly. I would ask you and your comrades to accompany our defenders at the outermost ward."},{"name":"THANCRED","text":"(-???-)I should hope that includes us as well, yes?"},{"name":"MARCELAIN","text":"The Scions of the Seventh Dawn!?"},{"name":"YSHTOLA","text":"We could not well stand idly by while the Horde threatens the good people of Ishgard."},{"name":"PAPALYMO","text":"Indeed. To do otherwise would go against all that Master Louisoix has taught us."},{"name":"PAPALYMO","text":"As for where we may be of most assistance, I think it prudent we divide into two groups. Yda and I will join the rear guard."},{"name":"YDA","text":"Right! If the dragons should reach us, we'll be sure to give them what for."},{"name":"MARCELAIN","text":"Thank you. All of you. Pray speak with me again when your preparations are complete, and together we shall stand against the Horde!"},{"name":"THANCRED","text":"I'm told the first commander of the Temple Knights, Lucia, will be leading their forces. By all accounts, it would seem we're in quite capable hands."},{"name":"YSHTOLA","text":"The dragons may never again have such an opportunity to strike at the Holy See. You can be certain they will not squander it, so we must be vigilant."},{"name":"PAPALYMO","text":"Would that we could say with certainty that none of the wards will be breached, but our enemy is resourceful."},{"name":"YDA","text":"No matter what happens, we cannot let them cross this bridge."},{"name":"SYSTEM","text":"You must be a Disciple of War or Magic of level 50 or above to proceed."},{"name":"MARCELAIN","text":"I trust you are ready, then? Good. Come, let us make for the battlefield!"},{"name":"MARCELAIN","text":"By the Fury... You have driven the Horde from the Steps of Faith! You! A stranger to our land! I confess, I did not think you capable of such a feat..."},{"name":"MARCELAIN","text":"Yet you yielded not an ilm in the face of dragons that would turn my brother knights' blood to ice. The Fury Herself must walk at your side!"},{"name":"CHAUNOLLET","text":"Nay, I'll not deny it: without your skill and fortitude, the city would now be ash. Would that more of your adventuring brethren possessed such qualities."},{"name":"LOANNE","text":"You have served us well, adventurer─the Temple Knights would have been hard-pressed indeed to turn back the Horde alone. Mayhap 'tis time I returned to the practice yard..."},{"name":"THANCRED","text":"It was a close victory, but a victory nonetheless. I think we have earned a brief respite."},{"name":"YSHTOLA","text":"'Tis a rare opportunity to find oneself confronted with so terrible a foe. Rarer still to emerge victorious. I should hope we need not contend with more of Nidhogg's champions."},{"name":"PAPALYMO","text":"The famed dragoons of Ishgard commanding the skies of battle was truly a sight to behold."},{"name":"YDA","text":"Phew, that was exhausting..."},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>! The dragons are routed! Lest you wonder, the fighting at the Steel Vigil was also fierce, but my Crystal Braves were not found wanting!"},{"name":"AYMERIC","text":"Commander Leveilleur, <span class=\"highlight\">Forename</span>... True to your word, you arrived to aid us in our hour of need."},{"name":"AYMERIC","text":"On behalf of the Holy See and the people of Ishgard, I offer you my humble thanks."},{"name":"AYMERIC","text":"Though I would stay and lavish you with well-deserved praise, I fear I must away to oversee the aftermath of the siege. Not all the dragons are fled, and there are yet wounded to be carried from the field. Pray let us meet anon that I might express my thanks with the proper courtesy."},{"name":"ALPHINAUD","text":"We have indeed achieved a victory of singular importance."},{"name":"ALPHINAUD","text":"With the Dravanian Horde thus weakened and scattered, the threat to Ishgard has been greatly diminished."},{"name":"ALPHINAUD","text":"And, mayhap equally significant, the Holy See must now recognize the necessity of cooperation with foreign powers."},{"name":"ALPHINAUD","text":"Long have they barred their gates against the outside world, but I am confident that the day will soon come when Ishgard proclaims itself a member of the Eorzean Alliance once more."},{"name":"ALPHINAUD","text":"Much have we sacrificed in our struggles against dragons and primals, the Ascians and the Empire. But, step by unfaltering step, we march ever nearer to our goal."},{"name":"ALPHINAUD","text":"And, as ever, the journey is made with you in the van."},{"name":"ALPHINAUD","text":"The victory you have won this day gives us greater hope for the morrow."},{"name":"ALPHINAUD","text":"'Tis a hope that shall sustain us in the days to come, and bear us past the many evils that yet seek to hinder our progress.<br>Yes, we have done well, my friend, and I, for one, would take a moment to savor the enormity of our achievement!"},{"name":"ALPHINAUD","text":"...The demands of duty, however, allow me little time for levity. I must accompany Captain Ilberd back to Ul'dah, and reassign those Braves whose squads suffered heavy losses."},{"name":"ALPHINAUD","text":"You, my friend, have earned a rest at the Rising Stones. Pray return to Revenant's Toll, and share your tale with Minfilia in person."},{"name":"THANCRED","text":"We will see to informing the other nations of what took place here. Do be sure to give our regards to Minfilia."},{"name":"MINFILIA","text":"<span class=\"highlight\">Forename</span>! Welcome back!"},{"name":"MINFILIA","text":"Alphinaud sent word of the siege. And, of course, of the role you played in ending it."},{"name":"MINFILIA","text":"Your deeds never cease to amaze me, <span class=\"highlight\">Forename</span>... Thank you."}],"reward":{"gil":3306,"items":[{"id":5717,"one":1},{"id":5722,"one":1}]},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65954]},"next":[65956]},"partials":[{"type":"npc","id":"1006454","obj":{"i":1006454,"n":"Marcelain","l":63,"q":4}},{"type":"npc","id":"1010897","obj":{"i":1010897,"n":"Minfilia","l":481,"q":10}},{"type":"item","id":"5717","obj":{"i":5717,"n":"Quickarm Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Skill Speed","category":0}}},{"type":"item","id":"5722","obj":{"i":5722,"n":"Quicktongue Materia IV","l":70,"c":20228,"t":58,"materia":{"tier":3,"value":4,"attr":"Spell Speed","category":0}}},{"type":"quest","id":"65954","obj":{"i":65954,"n":"An Allied Perspective","g":2,"l":"Mor Dhona","s":90}},{"type":"quest","id":"65956","obj":{"i":65956,"n":"Administrative Decision","g":2,"l":"The Rising Stones","s":92}}]}