{"quest":{"name":"Shadowed Remnants","location":"Hydromantic Terraces","id":70129,"patch":6.2,"sort":630,"eventIcon":71201,"issuer":1042064,"target":1043800,"genre":12,"journal":["Varshahn wears a look of quiet determination."],"objectives":["Gather information on the hydromantic terraces.","Wait at the designated location.","Search for the clever voidsent at carcere IV.","Speak with Y'shtola."],"dialogue":[{"name":"YSHTOLA","text":"Wherever I turn, there's Darkness as far as I can perceive; the only source of Light here is ourselves. The opposite was true in the First."},{"name":"ESTINIEN","text":"It seems the minions are content to gawp for now. Let's carry on."},{"name":"VARSHAHN","text":"The warding scale exhibits no change. It should be safe to remain here and begin our search."},{"name":"VARSHAHN","text":"But whither now? I would sense Azdaja were she remotely near, but there is nothing..."},{"name":"ESTINIEN","text":"Might you not call to her? Let her know that you have come."},{"name":"VARSHAHN","text":"Alas, this vessel is not capable of calling across vast distances. For that, I require my true form."},{"name":"VARSHAHN","text":"And even were it possible, a dragon's call is borne upon aether. 'Tis liable to draw more voidsent to us."},{"name":"ESTINIEN","text":"I see..."},{"name":"YSHTOLA","text":"In any case, there's little exploration to be done while we are confined to this isolated isle."},{"name":"YSHTOLA","text":"I propose we begin by learning what we can from the castle's occupants. An understanding of their ways may prove useful to our cause."},{"name":"ESTINIEN","text":"Very well. Let's hope a few of them are capable of speech."},{"name":"VARSHAHN","text":"Let all remain vigilant while we go about our inquiries. We reconvene afterwards."},{"name":"YSHTOLA","text":"Like the prevailing tongue in Norvrandt, the language of this world bears a resemblance to our own. It may be assumed that they share a common ancestor."},{"name":"ESTINIEN","text":"This one does naught but stare..."},{"name":"VARSHAHN","text":"Some seem willing enough to converse. Whether they have the ability to do so is another matter..."},{"name":"VOIDSENT04593A","text":"Grrrrrr..."},{"name":"VOIDSENT04593A","text":"Grrr? Grrraaargggh..."},{"name":"SYSTEM","text":"The creature snarls and glares at you. It is unlikely that you will learn anything from it."},{"name":"VOIDSENT04593A","text":"Grrr... Grrraaargggh!"},{"name":"VOIDSENT04593B","text":"What enticing aether you have... Give me some! Give me some!"},{"name":"VOIDSENT04593B","text":"Awww... If only I were stronger, I'd be able to eat you..."},{"name":"VOIDSENT04593B","text":"Fine, fine. I'll find someone else to eat... &lt;grumble&gt;"},{"name":"SYSTEM","text":"While able to communicate, this one seems to think only of feeding. Better to take your inquiries elsewhere."},{"name":"VOIDSENT04593B","text":"I want to eat you. I mustn't eat you. I want to eat you. I mustn't eat you..."},{"name":"VOIDSENT04593C","text":"The mistress's eyes are beauteous! Sublime! To bask in her gaze is bliss!"},{"name":"VOIDSENT04593C","text":"But now she's gone... Never again will I feel her gaze..."},{"name":"VOIDSENT04593C","text":"No mistress. No orders. What am I to do now? What am I to do now?"},{"name":"SYSTEM","text":"The creature mutters endlessly to itself, not sparing you so much as a glance."},{"name":"VOIDSENT04593C","text":"No mistress. No orders. What am I to do now? What am I to do now?"},{"name":"VOIDSENT04593D","text":"I serve! I obey! Please don't eat me!"},{"name":"VOIDSENT04593D","text":"A...dragon? What's that? Does it taste good? I don't know anything about it. Don't know about anything."},{"name":"VOIDSENT04593D","text":"But the one we caught recently, they seemed to know lots."},{"name":"VOIDSENT04593D","text":"We threw them in the dungeon, but clever ones are tasty. They might have been eaten already."},{"name":"SYSTEM","text":"You've learned all you can from this voidsent. If you look in the dungeon, you may be able to find the clever one it mentioned."},{"name":"VOIDSENT04593D","text":"We threw the clever one in the dungeon, but clever ones are tasty. If I had the chance, I don't think I could resist..."},{"name":"VARSHAHN","text":"I have nothing to share. While those I approached had no will to fight, neither were they capable of holding a conversation worth the name."},{"name":"YSHTOLA","text":"My experience was much the same. Lower-rung voidsent tend to have lower intelligence, 'twould seem."},{"name":"ESTINIEN","text":"A pity Scarmiglione is dead. He was talkative at least."},{"name":"YSHTOLA","text":"What of you?"},{"name":"VARSHAHN","text":"A clever voidsent in the dungeon..."},{"name":"ESTINIEN","text":"That would be the area in which we emerged."},{"name":"YSHTOLA","text":"Indeed."},{"name":"YSHTOLA","text":"Let's take ourselves back there and find this voidsent─preferably before its fellows make a meal of it."},{"name":"VARSHAHN","text":"To the dungeon, then."},{"name":"YSHTOLA","text":"There appears to be someone within..."},{"name":"ESTINIEN","text":"I mislike the feel of this. Stay on your guard."},{"name":"VARSHAHN","text":"Could this be the clever voidsent?"},{"name":"ESTINIEN","text":"Zenos's avatar, eh? What are the odds."},{"name":"ESTINIEN","text":"We still know little about her, but for now I'm glad we found someone who can do more than moan for aether."},{"name":"VARSHAHN","text":"I assume the dungeon was reserved for those intended for the mistress's consumption."},{"name":"VARSHAHN","text":"'Tis fortunate that we came here when we did. Fateful, even."},{"name":"MYSTERIOUSPERSON","text":"When I served Zenos, my mind was shrouded in haze. But one thing was always clear─his obsession with the “friend.”"},{"name":"MYSTERIOUSPERSON","text":"What the word means, I do not know exactly. I know only that it referred to you, and that yours was an important existence."},{"name":"YSHTOLA","text":"As much as one might expect the unexpected, I doubt any of us could have foreseen this turn of events."},{"name":"YSHTOLA","text":"She seems different from other voidsent─at least those we've met. And the change we witnessed, I suspect, is due to your crystal purging the excess Darkness in her."},{"name":"YSHTOLA","text":"Even so, she still harbors a great deal of Darkness. I'm very keen to hear what she can tell us─about herself and about her world."}],"reward":{"gil":1087,"items":[{"num":3,"id":36075,"one":1},{"num":3,"id":36068,"one":1},{"num":3,"id":36071,"one":1},{"num":3,"id":36073,"one":1},{"num":2,"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70128]},"next":[70130]},"partials":[{"type":"npc","id":"1042064","obj":{"i":1042064,"n":"Varshahn","l":4036,"q":1}},{"type":"npc","id":"1043800","obj":{"i":1043800,"n":"Y'shtola","l":4036,"q":1}},{"type":"item","id":"36075","obj":{"i":36075,"n":"Scallop Salad","l":580,"c":24207,"t":46}},{"type":"item","id":"36068","obj":{"i":36068,"n":"Beef Stroganoff","l":580,"c":24369,"t":46}},{"type":"item","id":"36071","obj":{"i":36071,"n":"Peach Juice","l":580,"c":24409,"t":46}},{"type":"item","id":"36073","obj":{"i":36073,"n":"Sykon Cookie","l":580,"c":24094,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"70128","obj":{"i":70128,"n":"In Search of Azdaja","g":12,"l":"Radz-at-Han","s":629}},{"type":"quest","id":"70130","obj":{"i":70130,"n":"Where Everything Begins","g":12,"l":"Carcere IV","s":631}}]}