{"quest":{"name":"The Crystal (Line's) Call","location":"Wolves' Den Pier","id":70121,"patch":6.1,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1038448,"target":1038448,"genre":91,"journal":["Gungi Zelungi would have you aspire to greater heights─strategically.<br><br>※Crystalline Conflict can be accessed via the Duty Finder."],"objectives":[],"dialogue":[{"name":"GUNGIZELUNGI","text":"You look to be spoiling for a fight, newcomer. Not that I blame you─most everyone the captain sends my way is."},{"name":"GUNGIZELUNGI","text":"You'd do well to vent some of that pent-up rage in a match or three of Crystalline Conflict. It's the latest, greatest, and most exciting tactical training you'll find this side of the front lines!"},{"name":"GUNGIZELUNGI","text":"You may think me biased, given that I'm the one who came up with the rules, but nothing could be further from the truth. We received countless calls to add more strategic elements to our training skirmishes, you see, and I simply put the entirety of my considerable skill toward answering them."},{"name":"GUNGIZELUNGI","text":"Crystalline Conflict matches challenge you to maintain control over an all-important freight, which you must transport safely to a designated location amid the heat of battle. I've even designed special arenas replete with magicked mechanisms to keep you on your toes."},{"name":"GUNGIZELUNGI","text":"If that piques your interest, my first recommendation is that you learn the rules in their entirety, lest you be pulverized the moment you step onto the field. But fear not─I am more than happy to discuss them any time!"},{"name":"SYSTEM","text":"Crystalline Conflict allows you to take part in small-scale, 5v5 tactical skirmishes. It can be accessed via the PvP section of the Duty Finder."},{"name":"GUNGIZELUNGI","text":"I'm afraid you'll need to put on a fiercer face than that if you're to take on my training. You may survive, but you won't <span class=\"emphasis\">strategically thrive</span>..."},{"name":"SYSTEM","text":"In order to undertake this quest, you must meet the following requirements:"},{"name":"SYSTEM","text":"※ You must be at least level 30 with a Disciple of War or Magic."},{"name":"SYSTEM","text":"※ You must be affiliated with a Grand Company and have unlocked Crystalline Conflict PvP."}],"reqs":{"jobs":[{"lvl":30,"id":34}],"questsType":"any","quests":[66640,66641]}},"partials":[{"type":"npc","id":"1038448","obj":{"i":1038448,"n":"Gungi Zelungi","l":358,"q":1,"t":"CC Attendant"}},{"type":"quest","id":"66640","obj":{"i":66640,"n":"A Pup No Longer (Maelstrom)","g":190,"l":"Limsa Lominsa","s":300,"f":1}},{"type":"quest","id":"66641","obj":{"i":66641,"n":"A Pup No Longer (Twin Adder)","g":191,"l":"Gridania","s":300,"f":1}}]}