{"quest":{"name":"Where Everything Begins","location":"Carcere IV","id":70130,"patch":6.2,"sort":631,"icon":101197,"eventIcon":71201,"issuer":1043802,"target":1043812,"genre":12,"journal":["The dark-robed voidsent regards you questioningly.","The dark-robed voidsent is willing to provide you with the information you seek─for a price. In this world, she explains, no one aids another unless they themselves stand to gain. The bargain is struck with an offer of aether, and you make your way outside the dungeon for a lesson on the void.","There was once Light here in the Thirteenth, but a terrible conflict known as the Contramemoria shattered the balance of aether, causing Darkness to engulf the world. Thus was all life transformed into voidsent. The dark-robed voidsent, however, is voidsent only in part, on account of having been touched by Darkness while still in her mother's womb, when the war had only just begun. Desiring a name by which to call her, Y'shtola suggests “Zero”─which the half-voidsent woman accepts with the disinterest of the damned.","Believing yourselves exposed, Varshahn suggests continuing the conversation inside the castle. Thus do you make your way to the throne room.","On arriving at the throne room, Zero demands her payment. But ere Y'shtola can provide it, Scarmiglione, whom you had believed slain, sets upon you once more. The archfiend reveals that death doesn't exist in the void, and you struggle to contend with his powers of regeneration─until Zero agrees to join the fray. All marvel as she uses her mysterious power to transform Scarmiglione's minions into crystals. With the odds made even, you turn to deal with the archfiend himself.","You succeed in overcoming Scarmiglione, with Zero delivering the coup de grâce and binding him in crystal. Taking the object in your hand, you experience a vision of the past─of a knight in black named Golbez, and those he proclaimed his four archfiends. Of greater interest, however, is the presence of what appears to be a wyrm...","From the memoria crystals and their part in the world-ending war to Golbez and his mysterious ambitions, you have been given much to consider─and doubtless have many new questions. Fortunately, as Y'shtola observes, Zero still owes you some few answers."],"objectives":["Speak with the dark-robed voidsent.","Speak with Varshahn.","Speak with Zero in the Seat of the Foremost.","Speak with Y'shtola."],"dialogue":[{"name":"YSHTOLA","text":"While the language of this world is similar to ours, it is her covenant with Zenos that should ensure we can understand one another."},{"name":"YSHTOLA","text":"The magick for summoning voidsent also facilitates communication, you see. Without this component, a mage would struggle to make his mind known to his servant."},{"name":"ESTINIEN","text":"Zenos's avatar, eh? What are the odds."},{"name":"ESTINIEN","text":"We still know little about her, but for now I'm glad we found someone who can do more than moan for aether."},{"name":"VARSHAHN","text":"I assume the dungeon was reserved for those intended for the mistress's consumption."},{"name":"VARSHAHN","text":"'Tis fortunate that we came here when we did. Fateful, even."},{"name":"MYSTERIOUSPERSON","text":"So, I doubt you came to the dungeon by pure chance. What is it that you're after?"},{"name":"VARSHAHN","text":"We were looking for a voidsent with whom we could converse, in the course of which we learned of you."},{"name":"VARSHAHN","text":"We are visitors to this world, and know little and less of its workings and ways."},{"name":"VARSHAHN","text":"We would be grateful if you could tell us about it. About yourself."},{"name":"MYSTERIOUSPERSON","text":"So it's information you seek."},{"name":"MYSTERIOUSPERSON","text":"What do you offer for it?"},{"name":"VARSHAHN","text":"...I beg your pardon?"},{"name":"MYSTERIOUSPERSON","text":"Voidsent do not give unless we stand to gain."},{"name":"MYSTERIOUSPERSON","text":"If you desire something, you pay the price. That is the sole rule in this world you call the void."},{"name":"VARSHAHN","text":"That makes sense. Pray forgive our ignorance."},{"name":"VARSHAHN","text":"But what would be acceptable as payment? I suspect that such coin as we carry has no value here."},{"name":"YSHTOLA","text":"Voidsent crave one thing alone: aether."},{"name":"YSHTOLA","text":"In return for information, I offer you mine. Just not all of it, mind you. I still have need of my life."},{"name":"MYSTERIOUSPERSON","text":"Very well. I will tell you no more than you can afford to pay."},{"name":"YSHTOLA","text":"Then we have a bargain."},{"name":"MYSTERIOUSPERSON","text":"If we're to talk about the void, let us do so outside. Come with me."},{"name":"YSHTOLA","text":"You needn't worry for me. My life force is a small price to pay for her knowledge, and I will recover it quickly enough once we've returned home."},{"name":"ESTINIEN","text":"Their “one rule” is no different from that of many in our own world."},{"name":"ESTINIEN","text":"It's those like Alphinaud who are a rare breed."},{"name":"VARSHAHN","text":"We cannot allow Y'shtola to bear the burden alone. When next the opportunity arises, I will offer my own aether."},{"name":"YSHTOLA","text":"No one else seems to be nearby. Perhaps it was just a trick of the wind..."},{"name":"YSHTOLA","text":"If naught is out of the ordinary, I should like to hear more from Zero. I can't imagine there are many part voidsent like her who remember the world as it was."},{"name":"ESTINIEN","text":"We may have subdued the voidsent here, but I doubt they'll remain that way. Remain vigilant."},{"name":"MYSTERIOUSPERSON","text":"“Beginning”... A curious notion in a world where all has come to an end."},{"name":"VARSHAHN","text":"I must say, we are rather exposed here."},{"name":"VARSHAHN","text":"Perhaps we should continue the conversation within the castle."},{"name":"VARSHAHN","text":"The throne room is defensible, given its few points of ingress. Let us head back there."},{"name":"MYSTERIOUSPERSON","text":"Moving wasn't part of the bargain. I'll comply, but I expect my payment promptly."},{"name":"YSHTOLA","text":"You shall have it as soon as we've arrived."},{"name":"YSHTOLA","text":"I will see to the payment, and then we may ask Zero what she knows about Azdaja."},{"name":"ESTINIEN","text":"I feel eyes on us. Stay alert."},{"name":"VARSHAHN","text":"All appears unchanged here."},{"name":"SYSTEM","text":"Upon proceeding, several cutscenes will play in sequence.<br>It is recommended that you set aside sufficient time to view these scenes in their entirety."},{"name":"SYSTEM","text":"In addition, you will be required to participate in battle. Your progress will be saved at certain points. In the event that you are defeated, you will be able to try again from the most recent of these."},{"name":"SYSTEM","text":"Please note that if you enter battles associated with other quests or log out from the game, this progress will be lost."},{"name":"SYSTEM","text":"You must be a Disciple of War or Magic of level 90 or above to proceed."},{"name":"ESTINIEN","text":"We've vanquished one of Golbez's archfiends, but three remain. As troublesome as this one, I expect."},{"name":"VARSHAHN","text":"If Golbez has Azdaja at his mercy, then we must find him. Hopefully Zero has knowledge that will aid us in our search..."},{"name":"MYSTERIOUSPERSON","text":"There is nothing like the aether of a living mortal. I haven't felt so satisfied since my return."},{"name":"YSHTOLA","text":"In light of our recent experiences, I expect we all have questions. I trust Zero can answer some few of them."},{"name":"YSHTOLA","text":"We should still be owed at least that much, I daresay."}],"reward":{"gil":3028},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70129]},"next":[70131]},"partials":[{"type":"npc","id":"1043802","obj":{"i":1043802,"n":"Dark-robed Voidsent","l":4036,"q":1}},{"type":"npc","id":"1043812","obj":{"i":1043812,"n":"Y'shtola","l":4036,"q":1}},{"type":"quest","id":"70129","obj":{"i":70129,"n":"Shadowed Remnants","g":12,"l":"Hydromantic Terraces","s":630}},{"type":"quest","id":"70131","obj":{"i":70131,"n":"Groping in the Dark","g":12,"l":"Troia Keep","s":632}}]}