{"quest":{"name":"Groping in the Dark","location":"Troia Keep","id":70131,"patch":6.2,"sort":632,"eventIcon":71201,"issuer":1043815,"target":1043822,"genre":12,"journal":["Estinien looks at you with his piercing gaze."],"objectives":["Gather information on the hydromantic terraces.","Speak with Varshahn in the Seat of the Foremost.","Speak with Zero on the hydromantic terraces.","Speak with Zero."],"dialogue":[{"name":"YSHTOLA","text":"From memoria to Golbez and his archfiends, we have more questions now than answers. But that is a sign that we are making progress."},{"name":"VARSHAHN","text":"If Golbez has Azdaja at his mercy, then we must find him. Hopefully Zero has knowledge that will aid us in our search..."},{"name":"MYSTERIOUSPERSON","text":"There is nothing like the aether of a living mortal. I haven't felt so satisfied since my return."},{"name":"ESTINIEN","text":"Hmm... <span class=\"highlight\">Forename</span>, you've come to the Thirteenth before, yes? You fought voidsent here."},{"name":"ESTINIEN","text":"But clearly you didn't know they could regenerate, else you would have shared that detail beforehand."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"They seemed to stay dead at the time, yes."},{"name":"A1","text":"I was in a bit of a rush and didn't have time to wait around and see..."},{"name":"ESTINIEN","text":"I doubt not that they did. There must be a reason why the ones you defeated did not return, in contravention of the natural order."},{"name":"ESTINIEN","text":"Do you remember aught out of the ordinary? A sealing magick like Zero's, perhaps?"},{"name":"ESTINIEN","text":"From what I know of your foray, I can hardly blame you."},{"name":"ESTINIEN","text":"Perhaps they returned after you left. But if they didn't, there must be a reason why."},{"name":"MYSTERIOUSPERSON","text":"There are circumstances in which we're unable to return. If you like, I can tell you about this."},{"name":"ESTINIEN","text":"Please do."},{"name":"MYSTERIOUSPERSON","text":"The more you devour, the more powerful you grow. But in the process, your essence is blended with those of your prey."},{"name":"MYSTERIOUSPERSON","text":"If you were to lose your flesh, the souls you had come to harbor may break free and coalesce into distinct voidsent once more."},{"name":"MYSTERIOUSPERSON","text":"And before you yourself return, your own soul might be devoured by your enemies or your erstwhile prey. A fate more likely for stronger beings, who require more time to regenerate."},{"name":"MYSTERIOUSPERSON","text":"However, even assuming you survive the process, it's highly uncommon to return as you were."},{"name":"VARSHAHN","text":"Yet despite his greater strength, Scarmiglione managed to resurrect rather swiftly. Are there others capable of the same?"},{"name":"MYSTERIOUSPERSON","text":"Not that I'm aware of. His attachment to his flesh must've been unique for him to develop such an ability."},{"name":"YSHTOLA","text":"I believe we understand the fundamentals of rebirth now."},{"name":"YSHTOLA","text":"If I may, I would ask you about your power. Will you tell us about it?"},{"name":"MYSTERIOUSPERSON","text":"What you saw should speak for itself. I can bind the aether of the soul in crystal."},{"name":"MYSTERIOUSPERSON","text":"Many wielded this power during the Contramemoria, but I'm the only one left."},{"name":"YSHTOLA","text":"I am told that heroes of the Thirteenth once sealed gods in stones called auracite. Are they and memoria one and the same?"},{"name":"MYSTERIOUSPERSON","text":"“Auracite”... I do not know this word, but the world is vast, and perhaps memoria had different names elsewhere. But it does sound quite similar."},{"name":"YSHTOLA","text":"How does one come to wield memoria? And what happened to your peers?"},{"name":"MYSTERIOUSPERSON","text":"Hm, I've never thought about that... I do know, though, that voidsent can't use the power. I assume I can because I'm mortal in part."},{"name":"YSHTOLA","text":"...I see."},{"name":"VARSHAHN","text":"Zero, I wish to ask you about the man called Golbez."},{"name":"VARSHAHN","text":"He may well have my sister in his clutches. Is there aught you can tell us of him?"},{"name":"MYSTERIOUSPERSON","text":"The name sounds vaguely familiar, though I can't say how I know it."},{"name":"MYSTERIOUSPERSON","text":"If he is powerful, however, someone in the castle may have heard of him."},{"name":"VARSHAHN","text":"Then we must try talking to the other voidsent again!"},{"name":"YSHTOLA","text":"Let us entrust the task to <span class=\"highlight\">Forename</span>. <span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> Echo will help facilitate communication."},{"name":"YSHTOLA","text":"More importantly, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> should be able to maintain <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> composure better than a concerned sibling."},{"name":"VARSHAHN","text":"That, I cannot deny..."},{"name":"VARSHAHN","text":"Forgive me, but will you not ask about Golbez in my stead? On the terraces to begin with, perhaps."},{"name":"VARSHAHN","text":"Thank you. We shall remain here and discuss what other avenues we might pursue in the meantime."},{"name":"YSHTOLA","text":"Scarmiglione, too, appeared surprised by Zero's power. As she says, it must be a lost art."},{"name":"YSHTOLA","text":"This makes her invaluable to our cause─far more than someone who can simply communicate."},{"name":"ESTINIEN","text":"I know what it feels like to have my essence blended with that of another."},{"name":"ESTINIEN","text":"Yet tumultuous though it was, it was only one wyrm's soul. To be bound to scores of others over thousands of years sounds <span class=\"emphasis\">horrible</span>."},{"name":"VARSHAHN","text":"According to your vision, Golbez recruited his champions and raised an army by offering a dragon's aether in exchange."},{"name":"VARSHAHN","text":"Whatever his crusade, 'tis unconscionable to use a dragon's life force as fodder. He will answer for his deeds."},{"name":"MYSTERIOUSPERSON","text":"So with this “Echo” of yours, you can see into the past? Interesting."},{"name":"MYSTERIOUSPERSON","text":"Those memories may as well be all that remains of it, though. Everything and everyone was warped by Darkness. However storied it may appear, this castle is simply the product of its mistress's mind."},{"name":"VOIDSENT04593B","text":"Ugh, the tasty one returns to tempt me. I mustn't eat you, I mustn't eat you..."},{"name":"VOIDSENT04593B","text":"...Golbez? I know of him from those I've eaten."},{"name":"VOIDSENT04593B","text":"He has minions. And those minions have minions. No one ever sees him."},{"name":"SYSTEM","text":"With his army of minions, Golbez would seldom have need to act personally. It will not be easy to reach him."},{"name":"VOIDSENT04593B","text":"Golbez must be strong. Very strong. If I were you, I wouldn't try to eat him."},{"name":"VOIDSENT04593C","text":"If the one who devoured her dies, perhaps the mistress will return. Then I may bask in her gaze again..."},{"name":"VOIDSENT04593C","text":"G-Golbez, you say!? My mistress spoke of him!"},{"name":"VOIDSENT04593C","text":"He commands the archfiends! They are very powerful and have conquered many domains!"},{"name":"VOIDSENT04593C","text":"The mistress bade us defend the castle from them. Yes, yes, she did!"},{"name":"SYSTEM","text":"It seems the archfiends have been attacking other domains. Their fearsome reputation precedes them."},{"name":"VOIDSENT04593C","text":"I'll defend the castle from the archfiends. And when the mistress returns, perhaps she'll favor me with a long gaze..."},{"name":"VOIDSENT04593D","text":"So the clever one hadn't been eaten? If no one wants it, then perhaps..."},{"name":"VOIDSENT04593D","text":"Golbez? Of course I know of him. Only a fool without ears wouldn't."},{"name":"VOIDSENT04593D","text":"His archfiends lead armies to ravage and conquer. They devour those they deem useless. Those who can't fight."},{"name":"VOIDSENT04593D","text":"If you don't want to be eaten, then you had better flee. Though soon there will be nowhere to run..."},{"name":"SYSTEM","text":"It seems the archfiends keep only those who are fit for battle. Others must escape or be consumed."},{"name":"VOIDSENT04593D","text":"Obey or be eaten. Obey but eventually be eaten anyway. I don't want to live like that..."},{"name":"YSHTOLA","text":"Oh, you've finished already? Or did we get carried away talking..."},{"name":"YSHTOLA","text":"There's no easy way to mark the passage of time in this world. Nor do I imagine such things concern voidsent."},{"name":"YSHTOLA","text":"It would take considerable mental fortitude to still care after millennia in this endless night."},{"name":"ESTINIEN","text":"No trouble on your end either? Good."},{"name":"ESTINIEN","text":"I daresay Scarmiglione's fate served as sufficient warning. Let's hope that those elsewhere have the same sense."},{"name":"MYSTERIOUSPERSON","text":"Is there no end to their questions? &lt;sigh&gt; I should've demanded more aether..."},{"name":"VARSHAHN","text":"Welcome back, <span class=\"highlight\">Forename</span>. Were you able to learn aught of value?"},{"name":"VARSHAHN","text":"So countless voidsent answer to the archfiends, who in turn answer to Golbez─as your vision did suggest."},{"name":"YSHTOLA","text":"Scarmiglione's aggression is also consistent with the claims that the archfiends conquer other domains."},{"name":"ESTINIEN","text":"The question is, how do we reach Golbez if he surrounds himself with armies of minions?"},{"name":"ESTINIEN","text":"We could target his other archfiends...or perhaps those who have fled his service. Either may yield useful information."},{"name":"ESTINIEN","text":"That said, we can't do much while we're stuck on this isle."},{"name":"VARSHAHN","text":"Zero, I would ask a favor of you."},{"name":"VARSHAHN","text":"I am determined to save my sister Azdaja. If there is even a faint possibility that Golbez has her, then I must find him."},{"name":"VARSHAHN","text":"To that end, I want you to lend us your strength and knowledge. Will you accompany us on our quest?"},{"name":"MYSTERIOUSPERSON","text":"Forgotten the way of my world already? If you want help, offer payment."},{"name":"MYSTERIOUSPERSON","text":"None here will aid you out of the kindness of their hearts. Any who claim otherwise are liars and betrayers."},{"name":"MYSTERIOUSPERSON","text":"Or is this less a request and more a threat? If I refuse, will you force me to serve?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"If you accompany us, we can offer you protection."},{"name":"A2","text":"Surely you must desire something. Name it."},{"name":"A2","text":"We're not like Zenos. We would never, ever force you to serve."},{"name":"MYSTERIOUSPERSON","text":"Protection? I have no need of such."},{"name":"MYSTERIOUSPERSON","text":"I was a prisoner, yes, but only because I couldn't be bothered to resist. I could have easily broken free had I desired to do so."},{"name":"ESTINIEN","text":"If you're truly such an aimless creature, then you could do worse than to join us. You needn't expend as much energy to defend yourself as you would alone."},{"name":"MYSTERIOUSPERSON","text":"Trying to be clever, are you? But even if you had a point, your protection isn't enough to persuade me."},{"name":"MYSTERIOUSPERSON","text":"I have no purpose. Why would I desire anything?"},{"name":"MYSTERIOUSPERSON","text":"That's why I didn't bother to resist when the ones here fell upon me. What matters in a world that's already dead?"},{"name":"YSHTOLA","text":"By that logic, you've no reason to refuse our requests. The payment need but be to your satisfaction, correct?"},{"name":"MYSTERIOUSPERSON","text":"&lt;sigh&gt; Did I not already say as much from the start?"},{"name":"MYSTERIOUSPERSON","text":"You aren't forcing your avatar to serve against its will, that's true. Yours is an equitable covenant."},{"name":"MYSTERIOUSPERSON","text":"That being the case, I can believe your words. You would provide fair payment."},{"name":"MYSTERIOUSPERSON","text":"...Well? What do you offer?"},{"name":"VARSHAHN","text":"Very well, Zero. I propose you travel with us, and whenever you perform a deed that requires payment, we will provide it in aether."},{"name":"MYSTERIOUSPERSON","text":"That's all you had to say. Everything else was superfluous."},{"name":"ESTINIEN","text":"Fair point. Where to now?"},{"name":"ESTINIEN","text":"Either a place the archfiends may strike next, or where refugees and deserters may seek sanctuary..."},{"name":"MYSTERIOUSPERSON","text":"I know the latter. I'll take you there."},{"name":"YSHTOLA","text":"I assume you also know how we can get off this isle?"},{"name":"MYSTERIOUSPERSON","text":"I was brought here on a mount. We can leave the same way."},{"name":"YSHTOLA","text":"Now that you mention it, I did notice some flying creatures near the terraces."},{"name":"MYSTERIOUSPERSON","text":"Given our numbers, we'll need a large one. But regardless of size, all can be won over with aether."},{"name":"VARSHAHN","text":"Excellent. Let us go and find our mount at once."},{"name":"SPYVOIDSENT","text":"(-Snooping Voidsent-)Not good... Lord Golbez must hear of this!"},{"name":"YSHTOLA","text":"Zero will best know how to handle the creatures. Let us watch and learn."},{"name":"ESTINIEN","text":"Not all voidsent can fly. It stands to reason that some would be made to serve as mounts."},{"name":"VARSHAHN","text":"Were I here in my true form, I would be able to carry you all. But even were it possible to so enlarge the gate, the risk would be too great."},{"name":"MYSTERIOUSPERSON","text":"We should be able to find a mount here. With the castle in disarray, the creatures will be hungry. Just a little aether should suffice."},{"name":"MYSTERIOUSPERSON","text":"Are you ready?"},{"name":"SYSTEM","text":"Leave Troia Keep?"},{"name":"YSHTOLA","text":"'Tis said that a person's domain is a reflection of what abides in their heart. If true, this place may offer a glimpse into Zero's past."},{"name":"ESTINIEN","text":"The longer one lives, the more one yearns for peace. I understand why some would sequester themselves here."},{"name":"VARSHAHN","text":"'Tis quite a gathering of voidsent. I pray one among them has the knowledge we seek."},{"name":"MYSTERIOUSPERSON","text":"This is my abode. The others won't come near, so you may be at ease."},{"name":"MYSTERIOUSPERSON","text":"While they know their place, if tantalizing aether were to walk by, I can't guarantee they wouldn't pounce."},{"name":"MYSTERIOUSPERSON","text":"It is a voidsent's nature to consume. Their sole purpose. Even if the pursuit of aether may lead to their undoing, many succumb to instinct."},{"name":"MYSTERIOUSPERSON","text":"But any who succumb here will have to answer to me. This is my domain's one and only rule─and it is absolute."}],"reward":{"gil":1217},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70130]},"next":[70132]},"partials":[{"type":"npc","id":"1043815","obj":{"i":1043815,"n":"Estinien","l":4036,"q":1}},{"type":"npc","id":"1043822","obj":{"i":1043822,"n":"Zero","l":4038,"q":2}},{"type":"quest","id":"70130","obj":{"i":70130,"n":"Where Everything Begins","g":12,"l":"Carcere IV","s":631}},{"type":"quest","id":"70132","obj":{"i":70132,"n":"Nowhere to Run","g":12,"l":"Zero's Domain","s":633}}]}