{"quest":{"name":"The Wind Rises","location":"Zero's Domain","id":70133,"patch":6.2,"sort":634,"icon":101198,"eventIcon":71201,"issuer":1043839,"target":1043840,"genre":12,"journal":["Zero has a word of warning before you go to face Barbariccia.","Despite Barbariccia's vague promise of answers regarding Azdaja, on Zero's advice you resolve to seal the archfiend away at the earliest opportunity. With luck, her memoria will yield the knowledge you seek. The strategy thus decided, you go to mount the nisroch on your way to what promises to be a turbulent struggle with the archfiend of wind.","As you approach Barbariccia's domain, you meet with heavy resistance from her minions. While your comrades tend to them, you press on to confront the waiting archfiend.","The time has come to lay low Barbariccia, in the hopes that her memories will lead you to Varshahn's sister. But what tricks the archfiend has in store for you remain to be seen...<br><br>※Storm's Crown can be accessed via the Duty Finder.","Barbariccia brings her considerable might to bear against you, but you weather the storm and subdue the archfiend. Before she regains her strength, you must move quickly and see her imprisoned.","Seizing her moment, Zero descends from on high to seal Barbariccia in memoria. To your disappointment, the resulting crystal does not grant you a vision, but you take heart from your victory over one of Golbez's champions. Having fulfilled her part of the bargain, Zero demands the aether she is owed...only to collapse from exhaustion before she can receive it. Eager though Varshahn is to continue your mission, he bids you suspend it in favor of tending to your ailing companion, and you begin by carrying her back to her domain.","Though Zero remains unconscious, she is otherwise in no danger─save from other voidsent, perhaps. Thus do you decide to observe her as you consider your next course of action."],"objectives":["Travel to Barbariccia's domain.","Confront Barbariccia in Storm's Crown.","Speak with Y'shtola."],"dialogue":[{"name":"YSHTOLA","text":"What little I learned in your absence did not pertain to the archfiends. That discussion can wait until after we've tended to Barbariccia."},{"name":"ESTINIEN","text":"Scarmiglione possessed the power of regeneration. Let us see what Barbariccia can do with her winds."},{"name":"VARSHAHN","text":"Just you wait, Barbariccia. I will have answers from you yet..."},{"name":"MYSTERIOUSPERSON","text":"A word of warning. Barbariccia spoke as if she would give us answers if we were to defeat her."},{"name":"MYSTERIOUSPERSON","text":"But even assuming she'll talk─which I doubt─I trust I needn't tell you how foolish it is to give an archfiend a second chance. Best to seal her away at the earliest opportunity."},{"name":"MYSTERIOUSPERSON","text":"If you wish to peer into her past, the memoria will suffice."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I can't wield the power at will."},{"name":"A1","text":"I'll try, but I make no guarantees."},{"name":"MYSTERIOUSPERSON","text":"Well then, you had better hope it favors you when the time comes."},{"name":"MYSTERIOUSPERSON","text":"You do that. And if you fail, well...you'll just have to search elsewhere for answers."},{"name":"YSHTOLA","text":"Rest assured this won't be our last opportunity to learn about Azdaja."},{"name":"YSHTOLA","text":"If another archfiend were to fall, Golbez would surely be compelled to respond."},{"name":"YSHTOLA","text":"We need only wait for our quarry to come to us."},{"name":"VARSHAHN","text":"Indeed. If our struggles with Scarmiglione taught us aught, 'tis that we must hold nothing back when facing an archfiend."},{"name":"VARSHAHN","text":"Let us heed Zero's advice and seal her away at the earliest opportunity."},{"name":"MYSTERIOUSPERSON","text":"If we're all in agreement, then let us be off. We travel by nisroch."},{"name":"YSHTOLA","text":"Scarmiglione was the archfiend of earth, while Barbariccia is of the wind. In this world given to Darkness, I wonder what significance their elemental titles hold."},{"name":"ESTINIEN","text":"Barbariccia will use every advantage she has. Traps, ambushes─we must be prepared for all that and more."},{"name":"VARSHAHN","text":"This is not the first trial we have faced since coming to this world. Nor will it be the last. But with you all beside me, I am confident we will prevail. So come, let us sally forth!"},{"name":"MYSTERIOUSPERSON","text":"To transform a voidsent into memoria, we must first drain them of their aether. To wit, we must wound her gravely."},{"name":"SYSTEM","text":"Travel to Barbariccia's domain?"},{"name":"ESTINIEN","text":"In her present state, Zero is easy prey for other voidsent. We must be on our guard."},{"name":"VARSHAHN","text":"Zero hasn't so much as stirred. Such power she must have expended..."},{"name":"SYSTEM","text":"Though so slow as to be nearly imperceptible, Zero's chest rises and falls in a steady rhythm..."},{"name":"YSHTOLA","text":"Though Zero remains unconscious, she appears otherwise fine."},{"name":"YSHTOLA","text":"...Insofar as I can discern, at any rate. Being part voidsent, her physiology may be rather different from ours. Let us observe her for a while as we discuss our next move."}],"reward":{"gil":3718,"instance":20084},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70132]},"next":[70134]},"partials":[{"type":"npc","id":"1043839","obj":{"i":1043839,"n":"Zero","l":4038,"q":1}},{"type":"npc","id":"1043840","obj":{"i":1043840,"n":"Y'shtola","l":4038,"q":1}},{"type":"instance","id":"20084","obj":{"i":20084,"n":"Storm's Crown","c":61804,"t":"Trials","min_lvl":90,"max_lvl":90,"min_ilvl":585}},{"type":"quest","id":"70132","obj":{"i":70132,"n":"Nowhere to Run","g":12,"l":"Zero's Domain","s":633}},{"type":"quest","id":"70134","obj":{"i":70134,"n":"Return from the Void","g":12,"l":"Zero's Domain","s":635}}]}