{"quest":{"name":"A World with Light and Life","location":"Radz-at-Han","id":70135,"patch":6.2,"sort":636,"eventIcon":71201,"issuer":1043848,"target":1043857,"genre":12,"journal":["Never one to remain idle, Y'shtola would tend to an errand."],"objectives":["Speak with Mehryde.","Speak with the Meghaduta attendant.","Speak with Zero and have her accompany you.","Speak with Mihleel while Varshahn and Zero are accompanying you.","Head to Balshahn Bazaar while accompanied by Varshahn and Zero, and speak with Zero at the designated location.","Speak with Isu while Varshahn and Zero are accompanying you.","Head to Windweft while accompanied by Varshahn and Zero, and speak with Zero at the designated location.","Speak with Zero."],"dialogue":[{"name":"ESTINIEN","text":"My chamber is much the same as this one. Too opulent for my taste, but at least it has space to train."},{"name":"VARSHAHN","text":"She seems to be faring better here. Praise be to the Sisters..."},{"name":"SYSTEM","text":"Zero's breathing appears to be less strained than it was in the Thirteenth."},{"name":"MEGHADUTAEMPLOYEE","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. If you would follow me, I will show you to the guest chambers."},{"name":"SYSTEM","text":"Proceed to the Meghaduta guest chambers?"},{"name":"YSHTOLA","text":"If I may excuse myself, I wish to pay a visit to the High Crucible."},{"name":"YSHTOLA","text":"While the scales functioned admirably, it would be prudent to have them inspected for signs of degradation."},{"name":"VARSHAHN","text":"By all means. I shall do the same for this vessel."},{"name":"ESTINIEN","text":"Then I'll go and meet with the soldiers. Share with them what I learned fighting voidsent in the Thirteenth."},{"name":"VARSHAHN","text":"What of you, my friend? Have you any immediate plans?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Nothing in particular."},{"name":"A1","text":"I'm just worried about Zero."},{"name":"A1","text":"I might go and tend to my island."},{"name":"VARSHAHN","text":"In that case, might I trouble you with a small task?"},{"name":"VARSHAHN","text":"In that case, might I trouble you with a small task?"},{"name":"VARSHAHN","text":"Truly? Had I known you had such interests, I might have entrusted you with the development of our nearby isles to attract visitors. "},{"name":"VARSHAHN","text":"At any rate, should you be in no hurry, might I trouble you with a small task first?"},{"name":"VARSHAHN","text":"I wish to have food ready for Zero when she awakens, you see. Would you be willing to go to Mehryde's Meyhane and ask for suitable refreshments? "},{"name":"VARSHAHN","text":"Excellent. In the meantime, Nidhana shall watch over Zero. She is already en route. "},{"name":"VARSHAHN","text":"Let us each then tend to our respective businesses and reconvene anon."},{"name":"MEHRYDE","text":"Welcome to Mehryde's Meyhane! Please make yourself comfortable."},{"name":"MEHRYDE","text":"What? A guest of the satrap has collapsed from hunger?"},{"name":"MEHRYDE","text":"Of course I would be happy to help. You need only tell me what you desire."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Your most expensive dish, just for good measure."},{"name":"A3","text":"Something light and refreshing. Like fruit perhaps."},{"name":"A3","text":"A rich and hearty meal with plenty of meat."},{"name":"A3","text":"A modest quantity of a living mortal's aether should suffice."},{"name":"MEHRYDE","text":"While that can certainly be arranged, I fear it would be too rich for someone coming out of a long slumber."},{"name":"MEHRYDE","text":"I would recommend something gentler on the stomach, like these apples here. They're sweet, juicy, and nutritious!"},{"name":"MEHRYDE","text":"Ah yes, that would be perfect for someone coming out of a long slumber. Please take these apples with you, then. They've just come in, and I can guarantee their freshness."},{"name":"MEHRYDE","text":"While that might be perfect for an adventurer preparing to raid a treasure vault, I fear it would be too much for someone coming out of a long slumber."},{"name":"MEHRYDE","text":"I would recommend something gentler on the stomach, like these apples here. They've just come in, and I can guarantee their freshness."},{"name":"MEHRYDE","text":"Er, I'm afraid we don't serve that particular...delicacy... "},{"name":"MEHRYDE","text":"If I may, I would recommend something gentle on the stomach, like these apples here. They've just come in, and I can guarantee their freshness."},{"name":"MEHRYDE","text":"Afterwards, once your guest feels better, she's welcome to sample whatever else we can provide. Just let me know! "},{"name":"MEHRYDE","text":"Oh, this is a while ago now, but Professor Jalheen and Azahma were overjoyed to learn of your safe return from the treasure vault. And so they celebrated, and got just about every other patron involved."},{"name":"MEHRYDE","text":"Not in recent memory has the meyhane been so lively. It was all Mihleel and I could do to keep things orderly, but we too shared in their joy."},{"name":"MEGHADUTAEMPLOYEE","text":"Ah, welcome back. Lest you worry, Mistress Nidhana has been taking good care of our guest."},{"name":"MEGHADUTAEMPLOYEE","text":"Will you be joining them now?"},{"name":"SYSTEM","text":"Proceed to the Meghaduta guest chambers?"},{"name":"YSHTOLA","text":"While at the High Crucible, I spoke with the alchemists about Zero. If you require any assistance, don't hesitate to let them know. "},{"name":"ESTINIEN","text":"The Thirteenth was far colder than Thavnair. Let's hope Zero doesn't collapse again from the heat... "},{"name":"NIDHANA","text":"Should walking prove too taxing, there is always the Aethernet. She shouldn't have trouble making use of it. "},{"name":"VARSHAHN","text":"'Twas my pleasure to show you the city when first you arrived. I shall enjoy doing the same for Zero. "},{"name":"MYSTERIOUSPERSON","text":"This world is brimming with aether... I feel invigorated just standing here in the breeze."},{"name":"VARSHAHN","text":"Glad am I to hear that. So─is there any place in particular you wish to see?"},{"name":"MYSTERIOUSPERSON","text":"Hmmm..."},{"name":"MYSTERIOUSPERSON","text":"Perhaps where that food came from─apple, was it? While I don't expect I'll collapse again, it would be good to know where I can procure more if necessary."},{"name":"VARSHAHN","text":"Mehryde's Meyhane it is, then. I shall introduce you to the head waitress, Mihleel."},{"name":"SYSTEM","text":"Varshahn and Zero are now accompanying you. Keep them at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave your quest companions behind by entering a different area, or by speaking with them and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have your companions join you again, return and speak with them at the original location."},{"name":"SYSTEM","text":"What will you do?"},{"name":"SYSTEM","text":"Small talk."},{"name":"SYSTEM","text":"Part ways."},{"name":"SYSTEM","text":"Nothing."},{"name":"MYSTERIOUSPERSON","text":"While bound to Zenos, I never saw vibrant cities like this. Only ruined places, not so different from the void. "},{"name":"VARSHAHN","text":"Do you recall the time we traveled together to the outpost? Should our tour take us outside the city, we must make use of hamsa again."},{"name":"SYSTEM","text":"Are you sure you wish to part ways with your companions?"},{"name":"MYSTERIOUSPERSON","text":"Do as you will, but the condition was that you accompany me. I will return to the palace."},{"name":"VARSHAHN","text":"You have urgent business? Very well, we shall await you back at Meghaduta."},{"name":"MYSTERIOUSPERSON","text":"You're here. Good. We can set out again."},{"name":"VARSHAHN","text":"If you have concluded your business, then let us resume our tour."},{"name":"SYSTEM","text":"<span class=\"highlight\">Discuss Mehryde's Meyhane.</span>"},{"name":"MYSTERIOUSPERSON","text":"This is the place? The air is different here, and I speak not of the heat."},{"name":"MYSTERIOUSPERSON","text":"There's a texture to it─a fullness─unlike that of elsewhere."},{"name":"VARSHAHN","text":"You smell the cooking, I believe. Hannish cuisine is quite fragrant─and delicious, I hope you will agree."},{"name":"VARSHAHN","text":"We could attempt to introduce Zero to Mehryde herself, but Mihleel is more likely to be available. "},{"name":"MIHLEEL","text":"Welcome to Mehryde's Meyhane! Are you by yourself <span class=\"alternative-container\"><span class=\"alternative\">this evening</span><span class=\"alternative\">today</span></span>?"},{"name":"SYSTEM","text":"You must be accompanied by Varshahn and Zero, and have them at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"Your companions have yet to arrive. Be sure they are at your side before attempting to continue."},{"name":"MIHLEEL","text":"Welcome to Mehryde's Meyhane!"},{"name":"VARSHAHN","text":"Greetings, Mihleel, and may I introduce you to Zero. She is an esteemed guest, and I ask that you see to her meals during her stay."},{"name":"MIHLEEL","text":"Ah, yes, Mehryde has told me all! Please come to us whenever you're hungry. We'll look after you."},{"name":"VARSHAHN","text":"'Twas here that <span class=\"highlight\">Forename</span> obtained the apple."},{"name":"VARSHAHN","text":"While the palace cooks can prepare whatever you desire, 'tis certainly a quick and convenient food."},{"name":"MYSTERIOUSPERSON","text":"I'll remember it."},{"name":"MYSTERIOUSPERSON","text":"...Who are the ones there, moving their bodies about? Is it for some ritual related to eating? "},{"name":"VARSHAHN","text":"The dancers? They move their bodies to bring pleasure to those who are watching."},{"name":"VARSHAHN","text":"'Tis a form of entertainment. Part of our culture."},{"name":"MYSTERIOUSPERSON","text":"How needlessly complicated. We voidsent prefer simpler pleasures."},{"name":"VARSHAHN","text":"That may be the way of it now, but your world, too, must have had such “complicated” diversions once."},{"name":"MYSTERIOUSPERSON","text":"...I don't remember."},{"name":"VARSHAHN","text":"Well, let us move on. I propose we visit Balshahn Bazaar, where goods the world over may be found. "},{"name":"MIHLEEL","text":"Be it food, drinks, or dancers, we provide only the finest for your enjoyment!"},{"name":"MEHRYDE","text":"I'm pleased to see that His Excellency's guest is back on her feet. She is always welcome here, as are you."},{"name":"MYSTERIOUSPERSON","text":"What are all these things for? What do you do here?"},{"name":"VARSHAHN","text":"This is a marketplace─where people buy and sell goods. Since its earliest days, Radz-at-Han has served as a trading hub, and here you'll find not only local products, but wares from distant lands."},{"name":"VARSHAHN","text":"I should mention that the vendors generally only accept payment in coin or tomestones. If there is aught you desire, I shall take care of it."},{"name":"MYSTERIOUSPERSON","text":"So that's what tomestones are for... Voidsent returned with them on occasion, but I never knew their purpose."},{"name":"MYSTERIOUSPERSON","text":"They struck me as useless trinkets, and I couldn't understand your obsession with them."},{"name":"VARSHAHN","text":"On that subject, there appeared to be no shops in the Thirteenth. Do you never make bargains in which possessions are exchanged?"},{"name":"MYSTERIOUSPERSON","text":"We do, but rarely. We strike bargains when we want something done. If we desire an object, we kill whoever has it."},{"name":"VARSHAHN","text":"I see, I see. Your bargains may be likened to employment, I believe. I shall bear this in mind."},{"name":"VARSHAHN","text":"With that, let us continue on. I propose we head to the High Crucible of Al-Kimiya."},{"name":"ISU","text":"We were told the satrap has a special guest. Is she not with you?"},{"name":"ISU","text":"Why, Master Vrtra! How may we serve you this <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span>? If you're here for your vessel, I'm afraid we're still tending to it..."},{"name":"VARSHAHN","text":"No, no, there is no rush. Pray take as much time as you require, and know that I have complete faith in your work."},{"name":"VARSHAHN","text":"The High Crucible is home to the finest alchemists. They are the ones who created my bodies, and can provide you with healing as well."},{"name":"VARSHAHN","text":"Hmmm... Now that I think on it, you weren't at all surprised when I changed forms. Were you aware of my nature from the start─that I was a soul occupying a vessel not my own?"},{"name":"MYSTERIOUSPERSON","text":"It's hardly uncommon in our world. When given the chance, many shed their bodies to claim stronger ones."},{"name":"ISU","text":"Oh, you must be the rumored guest! We've been most eager to meet you!"},{"name":"ISU","text":"If you have a moment, would you care to stay for some tea? The Sisters know we'd love to hear your tales!"},{"name":"MYSTERIOUSPERSON","text":"No. I've had enough food for now, and can always obtain more without the need for inane chatter."},{"name":"VARSHAHN","text":"Now, now, no need to decline outright. I daresay you are tired, so let us save it for another time and return to Meghaduta. If aught catches your eye en route, do not hesitate to say so."},{"name":"ISU","text":"Artificial voidsent are a concept we understand well, but <span class=\"emphasis\">partial</span> voidsent─now that is something that upends our established theories! I do hope we have the chance to speak with her at length. And perform a few tests, perhaps... "},{"name":"MYSTERIOUSPERSON","text":"...Some sort of fruit? Pitiful things, though. I imagine you'd need to eat a lot to derive any satisfaction. "},{"name":"VARSHAHN","text":"These are mulberry trees. While the fruits are indeed edible, more important are the leaves, which we feed to silkworms. Without the creatures, we wouldn't have the silk to make our famous Thavnairian weave."},{"name":"VARSHAHN","text":"Furthermore, the bark of the tree also possesses medicinal properties. You would be hard-pressed to find a more useful plant."},{"name":"MYSTERIOUSPERSON","text":"Is that so... Aside from food, I wouldn't have considered any other purpose for it."},{"name":"MEHRAHD","text":"(-Familiar Boy's Voice-)&lt;gasp&gt; Master Vrtra! And <span class=\"highlight\">Forename</span> too!"},{"name":"VARSHAHN","text":"If it isn't young Mehrahd. And that must be your sister, Yahsra. Is all well at the orphanage?"},{"name":"MEHRAHD","text":"Yes, Your Excellency. The other children are very nice, and we all look out for one another."},{"name":"YAHSRA","text":"Oh, oh! Just the other day, Estinien came to see us! Everyone was really excited!"},{"name":"VARSHAHN","text":"Truly? <span class=\"emphasis\">Estinien</span> paid you a visit? "},{"name":"VARSHAHN","text":"...That is well."},{"name":"MEHRAHD","text":"Is she a new friend?"},{"name":"MYSTERIOUSPERSON","text":"Friend... You know what that is?"},{"name":"MEHRAHD","text":"What!? You mean you <span class=\"emphasis\">don't</span>!?"},{"name":"VARSHAHN","text":"She is a visitor from a faraway land, you see, and is still unfamiliar with our language."},{"name":"YAHSRA","text":"Then we'll teach you! A friend is someone you like to play with!"},{"name":"MYSTERIOUSPERSON","text":"Play with..."},{"name":"MYSTERIOUSPERSON","text":"Zenos seemed to be enjoying himself when he fought you. Is that the same thing?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"More or less."},{"name":"A2","text":"Absolutely not. "},{"name":"MYSTERIOUSPERSON","text":"I see. But...is having someone to play with so fulfilling? I still do not understand why. "},{"name":"MYSTERIOUSPERSON","text":"Then I'm no closer to understanding it."},{"name":"MYSTERIOUSPERSON","text":"Why he traversed the great expanse─why he risked life and limb...for you... "},{"name":"MYSTERIOUSPERSON","text":"...But I waste energy dwelling on such things. I am not Zenos. I stand to gain nothing by knowing his heart."},{"name":"YAHSRA","text":"I'm sorry I couldn't explain it well..."},{"name":"MYSTERIOUSPERSON","text":"There's no need to apologize. The fault is not yours, but mine for failing to make sense of your words. "},{"name":"MEHRAHD","text":"Well, we had better get back to our errand."},{"name":"YAHSRA","text":"Good-bye! It was nice meeting you!"},{"name":"VARSHAHN","text":"What is a friend? 'Tis a seemingly simple question, but the answer is anything but. Only a child, innocent and pure, could reply with nary a moment's hesitation."},{"name":"MYSTERIOUSPERSON","text":"Through Zenos, I thought I understood the ways of your world."},{"name":"MYSTERIOUSPERSON","text":"But the more I learn of it, the more I realize how little I actually know. It's all so strange─your behavior and your reasons. I find myself baffled at every turn."},{"name":"MYSTERIOUSPERSON","text":"...But the feeling is not unwelcome. I'm...learning, bit by bit. It was the right decision to join you."}],"reward":{"gil":1389},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70134]},"next":[70136]},"partials":[{"type":"npc","id":"1043848","obj":{"i":1043848,"n":"Y'shtola","l":4039,"q":1}},{"type":"npc","id":"1043857","obj":{"i":1043857,"n":"Zero","l":3707,"q":1}},{"type":"quest","id":"70134","obj":{"i":70134,"n":"Return from the Void","g":12,"l":"Zero's Domain","s":635}},{"type":"quest","id":"70136","obj":{"i":70136,"n":"Buried Memory","g":12,"l":"Radz-at-Han","s":637}}]}