{"quest":{"name":"Nowhere to Run","location":"Zero's Domain","id":70132,"patch":6.2,"sort":633,"eventIcon":71201,"issuer":1043822,"target":1043836,"genre":12,"journal":["Having given you due warning, Zero would leave you to your own devices."],"objectives":["Speak with Zero and have her accompany you.","Gather information while Zero is accompanying you.","Accompany Zero to the designated location and then speak with her.","Accompany Zero to the designated location and then speak with her again.","Search for Farfarello while Zero is accompanying you.","Speak with Ciriatto while Zero is accompanying you.","Speak with Ciriatto again while Zero is accompanying you.","Speak with Ciriatto yet again while Zero is accompanying you.","Speak with Estinien."],"dialogue":[{"name":"YSHTOLA","text":"'Tis said that a person's domain is a reflection of what abides in their heart. If true, this place may offer a glimpse into Zero's past."},{"name":"ESTINIEN","text":"The longer one lives, the more one yearns for peace. I understand why some would sequester themselves here."},{"name":"VARSHAHN","text":"'Tis quite a gathering of voidsent. I pray one among them has the knowledge we seek."},{"name":"MYSTERIOUSPERSON","text":"Consider yourselves duly warned. If you wish to go among the voidsent here, that is your choice to make."},{"name":"MYSTERIOUSPERSON","text":"All have fled from one master or another. But whether any of those masters in turn served Golbez, I do not know. You must ask them yourselves."},{"name":"MYSTERIOUSPERSON","text":"Most have traveled to your world, so it shouldn't be difficult to communicate."},{"name":"VARSHAHN","text":"We shall go about making inquiries at once. Thank you for your counsel."},{"name":"VARSHAHN","text":"Once we've learned all we can, let us reconvene at yonder plaza."},{"name":"MYSTERIOUSPERSON","text":"You're going too, of course? In which case, I shall accompany you."},{"name":"MYSTERIOUSPERSON","text":"I wish only to observe. Do not expect me to help."},{"name":"MYSTERIOUSPERSON","text":"Then it's settled. I'm ready when you are."},{"name":"YSHTOLA","text":"As you may recall, when a larger voidsent is summoned, only its soul makes the journey to the Source."},{"name":"YSHTOLA","text":"Upon its arrival, it takes possession of a host body. But during that time, what becomes of its actual body here in the Thirteenth?"},{"name":"YSHTOLA","text":"The answer to this question may give us valuable insight into cross-rift travel."},{"name":"YSHTOLA","text":"To that end, while asking after Golbez, I shall also see what the voidsent can tell me about their experiences when summoned."},{"name":"ESTINIEN","text":"If a voidsent is too weak to create its own domain, it must join with others for protection."},{"name":"ESTINIEN","text":"Alternately, it might devour them in a bid to become stronger, but in so doing risk losing its sense of self."},{"name":"ESTINIEN","text":"'Tis an unenviable struggle..."},{"name":"VARSHAHN","text":"'Twas in order to strike down the Cloud of Darkness that my sister crossed over into the void."},{"name":"VARSHAHN","text":"What befell her after she vanished into the gate? How did she become Golbez's captive? These things and more, I hope to learn..."},{"name":"MYSTERIOUSPERSON","text":"Ready? Then lead the way. I leave it to you to decide with whom you speak."},{"name":"SYSTEM","text":"Zero is now accompanying you. Keep her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Zero behind by entering a different area, or by speaking with her and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Zero accompany you again, return and speak with her at the original location."},{"name":"SYSTEM","text":"What will you do?"},{"name":"SYSTEM","text":"Small talk."},{"name":"SYSTEM","text":"Part ways with Zero."},{"name":"SYSTEM","text":"Nothing."},{"name":"MYSTERIOUSPERSON","text":"Although this is my domain, I don't make a habit of strolling about. 'Tis a strange feeling..."},{"name":"SYSTEM","text":"Are you sure you wish to part ways with Zero?"},{"name":"MYSTERIOUSPERSON","text":"You have other business? Fine. Come and find me at my abode when you've finished."},{"name":"MYSTERIOUSPERSON","text":"Finished tending to your other affairs? Then let us continue on."},{"name":"SYSTEM","text":"<span class=\"highlight\">Ask about Zero's abode.</span>"},{"name":"SYSTEM","text":"<span class=\"highlight\">Ask about the plaza.</span>"},{"name":"MYSTERIOUSPERSON","text":"I call this my abode, but spend hardly any time here. I return only for meditation."},{"name":"MYSTERIOUSPERSON","text":"While physical wounds can be healed by replenishing one's aether, you can't preserve your form if you lose sight of yourself."},{"name":"MYSTERIOUSPERSON","text":"Such is the risk inherent in consuming another's soul. It dilutes your sense of self. Alters you inside and out."},{"name":"MYSTERIOUSPERSON","text":"To guard against this, I meditate. Visualize who I am, in a place all my own."},{"name":"MYSTERIOUSPERSON","text":"This is the heart of my domain. Normally it's deserted, but you and yours have drawn everyone out."},{"name":"MYSTERIOUSPERSON","text":"I don't recall this statue, though..."},{"name":"MYSTERIOUSPERSON","text":"However it came to be here, I certainly didn't wish for it."},{"name":"VOIDSENT04596A","text":"I thought you were her prey, but they say you're her minions. Which are you?"},{"name":"VOIDSENT04596B","text":"Are you really a mortal? I've never seen a mortal before..."},{"name":"VOIDSENT04596C","text":"&lt;slurp&gt; I bet you taste good. But I can't eat you, else I'll be eaten too..."},{"name":"SYSTEM","text":"You must be accompanied by Zero and have her at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"Zero has yet to arrive. Be sure she is at your side before attempting to continue."},{"name":"VOIDSENT04596A","text":"To walk around with her like that... You're her minion, then?"},{"name":"MYSTERIOUSPERSON","text":"You know I don't take minions. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> has some questions, and I want you to answer them."},{"name":"VOIDSENT04596A","text":"Golbez? I don't know that one. Only Scathach."},{"name":"VOIDSENT04596A","text":"When she led us beyond the veil, I grew scared and fled."},{"name":"VOIDSENT04596A","text":"I've been here since. I don't know anyone else, nor do I wish to. That's all I can tell you."},{"name":"MYSTERIOUSPERSON","text":"Scathach was a powerful voidsent who ruled over a vast domain. That was a long time ago, though, so I doubt she has any connection to Golbez."},{"name":"VOIDSENT04596A","text":"I told you─I don't know anyone else, nor do I wish to. Leave me be."},{"name":"VOIDSENT04596B","text":"You're one of the mortals! Is it true? When you die over there, you <span class=\"emphasis\">really</span> die?"},{"name":"VOIDSENT04596B","text":"So it is, so it is! What brings you here, then?"},{"name":"VOIDSENT04596B","text":"Ah yes, Golbez. He seeks strong minions to grow his army, so I hear."},{"name":"VOIDSENT04596B","text":"But recently, he stopped doing that. Instead, he devours all."},{"name":"MYSTERIOUSPERSON","text":"Perhaps he's gathered enough fodder and is now intent on bolstering his own strength. A sure sign that he is about to make a move."},{"name":"VOIDSENT04596B","text":"By the way, why haven't you died already? Over there, you can do so any time, no? Don't miss your chance, or you'll end up like us."},{"name":"VOIDSENT04596C","text":"&lt;rumble&gt; Stay away from me... If you don't want to be eaten, stay away..."},{"name":"VOIDSENT04596C","text":"Golbez, Golbez... I've heard the name before."},{"name":"VOIDSENT04596C","text":"Ah, I remember! Always speaking of a great crusade. I don't know what that is, but it sounds delicious. &lt;slurp&gt;"},{"name":"MYSTERIOUSPERSON","text":"A crusade, you say? From whom did you hear this?"},{"name":"VOIDSENT04596C","text":"Farfarello. He was a minion of another minion. Went on and on about the terrible things he saw."},{"name":"MYSTERIOUSPERSON","text":"I see... Perhaps Farfarello can tell us more."},{"name":"VOIDSENT04596C","text":"Why do you want to know about Golbez? Do you have a crusade too?"},{"name":"MYSTERIOUSPERSON","text":"Satisfied with what you've learned? Ah─but let's step away before you become too tempting to resist."},{"name":"MYSTERIOUSPERSON","text":"It seems the rumors of Golbez reach even my remote domain."},{"name":"MYSTERIOUSPERSON","text":"Fair to assume he's gathering strength for his crusade─whatever that may be."},{"name":"MYSTERIOUSPERSON","text":"But I must say, I wouldn't have guessed that Farfarello once fought in Golbez's army. It's a miracle he survived serving an archfiend."},{"name":"MYSTERIOUSPERSON","text":"Ah, I suppose I should explain."},{"name":"MYSTERIOUSPERSON","text":"Farfarello is the weakest among us. Constantly in fear of being devoured, he seldom consorts with others."},{"name":"MYSTERIOUSPERSON","text":"The only one he's comfortable with is Ciriatto."},{"name":"MYSTERIOUSPERSON","text":"He's a fellow coward who runs the instant he senses a threat, and won't stop until he's exhausted."},{"name":"MYSTERIOUSPERSON","text":"When their hunger grows too intense, they feed on each other's aether. Such is their relationship."},{"name":"MYSTERIOUSPERSON","text":"But I ramble. You intend to seek out Farfarello, I presume?"},{"name":"MYSTERIOUSPERSON","text":"Then I'll come with you. He's less likely to hide that way."},{"name":"MYSTERIOUSPERSON","text":"Farfarello keeps to the fringes of my domain. This way."},{"name":"SYSTEM","text":"<span class=\"highlight\">Ask about Farfarello's hiding place.</span>"},{"name":"MYSTERIOUSPERSON","text":"The voidsent here don't answer to a master. They can do as they please."},{"name":"MYSTERIOUSPERSON","text":"But all must answer to the hunger, and seek out prey when they need aether."},{"name":"MYSTERIOUSPERSON","text":"Except Farfarello and Ciriatto, that is─they are content to take from one another. Barring an incident, they dare not venture out."},{"name":"MYSTERIOUSPERSON","text":"When he takes flight, Ciriatto will not seek shelter until he is utterly spent. Farfarello, on the other hand, prefers to hide in the same place. Come."},{"name":"FORMERMINIONVOIDSENT","text":"Uwaaaaaah! P-Please don't eat me...but I suppose you have to..."},{"name":"FORMERMINIONVOIDSENT","text":"Oh, whatever will I do now? &lt;whimper&gt;"},{"name":"MYSTERIOUSPERSON","text":"Ciriatto... This is rather unexpected. Where is Farfarello?"},{"name":"FORMERMINIONVOIDSENT","text":"&lt;gulp&gt;"},{"name":"FORMERMINIONVOIDSENT","text":"Farfarello...isn't here anymore. He's...left. Y-Yes, that's right!"},{"name":"MYSTERIOUSPERSON","text":"Left? That doesn't sound like him at all."},{"name":"FORMERMINIONVOIDSENT","text":"W-Well, he's gone, all right? Wh-What more do you want me to say?"},{"name":"MYSTERIOUSPERSON","text":"And off he flees, as he is wont to do."},{"name":"MYSTERIOUSPERSON","text":"But something about this doesn't sit well with me..."},{"name":"MYSTERIOUSPERSON","text":"What do you make of Ciriatto's behavior?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"He seemed frightened. Perhaps someone had threatened him?"},{"name":"A1","text":"I don't think he was telling the truth."},{"name":"MYSTERIOUSPERSON","text":"I doubt it. Had he been threatened, we wouldn't have found him in one place."},{"name":"MYSTERIOUSPERSON","text":"No, he would run in circles until he could run no more. That's his nature."},{"name":"MYSTERIOUSPERSON","text":"So you think so too."},{"name":"MYSTERIOUSPERSON","text":"As he says, Farfarello is gone. But that is quite unusual."},{"name":"MYSTERIOUSPERSON","text":"As is the fact that Ciriatto, who was clearly frightened by something, chose not to flee but instead hid here, where Farfarello usually─"},{"name":"MYSTERIOUSPERSON","text":"...No."},{"name":"MYSTERIOUSPERSON","text":"We must go after Ciriatto. Now."},{"name":"MYSTERIOUSPERSON","text":"I know Farfarello was our quarry, but Ciriatto's behavior troubles me. We must find him."},{"name":"FORMERMINIONVOIDSENT","text":"I-I don't have time for this... You'd best keep your distance if you know what's good for you!"},{"name":"MYSTERIOUSPERSON","text":"Ciriatto, we need to talk."},{"name":"FORMERMINIONVOIDSENT","text":"Th-There's no time! The wind rises! We must flee!"},{"name":"MYSTERIOUSPERSON","text":"The wind rises...? What is he talking about?"},{"name":"MYSTERIOUSPERSON","text":"After him."},{"name":"FORMERMINIONVOIDSENT","text":"Uwaaah, the wind howls! Louder and louder!"},{"name":"MYSTERIOUSPERSON","text":"What's gotten into you? What do you mean, the wind rises?"},{"name":"FORMERMINIONVOIDSENT","text":"When the wind rises, she comes! <span class=\"emphasis\">Barbariccia</span>!"},{"name":"MYSTERIOUSPERSON","text":"Barba...riccia? Who in the world is that?"},{"name":"FORMERMINIONVOIDSENT","text":"We must flee, all of us! There's no time!"},{"name":"MYSTERIOUSPERSON","text":"I don't sense anything, but he seems convinced."},{"name":"MYSTERIOUSPERSON","text":"It's a dead end beyond. We'll corner him."},{"name":"FORMERMINIONVOIDSENT","text":"Ahhh, it's too late! The wind is already upon us!"},{"name":"FORMERMINIONVOIDSENT","text":"We're doomed! There's nowhere to run!"},{"name":"MYSTERIOUSPERSON","text":"What are you running from?"},{"name":"FORMERMINIONVOIDSENT","text":"I-I already told you! Barbariccia, the archfiend of wind!"},{"name":"MYSTERIOUSPERSON","text":"Archfiend, you say?"},{"name":"FORMERMINIONVOIDSENT","text":"We will be devoured or forced to serve. To fight in the crusade. But it makes no difference. In the end, all are eaten by her or her enemies."},{"name":"FORMERMINIONVOIDSENT","text":"I didn't want to fight anymore. That's why I fled and came here!"},{"name":"MYSTERIOUSPERSON","text":"I see. That explains everything...almost."},{"name":"MYSTERIOUSPERSON","text":"I thought it was Farfarello who used to serve an archfiend. Not you."},{"name":"MYSTERIOUSPERSON","text":"Not you, who always ran at the first sign of trouble. You who now speak as though you were Barbariccia's minion. There's only one explanation..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"He devoured Farfarello...didn't he?"},{"name":"A2","text":"..."},{"name":"MYSTERIOUSPERSON","text":"Indeed, that would account for his uncharacteristic behavior."},{"name":"MYSTERIOUSPERSON","text":"So, is that the way of it? Did you devour Farfarello?"},{"name":"MYSTERIOUSPERSON","text":"And not just a portion of his aether, but his entire being."},{"name":"MYSTERIOUSPERSON","text":"Tell me true, Ciriatto. You devoured Farfarello, didn't you?"},{"name":"MYSTERIOUSPERSON","text":"And not just a portion of his aether, but his entire being."},{"name":"FORMERMINIONVOIDSENT","text":"...H-How did you know?"},{"name":"MYSTERIOUSPERSON","text":"It wasn't only your behavior that felt strange."},{"name":"MYSTERIOUSPERSON","text":"<span class=\"emphasis\">You</span> felt strange. As if there was more than you present. "},{"name":"MYSTERIOUSPERSON","text":"Now, I don't believe you would've lost control. More likely it was at Farfarello's behest."},{"name":"FORMERMINIONVOIDSENT","text":"I can't hide anything from you..."},{"name":"FORMERMINIONVOIDSENT","text":"I admit it. Farfarello didn't leave. I ate him."},{"name":"FORMERMINIONVOIDSENT","text":"He feared Barbariccia more than anything. Hated the endless fighting."},{"name":"FORMERMINIONVOIDSENT","text":"So he begged me to devour him, that he would never have to fight again."},{"name":"MYSTERIOUSPERSON","text":"Rather than an eternity of fighting, he chose a moment of pain..."},{"name":"FORMERMINIONVOIDSENT","text":"For all the good it did. I can still hear his voice in my head. He's frightened, so very frightened..."},{"name":"MYSTERIOUSPERSON","text":"When you're eaten, your essence is blended with that of your devourer. And though you have no control, your consciousness in part endures."},{"name":"MYSTERIOUSPERSON","text":"Were this a world where the wheel of life and death still turned, the soul wouldn't linger so stubbornly."},{"name":"MYSTERIOUSPERSON","text":"In time, it would return to the great flow."},{"name":"MYSTERIOUSPERSON","text":"But there's no such end here. No escape. All know this. In making his choice, Farfarello must have been desperate indeed."},{"name":"MYSTERIOUSPERSON","text":"And now that desperation has joined with Ciriatto's fear, driving him to act erratically."},{"name":"FORMERMINIONVOIDSENT","text":"This place will become a battlefield. We don't want to be eaten. Neither me nor Farfarello. But there's nowhere to go! Nowhere!"},{"name":"MYSTERIOUSPERSON","text":"Then tell me about Barbariccia. I would know who it is we face."},{"name":"FORMERMINIONVOIDSENT","text":"It's too late. She's as good as here, and no one can escape her winds! No one!"},{"name":"YSHTOLA","text":"What little I learned in your absence did not pertain to the archfiends. That discussion can wait until after we've tended to Barbariccia."},{"name":"VARSHAHN","text":"Just you wait, Barbariccia. I will have answers from you yet..."},{"name":"MYSTERIOUSPERSON","text":"I have no intention of demanding anyone's aether until afterwards. Weakening you now would only reduce my chances of getting paid."},{"name":"ESTINIEN","text":"The less time we give the enemy to prepare, the better. If everyone is ready, then let us set forth."},{"name":"VARSHAHN","text":"Indeed. And yet...my heart weighs heavy for those Barbariccia struck down. Were it not for us, she would not have come here."},{"name":"VARSHAHN","text":"Should you require a moment, Zero..."},{"name":"MYSTERIOUSPERSON","text":"For what? Barbariccia took what she could. She was wise to strike quickly─as we would be."},{"name":"ESTINIEN","text":"Agreed. This is no time for sentiment. Only the battle matters now."}],"reward":{"gil":1605,"items":[{"id":33917,"one":1},{"id":33921,"one":1},{"id":33928,"one":1},{"id":33929,"one":1}]},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70131]},"next":[70133]},"partials":[{"type":"npc","id":"1043822","obj":{"i":1043822,"n":"Zero","l":4038,"q":2}},{"type":"npc","id":"1043836","obj":{"i":1043836,"n":"Estinien","l":4038,"q":1}},{"type":"item","id":"33917","obj":{"i":33917,"n":"Piety Materia IX","l":560,"c":20281,"t":58,"materia":{"tier":8,"value":12,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"item","id":"33921","obj":{"i":33921,"n":"Battledance Materia IX","l":560,"c":20281,"t":58,"materia":{"tier":8,"value":12,"attr":"Tenacity","category":0}}},{"type":"item","id":"33928","obj":{"i":33928,"n":"Quickarm Materia IX","l":560,"c":20282,"t":58,"materia":{"tier":8,"value":12,"attr":"Skill Speed","category":0}}},{"type":"item","id":"33929","obj":{"i":33929,"n":"Quicktongue Materia IX","l":560,"c":20282,"t":58,"materia":{"tier":8,"value":12,"attr":"Spell Speed","category":0}}},{"type":"quest","id":"70131","obj":{"i":70131,"n":"Groping in the Dark","g":12,"l":"Troia Keep","s":632}},{"type":"quest","id":"70133","obj":{"i":70133,"n":"The Wind Rises","g":12,"l":"Zero's Domain","s":634}}]}