{"quest":{"name":"The Restaurateur's Guide to the Dragonstar","location":"Ultima Thule","id":70140,"patch":6.25,"sort":4,"icon":101190,"beast":16,"unlocksFunction":1,"eventIcon":71341,"issuer":1043951,"target":1043951,"genre":30,"journal":["Last Dregs management would discuss the further development of your business plan.<br>※The difficulty of this quest will be synced to your current level.","N-7000 and Jammingway are pleased to report that the Miw Miisv seem as happy as giant jellyfish from the sea of stars can possibly be─which is to say, quite. With the aim of experiencing the lively air these young creatures have imparted to the Last Dregs, you agree to accompany your fellow managers on their rounds.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You find the Last Dregs bustling but not overcrowded, leading to the inevitable proposal that you procure yet more patrons. Ever overflowing with ideas, Jammingway asserts that the dragons would be prime candidates. Though N-7000 expresses strong reservations given its civilization's role in the Dragonstar's untimely end, it is eventually convinced to make contact in the name of a better future for all involved.","You proceed to Reah Tahra, where Jammingway attempts to hail a representative of the Dragonstar. Though they do eventually succeed in this first step, it quickly becomes clear that your allied units will struggle to generate interest in the Last Dregs─or any feeling at all─due to the dragons' utter emotional exhaustion from having spent eons in mourning. Upon discussion, it is agreed that a dragon of more agreeable disposition might provide ideas on raising her kin from their dead-eyed torpor, so you make ready to return to Etheirys and consult with wise Vidofnir.","Though she is aware of her people's history with the invaders from the Alphatron Star, Vidofnir elects to concern herself with the welfare of her fellow dragons rather than ancient grudges. She explains to your party that the sacred peaks of the Dragonstar once evoked such bittersweet nostalgia in Midgardsormr that he chose his brood's new home by the look of its mountains─the peak now known as Sohm Al first among them─and suggests you attempt to stir her lost kin's memories of the same. Fortunately, there is a Coerthan dessert that may do just that.","Armed with the knowledge of which terrestrial resources once brought a nostalgic tear to Midgardsormr's eye, you gather the perfect ingredients near Anyx Trine, and set about making a confectioner's Sohm Al. Though your guest from Reah Tahra is reluctant at first, the sight of the dessert recalls memories of the Dragonstar's mountains that resonate to his very core, filling him with wistful fondness. Indeed, he soon wishes to bring other dragons to the Last Dregs for a similar experience, and reassures N-7000 that this will not mean the resuming of hostilities─for what is past is long, long past.","Alongside your allies, you venture to Elysion, a portion of which has now been transformed into a vision of the Dragonstar. Peaks tower over a clutch of eggs, and hope that dragons may soon coast upon the breeze reigns. Apparently more affected by N-7000's previous statements than they let on, Jammingway takes this success as an opportunity to remind the unit of its life's worth, and its power to bring about change─scientific limitations be damned."],"objectives":["Speak with Jammingway.","Speak with N-7000.","Speak with Vidofnir at Anyx Trine.","<span class=\"alternative-container\"><span class=\"alternative\">Mine [Error] southwest of Anyx Trine</span><span class=\"alternative\">Deliver [Error] to N-7000</span><span class=\"alternative\">Gather [Error] northeast of Anyx Trine</span><span class=\"alternative\">Catch [Error] at the Iron Feast</span></span>.","Speak with N-7000 in A-4 Research."],"dialogue":[{"name":"N7000","text":"&lt;whirr&gt; Miw Miisv status: thriving. According to recent scans, the Ea also emit pleased vibrations."},{"name":"JAMMINGWAY","text":"They aren't the only ones! Members of quite a few civilizations have been enjoying watching the Miw Miisv frolic, and customer satisfaction has risen accordingly."},{"name":"JAMMINGWAY","text":"On that note─it is just about time for our regular rounds at the café. Care to join?"},{"name":"Q5","text":"Travel to the Last Dregs?"},{"name":"N7000","text":"Café status: bustling. Installation of additional seating recommended."},{"name":"JAMMINGWAY","text":"As you can see, the Last Dregs is now patronized by entities of all ages─and we have expanded our beverage range to accommodate both the young and the very, very old accordingly."},{"name":"N7000","text":"Now that the Miw Miisv and the Ea have settled in, the timing to introduce new patrons is optimal."},{"name":"JAMMINGWAY","text":"As a matter of fact, I was just thinking the same!"},{"name":"JAMMINGWAY","text":"We've had such good luck with the Ea, it only seems natural that we invite the dragons next. They too are residents of Ultima Thule, after all."},{"name":"N7000","text":"&lt;whirr&gt; Shall this unit scan your cranial cavern for irregularities? We Omicrons are the dragons' mortal enemies─they would not willingly break bread or any other substance with us. Projections indicate they may be traumatized by the very suggestion."},{"name":"JAMMINGWAY","text":"Are you worried about them? How endearing!"},{"name":"JAMMINGWAY","text":"Yet if Ultima Thule is to move forward, its people cannot remain mired in the conflicts of the past. It would befoul the dynamis, for one thing, and bugger up our hard work. You must learn to live in harmony!"},{"name":"N7000","text":"&lt;whirr&gt; Acknowledged...but this unit will excuse itself from promotional efforts. The probability of the Dragonstar's life-forms reacting adversely to Omicron presence in their territory exceeds acceptable parameters."},{"name":"JAMMINGWAY","text":"Parameters, shmarameters. It may be risky, but if the dragons are to believe that the Omicrons have turned over a new leaf, I can think of no better ambassador."},{"name":"JAMMINGWAY","text":"You may not be able to rewind time and un-conquer the Dragonstar, but you can certainly strive to do better in the future we're creating. Dynamis makes the impossible possible─you said so yourself!"},{"name":"N7000","text":"...Encouragement tentatively internalized. This unit will attempt to serve as an ambassador for peace."},{"name":"JAMMINGWAY","text":"Then it is off to Reah Tahra we go!"},{"name":"JAMMINGWAY","text":"Good perpetual evening, good sir, madam, or other! Can I interest you in a hot cup of coffee?"},{"name":"NIBIRAENOMI","text":"The mournful dirge that echoes through this place is pleasing to the ear. Why do some of these individuals still rage against their fate?"},{"name":"DRAGONOMI","text":"......"},{"name":"N7000","text":"This unit has detected an additional hurdle to fulfilling the current objective."},{"name":"JAMMINGWAY","text":"Excuse me! Can I interest you in, er...anything? Anything at all!?"},{"name":"JAMMINGWAY","text":"Hello!? Ignoring me won't make me go away!"},{"name":"DRAGONOMI","text":"...I wondered how a tuft of floss did come to clamor so, but 'tis no more than one of thy strange companions. This explaineth much."},{"name":"DRAGONOMI","text":"Wilt thou not leave me to my slumber? So long have I been weary..."},{"name":"JAMMINGWAY","text":"We have just the thing for that─coffee! Delectable cuisine, as well. Why not stop by the Last Dregs and see what the civilizations of Ultima Thule are raving about?"},{"name":"JAMMINGWAY","text":"I realize that you may have complicated feelings about my Omicron friend here, but we would nevertheless offer you a place to eat, drink, and be merry!"},{"name":"DRAGONOMI","text":"Art thou attempting to provoke me...? Though I suppose it matters not."},{"name":"DRAGONOMI","text":"Neither grief nor hate stir within me, for my flame hath long since flickered and died."},{"name":"N7000","text":"&lt;whirr&gt; The news that you do not wish to inflict vengeful obliteration upon the Alphatron Star should be welcome. However, this unit finds it unexpectedly difficult to process."},{"name":"N7000","text":"Are you certain you do not desire revenge? Not even a micron? It may be advisable to gnaw on this unit in the name of experimentation, lest your conclusion be premature."},{"name":"DRAGONOMI","text":"To what end? The destruction of a single machine changeth naught─meaneth naught."},{"name":"DRAGONOMI","text":"Aye, we dragons once reveled as thou wouldst have me do. In the mountain's shadow did we gather to sing. Yet even our melodies are naught but memory now..."},{"name":"DRAGONOMI","text":"If I no longer weep for the silence, machine, why dost thou believe I have aught to spare for thee?"},{"name":"N7000","text":"&lt;whirr&gt; Conversational difficulty levels critical. This unit requests permission to retreat."},{"name":"JAMMINGWAY","text":"Not so fast! The Karellians' apocalyptic aggression didn't stop us, and neither will this dragon's depression."},{"name":"JAMMINGWAY","text":"All of our patrons have needed a little help in learning to hope again. It's just a matter of discerning what they value and how to provide it."},{"name":"JAMMINGWAY","text":"Fortunately, we have the great <span class=\"highlight\">Forename</span> at our side! I've heard tell that you have no little experience treating with dragons."},{"name":"JAMMINGWAY","text":"And though the dragons here may not recall their passions, if the Dragonsong War is any indication, their brethren on Etheirys possess no such problem."},{"name":"JAMMINGWAY","text":"Surely there is at least one dragon of your acquaintance with whom we can consult?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Vrtra will explain in terms we can understand."},{"name":"A1","text":"Vidofnir is wise, and has been kind to me."},{"name":"JAMMINGWAY","text":"Vrtra!? Satrap of Radz-at-Han? Oh, no, I wouldn't dream of calling him away from his work for this."},{"name":"JAMMINGWAY","text":"Vidofnir it is, then. As a leader of her people and an arbiter of peace, she must have some advice about disagreeable dragons."},{"name":"JAMMINGWAY","text":"And she doesn't sound like the sort to let her elders on the Dragonstar wallow for eternity."},{"name":"N7000","text":"Etheirys's historical records are not registered to this unit's database, but the proposed course sounds logical as described."},{"name":"N7000","text":"It is statistically probable that they will not welcome assistance from a former enemy...but this unit believes that we must restore hope to dragonkind."},{"name":"JAMMINGWAY","text":"Then it's decided. Do we need to pack chassis wax or anything?"},{"name":"N7000","text":"This unit must remain in Ultima Thule to ensure the smooth operation of the Last Dregs while allied life-forms are away. However, a portable communications drone can be dispatched for the journey."},{"name":"JAMMINGWAY","text":"How convenient! Let us make for Anyx Trine posthaste!"},{"name":"DRAGONOMI","text":"Would that I could recall the feel of the mountain breeze...but even that lieth beyond my power now."},{"name":"N7000","text":"Communications network fully operational. This unit will ensure that customer experience remains optimal in your absence, and wishes you a pleasant traversal of space."},{"name":"VIDOFNIR","text":"Dost thou ever rest, Little One? Thou hast brought salvation to the star, yet thy countenance bespeaks a mission."},{"name":"VIDOFNIR","text":"The will of the star hath blessed thee with charming companions."},{"name":"VIDOFNIR","text":"Yet to think I should meet one of the “machines” that drove my grandsire from the Dragonstar... 'Tis like unto a bedtime fable."},{"name":"VIDOFNIR","text":"Fear not, for I shall not rebuke thee. Thou wouldst not be the first to call an old foe “friend”..."},{"name":"VIDOFNIR","text":"'Tis the fate of the dragons that concerneth me. To condemn them to an empty existence forevermore would be cruel indeed."},{"name":"N7000","text":"This unit did not expect to find you so...pleasant? Alive? It is difficult to locate the proper lexical data."},{"name":"N7000","text":"Jammingway shared much data about the dragons of Etheirys during the journey, but this unit struggles to process that those who embrace an ageless existence upon this star are of the same species as the life-forms we encountered in Ultima Thule."},{"name":"N7000","text":"Your dragons too faced countless battles and great suffering, yet they emerged whole. This unit wonders how much can be attributed to faith in their allied units, and how much to the resilience of their hope─or if these two variables are one and the same."},{"name":"JAMMINGWAY","text":"...Which brings us back to our purpose here. Is there anything we can say to the dragons of Ultima Thule that might open their hearts to embrace hope once more?"},{"name":"VIDOFNIR","text":"My sire, Hraesvelgr, oft spoke of Midgardsormr's tales of the Dragonstar, for from these memories was our Sohm Al born."},{"name":"VIDOFNIR","text":"'Tis mine understanding that the Dragonstar possessed a sacred peak resplendent, and 'twas my grandsire's longing for its heights that drew him to nest upon Etheirys."},{"name":"VIDOFNIR","text":"Mine ancestors doubtless felt its loss as keenly, yet their despair hath given way to exhaustion. The memory 'tis but a dull ache in their hearts."},{"name":"VIDOFNIR","text":"Restore to them memory untainted by bitterness, and they may yet be inspired as my grandsire once was. Words, however, shall not suffice."},{"name":"JAMMINGWAY","text":"If not words, what about taste? We've managed to evoke joyful recollections via soup before─surely we can do the same for the dragons."},{"name":"N7000","text":"Previous customer data supports this hypothesis."},{"name":"N7000","text":"However, dragons do not possess a culinary tradition as such. As with the Grebuloffs, we must think outside standard parameters."},{"name":"JAMMINGWAY","text":"Oh, I believe I have precisely what we need."},{"name":"JAMMINGWAY","text":"Among the recipes provided to us by our Sharlayan collaborators is one from Ishgard─a dessert resembling Sohm Al! If that's not outside standard parameters, I don't know what is."},{"name":"VIDOFNIR","text":"A curious proposal, but thou art welcome to attempt it."},{"name":"VIDOFNIR","text":"Southwest of Anyx Trine lie lustrous minerals, their sheen not unlike those of the Dragonstar's peaks. Collect them with my blessing."},{"name":"VIDOFNIR","text":"My grandsire once spoke of the pale blossoms northeast of Anyx Trine as like unto those of the Dragonstar's valleys. Collect them with my blessing."},{"name":"VIDOFNIR","text":"My grandsire once spoke of an iridescent fish in the Iron Feast, its scales a shade identical to the Dragonstar's holy peak."},{"name":"VIDOFNIR","text":"Collect one with my blessing─I am told they subsist upon roe."},{"name":"N7000","text":"This unit reminds you that all proceeds from gold salmon roe─available perpetually in A-4 Research─will be directed toward Omicron enhancement initiatives."},{"name":"JAMMINGWAY","text":"It sounds like we shall be gazing upon a resplendent─and edible─peak in no time!"},{"name":"N7000","text":"This unit requests that you return to the Last Dregs before initiating baking protocols. The utility of this drone's tiny digits is limited."},{"name":"VIDOFNIR","text":"Thou art truly a warrior of warriors, yet much else besides..."},{"name":"JAMMINGWAY","text":"We do strive to make our dishes visually appealing, but this will be our greatest challenge yet! I do hope the dragons appreciate it..."},{"name":"N7000","text":"Drone battery low. This unit has returned it to the charging station despite Jammingway's protests."},{"name":"N7000","text":"Ingredients consistent with Dragonstar environmental records. Please initiate baking protocols."},{"name":"JAMMINGWAY","text":"Consider them initiated. Dessert is go!"},{"name":"DRAGONOMI","text":"Remember, machine─'tis only at the purported request of my kin across the expanse that I humor thee. Do not test my patience overlong."},{"name":"JAMMINGWAY","text":"We wouldn't dream of it! Now, if you'll come this way..."},{"name":"DRAGONOMI","text":"...Thy tiny hands wrought this for my sake?"},{"name":"JAMMINGWAY","text":"Yes! <span class=\"highlight\">Forename</span>'s less-tiny hands and N-7000's spinny whatsits also helped. We worked hard to make it as much like the holy peak of the Dragonstar as possible."},{"name":"JAMMINGWAY","text":"Do you... Do you like it?"},{"name":"DRAGONOMI","text":"......"},{"name":"DRAGONOMI","text":"...'Tis difficult to say. My palate recalleth not what flavors once appealed. Visually, however..."},{"name":"DRAGONOMI","text":"I see it. The peaks dividing the Dragonstar in twain, bright clouds to shroud them..."},{"name":"DRAGONOMI","text":"I feel the wind upon my scales, and I...remember."},{"name":"DRAGONOMI","text":"A passing strange place, this... Yet for the newfound bond with my distant kin, and these memories gifted unto me, I am grateful."},{"name":"DRAGONOMI","text":"The gesture hath touched me─of that, be certain."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Do you feel a bit better now?"},{"name":"A2","text":"It's all right to miss home. Everyone does, sometimes."},{"name":"DRAGONOMI","text":"Indeed. How beautiful it was, our Dragonstar. How joyfully its winds did brace our wings..."},{"name":"DRAGONOMI","text":"I should like my kin to remember those days. No longer to mourn them, but dream of them once more..."},{"name":"N7000","text":"This unit is pleased to hear of your spiritual revival."},{"name":"N7000","text":"However, it would be remiss of this unit not to remind you that our establishment employs a large Omicron staff. Your kin would be most welcome to join you, but would this not be intolerable to them?"},{"name":"DRAGONOMI","text":"Metal warrior... Thou art not the same as thou once were. No more are we. I know not what to make of this future, but I would linger no longer in the past."},{"name":"DRAGONOMI","text":"That is why you created this place, is it not?"},{"name":"N7000","text":"&lt;whirr&gt; Logic circuits: complete. Threat level: nominal. Business status: booming."},{"name":"N7000","text":"However, this unit is experiencing an anomalous overflow. Conditions mathematically insufficient to generate current levels of mission satisfaction. Further analysis required. Initializing additional processors..."},{"name":"JAMMINGWAY","text":"Are you sure you aren't just...happy? You know, like a squishy-wishy organic life-form?"},{"name":"N7000","text":"An illogical life-form such as yourself could not begin to understand this unit's internal workings. Terminating interaction─good-bye."},{"name":"JAMMINGWAY","text":"Don't you dare go into sleep mode! Coward!"},{"name":"JAMMINGWAY","text":"We cannot let N-7000's emotional disfunction detract from our success. To Elysion! We'll drag it there if we must."},{"name":"Q4","text":"Travel to A-4 Research?"},{"name":"JAMMINGWAY","text":"I'm happy, you're happy, the dragon is happy... There's nothing anomalous about being happy!"},{"name":"N7000","text":"&lt;whirr&gt; Please refrain from vibrating your vocal organs. This unit will continue processing anomalous satisfaction levels once Elysion status has been verified."},{"name":"DRAGONOMI","text":"I do hope that winds bless yonder peak..."},{"name":"SYSTEM","text":"Inspiration has touched the dragons' hearts, and given form to a nostalgic vista from the Dragonstar."},{"name":"SYSTEM","text":"Yet still there is room for Elysion to grow and change! What other hopes will the power of dynamis bring to life?"},{"name":"JAMMINGWAY","text":"What a majestic sight that was. And so pointy!"},{"name":"N7000","text":"&lt;whirr&gt; Harmony between dragons and Omicrons defies any and all prior projections. "},{"name":"JAMMINGWAY","text":"A rousing success, then!"},{"name":"N7000","text":"Given historical events, it should not be possible per the laws of the universe. Only in Ultima Thule could such a thing occur."},{"name":"JAMMINGWAY","text":"In that case, I'd better not hear you question our potential ever again! This is definitive proof that we can do anything if we put our minds to it, no matter what your projections say."},{"name":"JAMMINGWAY","text":"I was created by someone too, you know? But I don't believe that being artificial makes our experiences any less worthwhile. We're here, and we're making a difference! Have a little faith─that's what living is all about."},{"name":"N7000","text":"...This unit did not realize that you were plagued by similar existential doubts, though it does explain your desire to pry into psyches you do not understand. Nevertheless, this unit will produce noises of generalized validation."},{"name":"JAMMINGWAY","text":"Well...good! We've created a miracle here today─as well as new bonds between dragonkind that span time and space. I propose we bask in that glory for a while!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Honored</span> reputation with the staff and patrons of the Last Dregs."},{"name":"SYSTEM","text":"New Omicron tribal daily quests are now available from Stigma-4 at A-4 Research."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Stigma-4 as a reputation bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Stigma-4. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from Omicron N-0598."}],"reward":{"gil":1135},"reqs":{"beastrank":5,"jobs":[{"lvl":80,"id":32}],"quests":[70139]},"next":[70141]},"partials":[{"type":"npc","id":"1043951","obj":{"i":1043951,"n":"N-7000","l":3712,"q":5}},{"type":"quest","id":"70139","obj":{"i":70139,"n":"And Another Question...","g":30,"l":"Ultima Thule","s":3,"f":1}},{"type":"quest","id":"70141","obj":{"i":70141,"n":"Mostly Heartless","g":30,"l":"Ultima Thule","s":5,"f":1}}]}