{"quest":{"name":"A Fertile Blend","location":"Ultima Thule","id":70148,"patch":6.25,"sort":106,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["Stigma-4 requires someone capable of great speed.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested goods to Stigma-4."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine [Error] in Ostrakon Deka-okto.</span><span class=\"alternative\">Deliver [Error] to Stigma-4.</span><span class=\"alternative\">Gather [Error] south of the vitrified fort.</span><span class=\"alternative\">Catch [Error] in the abode of the Ea.</span></span>"],"dialogue":[{"name":"STIGMA4","text":"Commencing regularly scheduled analysis of Karellian agricultural endeavors. You are requested to stand by while process completes and your task is assigned..."},{"name":"STIGMA4","text":"&lt;ping&gt; Analysis concludes that improvements to Karellian fertilizer by means of alien matter may result in higher crop yields. For this task, we require the aid of the most efficient errand organism in the immediate vicinity: you."},{"name":"STIGMA4","text":"Obtain nutrient-rich ore from Ostrakon Deka-okto. Approximate coordinates: 9, 33, 0. Consider this mission to be top priority."},{"name":"STIGMA4","text":"Obtain carpet-like grass from the vitrified fort. Approximate coordinates: 22, 35, 0. Consider this mission to be top priority."},{"name":"STIGMA4","text":"Obtain tiny aquatic organisms from the abode of the Ea. Approximate coordinates: 22, 7, 2. Use gold salmon roe as bait for the highest probability of success. Consider this mission to be top priority."},{"name":"STIGMA4","text":"Rest is not the recommended state of motion for this mission. Travel to Ostrakon Deka-okto and return with nutrient-rich ore."},{"name":"STIGMA4","text":"Rest is not the recommended state of motion for this mission. Travel to the vitrified fort and return with carpet-like grass."},{"name":"STIGMA4","text":"Rest is not the recommended state of motion for this mission. Travel to the abode of the Ea and return with tiny aquatic organisms. The use of gold salmon roe as bait will provide efficient and successful results."},{"name":"STIGMA4","text":"Return of allied errand organism confirmed well within acceptable time frame. Assuming it has brought the requested materials."},{"name":"STIGMA4","text":"Analyzing delivery... Fertilizer created with the incorporation of these materials is projected to improve agricultural yield by approximately 14.2%."},{"name":"STIGMA4","text":"Fertilizer preparation, application to fields, and retrieval of increased harvest is predicted to require a 23.6% increase in Karellian labor time. Overwork deemed an acceptable compromise."},{"name":"STIGMA4","text":"Your conduct in this mission deserves high commendation. Receive your compensation with pride."}],"reward":{"gil":655,"reputation":60,"items":[{"id":37854},{"id":6141}]},"reqs":{"beastrank":3,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}