{"quest":{"name":"Coffee Talk","location":"Ultima Thule","id":70144,"patch":6.25,"sort":102,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["Stigma-4 has an urgent message to convey.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["With the chat mode in <span class=\"highlight\">Say</span>, enter any phrase containing “coffee break” to get the attention of the Karellians.","Report to Stigma-4."],"dialogue":[{"name":"STIGMA4","text":"Alert: Request received from interminably shrill manager demanding Karellian patronage."},{"name":"STIGMA4","text":"Organic life-forms require regular intake of fluids to maintain vital functions, so the recommended course of action is to ask them to meet their basic needs at the Last Dregs."},{"name":"STIGMA4","text":"However, as Karellian brains are incapable of receiving communication via electronic waves, we must rely on less efficient means: you. Travel to Elysion and manipulate your vocal aperture to suggest that the Karellians visit our establishment for a coffee break."},{"name":"KARELEANA04608","text":"A farmer's work never ceases. The quality of the soil, the composition of the fertilizer, and maintenance are but a few of the countless problems we must tackle daily. Have you come to help?"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase containing the words “coffee break” to call out to the Karellian."},{"name":"KARELEANA04608","text":"A break? Well, it has been some time since I've had a proper rest. Life of a farmer, and all."},{"name":"KARELEANA04608","text":"Ah, speaking of which─did you invite that scoundrel from the Freedom Fighters? Not that I care what his business is, but he's been working as tirelessly as I, if not more so. It wouldn't do either of us any good if he keeled over suddenly."},{"name":"KARELEANA04608","text":"I must admit, at first I had my reservations about working alongside my sworn enemy. Yet in our time working in the fields together, our scythes swinging almost in unison, the animosities of the past seem to melt away..."},{"name":"KARELEANA04608","text":"...Anyway, you say there are beverages at the Last Dregs? I could certainly use a drink, so I shall be there shortly."},{"name":"KARELEANB04608","text":"......"},{"name":"SYSTEM","text":"The Karellian attends to his work in silence, paying you no heed."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase containing the words “coffee break” to call out to the Karellian."},{"name":"KARELEANB04608","text":"Huh? Oh, apologies, I didn't notice you there."},{"name":"KARELEANB04608","text":"Coffee, you say? Well, now that I've taken pause, I can feel the countless hours of labor in my limbs and back most keenly. I could do well with a sit and a drink."},{"name":"KARELEANB04608","text":"By the way, have you invited that tyrant from the Global Community? Not that I care if he works himself to an early grave, but it would have consequences to the work we've started here."},{"name":"KARELEANB04608","text":"I won't forget the family and friends his ilk have murdered in cold blood, but so long as we till the same fields, it would serve us both to look after the health of the other."},{"name":"KARELEANB04608","text":"Our job is taxing enough with two people, let alone one. I'll be at the Last Dregs forthwith─and thank you for the invitation."},{"name":"STIGMA4","text":"Return of allied life-form <span class=\"highlight\">Forename</span> confirmed. Transmission speed of message via manual conveyance, while slower than electronic transmission, is judged as satisfactory."},{"name":"STIGMA4","text":"It is difficult to determine whether the Karellians will erupt into open hostilities or are simply performing some manner of unique mating ritual. Please provide organic insight into this matter so that potential issues may be identified and summarily dispatched."},{"name":"STIGMA4","text":"Analyzing report... Disparity in ethical values between the two workers does not pose any immediate danger to the greater cause. This concludes your duty─receive your compensation and await further work orders."},{"name":"SAYTODO","text":"coffee break"}],"reward":{"gil":655,"reputation":60,"items":[{"id":37854}]},"reqs":{"beastrank":3,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}}]}