{"quest":{"name":"Well Below Standard","location":"Ultima Thule","id":70145,"patch":6.25,"sort":103,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["Stigma-4 requires materials for regularly scheduled environmental analysis.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested items to Stigma-4."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine [Error] south of the wellspring of regret.</span><span class=\"alternative\">Deliver [Error] to Stigma-4.</span><span class=\"alternative\">Gather [Error] south of the wellspring of regret.</span><span class=\"alternative\">Catch [Error] in the wellspring of regret.</span></span>"],"dialogue":[{"name":"STIGMA4","text":"In accordance with protocol introduced by the flea-infested manager, the Last Dregs' water supply is currently sourced directly from the wellspring of regret."},{"name":"STIGMA4","text":"As organic life-forms have a tendency to succumb to even minor environmental fluctuations, regular analysis and maintenance of the water supply is imperative to prevent widespread demise of café patrons."},{"name":"STIGMA4","text":"Appropriate sample for analysis detected. Approximate coordinates: 13, 16, 2. Harmful agents can seep into solid stone, indicating current levels of environmental toxicity. Speedy completion of task objectives is highly recommended."},{"name":"STIGMA4","text":"Appropriate sample for analysis detected. Approximate coordinates: 13, 14, 2. Harmful agents often seep into the soil, indicating current levels of environmental toxicity. Speedy completion of task objectives is highly recommended."},{"name":"STIGMA4","text":"Appropriate sample for analysis detected. Approximate coordinates: 14, 11, 2. Resident fauna can be analyzed for harmful agents, indicating current levels of toxicity. Gold salmon roe, available for purchase from N–0598, is estimated to further expediency of completing task objectives."},{"name":"STIGMA4","text":"Repeating task objectives: proceed to coordinates 13, 16, 2 and obtain requested sample. Every idle moment exacerbates potential corruption of the Last Dregs' water supply."},{"name":"STIGMA4","text":"Repeating task objectives: proceed to coordinates 13, 14, 2 and obtain requested sample. Every idle moment exacerbates potential corruption of the Last Dregs' water supply."},{"name":"STIGMA4","text":"Repeating task objectives: purchase gold salmon roe from N-0598, proceed to coordinates 14, 11, 2, and obtain requested fish. Every idle moment exacerbates potential corruption of the Last Dregs' water supply."},{"name":"STIGMA4","text":"Return of allied courier <span class=\"highlight\">Forename</span> confirmed. Requesting detailed report with deliverables."},{"name":"STIGMA4","text":"Analyzing delivered materials... In accordance with pan-galactic sanitation standards, the purity level of the water source has received a grade of B."},{"name":"STIGMA4","text":"In contrast, Alphatron water can be instantly synthesized to exceed a grade of A by all accepted standards. The foul-smelling manager's insistence on “natural” water is conclusively illogical."},{"name":"STIGMA4","text":"However, so long as its provision does not hinder current work objectives, B-grade water meets minimum safety standards. Receive your recompense for this task and await future instructions, perhaps while imbibing some technically nontoxic liquids."}],"reward":{"gil":575,"reputation":60,"items":[{"id":37854},{"id":6141}]},"reqs":{"beastrank":3,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}