{"quest":{"name":"The Hunger Pangs","location":"Ultima Thule","id":70149,"patch":6.25,"sort":107,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["Stigma-4 requires a swift pair of legs for an urgent delivery.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Deliver the packed meals to the Karellians patrolling the wellspring of regret.","Report to Stigma-4."],"dialogue":[{"name":"STIGMA4","text":"Task log indicates pending request for <span class=\"highlight\">Forename</span>. Karellians patrolling the wellspring of regret require the delivery of sustenance."},{"name":"STIGMA4","text":"Depletion of nutrients in the biological vessel directly correlates to emotional instability, which is statistically proven as the source of psychological warfare, physical altercations, and/or severe grumpiness. Current trajectory classified as “untenable.” Proceed with caution and haste."},{"name":"KARELEANA04613","text":"What is it? Make it quick─patrolling requires the utmost concentration, you know."},{"name":"KARELEANA04613","text":"Food? For me? Why, how unexpected... Truth be told, my patrols so far have been an exercise in battling off pangs of boredom and hunger in equal measure. This, at least, shall help with the latter."},{"name":"KARELEANA04613","text":"While you're here, might not you do something about that layabout Freedom Fighter? I've noticed a number of careless errors in his work. If I am expected to work alongside his kind, it is only right that he be held to the same standard of diligence, empty stomach notwithstanding."},{"name":"KARELEANA04613","text":"...Ah, but perhaps it is best not to think about work until after I've eaten this gift. So quickly does one's mood turn dark without sustenance. You have my thanks."},{"name":"KARELEANB04613","text":"Oh, it's you. I don't suppose you've come to help me with my work?"},{"name":"KARELEANB04613","text":"This...this is food! I'm so hungry the rocks and dirt were beginning to look like freshly baked bread and powdered sugar. Thank you for this bounty!"},{"name":"KARELEANB04613","text":"Speaking of which, you haven't seen that would-be taskmaster from the Global Community around, have you? He criticizes me upon every opportunity─not a surprise for someone of his stripe, but my ears may well bleed from the abuse..."},{"name":"KARELEANB04613","text":"...Still, little use wondering why villains will be vile when there's a meal to be had. Now, I feast!"},{"name":"STIGMA4","text":"Return of <span class=\"highlight\">Forename</span> confirmed. Awaiting detailed report."},{"name":"STIGMA4","text":"Relational deterioration between patrolling Karellians acknowledged. <span class=\"highlight\">Forename</span>'s assistance in this matter evaluated as vital to preserving peace and averting a breakdown of operations."},{"name":"STIGMA4","text":"Why organic life-forms retain the programming error colloquially referred to as “emotions” remains incomprehensible. Even so, a compensatory wage has been prepared for <span class=\"highlight\">Forename</span>'s monetary and emotional needs. Remember to refuel as necessary."}],"reward":{"gil":655,"reputation":60,"items":[{"id":37854}]},"reqs":{"beastrank":3,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}}]}