{"quest":{"name":"A Brewing Reputation","location":"Ultima Thule","id":70146,"patch":6.25,"sort":104,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["Stigma-4 would spread word of the Last Dregs far and wide.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Spread word of the Last Dregs.","Report to Stigma-4."],"dialogue":[{"name":"STIGMA4","text":"The Last Dregs' performance is currently satisfactory, but analysis indicates that a focus on spreading awareness of the café's presence would yield even greater results."},{"name":"STIGMA4","text":"Therefore, you are requested to make use of your vocal aperture to engage in persuasive conversation with other life-forms and secure their patronage."},{"name":"STIGMA4","text":"Commencing Operation: Propagandize Plebeians. Two likely locations of patron encounter have been marked on your map. Venture forth and return victorious."},{"name":"EAOMI04610","text":"Through what pains you meat bags go to prepare and masticate your meals into piles of meaningless mush. Perhaps your corporeal forms derive pleasure from such a horrific process, but I must admit a failure to comprehend the appeal."},{"name":"EAOMI04610","text":"We Ea find the occasional diversion in minute fluctuations of aether, yes. But to gather in a primitive circle of equally barbaric life-forms for an empty exchange of ritual... What a dreadful waste of time."},{"name":"EAOMI04610","text":"The Last Dregs? Yes I know it well! Several of my non-corporeal comrades have already gone to visit, eager to participate in gustatory experimentation. Truth be told, I have been considering making the journey myself, and this was just the push I needed!"},{"name":"EAOMI04610","text":"To reacquaint oneself with a sense long forgotten...now that is truly an experience to imbue life with meaning! I quiver with anticipation to see what the future has in store for me and mine."},{"name":"DRAGONOMI04610","text":"...Dost thou speak to me, little one? Pray be silent, for I cannot abide the chatter of diminutive creatures."},{"name":"DRAGONOMI04610","text":"Thou sayest this “café” is bustling with your like? The mere thought of the cacophony makest the bile rise in my throat..."},{"name":"DRAGONOMI04610","text":"I have heard much of this “café.” The whispers that carry across the rift speak of hope incarnate and the lost memory of our Dragonstar reborn."},{"name":"DRAGONOMI04610","text":"How I long to see her peaks... Perhaps these wings may yet bear me over that distance..."},{"name":"OMICRON04610","text":"&lt;whirr&gt; To further current objectives, all Omicrons have been informed that the Last Dregs is open for patronage."},{"name":"OMICRON04610","text":"Several units have already been deployed to lend aid to operations. Is your current request in regards to waitstaff or patron insufficiencies? &lt;whirr&gt; Retracting previous query in interest of efficiency. This unit will offer its services as needed to simulate the appearance of a successful small business."},{"name":"OMICRON04610","text":"&lt;whirr&gt; The Last Dregs' reputation grows. Of particular note is the popularity of a drink said to increase Omicron computational capabilities."},{"name":"OMICRON04610","text":"This wondrous beverage is highly regarded in Base Omicron and this unit would like to experience the sensation of enhanced functionality for itself. &lt;whirr&gt; Setting destination for the Last Dregs. Reason for travel: recreation and personal improvement."},{"name":"STIGMA4","text":"Propagandize Plebeians underway. Requesting detailed report of mission objectives."},{"name":"STIGMA4","text":"Success rate unsatisfactory. Persuasion must continue until custom improves. "},{"name":"STIGMA4","text":"Success rate mediocre. However, analysis indicates growing interest in the Last Dregs. Allied life-form <span class=\"highlight\">Forename</span>'s strategic and charismatic capabilities evaluated as “minimally competent.”"},{"name":"STIGMA4","text":"Success rate surpasses projected results. Converted clientele reliably patronize the Last Dregs and clamor enthusiastically for fluid intake. Café status officially designated as “trending.”"},{"name":"STIGMA4","text":"This mission will never cease, so long as life-forms remain who have yet to hear the name “The Last Dregs.” May this stipend meet your biological needs until your services are requested again."}],"reward":{"gil":655,"reputation":60,"items":[{"id":37854}]},"reqs":{"beastrank":3,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}}]}