{"quest":{"name":"Grounds for Improvement","location":"Ultima Thule","id":70147,"patch":6.25,"sort":105,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["Stigma-4 is seeking an upgrade to the Last Dregs.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested materials to the food processing unit.","Report to Stigma-4."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine [Error] from the Elysian fields.</span><span class=\"alternative\">Deliver [Error] to the food processing unit.</span><span class=\"alternative\">Gather [Error] from the Elysian fields.</span><span class=\"alternative\">Catch [Error] from the Elysian fields.</span></span>","Report to Stigma-4."],"dialogue":[{"name":"STIGMA4","text":"According to verbal testimony of the malodorous manager, “delicious” and “unique” coffee is a vital component of any café. Although objective analysis of such inherently subjective categories proves difficult, current stores of coffee have been classified as insufficient."},{"name":"STIGMA4","text":"Upgrading establishment coffee is predicted to result in clear strategic benefits. Your task is to procure necessary ingredients to achieve this goal."},{"name":"STIGMA4","text":"Mine rock salt from the Elysian fields. When your task is complete, deliver the materials to the food processing unit in the Last Dregs."},{"name":"STIGMA4","text":"Gather nectar from the Elysian fields. When your task is complete, deliver the materials to the food processing unit in the Last Dregs."},{"name":"STIGMA4","text":"Procure seaweed from the Elysian fields. When your task is complete, deliver the materials to the food processing unit in the Last Dregs. Gold salmon roe is recommended as bait for quickest completion of task."},{"name":"DELIVERER04611","text":"&lt;whirr&gt; Allied life-form <span class=\"highlight\">Forename</span> detected. This is in regards to the coffee upgrade, yes? Scanning for requested materials... Requested materials could not be detected. Please try again."},{"name":"DELIVERER04611","text":"&lt;whirr&gt; Allied life-form <span class=\"highlight\">Forename</span> detected. This is in regards to the coffee upgrade, yes? Scanning for requested materials... Requested materials detected. Please place them carefully in this unit's receptacle."},{"name":"DELIVERER04611","text":"&lt;whirr&gt; Receipt of materials confirmed. This unit thanks you for your efforts. Return to Stigma-4 for your recompense."},{"name":"STIGMA4","text":"Receptacle unit report received. Your cooperation is appreciated."},{"name":"STIGMA4","text":"According to subjective analysis by bewhiskered manager, rock salt mitigates the natural bitterness of coffee, resulting in a mild flavor that is acceptable to a wide range of palates."},{"name":"STIGMA4","text":"According to subjective analysis by bewhiskered manager, nectar-derived compounds lend revitalizing sweetness to coffee."},{"name":"STIGMA4","text":"According to subjective analysis by bewhiskered manager, salt extracted from dried seaweed mitigates the natural bitterness of coffee, resulting in a mild flavor that is widely acceptable to a range of palates."},{"name":"STIGMA4","text":"Projections indicate that coffee upgrades will result in increased patronage and an overall improvement of morale among café occupants. Whether this upward trajectory shall continue depends on the further assistance of helpful organisms such as yourself."}],"reward":{"gil":575,"reputation":60,"items":[{"id":37854},{"id":6141}]},"reqs":{"beastrank":3,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}