{"quest":{"name":"Using Their Heads","location":"Ultima Thule","id":70151,"patch":6.25,"sort":109,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["The Grebuloffs wish to look their best, and Stigma-4 requires your eye for aesthetics.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested materials to Stigma-4."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine [Error] from Ostrakon Deka-okto.</span><span class=\"alternative\">Deliver [Error] to Stigma-4.</span><span class=\"alternative\">Gather [Error] from Ostrakon Deka-okto.</span><span class=\"alternative\">Catch [Error] from Ostrakon Tria.</span></span>"],"dialogue":[{"name":"STIGMA4","text":"Request from Grebuloffs pending. Materials petitioned for maintenance and aesthetic upgrade of diving helmets."},{"name":"STIGMA4","text":"Stipulation: materials must be procured from outside Elysion. After analyzing desired parameters, materials with at least 90% satisfaction quotient have been located."},{"name":"STIGMA4","text":"Please procure weighted agalmatolite from Ostrakon Deka-okto. Approximate coordinates: 11, 27, 0."},{"name":"STIGMA4","text":"Please procure fragrant greens from Ostrakon Deka-okto. Approximate coordinates: 9, 27, 0."},{"name":"STIGMA4","text":"Please procure a fish known as sticky fingers from Ostrakon Tria. Approximate coordinates: 22, 8, 2.<br>Use of gold salmon roe is strongly advised. All proceeds go to Omicron enhancement initiatives. "},{"name":"STIGMA4","text":"Expedient delivery of materials will ensure optimization of Grebuloff satisfaction quotient."},{"name":"STIGMA4","text":"Awaiting delivery of weighted agalmatolite from Ostrakon Deka-okto."},{"name":"STIGMA4","text":"Awaiting delivery of fragrant greens from Ostrakon Deka-okto."},{"name":"STIGMA4","text":"Awaiting delivery of sticky fingers from Ostrakon Tria. Use of gold salmon roe is strongly advised. All proceeds go to Omicron enhancement initiatives."},{"name":"STIGMA4","text":"Return of <span class=\"highlight\">Forename</span> confirmed. Ready to accept petitioned materials."},{"name":"STIGMA4","text":"Analyzing... Materials identified as <span class=\"alternative-container\"><span class=\"alternative\">weighted agalmatolite</span><span class=\"alternative\">fragrant greens</span><span class=\"alternative\">sticky fingers</span></span>. The Grebuloffs will be pleased."},{"name":"STIGMA4","text":"Historical records indicate that helmet adornment protocols are a source of particular pride among Grebuloffs."},{"name":"STIGMA4","text":"The incorporation of foreign materials into helmets is believed to promote amicable relations with denizens of affiliated territories."},{"name":"STIGMA4","text":"This practice is illogical and an inefficient use of time and material. However, its impact upon the goodwill of foreign parties cannot be conclusively dismissed as insignificant. Future comprehensive evaluation of relations deemed necessary."}],"reward":{"gil":575,"reputation":60,"items":[{"id":37854},{"id":6141}]},"reqs":{"beastrank":4,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}