{"quest":{"name":"The Robot and the Sea","location":"Ultima Thule","id":70150,"patch":6.25,"sort":108,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["There is still much Stigma-4 would learn of the Grebuloffs' new home.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested sample to the analysis unit.","Report to Stigma-4."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine [Error] from the Elysian seas.</span><span class=\"alternative\">Deliver [Error] to the analysis unit.</span><span class=\"alternative\">Gather [Error] from the Elysian seas.</span><span class=\"alternative\">Catch [Error] from the Elysian seas.</span></span>","Report to Stigma-4."],"dialogue":[{"name":"STIGMA4","text":"Analysis indicates that the Grebuloffs continue to abide on Elysion without difficulty. However, data insufficiencies remain regarding the oceans created through their influence on dynamis."},{"name":"STIGMA4","text":"With sufficient data, it will be possible to preserve such ocean environments and improve Grebuloff well-being. Initiating research and analysis protocol..."},{"name":"STIGMA4","text":"Samples of limestone coral are required to proceed with analysis. Once procured, please deposit the samples in the analysis unit."},{"name":"STIGMA4","text":"Elysian cucumber samples are required to proceed with analysis. Once procured, please deposit the samples in the analysis unit."},{"name":"STIGMA4","text":"An Elysian nudibranch sample is required to proceed with analysis. Once procured, please deposit the sample in the analysis unit."},{"name":"STIGMA4","text":"For maximum efficiency, use of gold salmon roe is strongly advised. All proceeds go to Omicron enhancement initiatives."},{"name":"OMICRON04614","text":"Scanning inventory... Unidentified substances detected. Potential value and utilization factors...unclear.<br>Standing by for oceanic samples."},{"name":"OMICRON04614","text":"Scanning inventory... Oceanic samples detected. Please insert for analysis."},{"name":"OMICRON04614","text":"Analyzing... Sample possesses bacteria given to releasing foreign particulates. Olfactory sensors reaching critical. "},{"name":"OMICRON04614","text":"Conclusion: oceanic life-forms are prone to...unfavorable odor. Additional specimens required for further analysis."},{"name":"OMICRON04614","text":"Conclusion: ocean life-forms remain prone to unfavorable odor. Probability of fragrant life unlikely. Additional specimens required for further analysis."},{"name":"STIGMA4","text":"Report from analysis unit received. Your contribution was deemed beneficial to research on Elysion's oceanic environment."},{"name":"STIGMA4","text":"However, data insufficiencies remain. If discovered bacteria is present in all oceanic life-forms, verification of potential dissemination to other non-oceanic hosts is required."},{"name":"STIGMA4","text":"Proposal: submerge the redolent, fluffy manager in ocean water, and monitor odor fluctuations. Upon conclusion of this experiment, deployment of military-grade lasers may be authorized for decontamination purposes."},{"name":"STIGMA4","text":"Periodic analysis of new specimens is required for continued research and environmental preservation. Your future cooperation is greatly appreciated."}],"reward":{"gil":655,"reputation":60,"items":[{"id":37854},{"id":6141}]},"reqs":{"beastrank":4,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}