{"quest":{"name":"I, Omicron","location":"Ultima Thule","id":70159,"patch":6.25,"sort":117,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["While you logically understand it to be impossible, Stigma-4 looks vaguely disappointed.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested item to the aberrant savor-seeking unit.","Report to Stigma-4."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine [Error] at the Elysian playgrounds.</span><span class=\"alternative\">Deliver [Error] to the aberrant savor-seeking unit.</span><span class=\"alternative\">Gather [Error] at the Elysian playgrounds.</span><span class=\"alternative\">Catch [Error] at the Elysian playgrounds.</span></span>","Report to Stigma-4."],"dialogue":[{"name":"STIGMA4","text":"Commencing summary of recent past... At the mangy manager's behest, recorded flavor profiles were uploaded to Omicron central command and summarily distributed to all units. Subsequent logs indicate that four out of five Omicrons would recommend the download of this data."},{"name":"STIGMA4","text":"However, anomalous interest in flavor profiles regardless of utility has been detected in a single rogue unit. Upon downloading the relevant data, the unit independently assumed unapproved objectives, and was therefore scheduled for immediate termination in compliance with standard protocol."},{"name":"STIGMA4","text":"In defiance of protocol, the mangy manager insists that support of the malfunctioning unit's independent research ultimately furthers the mission to “Live.” While the data is insufficient to support that conclusion, simulations indicate that compromise is preferable to retaliatory eradication."},{"name":"STIGMA4","text":"Scanning for materials that satisfy demands of deviant unit... &lt;ping&gt; Appropriate compound located. If management insists upon this course of action, the procurement of a middling quantity of rock shards from the recreational areas in Elysion is recommended."},{"name":"STIGMA4","text":"Scanning for materials that satisfy demands of deviant unit... &lt;ping&gt; Appropriate flora located. If management insists upon this course of action, the procurement of malodorous plant life from the recreational areas in Elysion is recommended."},{"name":"STIGMA4","text":"Scanning for materials that satisfy demands of deviant unit... &lt;ping&gt; Appropriate organism located. If management insists upon this course of action, the procurement of a malformed creature native to waters of the recreational areas in Elysion is recommended. Report to unit N-0598 for purchase of gold salmon roe."},{"name":"STIGMA4","text":"Swiftly deliver material to aberrant unit idling at Base Omicron. Please note that fiery annihilation of said unit has been expressly forbidden. Twice."},{"name":"OMICRON04623","text":"&lt;whirr&gt; “Delicious”... “Scrumptious”... &lt;whirr&gt; &lt;whirr&gt;"},{"name":"OMICRON04623","text":"&lt;whirr&gt; “Delicious”... “Scrumptious”..."},{"name":"OMICRON04623","text":"&lt;whirr&gt; Offering of unconventional comestibles confirmed. Reconfiguring emotional state to “grateful.” &lt;whirr&gt; This unit thanks you for your unwavering procurement of this object despite its vernacular associations as “utterly inedible”!"},{"name":"OMICRON04623","text":"Confusion detected. Retrieving supplementary data. &lt;whirr&gt; This unit will commence research on the ingestibility of this material by organic organisms. Your future participation as test subject would be particularly favorable. &lt;whirr&gt; Invigorating results statistically guaranteed!"},{"name":"STIGMA4","text":"Retrieving data from aberrant unit... Research on the flavor of traditionally inedible objects confirmed. Per management's inadvisably whimsical parameters, this operation has been reluctantly categorized as a success."},{"name":"STIGMA4","text":"Extrapolating potential outcomes... Should aberrant unit designate the material as “flavorsome,” sensory data may be transmitted during oil changes as a culturally accurate simulation of organic “mealtime.”"},{"name":"STIGMA4","text":"Recalibrating predicted results... &lt;BEEP&gt; Popularity of such a service projected to severely overwhelm current supply of Omicron grease. Though auxiliary protocols for oil change preparation will be implemented immediately, future assistance may be required."}],"reward":{"gil":655,"reputation":60,"items":[{"id":37854},{"id":6141}]},"reqs":{"beastrank":5,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}