{"quest":{"name":"Working Up a Thirst","location":"Ultima Thule","id":70152,"patch":6.25,"sort":110,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["Error 5318008: Grebuloffs not found.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Search for the overcurious Grebuloffs.","Report to Stigma-4."],"dialogue":[{"name":"STIGMA4","text":"Irregular population fluctuations detected. Your assistance is required to search for two missing Grebuloffs."},{"name":"STIGMA4","text":"Analysis indicates insatiable curiosity and a proclivity for exploration in both units, making “voluntary expedition” the most likely explanation for their sudden disappearance."},{"name":"STIGMA4","text":"However, given the length of absence and approximate levels of danger in the surrounding areas, the likelihood that they currently face mortal peril exceeds recommended parameters."},{"name":"STIGMA4","text":"Please initiate your search immediately and aid the return of the two missing Grebuloffs. In the event they have been reduced to pieces, please collect and return accordingly."},{"name":"GREBULOFFA04616","text":"Oh, would you look how it shimmers and shines! Be still my quivering whiskers!<br>...Hm? Can I help you?"},{"name":"GREBULOFFA04616","text":"The others are looking for me? My apologies. So enraptured was I with this place, I completely lost track of time."},{"name":"GREBULOFFA04616","text":"Glittering landmarks much like this one could once be seen in the waters of our home, but they carried a terrible sickness. I never dared to dream I might find anything so similar in a place such as this."},{"name":"GREBULOFFA04616","text":"&lt;sigh&gt; Would that I could stay and behold its beauty a while longer, but as you say, my kin are worried. Another time, perhaps."},{"name":"GREBULOFFB04616","text":"&lt;grumble&gt; &lt;grumble&gt; Oh, what I wouldn't do for something to eat..."},{"name":"GREBULOFFB04616","text":"Bwaaah! Who... What are you doing here?"},{"name":"GREBULOFFB04616","text":"I'm being called back home? But the Ea promised there would be food. It should be ready any moment now."},{"name":"GREBULOFFB04616","text":"At least, that's what they told me. Yet no matter how long I wait, there has been nothing. &lt;sigh&gt; Perhaps I misunderstood when they invited me to join them in communal repast. I think I'll stop by the café on the way back, and eat something there."},{"name":"GREBULOFFC04616","text":"I... &lt;heave&gt; I fear I've made a terrible mist─ &lt;retch&gt;"},{"name":"GREBULOFFC04616","text":"Return home? Gladly. Seeing the dragons partake of the water, I thought it safe enough for a quick swim, but I was wrong. So very, very wrong..."},{"name":"GREBULOFFC04616","text":"Well, I've given my stomach enough trouble for one day. I should be returning home. If you'll excuse me."},{"name":"GREBULOFFD04616","text":"Hm? What brings you out here?"},{"name":"GREBULOFFD04616","text":"Oh, I... I didn't mean to make the others worry. I stumbled upon these remains, and couldn't help but think of our fallen kin..."},{"name":"GREBULOFFD04616","text":"Ahem. But now is not the time for sulking─it only serves to make the others worry. It was nice meeting you."},{"name":"GREBULOFFE04616","text":"Hm...? Ah, my apologies. I was marveling at the craftsmanship of this place."},{"name":"GREBULOFFE04616","text":"The others sent you to bring me home? Goodness, how long have I been away? It seems I lost track of time admiring all this metalwork."},{"name":"GREBULOFFE04616","text":"Perhaps one of the service nodes at the café would be willing to tell me more about it."},{"name":"GREBULOFFF04616","text":"Would you look at that eye? No doubt it keeps watch over everything in this space."},{"name":"GREBULOFFF04616","text":"You came looking for me? Hopefully my absence hasn't caused too much of a stir. I was captivated by the giant eye there, and soon found myself lost in thought."},{"name":"GREBULOFFF04616","text":"Fear not─when I return, I intend to work twice as hard to make up for my time spent here. We will make an Elysion worth watching, just wait and see."},{"name":"STIGMA4","text":"Return of wayward units confirmed. Influx of Grebuloff gratitude determined to be corollary."},{"name":"STIGMA4","text":"After the dissemination of verbal testimony by recently returned Grebuloffs, interest in the exploration of foreign regions has experienced a marked increase in other adventurous units."},{"name":"STIGMA4","text":"Probability of future employment opportunities high. Rest and recuperation are advised."}],"reward":{"gil":655,"reputation":60,"items":[{"id":37854}]},"reqs":{"beastrank":4,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}}]}