{"quest":{"name":"Ea Epicurious","location":"Ultima Thule","id":70158,"patch":6.25,"sort":116,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["Stigma-4 seems to be chewing on something─strictly in the metaphorical sense.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested items to the intrigued Ea.","Report to Stigma-4."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine [Error] in the Elysian fields.</span><span class=\"alternative\">Deliver [Error] to the intrigued Ea.</span><span class=\"alternative\">Gather [Error] in the Elysian fields.</span><span class=\"alternative\">Catch [Error] in the Elysian fields.</span></span>","Report to Stigma-4."],"dialogue":[{"name":"STIGMA4","text":"The Ea request delivery of Elysian foodstuffs for further experimentation of indeterminate nature."},{"name":"STIGMA4","text":"Request accepted by flea-infested manager in reckless subversion of approved workflow. Café effort still recovering from resulting casualties of time and efficiency. Reasserting task-distribution authority..."},{"name":"STIGMA4","text":"<span class=\"highlight\">Forename</span>, you are hereby ordered to obtain moderate quantities of dark sodium compounds found in the Elysian fields. Imbibing, ingesting, or otherwise licking said material before delivery is strictly prohibited."},{"name":"STIGMA4","text":"<span class=\"highlight\">Forename</span>, you are hereby ordered to obtain moderate quantities of colorful fauna in the Elysian fields. Errant mastication of items meant for delivery is strictly prohibited."},{"name":"STIGMA4","text":"<span class=\"highlight\">Forename</span>, you are ordered to obtain an unmistakably aquatic organism from waters in the Elysian fields. Gold salmon roe may be purchased from unit<br>N-0598 for a nominal fee. Personal consumption of any and all piscatory acquisitions is forbidden."},{"name":"STIGMA4","text":"Deliver the requested foodstuffs to the indicated Ea in Ostrakon Tria. Initiating encouragement sequence... Catering to the desires of local denizens furthers Last Dregs objectives. Enthusiasm is optional, but recommended."},{"name":"EA04622","text":"Greetings, corporeal being. I am currently awaiting the arrival of materiel most crucial, so if you would leave me to my contemplation..."},{"name":"EA04622","text":"Greetings, corporeal being. I am currently awaiting the arrival of materiel most crucial."},{"name":"EA04622","text":"Why, this is it precisely! You have done well to deliver it to me, cumbersomely burdened by a bone-house though you are."},{"name":"EA04622","text":"I recently received word from my brethren who engaged in that sensory experimentation sponsored by your restaurant. An endeavor worthy of further inquiry, yet tragically reliant upon a third-party conduit. "},{"name":"EA04622","text":"It is for this reason I plan to cultivate a comparable gustatory organ─yes, just the single piece─into which I may insert the foodstuffs you have brought me and perform “tastings” at my leisure. Ingenious, do you not agree? Now, if you will excuse me, I have corporeal mass to grow..."},{"name":"STIGMA4","text":"Return of <span class=\"highlight\">Forename</span> confirmed. Expression assessed as “queasy.” Requesting supplementary information."},{"name":"STIGMA4","text":"Verbal analysis complete. Burgeoning interest in foodstuffs amongst the Ea suggests a potential increase in patronage for the Last Dregs. Additionally, successful creation of artificial taste receptors is projected to create demand for food delivery, which aligns with overall objectives."},{"name":"STIGMA4","text":"In comparison, <span class=\"highlight\">Forename</span>'s queasiness is inconsequential. Shiny objects will be provided as a distraction from current digestive distress in the interest of maintaining morale."}],"reward":{"gil":655,"reputation":60,"items":[{"id":37854},{"id":6141}]},"reqs":{"beastrank":5,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}