{"quest":{"name":"A Taste of the Sea","location":"Ultima Thule","id":70156,"patch":6.25,"sort":114,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["Stigma-4 has received a new directive to spice things up at the café.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the alimentary survey unit.","Deliver the requested ingredients to the alimentary survey unit.","Report to Stigma-4."],"objectives":["Speak with the alimentary survey unit.","<span class=\"alternative-container\"><span class=\"alternative\">Mine [Error] from the Elysian seas.</span><span class=\"alternative\">Deliver [Error] to the alimentary survey unit.</span><span class=\"alternative\">Gather [Error] from the Elysian seas.</span><span class=\"alternative\">Catch [Error] from the Elysian seas.</span></span>","Report to Stigma-4."],"dialogue":[{"name":"STIGMA4","text":"The furry café owner has proposed a plan to secure more customers─a reconfiguration of the food directory."},{"name":"STIGMA4","text":"Specifically, the creation of a food item comprised of materials from the Elysian seas and suited to Karellian proclivities has been requested."},{"name":"STIGMA4","text":"Your assistance is required. Please report to the alimentary survey unit for further instruction."},{"name":"OMICRON04620","text":"Provision supplier identified: <span class=\"highlight\">Forename Surname</span>. Loading entry for Karellian cuisine production..."},{"name":"OMICRON04620","text":"Based on data from Karellian survey, certain diatom clusters have been determined to optimize “delectable” quotient while also promoting healthy digestion."},{"name":"OMICRON04620","text":"Based on data from Karellian survey, certain rock moss has been determined to optimize “delectable” quotient while also promoting healthy digestion."},{"name":"OMICRON04620","text":"Based on data from Karellian survey, the aquatic organism colloquially referred to as “seaweed snapper” has been determined to optimize “delectable” quotient while also promoting healthy digestion."},{"name":"OMICRON04620","text":"Use of gold salmon roe is strongly recommended for procurement. All proceeds go to Omicron enhancement initiatives."},{"name":"OMICRON04620","text":"Please proceed to the marked area for acquisition. Prompt delivery is advised to ensure preservation of nutritional value."},{"name":"OMICRON04620","text":"Loading directive... &lt;whirr&gt;<br>Please procure diatom clusters to optimize “delectable” quotient and promote healthy digestion."},{"name":"OMICRON04620","text":"Loading directive... &lt;whirr&gt;<br>Please procure rock moss to optimize “delectable” quotient and promote healthy digestion."},{"name":"OMICRON04620","text":"Loading directive... &lt;whirr&gt;<br>Please procure seaweed snapper to optimize “delectable” quotient and promote healthy digestion."},{"name":"OMICRON04620","text":"Prompt delivery is advised to ensure preservation of nutritional value. Please note that further delays may result in severe disappointment."},{"name":"OMICRON04620","text":"Welcome back, <span class=\"highlight\">Forename Surname</span>. Please insert delivery to continue."},{"name":"OMICRON04620","text":"Scanning... &lt;whirr&gt; Scanning...<br>Quality of ingredients is acceptable. Delivery complete.<br>Please return to Stigma-4 to receive compensation."},{"name":"STIGMA4","text":"Return confirmed. Your timely delivery of goods has been noted and is greatly appreciated."},{"name":"STIGMA4","text":"This successful addition to the café's food directory should appease the fuzzy one for the time being."},{"name":"STIGMA4","text":"&lt;beep&gt; Warning: extensive diversification of food directory likely to result in logistical errors. Standardization of customer digestive organs advised as the most efficient solution."}],"reward":{"gil":735,"reputation":60,"items":[{"id":37854},{"id":6141}]},"reqs":{"beastrank":4,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}