{"quest":{"name":"Remote Debugging","location":"Ultima Thule","id":70164,"patch":6.25,"sort":122,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["Stigma-4 seeks to unite its allied life-forms against a common enemy─bugs.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with the advanced pest extermination unit in Reah Tahra.","Mount the Miw Miisv and use Electric Flux at the designated locations.","Report to Stigma-4."],"dialogue":[{"name":"STIGMA4","text":"Analysis of soft and gooey life-form Miw Miisv suggests that its capacity to emit an electrical charge will be extremely effective in the extermination of small invertebrates. This analysis has been performed for...reasons. Mission-critical reasons."},{"name":"STIGMA4","text":"Reports indicate the dragons are regularly accosted by a swarm of buzzing arthropods of similar description. This presents a favorable opportunity to put the Miw Miisv's electrical manipulation capabilities to the test, while simultaneously expelling the aforementioned pests."},{"name":"STIGMA4","text":"The successful incorporation of allied unit into the Miw Miisv's gelatinous flesh will be critical for the completion of objectives. Comply with the guidance of the advanced pest extermination unit in station Reah Tahra and destroy enemy arthropods without fail."},{"name":"WORKER04628","text":"Bzzzt... Allied life-form recognized. Commencing mission briefing... &lt;beep&gt; The microscopic invertebrates pestering the dragons nest within rock cavities."},{"name":"WORKER04628","text":"Allied life-form must assimilate itself into the Miw Miisv, head to the indicated coordinates, and emit an electrically charged blast to exterminate the hostile arthropods. Show no mercy."},{"name":"WORKER04628","text":"This unit is growing irritated with allied life-form's continued presence. Allied life-form must allow itself to be enveloped by the Miw Miisv, head to the indicated coordinates, and unleash an electrically charged blast to exterminate the hostile arthropods. Sooner than later."},{"name":"SYSTEM","text":"Without the Miw Miisv and its Electric Flux, there is little you can do but look at this rocky outcrop. Speak with the advanced pest extermination unit to become enveloped in the entity's gooey goodness."},{"name":"SYSTEM","text":"A host of repulsive insects still smoking from the electric blast crawl out from under the rocks. Though they struggle to creep forward, it is mere moments before their bodies grow entirely motionless."},{"name":"STIGMA4","text":"Report received from on-the-ground extermination unit. Allied unit's performance has been rated as “excellent.”"},{"name":"STIGMA4","text":"Considerable reduction of irritability detected in dragons inhabiting Reah Tahra. Positive influence on area's dynamis anticipated."},{"name":"STIGMA4","text":"Electrical manipulation capabilities displayed by the Miw Miisv have proven invaluable in completing today's objective. However, analysis will require additional extermination data. Your continued assistance in merciless annihilation would be most welcome."}],"reward":{"gil":735,"reputation":60,"items":[{"id":37854}]},"reqs":{"beastrank":6,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}}]}