{"quest":{"name":"Not Forgotten","location":"Ultima Thule","id":70167,"patch":6.25,"sort":125,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["Despite its incomparable processing capabilities, it would appear there are many concepts Stigma-4 has yet to understand.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested items to the wistful dragon. ","Report to Stigma-4."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine [Error] at the Elysian playgrounds.</span><span class=\"alternative\">Deliver [Error] to the wistful dragon.</span><span class=\"alternative\">Gather [Error] at the Elysian playgrounds.</span><span class=\"alternative\">Catch [Error] at the Elysian playgrounds.</span></span>","Report to Stigma-4."],"dialogue":[{"name":"STIGMA4","text":"The hirsute proprietor of the Last Dregs has decreed the dragons residing in Ostrakon Deka-okto be offered rudimentary tools for grooming─“gifts,” in its words─as a “gesture of kindness.”"},{"name":"STIGMA4","text":"The obstinate and prickly proprietor was advised the tools be synthetically recreated to no avail. It has instead been decided the implements be inferior substitutes of organic origin, as that would somehow be “more genuine.” Hence, the allied unit's services are required."},{"name":"STIGMA4","text":"Further elucidation deemed unnecessary. Mission initiation requested. Proceed to Elysion and secure precisely three whetstones from rock formations in the recreational areas. Then, make your way to Reah Tahra, where you may offer the items to the saddest dragon you can find."},{"name":"STIGMA4","text":"Further elucidation deemed unnecessary. Mission initiation requested. Proceed to Elysion and secure plants with an objectively soft and fluffy texture from the recreational areas. Then, make your way to Reah Tahra, where you may offer the items to the saddest dragon you can find."},{"name":"STIGMA4","text":"Further elucidation deemed unnecessary. Mission initiation requested. Proceed to Elysion and secure a single clump of astral algae from water holes located within the recreational areas. Use of gold salmon roe in its retrieval recommended."},{"name":"STIGMA4","text":"After procuring said item, you are to deliver it to the saddest dragon you can find in Reah Tahra."},{"name":"DRAGON04631","text":"Little one... Why hast thou come? I wish to be left in peace, that I may continue to reminisce upon the days of old..."},{"name":"DRAGON04631","text":"Little one... Art thou an ally of the strangely attired rabbit? It appeared before me not long ago, insisting it wished to offer me a gift... "},{"name":"DRAGON04631","text":"Why hast thou presented me with this rough rock?"},{"name":"DRAGON04631","text":"A most peculiar plant...what is it for?"},{"name":"DRAGON04631","text":"Soft flora indeed...but I do not understand thine intent in presenting it to me."},{"name":"DRAGON04631","text":"Thou wouldst gift me mementos of the Dragonstar? Hmm. Perhaps if I squint, I shall see some resemblance..."},{"name":"DRAGON04631","text":"Regardless, 'tis heartening to know that some would remember us, even now. I thank thee and thine for the sentiment."},{"name":"STIGMA4","text":"Allied unit has returned unscathed in spite of anticipated mission failure. Requesting full report."},{"name":"STIGMA4","text":"The dragon expressed...gratitude? Preposterous. Projections indicated cataclysmic results."},{"name":"STIGMA4","text":"Reassessment of annoying proprietor's intelligence will be necessary. Commencing reevaluation...&lt;bleep&gt; Fatal error detected. Process terminated."}],"reward":{"gil":655,"reputation":60,"items":[{"id":37854},{"id":6141}]},"reqs":{"beastrank":6,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}