{"quest":{"name":"A Light in the Dark","location":"Ultima Thule","id":70165,"patch":6.25,"sort":123,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["Stigma-4 has orders to see Reah Tahra restored to its former splendor.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested item to the advanced environmental stimulation unit.","Report to Stigma-4."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine [Error] from the Elysian fields.</span><span class=\"alternative\">Deliver [Error] to the advanced environmental stimulation unit.</span><span class=\"alternative\">Gather [Error] from the Elysian fields.</span><span class=\"alternative\">Catch [Error] from the Elysian fields.</span></span>","Report to Stigma-4."],"dialogue":[{"name":"STIGMA4","text":"According to an incomprehensible theory offered by the flea-ridden manager, draconic patronage remains below preferred levels due to the dark environment in which they live “dampening their spirits.”"},{"name":"STIGMA4","text":"As protocol requires compliance with management orders even when they are stupid, the furnishing of Reah Tahra with vibrant and colorful organisms must be duly coordinated. Allied unit, you shall be charged with delivering the specimens."},{"name":"STIGMA4","text":"Procure a few clumps of bioluminescent rock moss from the Elysian fields, and deliver them to the advanced environmental stimulation unit in Reah Tahra."},{"name":"STIGMA4","text":"Procure a number of lucent flowers from the Elysian fields, and deliver them to the advanced environmental stimulation unit in Reah Tahra."},{"name":"STIGMA4","text":"Procure a chromatic fish from the Elysian fields, and deliver it to the advanced environmental stimulation unit in Reah Tahra. As always, the use of gold salmon roe is recommended for optimal attraction of aquatic organisms."},{"name":"STIGMA4","text":"（★未使用／削除予定★）"},{"name":"STIGMA4","text":"（★未使用／削除予定★）"},{"name":"STIGMA4","text":"（★未使用／削除予定★）"},{"name":"OMICRON04629","text":"Bzzzt... Allied life-form detected. This unit is unable to confirm presence of requested items in your belongings. Immediate procurement of said items strongly encouraged."},{"name":"OMICRON04629","text":"Bzzzt... Allied life-form detected. Scans indicate presence of requested items in your belongings. Immediate surrender of said items requested."},{"name":"OMICRON04629","text":"Delivery of items confirmed. All appears to be in order. You may return to Stigma-4 for mission debriefing and compensation when ready."},{"name":"STIGMA4","text":"Mission report from the advanced environmental stimulation unit has been received. Engaging monologue sequence to share results of analysis as an expression of appreciation for <span class=\"highlight\">Forename</span>'s cooperation..."},{"name":"STIGMA4","text":"Invasion of the Dragonstar led to its eventual destruction. The barrens the dragons inhabit is a simulation born from that memory. Significant change in the environment is not expected at this stage, but outlook for positive shift in their sentiment has marginally increased."},{"name":"STIGMA4","text":"Conclusion: this mission has no end in sight. Allied unit is requested to accept compensation for mission completion, and make its preparations to receive new orders."}],"reward":{"gil":655,"reputation":60,"items":[{"id":37854},{"id":6141}]},"reqs":{"beastrank":6,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}