{"quest":{"name":"Corporeal Hand to Proverbial Mouth","location":"Ultima Thule","id":70161,"patch":6.25,"sort":119,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["Stigma-4 has some tasty suggestions for a superior life-form, and before you ask─no, it's not you.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested items to the expectant Ea.","Report to Stigma-4."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine [Error] at the Elysian seas.</span><span class=\"alternative\">Deliver [Error] to the expectant Ea.</span><span class=\"alternative\">Gather [Error] at the Elysian seas.</span><span class=\"alternative\">Catch [Error] at the Elysian seas.</span></span>","Report to Stigma-4."],"dialogue":[{"name":"STIGMA4","text":"Last Dregs request pending. Marine foodstuffs requisitioned by Ea. Analysis suggests direct correlation to recent sensory transference involving miracle shrimp."},{"name":"STIGMA4","text":"Scanning environment for available resources... Narrowing results by compatibility with elite non-corporeal life-forms... Filtering riffraff... &lt;ping&gt; Supremest foodstuffs confirmed. Initiating order distribution sequence."},{"name":"STIGMA4","text":"Obtain appropriate quantities of superior bivalve mollusks from the Elysian seas. Specimen selection has been optimized to suit client sensibilities. Refrain from selfish ingestion and deliver to the abode of the Ea."},{"name":"STIGMA4","text":"Obtain appropriate quantities of superior flora inhabiting the Elysian seas. Specimen has been deemed sublime and therefore inappropriate for consumption by inferior life-forms. Restrain primitive urges to gorge and deliver to the abode of the Ea."},{"name":"STIGMA4","text":"Capture the superior arthropod native to the Elysian seas. Unit N-0598 is available to relieve you of your currency in exchange for gold salmon roe. Please note that malicious ingestion or refusal to deliver item to the abode of the Ea may result in swift termination."},{"name":"EA04625","text":"Well come, corporeal messenger. Have you the edible appurtenances I ordered?"},{"name":"EA04625","text":"Fascinating. I thank you for obtaining such intriguing victuals."},{"name":"EA04625","text":"After hearing my brethren's account of the miracle shrimp experiment, I have taken to engaging in the semi-regular indulgence of such tantalizing stimuli."},{"name":"EA04625","text":"Yet, with repeated exposure comes the deadening of pleasure, as that primitive maxim suggests. “Variety is the spice of life.” Indeed, your contribution is the proverbial spice that shall allay the monotony of my endless existence. I thank you..."},{"name":"STIGMA4","text":"Return of <span class=\"highlight\">Forename</span> confirmed. Complicated emotional state detected. Requesting additional information."},{"name":"STIGMA4","text":"Voice analysis complete. Mission success. Engaging experimental exaltation sequence to restore default emotional state... Fantastically achieved, <span class=\"highlight\">Forename</span>! Your presence is a beacon of light to this universe!<br>&lt;beep&gt;...Detecting errors. Aborting exaltation sequence."},{"name":"STIGMA4","text":"Analysis suggests that providing sufficient variety for Ea with gustatory interest will require thousands of individual taste samples to be accumulated and codified. Recommending <span class=\"highlight\">Forename</span>'s immediate and total recuperation of strength in light of future missions."}],"reward":{"gil":655,"reputation":60,"items":[{"id":37854},{"id":6141}]},"reqs":{"beastrank":5,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}