{"quest":{"name":"Brainstorm","location":"Ultima Thule","id":70169,"patch":6.25,"sort":127,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["Stigma-4 has graciously accepted a request from the Ea on your behalf.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with the itinerant server unit.","Speak with the excited Ea.","Report to Stigma-4."],"dialogue":[{"name":"STIGMA4","text":"Communication from the Ea residing in Ostrakon Tria received. Word has spread of <span class=\"highlight\">Forename</span>'s use as a flesh medium for sensory perception data, ergo additional non-corporeal entities now desire a demonstration."},{"name":"STIGMA4","text":"This experience could easily be achieved by visiting the café. Preliminary calculations, however, suggest that appeasing them with a trial in their colony will prove an effective means of publicity for the Last Dregs."},{"name":"STIGMA4","text":"You are responsible for reintroducing the thought entities to the notion of gustatory stimuli, and it is therefore your responsibility to acquiesce to their demands. Visit the abode of the Ea and make contact with the itinerant server unit at your earliest convenience."},{"name":"EAOMI04633","text":"Ah, you must be our fleshy medium for the demonstration. I am eager to discover what sensations this gustatory experience will entail!"},{"name":"OMICRON04633","text":"Bzzzt... Visual confirmation of allied unit <span class=\"highlight\">Forename</span>'s arrival. Preparations for the demonstration are complete."},{"name":"OMICRON04633","text":"Please begin consumption of one of the three available organic substances. Now initializing scan of allied life-form's gustatory inputs..."},{"name":"Q1","text":"What will you consume?"},{"name":"A1","text":"The potentially metaphorical single slice of bread."},{"name":"A1","text":"The decidedly unpoisoned apple."},{"name":"A1","text":"The low-grade choking hazard of an extra-sticky rice ball."},{"name":"EAOMI04633","text":"Oh my, it's begun! Look at how the poor, fleshy thing is forced to fill its oral cavity with the organic foodstuff, using its lingual nerve to collect flavor as it masticates matter with its teeth! Then, the finale...deglutition. How messy! How troublesome! How <span class=\"emphasis\">primitive</span>! "},{"name":"OMICRON04633","text":"Gustatory data received. Awaiting command to transmit data to the inexplicably narrating life-form."},{"name":"OMICRON04633","text":"Gustatory data received. Awaiting command to transmit data to the inexplicably narrating life-form."},{"name":"EAOMI04633","text":"Yes, yes, give me the data! Shock my senses, I beg you!"},{"name":"OMICRON04633","text":"Now transmitting data."},{"name":"EAOMI04633","text":"Oh... Oh <span class=\"emphasis\">my</span>! What is this sensation─this signal from a phantom organ I do not possess? How wonderfully bizarre!"},{"name":"EAOMI04633","text":"Yes, yes, I am confident what you consumed was the kneaded and baked result of finely powdered grain. “Why not simply ingest the grain in its original state,” I pondered, but my proverbial eyes have been opened! Not only does it have a uniquely satisfying mild flavor, but an unbelievably soft texture too!"},{"name":"EAOMI04633","text":"Invigorating flavors of acidity and sweetness wash over me─the firm, succulent texture of the victual immovable from the forefront of my mind. So this is what fruit tastes like... Who would have thought the reproductive body of a seed could have such a rich flavor?"},{"name":"EAOMI04633","text":"Setting aside the curious decision to shape it into a ballistic, this pale grain is more flavorsome than it has any right to be. So soft as to be nearly viscous, so starchy as to be nearly sweet..."},{"name":"EAOMI04633","text":"I now understand that fleshy ones do not consume organic substances strictly out of nutritional necessity, but for stimulation such as this. How altogether fascinating...indeed, I must see this café for myself!"},{"name":"OMICRON04633","text":"Departure of screeching non-corporeal entity confirmed. This unit will return to its duties at the Last Dregs, where countless such beings doubtless await. Allied unit is encouraged to return to A-4 Research for mission debriefing."},{"name":"STIGMA4","text":"Return of allied unit recognized. Requesting full mission report."},{"name":"STIGMA4","text":"Congratulations on your successful ingestion. Though this outcome was expected, it is also desirable. Guerrilla demonstration will be logged as an effective means of encouraging interest in sensory perception."},{"name":"STIGMA4","text":"It is fortunate that a number of Ea were present during your execution of objectives. Due to their lack of physical form as well as conditional operating protocols, luring them to the Last Dregs has been surpassingly difficult, even for tactical specialists."},{"name":"STIGMA4","text":"However, those who watched this demonstration from afar may choose to participate in the future. Should the opportunity present itself to carry out a similar operation, your services will be required once more."}],"reward":{"gil":735,"reputation":60,"items":[{"id":37854}]},"reqs":{"beastrank":6,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}}]}