{"quest":{"name":"Guardians of the Galaxy","location":"Ultima Thule","id":70160,"patch":6.25,"sort":118,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["If Stigma-4 had emergency lights, they would be blinking.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with the advanced unit replenishment unit at Base Omicron.","Mount the Miw Miisv and use Electric Flux to revive the Gordhona guardians.","Report to Stigma-4."],"dialogue":[{"name":"STIGMA4","text":"Emergency alert: Last Dregs primary staff non-responsive due to insufficient energy levels. Provisional units deployed."},{"name":"STIGMA4","text":"Requesting immediate assistance from nearest ally <span class=\"highlight\">Forename</span>. Replenish energy stores of inert staff members before provisional units expire under the unreasonable expectations inflicted upon service-industry employees."},{"name":"STIGMA4","text":"Transmission sent to the replenishment unit at Base Omicron. Your imminent arrival is expected."},{"name":"OMICRON04624","text":"&lt;whirr&gt; Initiating standard welcoming protocol. Greetings, <span class=\"highlight\">Forename</span>. Your imminent arrival was expected."},{"name":"OMICRON04624","text":"Initiating instruction... Direct energy supplies from this pillowy life-form into the incapacitated Gordhona guardians to restore basic functioning."},{"name":"OMICRON04624","text":"&lt;whirr&gt; Suspicion detected... This unit assures you that the Miw Miisv was obtained ethically and with permission from its guardian Ea. Please commence siphoning at your earliest convenience."},{"name":"OMICRON04624","text":"Presence of <span class=\"highlight\">Forename</span> confirmed. Unable to complete logic circuits. Analysis suggests this unit provided clear and satisfying instruction regarding revival of Gordhona guardians. Further harassment will be logged. &lt;whirr&gt;..."},{"name":"SYSTEM","text":"This erstwhile war machine twitches in its stasis. Maybe it's dreaming...<br>Speak with the advanced unit replenishment unit at Base Omicron to mount the Miw Miisv and jolt it awake."},{"name":"OMICRON04624","text":"&lt;khrrr&gt; &lt;ka-chunk&gt; &lt;ka-chunk&gt; Initiating start-up sequence... Last Dregs security protocol engaged... Returning to post to eliminate intruders."},{"name":"OMICRON04624","text":"...liminate intruders! Eliminate intruders! BEEP! BEEP! BOOOOOOP! &lt;ka-chunk&gt;<br>&lt;khrrr&gt; Recalibrating... Reverting weapons systems from “purge” to “stun.” Returning to post."},{"name":"STIGMA4","text":"Retrieving data... Previously incapacitated units back online and functioning normally. Café-specific disaster averted."},{"name":"STIGMA4","text":"Providing supplementary information. Evidence suggests that Gordhona guardians were manned units of war, but data insufficiencies necessitate units currently operate as automata."},{"name":"STIGMA4","text":"Detecting depreciated levels of concentration. Pinpointing relevancy to <span class=\"highlight\">Forename</span>... Until pilots can be properly reconstructed, regular replenishment of energy stores will prove crucial to Last Dregs operations. Future requests for assistance are inevitable."}],"reward":{"gil":735,"reputation":60,"items":[{"id":37854}]},"reqs":{"beastrank":5,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}}]}