{"quest":{"name":"Corporeal Comforts","location":"Ultima Thule","id":70163,"patch":6.25,"sort":121,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["Does Stigma-4 dream of electric Miw Miisv? These are the questions you ask of your imagination.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested items to the nurturing nanny.","Report to Stigma-4."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine [Error] at the Elysian playgrounds.</span><span class=\"alternative\">Deliver [Error] to the nurturing nanny.</span><span class=\"alternative\">Gather [Error] at the Elysian playgrounds.</span><span class=\"alternative\">Catch [Error] at the Elysian playgrounds.</span></span>","Report to Stigma-4."],"dialogue":[{"name":"STIGMA4","text":"Correspondence from Ea received. In adherence to updated nurturing protocols, acquisition and delivery of materials deemed “comfy” by organic life-forms has been requested."},{"name":"STIGMA4","text":"Analyzing available resources... &lt;meep&gt; Viable material identified. Projections indicate 99.9842% compatibility with the tender epidermis of infantile Miw Miisv."},{"name":"STIGMA4","text":"Imparting mission objectives: obtain appropriate amounts of clay from the recreational areas in Elysion and deliver it to the abode of the Ea, where a nanny awaits."},{"name":"STIGMA4","text":"Imparting mission objectives: obtain appropriate quantities of softwood from the recreational areas in Elysion and deliver it to the abode of the Ea, where a nanny awaits."},{"name":"STIGMA4","text":"Imparting mission objectives: obtain coral from the recreational areas in Elysion and deliver it to the abode of the Ea, where a nanny awaits. A share of proceeds from the sale of gold salmon roe will be donated to further Miw Miisv nourishment."},{"name":"EA04627","text":"You must be the fleshy one I ordered. Did you come complete with useful pieces?"},{"name":"EA04627","text":"Yes, yes...precisely what I had in mind! The corporeal frames of our children are ever so delicate, so I thought soft and natural environs might better attend to their physical needs."},{"name":"EA04627","text":"I would have gathered the required materials myself, but lacking a body makes such labor quite impossible. Providing for progeny by the sweat of one's brow... Such is a life we can but barely remember. Anyway, I hope you will lend us your brow again sometime."},{"name":"STIGMA4","text":"Return of <span class=\"highlight\">Forename</span> confirmed. Requesting additional information."},{"name":"STIGMA4","text":"Verbal analysis complete. Satisfied nanny confirmed. Mission success."},{"name":"STIGMA4","text":"The true nature of the Miw Miisv continues to elude comprehensive analysis. Satisfactory periods of stasis unattainable. Diverting Last Dregs resources to data acquisition protocols... Recommending <span class=\"highlight\">Forename</span> strengthen <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> own data acquisition protocols, regardless of relative insignificance."}],"reward":{"gil":655,"reputation":60,"items":[{"id":37854},{"id":6141}]},"reqs":{"beastrank":5,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}