{"quest":{"name":"Checking for Cavities","location":"Ultima Thule","id":70168,"patch":6.25,"sort":126,"interval":"daily","repeatable":1,"beast":16,"eventIcon":71222,"issuer":1043417,"target":1043417,"genre":31,"journal":["Though you cannot be certain, you have the unsettling feeling that Stigma-4's giant, ever-staring eye is focused on your mouth.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested items to the advanced dental polishing unit.","Report to Stigma-4."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine [Error] from the Elysian seas.</span><span class=\"alternative\">Deliver [Error] to the advanced dental polishing unit.</span><span class=\"alternative\">Gather [Error] from the Elysian seas.</span><span class=\"alternative\">Catch [Error] from the Elysian seas.</span></span>","Report to Stigma-4."],"dialogue":[{"name":"STIGMA4","text":"In the leporid proprietor's dubious wisdom, it has been decided that teeth polishing tools are to be supplied for maintenance of the oral cavities of draconic clientele, and incorporated into a new service offered to café patrons."},{"name":"STIGMA4","text":"Determining suitable matter to fulfill this purpose requires an extensive search covering billions of entries across thousands of databases...a trifling task. Material located."},{"name":"STIGMA4","text":"Allied unit <span class=\"highlight\">Forename</span> is hereby requested to relocate to the Elysian seas, where it may procure porous stones from rocky outcrops in the vicinity."},{"name":"STIGMA4","text":"Allied unit <span class=\"highlight\">Forename</span> is hereby requested to relocate to the Elysian seas, where it may procure suitably fibrous kelp from vegetation patches in the vicinity."},{"name":"STIGMA4","text":"Allied unit <span class=\"highlight\">Forename</span> is hereby requested to relocate to the Elysian seas, where it may procure helpless spongy life-forms. Use of gold salmon roe as a lure is projected to be effective."},{"name":"STIGMA4","text":"Samples may be delivered to the advanced dental polishing unit stationed in Reah Tahra, which will fabricate them into tools and perform experimental teeth maintenance. Your swift completion of objectives is appreciated."},{"name":"OMICRON04634","text":"&lt;whirr&gt; Once requested samples have been converted into tools, this unit will approach the nearest dragon, demand the unclenching of said dragon's jaw, and proceed to climb inside of its mouth to perform extensive teeth polishing. Estimated chances of survival: less than one percent."},{"name":"OMICRON04634","text":"&lt;whirr&gt; Once requested samples have been converted into tools, this unit will approach a nearby dragon, demand the unclenching of said dragon's jaw, and proceed to climb inside of its mouth to perform extensive teeth polishing. Estimated chances of survival: less than one percent."},{"name":"OMICRON04634","text":"Initializing material conversion process... This unit will now transition to dental polishing protocols to carry out its mission. Good-bye, allied life-form..."},{"name":"STIGMA4","text":"Return of allied unit <span class=\"highlight\">Forename</span> acknowledged. Your contribution to the universe's aggregate dental hygiene levels is greatly appreciated. Initializing gratitude monologue..."},{"name":"STIGMA4","text":"...Review of records of conflict on the Dragonstar indicate dragons maintained oral hygiene by masticating on rocks and similar objects. Necessity of a dental polishing service now brought into question."},{"name":"STIGMA4","text":"Nevertheless, there is a non-zero possibility of positive reception by café patrons. Production of specialized teeth cleaning drones added to queue, with trial runs to ensue. Allied unit's continued cooperation remains categorized as “necessary.”"},{"name":"STIGMA4","text":"（★未使用／削除予定★）"},{"name":"STIGMA4","text":"（★未使用／削除予定★）"},{"name":"STIGMA4","text":"（★未使用／削除予定★）"},{"name":"STIGMA4","text":"（★未使用／削除予定★）"},{"name":"STIGMA4","text":"（★未使用／削除予定★）"},{"name":"STIGMA4","text":"（★未使用／削除予定★）"},{"name":"OMICRON04632","text":"（★未使用／削除予定★）"},{"name":"OMICRON04632","text":"（★未使用／削除予定★）"},{"name":"OMICRON04632","text":"（★未使用／削除予定★）"},{"name":"STIGMA4","text":"（★未使用／削除予定★）"},{"name":"STIGMA4","text":"（★未使用／削除予定★）"},{"name":"STIGMA4","text":"（★未使用／削除予定★）"}],"reward":{"gil":655,"reputation":60,"items":[{"id":37854},{"id":6141}]},"reqs":{"beastrank":6,"jobs":[{"lvl":80,"id":32}]}},"partials":[{"type":"npc","id":"1043417","obj":{"i":1043417,"n":"Stigma-4","l":3712,"q":28}},{"type":"item","id":"37854","obj":{"i":37854,"n":"Omicron Omnitoken","l":1,"c":"t/65095","t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}