{"quest":{"name":"Truth Imperfect","location":"Stygian Insenescence Cells","id":70176,"patch":6.2,"sort":29,"icon":101196,"unlocksFunction":1,"eventIcon":71341,"issuer":1043497,"target":1043504,"genre":26,"journal":["Lahabrea is looking at Erichthonios with concern.","As Erichthonios regains his senses, Lahabrea finally shares the story of he and Athena. Conjuring phantom visions, he tells of his discovery of her experiments and journey into Pandæmonium to stop them. It is a story of betrayal and forlorn love, which resulted in Lahabrea and Athena bonding souls, and the former becoming corrupted by the latter's unquenchable thirst for knowledge. To save himself, Lahabrea was forced to cut away a part of his soul and seal it within a crystal. Yet even this was a part of Athena's scheme, as the crystal was used to imbue a vessel with life, creating Hephaistos.","With the truth of the matter laid bare at last, all that remains is to return to the surface. While there is yet more Erichthonios would say on the revelations which just transpired, he bids the group return to Pandæmonium's entrance, where the scars of the past do not linger.","Erichthonios thanks you and Themis for your efforts in aiding Pandæmonium─and in helping him understand his father. While questions remain as to the details of Hephaistos's experiments and Erichthonios's role in them, Lahabrea assures you that they are better left unanswered. When the topic of conversation turns to crystals, Themis remarks that the aether contained in the crystal you first showed him bore no resemblance to Hephaistos's, and wonders who might have sent it─a mystery of great interest to all present. As the others await such time as you are able to return with the crystal, they will set free the other warders, and inquire if any among them sent its message floating upon the aetherial sea.","You return to Claudien's laboratory to find a flustered Ruissenaud, who informs you that Claudien has gone missing and an unusual confluence of energy has been detected in the aetherial sea. Together you rush to the Aitiascope and are met with the sight of Pandæmonium floating in the once-empty void. Moments after, Fourchenault Leveilleur arrives as well, evidently drawn by the marked fluctuation in energy. Upon hearing your story, he deftly maps out a tentative course of action. Ishgard will be asked to aid in a search for Claudien, and the brightest minds in aetherial research will be gathered to keep track of changes in the aetherial sea. For the time being, he asks you to stand by to assist them when the next step is decided. He departs to make his own report to the Forum, leaving you and Ruissenaud behind to process what just occurred.","Before turning his wandering attention to his own report, Ruissenaud surmises that the hand behind Professor Claudien's disappearance may also have summoned Pandæmonium to the present. Like your allies in an age long past, he asks that you rest─warning that whatever may come, it is bound to demand your full strength."],"objectives":["Speak with Erichthonios.","Speak with Erichthonios at the Gates of Pandæmonium.","Speak with Ruissenaud at Aporia.","Speak with Ruissenaud."],"dialogue":[{"name":"ERICHTHONIOS","text":"Where...are we?"},{"name":"THEMIS","text":"What is this? The barriers around Pandæmonium are no longer under assault."},{"name":"LAHABREA","text":"I feel no trace of Hephaistos's poison in your mind, and for a blessing, it appears your body is none the worse for wear."},{"name":"THEMIS","text":"I made my way here as soon as I could. I no longer sense Hephaistos, and the force assailing Pandæmonium's barriers has ceased. Are we rid of him for good and all?"},{"name":"THEMIS","text":"...I see. Despite his muddled senses, Erichthonios felt that to seal Hephaistos away was the proper course."},{"name":"ERICHTHONIOS","text":"It wasn't so noble as that. I only knew something had to be done, so I acted."},{"name":"ERICHTHONIOS","text":"Lahabrea...was that how you dealt with Hephaistos in the past?"},{"name":"LAHABREA","text":"Indeed. He was naught but the parts of my memory and soul that I had cut away─a mass of aether without a material vessel. Storing his essence within a crystal was the most logical choice."},{"name":"THEMIS","text":"...On that matter, I believe the time has come for you to share the rest of your tale. Of Hephaistos's creation and Athena's end."},{"name":"ERICHTHONIOS","text":"I heard your words, but only vaguely, as if from under the surface of a deep pool. My mother wished...to use me?"},{"name":"ERICHTHONIOS","text":"I would hear the whole truth. I want to know what happened here, and what drove Athena to act as she did. I'm ready."},{"name":"LAHABREA","text":"Athena's brilliance outshone us all─even the other members of the Words of Lahabrea were as children in comparison. So dedicated to research was she that it was not unheard of for her to forget meals or even sleep."},{"name":"LAHABREA","text":"Her mind was ever grasping for knowledge, and it was in this endless search that she became obsessed with uncovering the secrets of life."},{"name":"LAHABREA","text":"You see, while we can conceive life in various forms, the means of creating a <span class=\"emphasis\">soul</span> are beyond our ken. Similarly, though we can enhance and alter our physical vessels, we have ever been bound to them. Athena's purpose was to shatter these limitations."},{"name":"THEMIS","text":"Such limitations as we were not meant to surpass. She sought to enter the realm of the gods."},{"name":"THEMIS","text":"Scarce few have the ability to comprehend what such a task entails, let alone the courage to attempt it."},{"name":"ERICHTHONIOS","text":"For most, the thought would be an idle fancy, considered once and then discarded. Not so for Athena..."},{"name":"LAHABREA","text":"As leader of the Words of Lahabrea, I spoke with her often about transcending our being. From an academic perspective, the challenge has plagued countless researchers through the ages."},{"name":"LAHABREA","text":"It was during these musings that I began to formulate a theory─a means by which a person could meld with a creation. The weaknesses of one would be mitigated by the strengths of the other, and the result could be something greater than we have ever imagined."},{"name":"LAHABREA","text":"Although it was but a theory, Athena insisted I develop it further, curious about every detail along the way. Our conversations became more frequent, and our platonic relationship grew into something much more..."},{"name":"ERICHTHONIOS","text":"I take it I was born not soon after..."},{"name":"LAHABREA","text":"Just so. I believed she bore true affection for me, and was blind to her hidden intentions. When Pandæmonium was built and she requested to lead the researchers, I saw no reason to deny her."},{"name":"LAHABREA","text":"Even setting aside our relationship, her accomplishments as a scholar made her the obvious choice. However, in giving her Pandæmonium, I also gave her free rein to conduct whatsoever experiments she could devise."},{"name":"ERICHTHONIOS","text":"And when you found out what she was doing...you killed her."},{"name":"LAHABREA","text":"I made haste to Pandæmonium the moment I learned of these hidden chambers. I left Agdistis to keep watch from Tartaros's vestibule as I ventured deeper, knowing not what would await me."},{"name":"LAHABREA","text":"...As for what occurred next, 'tis best to see with your own eyes."},{"name":"ERICHTHONIOS","text":"Is that...me?"},{"name":"LAHABREA","text":"You are well aware that out of respect for our neighbors in Elpis, the researchers of Pandæmonium are not to be masked."},{"name":"LAHABREA","text":"Yet you stand before me with your face covered. What petty defiance is this?"},{"name":"ATHENA","text":"What indeed? So quick you are to rebuke me, though you yourself have not set foot in these halls since their inception."},{"name":"LAHABREA","text":"You must have known you could not conceal this from myself and Agdistis forever...as well you know that I cannot allow it to continue."},{"name":"LAHABREA","text":"I shall say this but once: release Erichthonios. Else I shall have no choice but to strike you down."},{"name":"ATHENA","text":"I would meet my end at the hands of none other. However, ere my time is come, I will have you know the why of it."},{"name":"LAHABREA","text":"...Then you will not desist."},{"name":"ATHENA","text":"Once you understand what has driven me this far, you shall see that stopping was never an option."},{"name":"LAHABREA","text":"The feelings of one weigh little against the needs of the entire star."},{"name":"ATHENA","text":"Of course, of that I am well aware. But you did not deign to descend from your lofty heights simply to lecture me as you would a child."},{"name":"ATHENA","text":"You have an interest in my motivations. What possessed Athena, peerless researcher and mother to the son of the great Lahabrea, to embark upon the path to her downfall?"},{"name":"ATHENA","text":"History will demand an answer, but it is you who deserves one. Give me your hand, Lahabrea, and we shall know one another more deeply than ever before."},{"name":"THEMIS","text":"Impossible... You bonded your souls?"},{"name":"LAHABREA","text":"Aye. That the boundaries between us would cease to be... She offered me everything, to be understood."},{"name":"LAHABREA","text":"I found myself unable to refuse. At that moment, my mind was a storm of questions, yet one roared the loudest..."},{"name":"LAHABREA","text":"Did Athena ever truly love me?"},{"name":"ATHENA","text":"I am become thee, memory and mind..."},{"name":"LAHABREA","text":"...And I, thee."},{"name":"ATHENA","text":"(-Athena's Voice-)...Can you feel it?"},{"name":"ATHENA","text":"(-Athena's Voice-)My heart... All that I am."},{"name":"LAHABREA","text":"Yes. As if it were my own..."},{"name":"LAHABREA","text":"A fathomless desire to dissect the mysteries of life... To transcend our mortal flesh, and bleed into a higher plane of existence!"},{"name":"LAHABREA","text":"An unquenchable thirst for knowledge. Not a single thought spared for another...for the star!"},{"name":"ATHENA","text":"How disappointing..."},{"name":"ATHENA","text":"Yet what is known cannot be unknown. You have beheld my life's work."},{"name":"ATHENA","text":"Try as you might to excise the memory, the seed of desire remains. And when it takes root, you too shall be consumed by the selfsame fervor."},{"name":"LAHABREA","text":"I will dig it out! I will dispense with the corruption in my soul ere your rotten insight spreads."},{"name":"LAHABREA","text":"'Twas my weakness that let this wickedness fester─but never again. Today I cast aside fickle emotion, and abide in duty alone."},{"name":"LAHABREA","text":"Today I renounce all that I was, and live only as Lahabrea!"},{"name":"LAHABREA","text":"Thus did I forsake the part of myself that had been polluted by Athena, sealing it within a crystal."},{"name":"LAHABREA","text":"Never did I think I would one day face those memories made flesh."},{"name":"THEMIS","text":"Forgive my bluntness, but your actions bordered on insanity. To go to such lengths to escape your memories... You nearly rewrote your very existence."},{"name":"LAHABREA","text":"Rest assured, the change did not go unnoticed by our colleagues in the Convocation. Igeyorhm and Emet–Selch, in particular, made plain the suspicions they harbored."},{"name":"THEMIS","text":"As well they should have... That you escaped with your life was nothing short of a miracle."},{"name":"ERICHTHONIOS","text":"...Why didn't you destroy the crystal then and there? Did you think to one day make use of the knowledge it contained?"},{"name":"LAHABREA","text":"I will not deny such considerations played into my decision, but my main motivation was fear. I had never attempted such a feat before."},{"name":"LAHABREA","text":"The crystal was my sole recourse should something go awry with the remainder of my soul. In hindsight, to cling to it was a mistake born of doubt..."},{"name":"LAHABREA","text":"Athena must have anticipated that I would resort to such measures, and prepared a vessel beforehand that would accept the dregs of my soul."},{"name":"LAHABREA","text":"Hephaistos doubtless believed he was performing his duty as a husband and father should. Yet in truth, he was but a puppet being pulled to and fro by Athena's desires."},{"name":"LAHABREA","text":"His goal was not to raise himself high... He thought only of seeing his dear Athena live again, that she might finish what she began."},{"name":"LAHABREA","text":"Yet for all of that, he and I were alike. We yet shared a fatal flaw, you see─our need for control blinded us to other perspectives."},{"name":"ERICHTHONIOS","text":"While I was in thrall to Hephaistos, you called out to me. What say you now? Does Lahabrea speak true?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"He did promise."},{"name":"A2","text":"Yes, and now it's your turn to do the same."},{"name":"A3","text":"What does your heart tell you?"},{"name":"ERICHTHONIOS","text":"...I just want to know one thing. Did you truly believe that hiding the truth was best for <span class=\"emphasis\">me</span>? Even knowing how I felt about my mother?"},{"name":"ERICHTHONIOS","text":"The Lahabrea I know had a “fatal flaw,” after all. I'm still not convinced."},{"name":"LAHABREA","text":"I have said all that I can say. Now it is for you to choose to believe me...or not."},{"name":"ERICHTHONIOS","text":"The Lahabrea I know holds duty above all else. I would sooner prostrate myself before an erupting volcano than place my fickle emotions in his path."},{"name":"ERICHTHONIOS","text":"When you return to the surface, you'll doubtless don that mask once more. So before we climb out of this forsaken pit, I suppose I should say..."},{"name":"ERICHTHONIOS","text":"Thank you, Hephaistos."},{"name":"LAHABREA","text":"I have said all that needs to be said. From this moment forward, I pledge that my heart shall not lead me astray."},{"name":"THEMIS","text":"Hephaistos was far more than an imitation of Lahabrea. He was quite literally a part of him..."},{"name":"THEMIS","text":"But Lahabrea, to me, is a man who thinks of naught but his duty. By casting aside the burden that Hephaistos represented, he shall become ever more “himself,” in a way."},{"name":"ERICHTHONIOS","text":"I've heard enough. There is more I would yet discuss, but we should first return to Pandæmonium's gates. I'll gather my thoughts on the way."},{"name":"LAHABREA","text":"Athena viewed Erichthonios as the ideal test subject. Hephaistos's research must have been very nearly complete, to seek him out like he did..."},{"name":"THEMIS","text":"We have regained complete control of the facility, but it shall take some time yet until things are in working order again."},{"name":"ERICHTHONIOS","text":"I owe you an apology, <span class=\"highlight\">Forename</span>. It was due to my own inexperience that Hephaistos was so easily able to take hold of my mind."},{"name":"ERICHTHONIOS","text":"I also owe you thanks. If you and Themis hadn't chosen to brave the chaos occurring in Pandæmonium, then I would have never known Lahabrea's story. My father's story."},{"name":"THEMIS","text":"'Twas a tale I too was fascinated to hear. I very much look forward to speaking with Azem upon my return─I cannot help but wonder how much of this <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> foresaw."},{"name":"LAHABREA","text":"...I am afraid I cannot allow that, Elidibus. So long as you retain control of Pandæmonium, there is work to be done."},{"name":"THEMIS","text":"But of course. I shall first free the remaining warders and restore this place to its former glory."},{"name":"LAHABREA","text":"Using the facilities in Tartaros, we should be able to reverse the changes made to their bodies and minds. I shall stay behind to oversee the process."},{"name":"ERICHTHONIOS","text":"That is well, but I must yet learn why <span class=\"emphasis\">I</span> was considered the key to Hephaistos's experiments, and how he intended to revive Athena."},{"name":"LAHABREA","text":"Such questions are best left unanswered. In fact, I forbid the pursuit of that knowledge─the boundary between man and creation shall never again be crossed."},{"name":"LAHABREA","text":"And I intend to destroy the crystal containing Hephaistos's essence, that this mistake never again repeats."},{"name":"THEMIS","text":"I see no reason to gainsay your judgment."},{"name":"THEMIS","text":"There is yet the matter of <span class=\"emphasis\">your</span> crystal, however. Truth be told, I had not considered its origin until I saw the one containing Hephaistos's aether. I was struck by how wholly different they were."},{"name":"LAHABREA","text":"...There is another?"},{"name":"LAHABREA","text":"While imbuing a crystal with memories is a simple process, storing a message─a warning, even─would be something altogether more complex."},{"name":"LAHABREA","text":"This also means that someone besides the present company─and Azem─was aware of the plot unfolding within Pandæmonium."},{"name":"ERICHTHONIOS","text":"Then why would they not make themselves known, even now? No threats remain..."},{"name":"LAHABREA","text":"Perhaps it was one of the other warders. We shall question them after they are freed."},{"name":"ERICHTHONIOS","text":"That task may take some time─a resource I'd rather not steal more of from you. Return at your leisure, and we will share our results then. You've done more than enough for the time being."},{"name":"THEMIS","text":"I am of the same mind. Leave the loose ends to us, and continue upon your journey. Or if you are so inclined, take a much-needed repose."},{"name":"LAHABREA","text":"...This talk of journeys smacks of Azem."},{"name":"THEMIS","text":"As well it should. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> has pledged to keep moving until <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> has seen every corner of the world."},{"name":"ERICHTHONIOS","text":"If you do find yourself with a spare moment, you might bring that crystal of yours to Lahabrea─he may be able to offer further insight. Until then, my friend."},{"name":"ERICHTHONIOS","text":"As you may have noticed during our battle, Lahabrea's mask crowns me when I've transformed."},{"name":"ERICHTHONIOS","text":"It is said that we manifest in a way that reflects our innermost selves. I had thought that mask a symbol of the chains that bound my heart, but recent events have caused me to reconsider that assumption..."},{"name":"THEMIS","text":"I look forward to your returning with the crystal... But worry not, I shall try my level best to stave off loneliness while you are gone."},{"name":"LAHABREA","text":"The crystal that hangs from Erichthonios's waist was a gift from me, made in the hopes that it would spark growth in his aptitude for magic. 'Tis plain he no longer requires it, but I see no reason he cannot wear it for a while longer."},{"name":"LAHABREA","text":"Why, if it isn't <span class=\"highlight\">Forename</span>! Excuse me if I'm not my usual chipper self, but we have not been without our difficulties in your absence..."},{"name":"LAHABREA","text":"You see, communication with the airship Professor Claudien commissioned for his search was lost some time ago, and now we have quite lost track of where he might be!"},{"name":"LAHABREA","text":"And to make matters worse, Nemjiji has just sent word of an unusually large amount of energy coming from somewhere within the aetherial sea. I was just on my way to the Aitiascope, in fact─please, you must come with me!"},{"name":"RUISSENAUD","text":"What... What is that? Is it real!?"},{"name":"FOURCHENAULT","text":"(-???-)Why is it that whenever danger visits the world, you are never far behind?"},{"name":"FOURCHENAULT","text":"And you two... Professor Claudien's assistants, I take it?"},{"name":"FOURCHENAULT","text":"As you arrived before me, I take it you are involved in this. I would thank you to furnish me with an explanation."},{"name":"FOURCHENAULT","text":"While the research summary you submitted to the Forum gave us no cause for concern, these details are...alarming."},{"name":"NEMJIJI","text":"The professor's last message indicated he was on his way to Azys Lla, but we know not whether he ever reached his destination."},{"name":"FOURCHENAULT","text":"A rash endeavor, even for Claudien─but he has ever allowed the thrill of discovery to cloud his better judgment. We have no recourse but to entreat Ishgard's aid in searching for him."},{"name":"FOURCHENAULT","text":"As for that unsightly fortress which materialized in the aetherial sea─Pandæmonium, was it?─it cannot be left alone."},{"name":"FOURCHENAULT","text":"For the time being, information regarding this matter must be strictly controlled so as to minimize panic. We will gather those with knowledge of the aetherial sea, and continue monitoring it for further irregularities."},{"name":"FOURCHENAULT","text":"You two, submit a <span class=\"emphasis\">detailed</span> report to the Forum at once."},{"name":"FOURCHENAULT","text":"At present, we have far more questions than answers. Nevertheless, I would ask for your assistance at such a time that our investigation has concluded."},{"name":"FOURCHENAULT","text":"Very good. Now if you will excuse me, I must apprise the Forum of what has occurred here."},{"name":"RUISSENAUD","text":"Just when we need him the most, Professor Claudien remains unaccounted for."},{"name":"RUISSENAUD","text":"He even brought the crystal with him. We are left with scarce few straws to grasp at..."},{"name":"RUISSENAUD","text":"While I am but a lowly assistant, even I can see that our two current problems are likely related. The same party or phenomenon may be responsible for both."},{"name":"RUISSENAUD","text":"Conversely, I see now that my unexperienced imagination failed to do Pandæmonium's pitiless spires justice. I can only wonder─if the facility itself traversed the ages, did the creations within do the same? What of the keywards?"},{"name":"RUISSENAUD","text":"...But answers to these questions shall come in time, I am sure. For now, I must do as Master Fourchenault asked and write that report!"},{"name":"RUISSENAUD","text":"As for you, <span class=\"highlight\">Forename</span>, pray get what rest your responsibilities will allow. When next we call upon you, I wager we shall need you in prime condition!"}],"reward":{"gil":7500,"items":[{"id":33918},{"id":33919},{"id":33920},{"num":3,"id":33928,"one":1},{"num":3,"id":33929,"one":1},{"num":3,"id":33921,"one":1},{"num":3,"id":33917,"one":1}]},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70175]}},"partials":[{"type":"npc","id":"1043497","obj":{"i":1043497,"n":"Lahabrea","l":4250,"q":2}},{"type":"npc","id":"1043504","obj":{"i":1043504,"n":"Ruissenaud","l":3708,"q":1}},{"type":"item","id":"33918","obj":{"i":33918,"n":"Heavens' Eye Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"33919","obj":{"i":33919,"n":"Savage Aim Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Critical Hit","category":0}}},{"type":"item","id":"33920","obj":{"i":33920,"n":"Savage Might Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Determination","category":0}}},{"type":"item","id":"33928","obj":{"i":33928,"n":"Quickarm Materia IX","l":560,"c":20282,"t":58,"materia":{"tier":8,"value":12,"attr":"Skill Speed","category":0}}},{"type":"item","id":"33929","obj":{"i":33929,"n":"Quicktongue Materia IX","l":560,"c":20282,"t":58,"materia":{"tier":8,"value":12,"attr":"Spell Speed","category":0}}},{"type":"item","id":"33921","obj":{"i":33921,"n":"Battledance Materia IX","l":560,"c":20281,"t":58,"materia":{"tier":8,"value":12,"attr":"Tenacity","category":0}}},{"type":"item","id":"33917","obj":{"i":33917,"n":"Piety Materia IX","l":560,"c":20281,"t":58,"materia":{"tier":8,"value":12,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"quest","id":"70175","obj":{"i":70175,"n":"One Final Wish","g":26,"l":"The Gates of Pandæmonium","s":28,"f":1}}]}