{"quest":{"name":"An Unwelcome Visitor","location":"Labyrinthos","id":70171,"patch":6.2,"sort":24,"icon":101195,"unlocksFunction":1,"eventIcon":71341,"issuer":1041258,"target":1043489,"genre":26,"journal":["Claudien's eyes are brimming with the excitement of discovery.","Professor Claudien can scarcely contain his excitement as he informs you that the crystal has guided him to signs of another such memory repository that yet exists in the present day. He hastily departs to search for it, but not before asking you to make sure no further danger has visited Pandæmonium. A somewhat miffed Nemjiji, however, suggests first scouring the archives of Elpis for information on the failed creations interred within, that you might gain the upper hand in any future encounters.","You arrive at Peripeteia Krystalline to see Themis speaking with one of the archivists, seemingly for the same purpose as you. He offers to share his findings, but first asks that you accompany him to the beacon in Lethe, where he intends to meet an acquaintance that might shed further light upon the facility's mysteries.","Themis's acquaintance is in fact a member of the Words of Lahabrea, and their conversation reveals that while at first, Pandæmonium's researchers received creations from Elpis, over the years their focus shifted toward creations too flawed even to be considered for submission. Furthermore, the researcher informs you that a recent report from a keyward indicated that nothing is amiss in the facility. Knowing this to be a lie, Themis hurries to Asphodelos, where Erichthonios keeps a lone vigil.","As you reach the Gates of Pandæmonium, you are met with the sight of Erichthonios being held aloft by some unknown force. Themis dispels the bindings, and you observe their maker to be a familiar, who makes vaguely threatening utterances before vanishing, though thankfully without Erichthonios in tow.","Only the troubled-but-determined Erichthonios knows what transpired between him and Lahabrea moments ago. Fortunately, he seems more than happy to share the conclusion to which it has led him, should you but ask."],"objectives":["Speak with the archivist at Peripeteia Krystalline.","Speak with Themis.","Speak with Themis at the neus to Pandæmonium.","Speak with Erichthonios."],"dialogue":[{"name":"CLAUDIEN","text":"<span class=\"highlight\">Forename</span>, <span class=\"highlight\">Forename</span>! I've made a breakthrough! After uncountable days and nights, I finally hearkened to the crystal's whispers, and I must say─"},{"name":"NEMJIJI","text":"Professor Claudien, where are your manners? While I understand all too well your enthusiasm, I must remind you that even the most academically inclined prefer a <span class=\"emphasis\">composed</span> recounting of events."},{"name":"CLAUDIEN","text":"Ah... Yes, of course! My apologies, <span class=\"highlight\">Forename</span>. Being consumed by my research for so long, I am afraid I have quite forgotten how to engage in civilized conversation."},{"name":"CLAUDIEN","text":"Ahem. In that case, perhaps we should start from the beginning─with a crystal set adrift upon the aetherial tides, containing the memories of a party yet unknown..."},{"name":"CLAUDIEN","text":"They cried out for deliverance from Pandæmonium, where the ancients kept volatile creations under lock and key. You yourself witnessed the power devouring the facility from within, and the advent of a divine monstrosity wrought of mythic beast and powerful mage..."},{"name":"CLAUDIEN","text":"Fortunately, your martial prowess and the combined magical talents of your companions Themis and Erichthonios was sufficient to restore order to the circles of Asphodelos, but the greater threat remains."},{"name":"CLAUDIEN","text":"In the depths of Pandæmonium, a presence yet stirs, its intentions and identity shrouded in mystery. That is the issue at hand, is it not?"},{"name":"CLAUDIEN","text":"Since you returned to us, we worked tirelessly to discern the nature of the crystal. In the process, I detected an anomalous aetheric signature, which I believe arose from the memories stored within."},{"name":"CLAUDIEN","text":"Analysis of this pattern suggested a feeling of loss or yearning─specifically, the yearning to be made whole. And indeed, ambient readings have revealed a faint but identical signature! This can only mean that another such crystal exists in our time."},{"name":"CLAUDIEN","text":"So, my friend, I must depart to search for it forthwith. By tracing the matching aetheric signature to its source, I believe it will be a simple matter to find our crystal's twin."},{"name":"RUISSENAUD","text":"...Professor, will this expedition be carried out only by us? Or will <span class=\"highlight\">Forename</span> grace us with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> protection?"},{"name":"CLAUDIEN","text":"I'm afraid <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> has more pressing matters to attend to, my dear Ruissenaud. Namely, to seek out the secrets which lie nestled within Pandæmonium, where this all began."},{"name":"CLAUDIEN","text":"From all that we have heard, it appears that time traversal from the Crystal Tower is not fluid. That is to say, one can but travel in predetermined intervals. It would be prudent to check in on occasion, in case there are any unanticipated changes."},{"name":"CLAUDIEN","text":"As for you, my loyal assistants, I would ask you to remain here and continue cataloging the ancient creations."},{"name":"RUISSENAUD","text":"You can't mean... Do you intend to search for the crystal on your own?"},{"name":"CLAUDIEN","text":"Why yes, that <span class=\"emphasis\">would</span> be the most efficient use of resources, would it not? In fact, I have already commissioned a ship and pilot for that very purpose. I trust you to take good care of the laboratory in my absence."},{"name":"RUISSENAUD","text":"...I apologize for that somewhat abrupt departure. When progress is in sight, Professor Claudien tends to become blind to all else."},{"name":"NEMJIJI","text":"Indeed, and he has been worse than usual. While I cannot fault him for his excitement, I do wish he would spare a thought for those around him..."},{"name":"NEMJIJI","text":"For reasons unknown, the crystal seems loath to be overheard. Much as it spoke only to you last time, none but the professor has been able to capture its aetherial “yearning”...which has served only to convince him that he can solve this puzzle on his own!"},{"name":"RUISSENAUD","text":"Surely after some time alone he'll come to remember how valuable we are. The search for this crystal seemed to be a simple enough matter─let him have his adventure, and upon his return I'm certain he'll be back to his usual self."},{"name":"RUISSENAUD","text":"As for you, <span class=\"highlight\">Forename</span>, it may be best to return to Pandæmonium, as Professor Claudien suggested."},{"name":"NEMJIJI","text":"Speaking of which, I did have a request of my own to make. Traveling to Pandæmonium requires you to pass through Elpis, correct? There is something I would have you investigate in my stead."},{"name":"NEMJIJI","text":"While those creations confined within Pandæmonium are considered to be failures, I doubt that's their whole story."},{"name":"NEMJIJI","text":"Barring exceptional cases, they must have been under observation in Elpis before being consigned to their shackles. And if we know anything about the ancients, it's that they would have kept thorough records of the results."},{"name":"RUISSENAUD","text":"Ah, brilliant... Delving into these records may shed light on creatures <span class=\"highlight\">Forename</span> has yet to encounter. If your theory proves correct, that is."},{"name":"NEMJIJI","text":"While there are no guarantees, it certainly beats the current strategy of rushing forward blindly with only <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> strength to carry the day. For your own sake as well as ours, please unearth what information you can."},{"name":"THEMIS","text":"Ah, I did not expect to meet you here, of all places."},{"name":"STAFF04635","text":"...You seek records of Pandæmonium's creations? Master Themis has just finished perusing the very same."},{"name":"THEMIS","text":"I should not be surprised that we both arrived at the same conclusion. Luckily, I have saved you the trouble and gleaned what information I could."},{"name":"STAFF04635","text":"Ah, so you know each other. I was dreading having to once again scour the archives, but perhaps instead I'll rest for a spell. If there's nothing else, I shall take my leave."},{"name":"THEMIS","text":"As should we, for I have undone the warding sigil blocking the entrance to Abyssos. I came here merely to chase an idle suspicion while awaiting your return."},{"name":"THEMIS","text":"Fortunately, while Pandæmonium's protective wards continue to be assailed by our unknown foe, there have been no fluctuations so great as to make me doubt Erichthonios's capacity to keep watch over Asphodelos while I'm away."},{"name":"THEMIS","text":"He works diligently to master interment, that he might deliver the creations back to their cages by his own hand. I thought it best to give him time to hone his craft."},{"name":"THEMIS","text":"...And since fate has brought us both here, I would ask you to accompany me while I attend to another matter. More idle suspicions that I would like to chase down."},{"name":"THEMIS","text":"Rest assured, it shall not take long. I simply have a few questions to ask an acquaintance of mine. Come, he has agreed to meet us near the neus to Pandæmonium."},{"name":"THEMIS","text":"As I have pondered our expedition into Pandæmonium, I could not help but be mystified by how strongly the warders we encountered felt for Lahabrea, whether it be for good or ill."},{"name":"THEMIS","text":"Hesperos and Erichthonios were two sides of the same coin. The former looked to his mentor with absolute devotion, while the latter looks to his father with bald hatred."},{"name":"THEMIS","text":"I would not expect a familiar such as you to understand this, but such extreme emotions toward a single individual are quite rare indeed."},{"name":"THEMIS","text":"Naturally, I feel gratitude toward my mother and father, yet we are all equals in the larger picture of the star. This view is not unique to myself─it is more or less accepted as the way of things."},{"name":"THEMIS","text":"By contrast, the researchers of Pandæmonium seem to view Lahabrea with a feeling approaching obsession. Whether driven by love or hate, they have all been drawn to him."},{"name":"THEMIS","text":"There were many other aspects of the facility's particulars I found troubling besides. I decided the best course of action would be to go straight to the source, and pose my questions to a member of the Words of Lahabrea."},{"name":"STAFF04476","text":"My apologies to have kept you waiting, Master Themis."},{"name":"STAFF04476","text":"I understand you are conducting an investigation of Pandæmonium, and wish to know of its origins."},{"name":"THEMIS","text":"Indeed. In particular, I wish to know why exactly Pandæmonium was built directly under Elpis."},{"name":"THEMIS","text":"The facility is overseen by the Words of Lahabrea, after all. Why keep it so close to Elpis, whose governing body has no say in its day-to-day operations?"},{"name":"THEMIS","text":"At first I thought it to be simply a matter of convenience. Those creations which were deemed failures by the researchers of Elpis could be easily ushered into their new homes."},{"name":"THEMIS","text":"Imagine my surprise when a trip to the archives revealed that many of the creations were sent from organizations beyond Elpis, including from the Words of Lahabrea themselves."},{"name":"THEMIS","text":"Given this─albeit limited─information, I cannot but feel that the Akadaemia Anyder would have been a more fitting locale."},{"name":"THEMIS","text":"What does Elpis have that cannot be found there?"},{"name":"STAFF04476","text":"These are fitting questions, and ones we have asked ourselves many times in recent years. Alas, the nature of Pandæmonium's construction does not lend itself to relocation."},{"name":"STAFF04476","text":"When first it was built, circumstances weren't as they are now. As you surmised, the majority of the creations kept within Pandæmonium were sent from Elpis."},{"name":"STAFF04476","text":"Yet as the years passed, interests changed. Failures in creations deemed too flawed even to submit to Elpis paradoxically drew the attention of Pandæmonium's researchers."},{"name":"THEMIS","text":"...That is quite the change, and in fact it almost runs counter to the facility's original purpose. Who is it that decides which creations will be the subject of research?"},{"name":"STAFF04476","text":"Master Lahabrea. Such authority is reserved for the chief keyward, and he has taken it upon himself to step into that role."},{"name":"THEMIS","text":"So if Pandæmonium's resources <span class=\"emphasis\">were</span> being misused, it would be under Lahabrea's authority, correct?"},{"name":"STAFF04476","text":"I know not what you're suggesting, but the keywards also hold some sway within the facility. Not even Master Lahabrea would be free from their scrutiny."},{"name":"STAFF04476","text":"They are duty-bound to report any irregularities as soon as possible."},{"name":"STAFF04476","text":"Although I admit as of late their communication has been somewhat sporadic, we but recently received a report from one of the keywards stating that all is well within Pandæmonium's halls."},{"name":"THEMIS","text":"Really? And you are certain that a keyward sent it?"},{"name":"STAFF04476","text":"Yes, of course. Our communications suffered a temporary obstruction, but I can assure you that the Words did their due diligence in confirming the identity of the sender."},{"name":"THEMIS","text":"...Thank you. This information will be helpful to my investigation. That will be all for my prying."},{"name":"STAFF04476","text":"Then I shall take my leave. While you are yet permitted to conduct your investigation freely, I must remind you that the warders' work is delicate, and it would be remiss to disturb them for longer than is necessary."},{"name":"THEMIS","text":"“All is well”... A blatant lie, and to that we can both attest. One of the remaining keywards is most certainly in league with the party behind this."},{"name":"THEMIS","text":"Let us hurry. I know not why our adversary sent that report, but 'tis plain that we must return to Pandæmonium with haste. "},{"name":"THEMIS","text":"I cannot guess as to why this false report has arisen now, but it certainly bodes ill. As does the knowledge that our mysterious mastermind has at least one more keyward to puppet..."},{"name":"THEMIS","text":"Regardless, they have tipped their hand, and we would be remiss to leave Erichthonios at the mercy of their machinations. Let us hope no harm has befallen him..."},{"name":"ERICHTHONIOS","text":"Not quite..."},{"name":"ERICHTHONIOS","text":"I've traced these sigils countless times, yet <span class=\"emphasis\">still</span> I lack the strength to maintain the spell."},{"name":"ERICHTHONIOS","text":"And now time works against me. I can no longer be victim to my own ineptitude..."},{"name":"ERICHTHONIOS","text":"...What!? Who goes there?"},{"name":"FAMILIA04635","text":"(-???-)Hehe. There is something to be admired in such single-minded effort. Even if your methods leave much to be desired."},{"name":"FAMILIA04635","text":"(-???-)You allowed this familiar to catch you unawares. Have you set your sights so high as to forget you walk upon the earth?"},{"name":"ERICHTHONIOS","text":"I know this creature─a familiar of the phoinix. But that monster is locked away..."},{"name":"FAMILIA04635","text":"That it is─in spite of the trouble I went to in freeing it, I might add. Begrudge me for addressing you in this ill-fitting form if you must, but with control of Asphodelos wrested from my grasp, 'tis simply the best I can offer you..."},{"name":"ERICHTHONIOS","text":"Hide if you will, but mark my words─I will find you, and make you pay for the chaos you've sown!"},{"name":"FAMILIA04635","text":"Now, now, there is no need for such hostility. “A calm heart stays the course.” The wisdom of Lahabrea...your father."},{"name":"ERICHTHONIOS","text":"...And how would you know what “wisdom” he speaks?"},{"name":"ERICHTHONIOS","text":"I have heard those words, many times. The scolding of a tutor whose student struggled to grasp the most rudimentary lessons, seething with disgust..."},{"name":"ERICHTHONIOS","text":"No..."},{"name":"ERICHTHONIOS","text":"I've not told that to anyone─not even Keyward Hesperos. That can only mean one thing..."},{"name":"ERICHTHONIOS","text":"That still you insist on mocking me!"},{"name":"ERICHTHONIOS","text":"Stop this farce, Lahabrea!"},{"name":"FAMILIA04635","text":"...At last, you move to keep up. Pity that you remain behind nevertheless."},{"name":"ERICHTHONIOS","text":"What!?"},{"name":"FAMILIA04635","text":"As ever you are. Always you fail to learn, fail to understand, fail to act..."},{"name":"FAMILIA04635","text":"And though fate deigned to offer an escape, you remain here. You are bereft of magical prowess and common sense both."},{"name":"FAMILIA04635","text":"But you need not despair. Dull though you may be, you are yet indispensable to Pandæmonium's great experiment."},{"name":"ERICHTHONIOS","text":"Ungh... There's the affection I remember. Tell me...did I ever once measure up to your expectations?"},{"name":"FAMILIA04635","text":"You shall. Take pride in that, and rejoice to see your wish fulfilled."},{"name":"ERICHTHONIOS","text":"What? What wish...?"},{"name":"FAMILIA04635","text":"Come, and all shall be revealed. All this rage, this hatred, is but a consequence of ignorance. Our desires align more than you know."},{"name":"ERICHTHONIOS","text":"What...are you...?"},{"name":"FAMILIA04635","text":"Hmm... Uninvited guests join our reunion. It seems fortune no longer favors you."},{"name":"ERICHTHONIOS","text":"Do you think I have any interest in listening to your prattle, let alone bowing to your will? I am no longer a child, and my faith lies with those who have earned it."},{"name":"FAMILIA04635","text":"So these are the “heroes” who brought Hesperos low, even as power divine flowed through his veins..."},{"name":"FAMILIA04635","text":"'Tis plain there are worthier subjects to contend with."},{"name":"THEMIS","text":"Just what was that familiar after?"},{"name":"ERICHTHONIOS","text":"Thank you. If you had shown up even a moment later, I shudder to think what would have become of me."},{"name":"ERICHTHONIOS","text":"There's something I must tell you─I know who's behind this. There is but one person who can hold thrall over familiar, creation, and keyward alike!"}],"reward":{"gil":1000},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70015]},"next":[70172]},"partials":[{"type":"npc","id":"1041258","obj":{"i":1041258,"n":"Claudien","l":3708,"q":1}},{"type":"npc","id":"1043489","obj":{"i":1043489,"n":"Erichthonios","l":4033,"q":2}},{"type":"quest","id":"70015","obj":{"i":70015,"n":"Who Wards the Warders?","g":26,"l":"The Gates of Pandæmonium","s":23,"f":1}},{"type":"quest","id":"70172","obj":{"i":70172,"n":"Masks of the Father","g":26,"l":"The Gates of Pandæmonium","s":25,"f":1}}]}