{"quest":{"name":"Servant of Violence","location":"The Gates of Pandæmonium","id":70174,"patch":6.2,"sort":27,"icon":112488,"unlocksFunction":1,"eventIcon":71341,"issuer":1043506,"target":1043495,"genre":26,"journal":["Erichthonios seems eager to dispel Lahabrea's doubts.","Lahabrea is impressed with your victory over Hegemone, and gives you leave to proceed deeper into Pandæmonium. However, he insists that Erichthonios stay behind, fearing him to be a liability during such a dangerous endeavor. The warder lashes out at his father, but is abruptly overcome by dark forces and spirited away to depths unknown. Time will be of the essence in determining your next course of action.","With Erichthonios now at the mercy of Hephaistos's experiments, the only option is to press forward as quickly as possible to Tartaros, the deepest part of Pandæmonium. Agdistis, the final keyward, stands in your way, and although she is hidden away in the facility's liminal spaces, your aether allows you to be conveyed directly to her lair. Make ready to test your mettle against Pandæmonium's most gifted keyward.<br><br>※Abyssos: The Seventh Circle can be accessed via the Duty Finder.","Hephaistos's attempts to create an immortal hemitheos have left little of Agdistis's once-brilliant mind behind, which is perhaps your saving grace in overcoming her primal fury. Having emerged victorious, you stand alone in the howling void.","Ere you can begin to panic about your means of return to the gates, Themis and Lahabrea appear, seemingly ushered to your location as if by an outside force. As you ponder this mystery, the essence of Agdistis materializes before you, and you recognize her voice as the one vaguely heard throughout your investigation. With the last of her waning strength, she reveals a truth that Lahabrea long concealed for his son's peace of mind─namely, that Athena intended to use Erichthonios as a test subject for her experiments. Pieces of the puzzle are beginning to fall into place, with the promise of more to be found as you make ready to confront Hephaistos at last.","While Lahabrea grumbles about Agdistis's gall in putting his past on display, he also surmises that she was glad to face such a strong foe at the last─as close to an admission of sorrow as you are likely to hear from him. With the path into Tartaros clear, there is nowhere left to go but down..."],"objectives":["Speak with Lahabrea.","Enter Abyssos: The Seventh Circle.","Speak with Lahabrea."],"dialogue":[{"name":"LAHABREA","text":"I could sense from here that Hegemone had been contained. The effect of Hephaistos's tinkering is even more dire than I had imagined..."},{"name":"THEMIS","text":"As is to be expected, Erichthonios appears quite pleased with our victory."},{"name":"ERICHTHONIOS","text":"...Our plan was a success, although I hardly need to tell you that. Hegemone has been sealed away, and now you have no choice but to admit the merit in our methods."},{"name":"LAHABREA","text":"You have the right of it. I am not so petty as to deny the achievements of those I've squabbled with, no matter how strongly we disagree."},{"name":"LAHABREA","text":"Moreover, this being─aether as thin as retreating mist, unable to wield creation magicks, yet powerful enough to subdue a hemitheos─has made this ordeal far more interesting."},{"name":"ERICHTHONIOS","text":"Then we have leave to continue?"},{"name":"LAHABREA","text":"As for that...there is one among you whose very presence puts the others at risk. 'Twould be best to proceed without him, for failure would have consequences that reach far beyond Pandæmonium."},{"name":"ERICHTHONIOS","text":"...And of whom do you speak?"},{"name":"LAHABREA","text":"A warder who cannot even conduct his duty without aid. In this place, hope alone is not enough to overcome what awaits you. A single misstep will send all to their doom."},{"name":"ERICHTHONIOS","text":"So long as we each do our part and look to the allies by our side, even a neophyte can upraise his companions. That's something that <span class=\"highlight\">Forename</span> and Themis taught me."},{"name":"THEMIS","text":"While I do not wish to express any bias, I am inclined to agree. If my investigation has made anything clear, it is that we are together greater than the sum of our parts."},{"name":"ERICHTHONIOS","text":"And hope has brought us this far! It drives us to seek the <span class=\"emphasis\">right</span> path─and to act before that path lies closed to us."},{"name":"LAHABREA","text":"Then tell me─what is it you hope for?"},{"name":"ERICHTHONIOS","text":"To see Hephaistos in chains. That's the surest way to prevent further sacrifices."},{"name":"ERICHTHONIOS","text":"I'm aware that destroying Pandæmonium would rid us of him, but the cost is far too great."},{"name":"ERICHTHONIOS","text":"And I admit...I wish to know how he means to resurrect Athena."},{"name":"LAHABREA","text":"...And there we have it."},{"name":"LAHABREA","text":"You must leave this place at once. And do not think to set foot in Pandæmonium again."},{"name":"LAHABREA","text":"You are capable, that much is plain. Yet Hephaistos cannot be suffered to live. And I shall not allow his talk of resurrection to poison mine or anyone else's mind."},{"name":"LAHABREA","text":"Life flows in a cycle. This is known."},{"name":"LAHABREA","text":"All souls return to the Underworld, and Athena's is no exception. She has likely found a new vessel─and a new journey to embark upon."},{"name":"LAHABREA","text":"You cannot be ignorant to the folly of Hephaistos's words. Even were he to breathe life into a body, the soul contained within would not be your mother's."},{"name":"ERICHTHONIOS","text":"What if our knowledge is imperfect? What if Hephaistos has discovered something that no one else has?"},{"name":"ERICHTHONIOS","text":"He knows all that you do. Understands the bitter reality of the world. He wouldn't pursue the impossible!"},{"name":"LAHABREA","text":"Think, Erichthonios. I have already explained that he is merely my twisted reflection. Is it worth bringing back your mother if it means others are used and discarded like tools?"},{"name":"ERICHTHONIOS","text":"Is it worth it? To see her once more..."},{"name":"LAHABREA","text":"<span class=\"emphasis\">Now</span> you measure the worth of your colleagues' lives? What was that foolish braying about saving them? Merely a performance to hide your childish devotion to your mother?"},{"name":"THEMIS","text":"Please, such barbs will get us nowhere. We should first discuss─"},{"name":"ERICHTHONIOS","text":"You would call <span class=\"emphasis\">me</span> “fool”? You, who murdered your wife in service of your ambition!? “For the sake of the star,” no doubt..."},{"name":"ERICHTHONIOS","text":"Ungh... I can hear it again. That voice...inside my head..."},{"name":"ERICHTHONIOS","text":"I know who to follow... Hephaistos... Father!"},{"name":"ERICHTHONIOS","text":"Mother... Oh, I love you so! And this voice...will guide me to you!"},{"name":"DEIANEIRA","text":"(-Distant Voice-)No, listen not! Listen not, Erichthonios!"},{"name":"ERICHTHONIOS","text":"Apologies. You taught me that a calm heart stays the course...but I could never even grasp the rudder."},{"name":"THEMIS","text":"This was Hephaistos's work, there can be no doubt. It seems he learned from his previous failure."},{"name":"LAHABREA","text":"Hephaistos is cunning despite his warped mind. Whatever took hold of Erichthonios, it made short work of his reason."},{"name":"LAHABREA","text":"From the moment he laid eyes upon me, I could sense his hatred and rage simmering below the surface. 'Twas but a matter of time until it spilled forth─and that was when he fell into the spell's embrace."},{"name":"LAHABREA","text":"A magic woven with such skill that Erichthonios himself failed to notice until it was too late."},{"name":"THEMIS","text":"If this is the measure of Hephaistos's power, then the other keywards had little chance to resist it."},{"name":"THEMIS","text":"We saw his work during our encounter with Hesperos. Doubtless Hephaistos's magicks fed his admiration and envy until there was room for naught else in his heart."},{"name":"THEMIS","text":"And there was something else besides... Did you not feel the presence of another?"},{"name":"THEMIS","text":"As I thought. Someone was trying to warn Erichthonios, but whom? Could it have been one of the keywards?"},{"name":"LAHABREA","text":"Alas, their warning arrived too late. I had already provoked Erichthonios past the point of no return."},{"name":"LAHABREA","text":"I bear the burden for this failure. In my stubbornness I could but scorn the boy, and Hephaistos knew that."},{"name":"LAHABREA","text":"And now I dread to think of the ordeal that awaits him due to my rashness..."},{"name":"THEMIS","text":"...There is time yet to save him. We can easily regain control of Abyssos, giving us a firm foothold from which to brave Pandæmonium's lowest level. The enemy is within reach."},{"name":"THEMIS","text":"Just as with Hesperos, Erichthonios is in danger of being consumed by Hephaistos's spell. However, I have faith that he will not easily lose sight of himself!"},{"name":"THEMIS","text":"The way forward is clear. Lahabrea, pray tell us all you know of what we shall find beyond Abyssos. I can only assume one more keyward lies in wait."},{"name":"LAHABREA","text":"The deepest level of Pandæmonium is called Tartaros, and your passage shall be challenged not only by a keyward..."},{"name":"LAHABREA","text":"Hephaistos has laid traps in every corner of its halls. You have no hope of surviving far past the threshold."},{"name":"THEMIS","text":"...That, I expect, is where <span class=\"highlight\">Forename</span> shall shine."},{"name":"THEMIS","text":"<span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> dissolute aether shall allow <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to slip through the traps unimpeded. We saw it when Hephaistos's had no effect, and doubtless even he has yet to devise a countermeasure."},{"name":"LAHABREA","text":"Then time is of the essence. Hephaistos is already well aware that you can match a keyward in battle─he will not stand idle while you stroll past his other defenses at your leisure."},{"name":"THEMIS","text":"Agreed. However, clarity will be indispensable to our success, and I'm afraid I must insist upon it ere we depart."},{"name":"THEMIS","text":"We have yet to discern to what end Hephaistos would use Erichthonios. If you know, I would ask that you enlighten us."},{"name":"THEMIS","text":"And then there is the matter of Athena. Why do you so fiercely rebuke Erichthonios's feelings for his mother?"},{"name":"THEMIS","text":"While I understand the very thought of resurrecting the dead is anathema, you act as if grief over her passing should be equally so. How are we to grapple with what plagues our friend and drives our foe if you refuse to acknowledge it?"},{"name":"LAHABREA","text":"I do acknowledge it. I wish only to spare those that feel it still greater pain."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Did you mean to protect Erichthonios with your silence?"},{"name":"A2","text":"So instead of being honest, you bicker like a child?"},{"name":"A3","text":"And so you drove your own son over the edge."},{"name":"LAHABREA","text":"How dare you..."},{"name":"LAHABREA","text":"...No, no. You are right. The blame for Erichthonios's fate rests squarely on my shoulders."},{"name":"LAHABREA","text":"Very well. I shall lay bare the truth, but only after the foe before us has been laid low."},{"name":"LAHABREA","text":"The remaining keyward is Agdistis. She has served in Pandæmonium since its inception, and her affinity for magic is peerless even among the keywards."},{"name":"LAHABREA","text":"Hephaistos knows that losing her would mean the end of his experiments. He has hidden her in a space unreachable by conventional means."},{"name":"LAHABREA","text":"But your presence makes mockery of such barriers. The scarcity of your aether means it will be trivial to send you directly to Agdistis."},{"name":"THEMIS","text":"We shall approach as closely as caution will allow. We know where the battle will commence, so I do not anticipate difficulty in detecting your presence."},{"name":"THEMIS","text":"From afar, I shall do my best to provide you with ground on which to fight and phantom allies to aid you. As for the interment, I have yet to think of a foolproof method..."},{"name":"LAHABREA","text":"Interment shall not be necessary."},{"name":"LAHABREA","text":"From here I can sense Agdistis's essence...but it is scarcely recognizable. Hephaistos was more ambitious with her than he was with Hegemone. She has been transfigured such that barely a scantling of her self remains."},{"name":"LAHABREA","text":"We can but take comfort in what a mercy the Underworld will be to her."},{"name":"THEMIS","text":"I shall establish control of Abyssos while keeping an eye on your battle. When the dust has settled, Hephaistos will have nowhere left to flee."},{"name":"LAHABREA","text":"I sense that Hephaistos has come close to perfecting his image of a hemitheos. Which means his research is in its final stage..."},{"name":"THEMIS","text":"The moment Agdistis was slain, the flow of aether in Pandæmonium focused keenly on this location, creating a tunnel of sorts through which we could quickly convey ourselves. 'Twas almost as if we were ushered here..."},{"name":"LAHABREA","text":"This space was created with care, and concealed with powerful wards. Only a keyward would have been able to detect it, and even then with great difficulty. Ergo..."},{"name":"DEIANEIRA","text":"If only I could restore Tartaros to order...but I am afraid this is the most I can manage with such power as remains to me."},{"name":"DEIANEIRA","text":"It has been too long, Master Lahabrea."},{"name":"LAHABREA","text":"Likewise, Keyward Agdistis. I should not be surprised you were able to break free of Hephaistos's spells, even diminished as you were."},{"name":"DEIANEIRA","text":"'Twas not an easy task, even with your aid. His curses dig into one's heart, creating a storm of emotions that is all too easy to become lost in. Only by chance did a fragment of my self remain, illuminating a path through the madness."},{"name":"DEIANEIRA","text":"And thus am I able to appear before you now. Even while my body was powerless to resist Hephaistos's commands, some small part of my logical mind stood alone in defiance. It even managed to speak to the outside world."},{"name":"THEMIS","text":"...The report. That was you!"},{"name":"DEIANEIRA","text":"Doubtless you recognize my voice from the many times I have called out to you. The hope that those pleas would not fall on deaf ears was all that kept me from succumbing to hopelessness."},{"name":"DEIANEIRA","text":"But I have a greater purpose here than simply saying my farewells. There is something you must know, that the tragedies of the past do not repeat in the present."},{"name":"DEIANEIRA","text":"Forgive me for what I am about to do, Master Lahabrea, but the story must be told. 'Tis the only way to understand Hephaistos's fixation on Erichthonios."},{"name":"DEIANEIRA","text":"No longer can you hide your heart away..."},{"name":"THEMIS","text":"Hephaistos? No, the mask marks him as Lahabrea..."},{"name":"DEIANEIRA","text":"Master Lahabrea had brought an end to Lady Athena's life, and sealed away a part of his memories and emotions within Hephaistos. These are my recollections of the moments following."},{"name":"DEIANEIRA","text":"...And you truly have no intention of revealing the truth to Erichthonios?"},{"name":"LAHABREA","text":"My lesser half is now buried where none can find it. We would be wise to do the same with our memory of this day."},{"name":"LAHABREA","text":"Blood should not sway the spirit so, but Athena's teachings have warped the boy. I fear he would see our star burn to keep his mother safe."},{"name":"LAHABREA","text":"Erichthonios believes that he feels love, but he is shackled by dependence. He could not bear the truth."},{"name":"DEIANEIRA","text":"His dependence makes it all the more important to be open with him. He will seek answers about his mother's loss, which shall inevitably lead him to you. Are you willing to accept the blame for Athena's death? Are you willing to accept your son's hatred?"},{"name":"LAHABREA","text":"If that is what comes to pass, then so be it. Better to be burdened with hatred than the knowledge that Athena thought his body and soul mere tools. To be used and discarded..."},{"name":"LAHABREA","text":"Even were I to tell him what his mother plotted, he would ever seek reasons to believe that the true fault lies with me─or with him. Should he merely hate me, he will remain unfettered by doubt─free to serve the star far from his parents' shadow."},{"name":"THEMIS","text":"Erichthonios loved his mother more than life itself, and yet... What a dreadful truth you've borne all this time."},{"name":"DEIANEIRA","text":"Such is Lahabrea's nature. Every action, every word a solution to life's great dilemmas─and none to spare for his own."},{"name":"DEIANEIRA","text":"What I have revealed to you is but a small portion of a larger picture. I shall leave it to Lahabrea to paint the rest for you─and for Erichthonios, I hope."},{"name":"LAHABREA","text":"Thank you, Agdistis."},{"name":"DEIANEIRA","text":"I always admired you, you know. What choice did I have, when you sacrificed so much to guide our star to the heavens?"},{"name":"LAHABREA","text":"Hephaistos has doubtless sensed that his final keyward has fallen. We should return to the surface before he moves to strike us here."},{"name":"LAHABREA","text":"If we are to face him, we must be prepared to bring our full strength to bear."},{"name":"THEMIS","text":"It was Erichthonios's hatred of his father that caused him to fall victim to Hephaistos's magicks. Yet the roots of that hatred were born from a son's love..."},{"name":"THEMIS","text":"...A love nurtured not by a mother caring for her offspring, but by a researcher creating the ideal test subject. Pandæmonium abounds with demons indeed..."},{"name":"LAHABREA","text":"Agdistis was ever a bold woman, even in her final moments. That she would unearth the secrets of my past for all to look upon..."},{"name":"LAHABREA","text":"...Still, full glad am I that she faced you as her last opponent. I could think of none more worthy to send her soul off to the other side."}],"reward":{"gil":3000,"items":[{"num":5,"id":33921},{"num":3,"id":33918,"one":1},{"num":3,"id":33919,"one":1},{"num":3,"id":33920,"one":1}],"instance":30118},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70173]},"next":[70175]},"partials":[{"type":"npc","id":"1043506","obj":{"i":1043506,"n":"Erichthonios","l":4033,"q":2}},{"type":"npc","id":"1043495","obj":{"i":1043495,"n":"Lahabrea","l":4033,"q":2}},{"type":"item","id":"33921","obj":{"i":33921,"n":"Battledance Materia IX","l":560,"c":20281,"t":58,"materia":{"tier":8,"value":12,"attr":"Tenacity","category":0}}},{"type":"item","id":"33918","obj":{"i":33918,"n":"Heavens' Eye Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"33919","obj":{"i":33919,"n":"Savage Aim Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Critical Hit","category":0}}},{"type":"item","id":"33920","obj":{"i":33920,"n":"Savage Might Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Determination","category":0}}},{"type":"instance","id":"30118","obj":{"i":30118,"n":"Abyssos: The Seventh Circle","c":61802,"t":"Raids","min_lvl":90,"max_lvl":90,"min_ilvl":585}},{"type":"quest","id":"70173","obj":{"i":70173,"n":"A Keyward's Gaol","g":26,"l":"The Gates of Pandæmonium","s":26,"f":1}},{"type":"quest","id":"70175","obj":{"i":70175,"n":"One Final Wish","g":26,"l":"The Gates of Pandæmonium","s":28,"f":1}}]}