{"quest":{"name":"Masks of the Father","location":"The Gates of Pandæmonium","id":70172,"patch":6.2,"sort":25,"icon":112484,"unlocksFunction":1,"eventIcon":71341,"issuer":1043489,"target":1043492,"genre":26,"journal":["Erichthonios is certain he knows the identity of Pandæmonium's assailant.","Erichthonios is adamant that the person behind the troubles in Pandæmonium is none other than Lahabrea. Themis acknowledges the possibility but remains doubtful that Lahabrea would put so many at risk for his own ambition. You all agree that the only way to find out for sure is to venture into Abyssos and meet the villain for yourselves. As you make toward the threshold to Pandæmonium's next circle, you steel yourself for what lies ahead.<br><br>※Abyssos: The Fifth Circle can be accessed via the Duty Finder.","Spirited away to a strange space within Pandæmonium, you brave scorching rays and corrupting poison to seal the proto-Carbuncle in its cage. With the immediate threat quelled, perhaps a search of the area will reveal whose magic is at work.","Your search ends quickly, as your foe reveals himself, claiming to be Lahabrea and offering Erichthonios the chance to meet Athena once more. He makes a convincing performance, but Themis sees through his act, declaring him an impostor. The proceedings are interrupted by the appearance of another man─the true Lahabrea, who calls Themis by the name “Elidibus.” With no reason left to hide the truth, the imitator introduces himself as Hephaistos before vanishing abruptly. As your companions depart for the relative safety of the facility's gates, Themis takes you aside to confirm that he is indeed the Convocation's emissary, and apologize for misleading you.","Away from Abyssos's horrors for the moment, Themis explains his purpose in deceiving you─but also his reasons for trusting you. With several truths revealed and many more questions waiting in the wings, your curiosity points you toward Erichthonios..."],"objectives":["Enter Abyssos: The Fifth Circle.","Speak with Themis."],"dialogue":[{"name":"THEMIS","text":"...Erichthonios seems to have quite the story to tell. Perhaps we should lend an ear?"},{"name":"ERICHTHONIOS","text":"...And so there can be but one conclusion─Lahabrea was the driving force behind this chaos from the start!"},{"name":"THEMIS","text":"There is logic to that. There are few with the wherewithal to even consider experimentation on such a scale, let alone the capacity to create demigods from man and beast with the rest of us none the wiser."},{"name":"THEMIS","text":"Considering the magnitude of his work with the Convocation and the Words, his relatively minor role as chief keyward comes under little scrutiny, even as it provides him the authority to wield dangerous magicks. It may serve as veil and mantle both."},{"name":"THEMIS","text":"Still, I find the notion hard to accept. The misdeeds perpetrated here could not have been done by the Lahabrea I know..."},{"name":"THEMIS","text":"You have met him, yes? Do you think he is capable of this?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Lahabrea is capable of far more than you know."},{"name":"A2","text":"It's still too early to say for certain."},{"name":"THEMIS","text":"...Is he? So you believe Lahabrea to be a man of few scruples, if it brings his goals closer in reach."},{"name":"THEMIS","text":"It truly is a puzzle with many missing pieces. Still, I see you do not deny outright the possibility that Lahabrea is a man with few scruples."},{"name":"ERICHTHONIOS","text":"That alone should be enough, but let me assure you─Lahabrea holds nothing so dear as his own ambition."},{"name":"THEMIS","text":"While he may not be one to let emotion stand in the way of his mission, I cannot believe there are no depths to which he would not stoop."},{"name":"THEMIS","text":"Although we met but briefly, the impression he left on me stands in stark contrast to your evaluation. Though his methods are ever unorthodox, they seemed guided by a firm understanding of what is just."},{"name":"ERICHTHONIOS","text":"...There's one way to find out for certain. We delve deeper into Pandæmonium and pull back the curtain on this mystery ourselves."},{"name":"THEMIS","text":"A wise course. I would not deny the truth if I saw it with my own eyes. Even if it was discomfiting to behold..."},{"name":"ERICHTHONIOS","text":"Then we must move forward with no excess of caution. Lahabrea─or whomever is behind this─has likely spread their tentacles into every corner of Pandæmonium. We can safely assume the other keywards won't greet us with open arms."},{"name":"THEMIS","text":"Agreed. Let us make our way through Abyssos one careful step at a time."},{"name":"THEMIS","text":"I shall stay by Erichthonios's side, in case our enemies think to target him again. Could I trouble you to take the vanguard?"},{"name":"THEMIS","text":"Thank you. As a precaution, I shall safeguard you with a simple spell. This will ensure that even should we become separated, my phantom warriors will still come to your aid."},{"name":"THEMIS","text":"If it does come to battle, the keywards' magicks will put us at a disadvantage once again. Luckily, we have you to even the scales somewhat. I trust you shall be liberal with your weight."},{"name":"THEMIS","text":"Judging from the demeanor of that familiar, there is little doubt that our enemy has a tight grip on Pandæmonium and its denizens. We will be vulnerable."},{"name":"ERICHTHONIOS","text":"Just what is Lahabrea planning? And what role do I play in his schemes?"},{"name":"THEMIS","text":"So this is where research is conducted on creations imbued with poisons and venoms. Erichthonios and I were conveyed not far from here─it seems our foe is finding it more difficult to surprise us."},{"name":"THEMIS","text":"Fortunately for you, since they appear particularly keen to see you dispatched as quickly as possible."},{"name":"HEPHAESTUS","text":"(-???-)Even alone you are a force to be reckoned with. Part of me is glad you emerged victorious, that I might observe you further."},{"name":"HEPHAESTUS","text":"(-Red Mask Holder-)Were the circumstances different, I might thank you for keeping my son alive for this long. But I believe we can forgo introductions...unless I have misread you?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Lahabrea."},{"name":"A2","text":"I'm all too familiar, <span class=\"emphasis\">Paragon</span>."},{"name":"A3","text":"Am I supposed to know who you are?"},{"name":"HEPHAESTUS","text":"(-Red Mask Holder-)Passably perceptive. Yes, I am Lahabrea, of the Convocation of Fourteen."},{"name":"HEPHAESTUS","text":"(-Red Mask Holder-)A charming appellation, but I'm afraid I hold no such position. No, I am Lahabrea, of the Convocation of Fourteen."},{"name":"HEPHAESTUS","text":"(-Red Mask Holder-)I understand that my son's rhetoric is rarely compelling, but come now─I can be none other than Lahabrea, of the Convocation of Fourteen."},{"name":"THEMIS","text":"If you truly are who you claim to be, then answer this question..."},{"name":"HEPHAESTUS","text":"(-Lahabrea-)That can wait."},{"name":"THEMIS","text":"Ungh! What is this!?"},{"name":"HEPHAESTUS","text":"(-Lahabrea-)Now this is curious... The trap I wove at your feet reacts to aether, but you remain unaffected."},{"name":"HEPHAESTUS","text":"(-Lahabrea-)Such thin aether, and in an unfamiliar composition besides. It is of no matter, I suppose. A more direct approach will beget the same results."},{"name":"HEPHAESTUS","text":"(-Lahabrea-)I would advise you to think carefully before deciding your next action. Strike me down here, and Erichthonios's wish shall remain unfulfilled. Never again shall he meet Athena."},{"name":"ERICHTHONIOS","text":"Mother? You would dare hide behind her name!?"},{"name":"HEPHAESTUS","text":"(-Lahabrea-)Listen well, Erichthonios. We are of the same mind concerning your mother. You have your allies for protection, so what harm is there in hearing me out?"},{"name":"THEMIS","text":"Erichthonios, wait!"},{"name":"THEMIS","text":"There is a question I must needs ask first."},{"name":"THEMIS","text":"...If you truly are Lahabrea, why speak such blatant lies?"},{"name":"HEPHAESTUS","text":"(-Lahabrea-)Bitter in defeat, are we?"},{"name":"THEMIS","text":"...Say my name."},{"name":"THEMIS","text":"A simple request."},{"name":"HEPHAESTUS","text":"(-Lahabrea-)Themis, was it? A trifle soon forgotten, as are you."},{"name":"THEMIS","text":"...I have my answer."},{"name":"THEMIS","text":"The Lahabrea that I knew took pride in the Convocation, and would never suffer its denigration."},{"name":"THEMIS","text":"You sully his station with this farce!"},{"name":"ERICHTHONIOS","text":"Themis, what are you saying? Lahabrea and I hardly saw eye to eye, but I know his voice when I hear it..."},{"name":"THEMIS","text":"Indeed, he makes a passing fine imitation in appearance and manner. However, the real Lahabrea would never call me by the name “Themis.”"},{"name":"LAHABREA","text":"(-???-)What trouble have you gotten yourself into, Elidibus?"},{"name":"LAHABREA","text":"(-???-)Impostor. You have no right to claim that form. That mask."},{"name":"ERICHTHONIOS","text":"What─? Who─!?"},{"name":"HEPHAESTUS","text":"(-Lahabrea-)'Twas a mask that sickened me to wear."},{"name":"HEPHAESTUS","text":"(-Lahabrea-)The mask of Lahabrea! A man who values his position above all─who would murder his own wife in pursuit of duty!"},{"name":"LAHABREA","text":"Yet you would assume my name and wield powers that are mine by right? Any worth you may have hinges on that which you so despise."},{"name":"HEPHAESTUS","text":"(-Lahabrea-)Such trite provocations. I will not be goaded into finishing this ere my work is done."},{"name":"HEPHAESTUS","text":"Erichthonios, listen well. I am Hephaistos."},{"name":"HEPHAESTUS","text":"And it is I whom you should call Father..."},{"name":"ERICHTHONIOS","text":"What in the name of creation...?"},{"name":"LAHABREA","text":"...We would do well not to stand idle while our enemy is about. I believe an explanation is in order, Elidibus. Let us return to safety so you may provide it."},{"name":"THEMIS","text":"Ah, that sounds more like the Lahabrea I know."},{"name":"THEMIS","text":"Before we depart, however, I must offer you an apology."},{"name":"THEMIS","text":"As Lahabrea said, I am Elidibus, one of the Convocation and emissary of their will."},{"name":"THEMIS","text":"For reasons which do not involve you, it was necessary to hide my identity while investigating this place. Still, that hardly excuses my deception."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I had a feeling."},{"name":"A2","text":"Whatever your name is, you're still Themis to me."},{"name":"A3","text":"I know a thing or two about deception myself."},{"name":"THEMIS","text":"Your perceptiveness does not surprise me. When the time comes, it shall make my explanation all the easier to understand."},{"name":"THEMIS","text":"Such words are comforting, truly. I shall offer an explanation in time, but first let me assure you my choices were not born from animosity."},{"name":"THEMIS","text":"That is reassuring to hear. The burdens we bear are heavy enough without adding a grudge to their weight."},{"name":"THEMIS","text":"In any case, we have pressing matters to attend to. Let us do as Lahabrea suggested and return to the Gates. We can speak there."},{"name":"DEIANEIRA","text":"(-Distant Voice-)Please, help him... Save him..."},{"name":"LAHABREA","text":"I see Elidibus has chosen to keep odd company. Such a vexing composition of aether you possess..."},{"name":"ERICHTHONIOS","text":"...I still don't understand."},{"name":"THEMIS","text":"As you are aware of by now, I am known as Elidibus. After my dear friend Azem and I detected irregularities in Pandæmonium, we decided the best course of action would be to hide my station as I conducted my investigation."},{"name":"THEMIS","text":"I am sure Lahabrea, as well, is eager to find out why I hid who I was, so I shall save that story for later. First, I would like to speak of you, my friend."},{"name":"THEMIS","text":"Although neither Azem nor I had ever met you in the flesh, you came with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> highest recommendation. That alone was enough for me to accept you as an ally without question."},{"name":"THEMIS","text":"That somewhere in the world a guiding star so similar to <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> was out there amused Azem to no end. There was not a shade of doubt in <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> heart that you would be a formidable ally."},{"name":"THEMIS","text":"Furthermore, I have heard stories that Mistress Venat, who held the position of Azem previously, journeyed with a familiar much like yourself. That made the decision to trust you all the easier."},{"name":"THEMIS","text":"She, too, now dons the white robes of an advisor. If she placed her absolute faith in you, I knew I would be in capable hands."},{"name":"THEMIS","text":"Aware though I was of the path you had walked, I had no interest in exposing you. I merely wanted to meet you─to travel by your side for a while."},{"name":"THEMIS","text":"I may know but a small portion of your whole story, but that is enough for me to believe you would never lead me astray. I wanted to tell you that."}],"reward":{"gil":2000,"items":[{"num":5,"id":33928},{"num":3,"id":33918,"one":1},{"num":3,"id":33919,"one":1},{"num":3,"id":33920,"one":1}],"instance":30116},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70171]},"next":[70173]},"partials":[{"type":"npc","id":"1043489","obj":{"i":1043489,"n":"Erichthonios","l":4033,"q":2}},{"type":"npc","id":"1043492","obj":{"i":1043492,"n":"Themis","l":4033,"q":1}},{"type":"item","id":"33928","obj":{"i":33928,"n":"Quickarm Materia IX","l":560,"c":20282,"t":58,"materia":{"tier":8,"value":12,"attr":"Skill Speed","category":0}}},{"type":"item","id":"33918","obj":{"i":33918,"n":"Heavens' Eye Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"33919","obj":{"i":33919,"n":"Savage Aim Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Critical Hit","category":0}}},{"type":"item","id":"33920","obj":{"i":33920,"n":"Savage Might Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Determination","category":0}}},{"type":"instance","id":"30116","obj":{"i":30116,"n":"Abyssos: The Fifth Circle","c":61802,"t":"Raids","min_lvl":90,"max_lvl":90,"min_ilvl":585}},{"type":"quest","id":"70171","obj":{"i":70171,"n":"An Unwelcome Visitor","g":26,"l":"Labyrinthos","s":24,"f":1}},{"type":"quest","id":"70173","obj":{"i":70173,"n":"A Keyward's Gaol","g":26,"l":"The Gates of Pandæmonium","s":26,"f":1}}]}