{"quest":{"name":"One Final Wish","location":"The Gates of Pandæmonium","id":70175,"patch":6.2,"sort":28,"icon":112490,"unlocksFunction":1,"eventIcon":71341,"issuer":1043495,"target":1043497,"genre":26,"journal":["Lahabrea would speak further of Athena's fate.","With Pandæmonium free from Hephaistos's control, the way forward is clear of obstacles. Lahabrea senses that his other half is cloistered away within the depths of Tartaros, where Athena carried out her most clandestine research. Themis makes ready to send you and the chief keyward to confront Hephaistos, that you might rid the world of his wickedness once and for all.<br><br>※Abyssos: The Eighth Circle can be accessed via the Duty Finder.","In the heart of Tartaros, you find yourself embroiled in a frenetic battle that sees Hephaistos taking form after form, stretching the very boundaries of creation magicks. In the end, however, even the purloined power of Pandæmonium's prisoners is no match for your own, and the would-be god falls to you and your phantom band. At your heels, Lahabrea stands ready to at last set right the mistake of his past.","As Lahabrea is about to deal the killing blow, Hephaistos shields himself with the insensate Erichthonios, prompting Lahabrea to at last reveal the truth of Athena's intentions before his son. A few well-placed words stir Erichthonios from his stupor, and gathering what strength he can, the keyward breaks free from the magic binding him. He inters Hephaistos in an aetherial casket, around which Lahabrea works his own magicks until all that remains is a fiery red crystal.","You take a moment to check in with Lahabrea, who is impressed that his son was able to work the magic of interment so adeptly, and even verbalizes the sentiment. With the immediate threat vanquished, there are questions that demand answers, and truths that demand to be told."],"objectives":["Enter Abyssos: The Eighth Circle.","Speak with Lahabrea."],"dialogue":[{"name":"THEMIS","text":"From a son's undying love for his mother was born a deep well of hatred for his father."},{"name":"THEMIS","text":"For Erichthonios, those emotions were all too real─the efficacy of Hephaistos's magicks attests to that. Yet they were spun by a guiding hand, one which sought to use his inner turmoil as a tool for experimentation."},{"name":"LAHABREA","text":"The vision you saw told the story far more eloquently than I ever could. Athena was consumed by her research, and was willing to sacrifice her own child if it hastened her progress."},{"name":"LAHABREA","text":"She did not offer him a position here out of a sense of love or pride─'twas merely because she knew he would be the most pliable test subject."},{"name":"THEMIS","text":"I see now why you hid the truth from him. I cannot say with certainty that Erichthonios could handle the weight of such betrayal, after holding his mother on a pedestal for so long..."},{"name":"LAHABREA","text":"Unfortunately, it seems not even her death has ensured his safety. Hephaistos has taken up Athena's research, and succeeded in creating hemitheoi."},{"name":"LAHABREA","text":"I know not what his ultimate end is, but 'tis plain it is connected with the resurrection of Athena."},{"name":"THEMIS","text":"That knowledge alone is sufficient to direct our next course of action. As for the rest of your story, we shall hear it after we have returned Erichthonios to safety, in accordance with Agdistis's last wish."},{"name":"LAHABREA","text":"...Very well."},{"name":"THEMIS","text":"I can, at least, assure you that finding him shall prove relatively simple now that Hephaistos can no longer bend Pandæmonium to his will."},{"name":"LAHABREA","text":"There is but one place left for him to find refuge: the black heart of Tartaros, where Athena built her testing compound."},{"name":"THEMIS","text":"We can assume that Hephaistos will offer fierce resistance. I must focus my every effort on securing a safe means of approach."},{"name":"THEMIS","text":"Lahabrea, I would ask that you assume the duty of summoning <span class=\"highlight\">Forename</span>'s phantom warriors."},{"name":"LAHABREA","text":"...I have no objections. My ability to fight within Tartaros would be greatly diminished in any case."},{"name":"LAHABREA","text":"However, I wish to deal the final blow to Hephaistos myself. There is no need to dirty your hands with such a deed."},{"name":"THEMIS","text":"I take it, then, that you have no intent to seal him away as before."},{"name":"LAHABREA","text":"The presence I felt when I encountered Hephaistos bore little resemblance to the entity I created. By his own hand he has become something far more wicked, and the same magicks that once shackled him may very well shatter before the power he wields."},{"name":"LAHABREA","text":"On my pride as a researcher, I am loath to repeat the same mistake twice. I would not see these events play out again, and so he must be extinguished."},{"name":"THEMIS","text":"Well then, I shall open the way forward. May we finish this─together!"},{"name":"THEMIS","text":"The end is in sight. Return to me safely, friend."},{"name":"LAHABREA","text":"If Hephaistos truly means to continue Athena's research, then Erichthonios is indispensable to his goals. He is safe, but for how much longer I cannot say..."},{"name":"LAHABREA","text":"The chain of events that led to this moment began with my error, when out of mercy I confined you here. Now I break it, and leave no trace of you behind."},{"name":"HEPHAESTUS","text":"This...is not...over!"},{"name":"LAHABREA","text":"I see you will not go peacefully..."},{"name":"HEPHAESTUS","text":"Even a castoff would uphold his pride. Though such an impulse must speak to the overwhelming arrogance of my other half..."},{"name":"HEPHAESTUS","text":"The name “Hephaistos” shall grow to eclipse yours. None shall remember the deeds of Lahabrea once I fulfill Athena's ambition...and bring Erichthonios's dream to life!"},{"name":"LAHABREA","text":"You speak as if you care a whit for the boy. Why then do you cower behind him?"},{"name":"LAHABREA","text":"There are some desires which must not be realized. Athena would see the world destroyed if it meant she could find hers in the ruins. As for Erichthonios..."},{"name":"LAHABREA","text":"He knows not what his wish would beget─a truth which you have hidden from him. Do you truly believe a father's role is to deceive and manipulate?"},{"name":"ERICHTHONIOS","text":"My...wish...?"},{"name":"LAHABREA","text":"You would claim the name Hephaistos and call yourself his father, yet you bind his mind and body in dark chains. Your words─and your pride─ring hollow."},{"name":"HEPHAESTUS","text":"Athena wanted her son by her side, and he desires to return there. What wickedness is there in mending a broken family?"},{"name":"LAHABREA","text":"Athena cared naught for Erichthonios, beyond how he could serve her ends."},{"name":"LAHABREA","text":"You claim to be acting in his interest, but 'tis plain you are no different."},{"name":"LAHABREA","text":"As I ushered Athena to her end, I vowed that my sole mission in life would be to guide this star true."},{"name":"LAHABREA","text":"In service to that vow, I silenced the whispers of my heart. I could not nurture a son whilst an entire world looked to me for guidance. For that choice, I bear the responsibility..."},{"name":"LAHABREA","text":"Yet he is still my son, and I'll not suffer you to seduce him with false hope. You, who are naught but the bitter dregs of Athena and I─the very worst of us!"},{"name":"ERICHTHONIOS","text":"Mother, she... N-No! Then who─ <span class=\"emphasis\">How</span> do I...?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Trust in Lahabrea!"},{"name":"A2","text":"Hearken to your heart!"},{"name":"A3","text":"Come back to us!"},{"name":"ERICHTHONIOS","text":"I-I hear you... I owe you...and Themis...an apology..."},{"name":"ERICHTHONIOS","text":"Athena, did you ever...? And Lahabrea, I..."},{"name":"ERICHTHONIOS","text":"I will have my say!"},{"name":"HEPHAESTUS","text":"H-How!? His mind was mine!"},{"name":"ERICHTHONIOS","text":"I can't explain. <span class=\"highlight\">Forename</span>'s words reached me through the haze..."},{"name":"ERICHTHONIOS","text":"They rang loud and clear."},{"name":"ERICHTHONIOS","text":"As did the words of another. In a voice much like yours, but resounding with truth!"},{"name":"HEPHAESTUS","text":"How... When did you master these bonds!?"},{"name":"ERICHTHONIOS","text":"Oh, we've interred much worse!"},{"name":"HEPHAESTUS","text":"You worthless... You... Aaaaaargggh!"},{"name":"ERICHTHONIOS","text":"It appears my failures have borne fruit after all..."},{"name":"LAHABREA","text":"You did well...son."},{"name":"ERICHTHONIOS","text":"Where...are we?"},{"name":"THEMIS","text":"What is this? The barriers around Pandæmonium are no longer under assault."},{"name":"LAHABREA","text":"With Hephaistos's essence contained in this crystal, we may safely return Erichthonios above. That he would bind Hephaistos with only half his senses intact..."},{"name":"LAHABREA","text":"You quite understated his adeptness in the art of interment. It was hardly what I had in mind, but a feat deserving of praise nonetheless."}],"reward":{"gil":3000,"items":[{"num":5,"id":33917},{"num":3,"id":33918,"one":1},{"num":3,"id":33919,"one":1},{"num":3,"id":33920,"one":1}],"instance":30122},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70174]},"next":[70176]},"partials":[{"type":"npc","id":"1043495","obj":{"i":1043495,"n":"Lahabrea","l":4033,"q":2}},{"type":"npc","id":"1043497","obj":{"i":1043497,"n":"Lahabrea","l":4250,"q":2}},{"type":"item","id":"33917","obj":{"i":33917,"n":"Piety Materia IX","l":560,"c":20281,"t":58,"materia":{"tier":8,"value":12,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"item","id":"33918","obj":{"i":33918,"n":"Heavens' Eye Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"33919","obj":{"i":33919,"n":"Savage Aim Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Critical Hit","category":0}}},{"type":"item","id":"33920","obj":{"i":33920,"n":"Savage Might Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Determination","category":0}}},{"type":"instance","id":"30122","obj":{"i":30122,"n":"Abyssos: The Eighth Circle","c":61802,"t":"Raids","min_lvl":90,"max_lvl":90,"min_ilvl":585}},{"type":"quest","id":"70174","obj":{"i":70174,"n":"Servant of Violence","g":26,"l":"The Gates of Pandæmonium","s":27,"f":1}},{"type":"quest","id":"70176","obj":{"i":70176,"n":"Truth Imperfect","g":26,"l":"Stygian Insenescence Cells","s":29,"f":1}}]}