{"quest":{"name":"The Imperfect Gentleman","location":"Mare Lamentorum","id":70178,"patch":6.25,"sort":220,"icon":101194,"unlocksFunction":1,"eventIcon":71341,"issuer":1042544,"target":1042555,"genre":71,"journal":["Unfazed by events that would shatter the mind of a lesser man, Hildibrand stands ready to begin his next case.","Inspector's Log:<br>After being hauled into the sky and stuffed into a cramped space like so much airship baggage, I have at last convinced my amiable captor to release me from his custody. Master PuPu is not of this star─as was evinced by his unintelligible tongue and unfathomable technology─yet with the help of a preternaturally talented associate, I have deduced that the matter which brought him to our star is a cause worthy of investigation. Fear not, fellow sentient beings, for otherworldly origins notwithstanding, Hildibrand Helidor Maximilian Manderville is a friend to one and all!<br>　　　　　　　　　　　　*　*　*<br>None the worse for wear after his extraterrestrial escapade, Hildibrand is eager to embark on a new case. Before his “channeling” can produce a viable lead, however, your recent Loporrit guide arrives to report a nearby sighting of...Hildibrand. Several moments of confusion and logical reasoning later, it is determined that one of the clones escaped PuPu's vaporization beam, and is now running loose somewhere on the moon. Hildibrand insists upon eliminating this impostor inspector before any damage can be done to the Manderville name.","With eyes peeled for gentlemanly tracks, you set off in search of the defective clone. Considering the chaos which routinely erupts around the original, even a slightly shoddy imitation should not be too hard to find...<br><br>※You must be accompanied by Hildibrand and Nashu to complete this task. Speak with either of them again in the north of Mare Lamentorum should you become separated.","You stumble across a thinker whose last thought seems to have been interrupted by the sudden and violent interjection of a goldsmithing hammer. This does not, however, appear to have been the work of the clone. The search continues...<br><br>※You must be accompanied by Hildibrand and Nashu to complete this task. Speak with either of them again in the north of Mare Lamentorum should you become separated.","You find another victim of blunt force trauma, but again, no sign of the fugitive clone. Though you resolve to press on with the search, one would be forgiven for wondering if you've stumbled upon the trail of a serial killer with an endless supply of hammers...<br><br>※You must be accompanied by Hildibrand and Nashu to complete this task. Speak with either of them again in the north of Mare Lamentorum should you become separated.","The discovery of fancy footprints at last leads you to the object of your hunt. No sooner have you spotted the clone, however, when an all but in the altogether Godbert appears out of nowhere, and proceeds to demonstrate a cataclysmic level of Manderville affection for his beloved son. After the dust settles and the music stops, PuPu vaporizes the flawed duplicate, marking the end of one of the inspector's active cases. Godbert, meanwhile, is relieved to find the genuine Hildibrand in relatively good health. He offers his gratitude for your part in seeing his boy's soul safely reunited with his body, and expresses a desire to consult with you back in Radz–at–Han. Something regarding a certain rare ore he located on the moon... Agreeing with the idea of heading starward, Hildibrand is eager to continue the search for PuPu's comrade closer to home.","Returned to the relative normalcy of Thavnair, Hildibrand resumes the Case of the Silent Correspondent with Nashu and PuPu in tow. Delion holds back, however, and divulges to you his intention to investigate the little blue man and his diabolical devices. Even as you tacitly agree to assist the editor in chief, you are approached by Godbert with yet another request for aid. It seems the master goldsmith has turned his hand to armaments─a change brought on by the terrible events of the Final Days─and he now seeks to craft superior weapons as described in an ancient manual of Manderville family legacy. Should you have time to help gather the necessary materials, you are to alert Godbert's manservant...who will be waiting patiently nearby. For as long as it takes."],"objectives":["Speak with Hildibrand and have him accompany you.","Search for clues while Hildibrand and Nashu are accompanying you.","Search for more clues while Hildibrand and Nashu are accompanying you.","Search for even more clues while Hildibrand and Nashu are accompanying you.","Speak with Hildibrand in Radz–at–Han."],"dialogue":[{"name":"NASHUMHAKARACCA","text":"Mister PuPu's eyes make me feel dizzy. Like swirls that go around and around and around and around..."},{"name":"DELION","text":"This Echo power of yours sounds...extraordinary. You must allow me to interview you once we've put this business on the moon behind us."},{"name":"KOYOKOYO","text":"I am glad you are here to help ward off any more...PuPu...misunderstandings."},{"name":"HILDIBRAND","text":"So begins “The Case of the Silent Correspondent”!"},{"name":"DELION","text":"Uh...not to rain on your parade, but “my friend who was somewhere on your star stopped sending me messages” is not a lot to go on."},{"name":"DELION","text":"I've spent years investigating the existence of aliens, and recent experiences notwithstanding, they are <span class=\"emphasis\">not</span> that easy to find."},{"name":"NASHUMHAKARACCA","text":"Then you don't know Inspector Hildibrand! He'll solve this case as he's solved countless others: with unerring perception and panache!"},{"name":"HILDIBRAND","text":"Ah...hahaha, well said, Nashu! I need but relinquish conscious thought to investigative instinct, and the clues will flow to me forthwith!"},{"name":"NASHUMHAKARACCA","text":"Lose yourself in the deductive current, Inspector!"},{"name":"DELION","text":"&lt;gasp&gt; You're <span class=\"emphasis\">channeling</span>, aren't you!? Contacting a higher power to breach the veil of mystery? Another fascinating development."},{"name":"GENTLELOPORRIT","text":"Ah, there you are. I've been looking all over!"},{"name":"GENTLELOPORRIT","text":"Thought you'd like to know that I spotted that chap you were asking about─you know, the well-muscled gentleman with tattered clothing and dazzling teeth?"},{"name":"NASHUMHAKARACCA","text":"You mean this gentleman? We found him, too!"},{"name":"GENTLELOPORRIT","text":"Well, that can't be right!"},{"name":"GENTLELOPORRIT","text":"I just saw him in the north of Mare Lamentorum, and he ran the other way when I called out. I don't understand how he could've arrived before me..."},{"name":"NASHUMHAKARACCA","text":"I have a feeling, Mister Bunny, sir, that what you saw was an impostor."},{"name":"NASHUMHAKARACCA","text":"<span class=\"highlight\">Forename</span>, would you mind asking Mister PuPu if he was growing any more inspectors on the moon?"},{"name":"KOYOKOYO","text":"PuPu... I only created a single batch, but one did manage to escape the vaporization beam."},{"name":"KOYOKOYO","text":"That individual's behavior was...unpredictable. A flaw in the cloning process, I'm afraid."},{"name":"HILDIBRAND","text":"Well, this won't do at all. We cannot have a flawed inspector running around besmirching the Manderville name."},{"name":"HILDIBRAND","text":"Master PuPu, I must ask that we hunt down and liquidate my other self as soon as possible. Might we delay the search for your comrade until the deed is done?"},{"name":"KOYOKOYO","text":"PuPu... The imperfect clone was of my making. It is only right that I redress my mistake first."},{"name":"HILDIBRAND","text":"So begins “The Case of the Impostor Inspector”!"},{"name":"GENTLELOPORRIT","text":"Ooh, that does sound exciting. If you don't mind me coming along, I can show you the place where I saw the <span class=\"emphasis\">impostor inspector</span>."},{"name":"NASHUMHAKARACCA","text":"Zzz... &lt;snort&gt;"},{"name":"DELION","text":"I wonder what other nefarious abilities this so-called “amicable” alien is hiding."},{"name":"KOYOKOYO","text":"PuPu... My ship's matter duplication facility is prone to the occasional glitch. I should probably have that looked at..."},{"name":"GENTLELOPORRIT","text":"It was right around here..."},{"name":"HILDIBRAND","text":"I espy with my little eye...no dashingly defective gentlemen."},{"name":"GENTLELOPORRIT","text":"He can't have made it that far on foot. Why don't we try searching the immediate area? Scan the horizon, that kind of thing?"},{"name":"HILDIBRAND","text":"Then I suggest we split up so we can cover more ground. Nashu, <span class=\"highlight\">Forename</span>, and I will investigate to the west."},{"name":"GENTLELOPORRIT","text":"Right. I'll take these other two and head east."},{"name":"DELION","text":"Splitting the party <span class=\"emphasis\">again</span>!? And you're leaving me with the <span class=\"emphasis\">aliens</span>!?"},{"name":"GENTLELOPORRIT","text":"Oh, relax, bright eyes. We'll have a nice chat, and I can disabuse you of all those strange conspiratorial notions. Oh, and we can get to know our new friend here!"},{"name":"HILDIBRAND","text":"Let us be on our way as well. With <span class=\"highlight\">Forename</span> in the van, if you please!"},{"name":"SYSTEM","text":"Hildibrand and Nashu are now accompanying you. Keep them at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave your quest companions behind by entering a different area, or by speaking with them and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have your companions join you again, return and speak with them at the original location."},{"name":"SYSTEM","text":"A goldsmithing hammer is lodged in the thinker's carcass. It appears to have been dealt a single, swift killing blow."},{"name":"NASHUMHAKARACCA","text":"Cor, the bugs grow big up here, don't they!"},{"name":"HILDIBRAND","text":"This h-hammer... Surely it cannot be─ Nay, it does not bear thinking about."},{"name":"HILDIBRAND","text":"Come along! Nothing to see here!"},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Talk."},{"name":"A1","text":"Part ways."},{"name":"A1","text":"Nothing."},{"name":"HILDIBRAND","text":"Being on the moon reminds me of that time I was blasted all the way to Dalamud. I do believe that was a personal best in terms of distance flung."},{"name":"NASHUMHAKARACCA","text":"When you're up in the sky, our world's a pizza pie, oh so pretty～♪"},{"name":"A6","text":"<span class=\"highlight\">Discuss the Cradle of Darkness.</span>"},{"name":"HILDIBRAND","text":"Behold this sublime vista! 'Tis as if the moon herself breathes beneath our feet!"},{"name":"NASHUMHAKARACCA","text":"Oh, look down there─they have their very own hot spring!"},{"name":"HILDIBRAND","text":"My dear Nashu, what you are observing is no hot spring, but a natural reservoir of ceruleum! With such a rich resource to hand, it is no wonder they can afford these palatial residences!"},{"name":"NASHUMHAKARACCA","text":"I'm glad you're here to educate me, Inspector! I was about to take a quick soak!"},{"name":"A6","text":"<span class=\"highlight\">Discuss the starry sky.</span>"},{"name":"HILDIBRAND","text":"What a dazzling display of stars!"},{"name":"NASHUMHAKARACCA","text":"Not a single cloud in sight. In fact, I've never seen the night sky so clearly."},{"name":"HILDIBRAND","text":"Now that you mention it, it's been nighttime the entire time I've been here. How much longer until dawn breaks, do you think...?"},{"name":"SYSTEM","text":"Are you sure you wish to part ways with your companions?"},{"name":"HILDIBRAND","text":"Haha! No rest for the adventurous, is there? We shall await your return at our previous rendezvous point. I wouldn't wish for you to miss anything!"},{"name":"NASHUMHAKARACCA","text":"An errand? Please, go ahead! I'll be safe and sound with the inspector around!"},{"name":"HILDIBRAND","text":"Ah, my loyal associate! Let us resume the search for my ephemeral twin!"},{"name":"NASHUMHAKARACCA","text":"Welcome back! Hopefully the impostor inspector hasn't gotten too much of a lead on us!"},{"name":"SYSTEM","text":"You must be accompanied by Hildibrand and Nashu, and have them at your side in order to proceed with quest objectives."},{"name":"HILDIBRAND","text":"Have you noticed a sudden absence of cheerful confusion? Where is Nashu?"},{"name":"NASHUMHAKARACCA","text":"Did we lose the inspector? Don't tell me he's gone missing again..."},{"name":"SYSTEM","text":"A companion has yet to arrive. Be sure they are both at your side before attempting to continue."},{"name":"SYSTEM","text":"A companion has yet to arrive. Be sure they are both at your side before attempting to continue."},{"name":"SYSTEM","text":"Another goldsmithing hammer, another killing blow that bespeaks unparalleled strength..."},{"name":"NASHUMHAKARACCA","text":"Aw, it looks like he's yawning. The hammer stuck in his head spoils the effect, though."},{"name":"HILDIBRAND","text":"He cannot be here... Why would he be here...?"},{"name":"NASHUMHAKARACCA","text":"That's a goldsmithing tool, isn't it? It does look awfully familiar..."},{"name":"HILDIBRAND","text":"And y-yet completely unrelated to our case! Moving on, people, moving on!"},{"name":"SYSTEM","text":"A set of gentlemanly tracks leads to the northwest..."},{"name":"HILDIBRAND","text":"Aha! In the sand, in the snow, or in a half-ilm of moondust, I'd recognize those fancy footprints anywhere! They're a perfect copy of mine."},{"name":"HILDIBRAND","text":"Our fugitive impostor must be just up ahead!"},{"name":"HILDIBRAND","text":"I sense a gentlemanly presence. He is close. Very close."},{"name":"DELION","text":"No clones in the northeastern quadrant...that we could see."},{"name":"NASHUMHAKARACCA","text":"That's clever! Mister PuPu can scout for us from the air!"},{"name":"HILDIBRAND","text":"Aha! I found...me!"},{"name":"HILDIBRANDF","text":"(-Hildiclone-)Why? Why did I flee?"},{"name":"NASHUMHAKARACCA","text":"He seems sad. Downcast. Very un-inspector-like."},{"name":"HILDIBRAND","text":"A flawed creation, to be sure. Such negative emotions would never mar the heart of a true Manderville man."},{"name":"GODBERT","text":"Praise Thal for his patience. 'Twould seem my beloved Hildy has been awoken from his unnatural slumber..."},{"name":"HILDIBRANDF","text":"(-Hildiclone-)Abandoning my gentleman comrades to save myself... My pride in worse tatters than my maltreated wardrobe..."},{"name":"GODBERT","text":"My fatherly love, denied? Unthinkable! Unless...that is not my son."},{"name":"HILDIBRANDF","text":"(-Hildiclone-)Another of me survived!?"},{"name":"HILDIBRANDF","text":"(-Hildiclone-)I'll not turn tail and run this time, no sir! Hildibrand to the rescue!"},{"name":"GODBERT","text":"Round and round, as fast as I can!♪<br>I can't slow down, I'm a Manderville man!♪"},{"name":"DELION","text":"Now I <span class=\"emphasis\">know</span> I'm dreaming. That can't possibly be real..."},{"name":"GENTLELOPORRIT","text":"Ah, that was a little something we were preparing to welcome the people of Etheirys. I almost forgot it was still there."},{"name":"GENTLELOPORRIT","text":"The barrage appears to have stopped, but just look at all this junk!"},{"name":"GENTLELOPORRIT","text":"Please be sure to pick up your litter before you leave. The moon belongs to everyone, you know."},{"name":"GODBERT","text":"Oho..."},{"name":"GODBERT","text":"Hildibrand Helidor Maximilian Manderville, how glad I am to see you up and about! Your mother will be beside herself with joy!"},{"name":"HILDIBRAND","text":"I only stand before you now thanks to Nashu, who stood ever vigilant at my bedside, and to <span class=\"highlight\">Forename</span>, who ferried my soul back from across the rift."},{"name":"GODBERT","text":"My son is indeed blessed with comrades of quality. You have my heartfelt gratitude."},{"name":"GODBERT","text":"To you, Master PuPu, I extend my apologies─in my excitement, I fear I have broken your starship. If there is aught I can do to help effect repairs, you have only to ask."},{"name":"KOYOKOYO","text":"PuPu... My vessel experienced a temporary malfunction, but there was no major structural damage."},{"name":"GODBERT","text":"It brings me relief and joy to hear it."},{"name":"GODBERT","text":"Ahem. Might I have a word, <span class=\"highlight\">Forename</span>? I had actually come to the moon in search of a certain rare ore, and by Thal's good graces, my quest has been successful."},{"name":"GODBERT","text":"The ore, however, is but the first step of a longer saga. Meet me back in Radz–at–Han, and I will explain the role I wish you to play."},{"name":"HILDIBRAND","text":"Yes, I think it best we make the journey starwards. We'll not find Master PuPu's friend from up here unless someone packed an extremely efficacious spyglass! Anybody...? No? Then home it is!"},{"name":"DELION","text":"For years, I've chased after the supernatural and the inexplicable, but to encounter so much of it in such a short span of time... My mind still reels from the implications."},{"name":"DELION","text":"Yet I must keep my gaze focused beyond the veil. A chance like this comes only once in a lifetime!"},{"name":"NASHUMHAKARACCA","text":"See! I told you I recognized those hammers! A good inspector never forgets a tool!"},{"name":"DELION","text":"Now begins the hard work of compiling my notes into a structured account of events. There is so much to say, I may need to stretch this over several articles..."},{"name":"KOYOKOYO","text":"PuPu... You needn't worry about the clones returning to plague you. The vaporization ray disassembles matter on a molecular level."},{"name":"OKKAKE","text":"Oh, uh, yes...I'm still here. That alien tried to take me away from my Miss Nashu, but as you can see, true love has prevailed!"},{"name":"OKKAKE","text":"I'll be around, as always, lurking─ahem, keeping an adoring eye on the most beautiful girl in the world. From a respectful distance, of course."},{"name":"HILDIBRAND","text":"Ah, how lovely to be back on the star of my birth! Father did not tarry to chat, but said something about returning here with a trusted employee..."},{"name":"HILDIBRAND","text":"Well, we've no time for further familial pleasantries! Nashu and I must devote all our mental energies to “The Case of the Silent Correspondent”!"},{"name":"HILDIBRAND","text":"My keen inspector's sense impels me to begin our search in <span class=\"emphasis\">that direction</span>. Make haste, my companions, for justice waits for no man! Not even one who is little and blue!"},{"name":"NASHUMHAKARACCA","text":"Inspector, wait! Can't justice make an exception for me!?"},{"name":"DELION","text":"His channeling appears to be remarkably effective. Fascinating. Yes, most fascinating indeed..."},{"name":"DELION","text":"<span class=\"highlight\">Forename</span>, forgive me: I seem to have been laboring under a misconception."},{"name":"DELION","text":"After spending some time with the xeno-bunnies, it has become clear to me that they have not the slightest intention of invading our star. They are no threat to us..."},{"name":"DELION","text":"...But <span class=\"emphasis\">he</span> is! You know of whom I speak! That devious Master PuPu and his diabolical devices devised solely for world domination!"},{"name":"DELION","text":"I shall have to investigate him further to learn the intricacies of his plans, but I may require your aid─not to mention your interpretation."},{"name":"DELION","text":"I'll even pay you a retainer fee. So please, when the time comes, join me on my quest for the <span class=\"emphasis\">Truth</span>."},{"name":"GODBERT","text":"Ah, <span class=\"highlight\">Forename</span>, my apologies for the wait. Shall we proceed to business, then?"},{"name":"GODBERT","text":"The task at hand concerns nothing less than a family legacy..."},{"name":"GODBERT","text":"The recreation of the historically significant and astronomically magnificent Manderville weapons!"},{"name":"GODBERT","text":"They were the designs of a distant ancestor, you see. While the originals have long since vanished, the manual containing the secrets of their construction survived─a precious heirloom passed down through generations of Mandervilles."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Why the sudden passion for weaponsmithing?"},{"name":"A2","text":"Aren't your hammers built for hammering gold?"},{"name":"GODBERT","text":"'Tis true that, as a goldsmith, I've had little occasion for crafting implements of war. “Why this project, and why now?” you may very well ask. Then I shall very well tell you."},{"name":"GODBERT","text":"The tale begins not so long ago. I was here, in Radz–at–Han, to discuss a deal with an up-and-coming merchant."},{"name":"GODBERT","text":"The matter in question was an acquisition proposal. Alas, the talks soured, so I made preparations to depart. It was then that the sky burst into flame."},{"name":"GODBERT","text":"You know all too well what horrors followed. I did my best to defend the citizenry from the beasts which spawned, yet I could not save them all. Saved far too few, in fact."},{"name":"GODBERT","text":"The memory of it haunted me, day and night, and I found myself unable to work. But then I heard the news of how you and your companions had ventured forth to banish this evil at its source."},{"name":"GODBERT","text":"You forged on in the face of deepest despair...and it gave me the courage to do the same!"},{"name":"GODBERT","text":"I took a good, hard look in the looking glass and asked, “What can Godbert Manderville do to safeguard the people of this star?” Thus did I realize that I had both the knowledge and the skill to forge the greatest of weapons, that I might empower others to protect themselves and their fellow man."},{"name":"GODBERT","text":"So I began going down the list, acquiring the necessary materials with single-minded purpose. One of these was a goodly chunk of purest manderium ore─a metal found exclusively in meteorites, and that only rarely."},{"name":"GODBERT","text":"I searched high and low, scouring impact sites and consorting with kobolds, all to no avail. Then, when none was to be found on Hydaelyn, I set my sights on the moon, where I at last obtained a sizable sample."},{"name":"GODBERT","text":"Now I say, “at last,” but the list of materials goes on. If I'm to collect the rest in a timely fashion, I must employ the help of a comrade of quality!"},{"name":"GODBERT","text":"When you can spare a moment from adventuring─or aiding my dear son in his inspecting─pray drop a word in the ear of my manservant here."},{"name":"GODBERT","text":"I shall clear my schedule of trivial interruptions, and we can proceed with the recreation of a Manderville weapon forthwith!"},{"name":"SYSTEM","text":"Meanwhile, elsewhere in Radz–at–Han..."},{"name":"RADIANTSOLDIER04642","text":"(-Radiant Sentry-)Sound the alarum! A prisoner is escaping!"},{"name":"SYSTEM","text":"On solid ground, or far out of this world♪"},{"name":"SYSTEM","text":"Beyond the truth lies the weird and absurd♪"},{"name":"SYSTEM","text":"A beloved son♪<br>He's second to none♪<br>Our agent of enquiry─Hildibrand Manderville♪"},{"name":"SYSTEM","text":"Definitely not an alien clone♪"}],"reward":{"gil":1432},"reqs":{"jobs":[{"lvl":90,"id":34}],"quests":[70177]},"next":[70188,70254]},"partials":[{"type":"npc","id":"1042544","obj":{"i":1042544,"n":"Hildibrand","l":3711,"q":2}},{"type":"npc","id":"1042555","obj":{"i":1042555,"n":"Hildibrand","l":3707,"q":1}},{"type":"quest","id":"70177","obj":{"i":70177,"n":"Lunar Conspiracy","g":71,"l":"Radz-at-Han","s":210,"f":1}},{"type":"quest","id":"70188","obj":{"i":70188,"n":"Make It a Manderville","g":72,"l":"Radz-at-Han","s":101,"f":1}},{"type":"quest","id":"70254","obj":{"i":70254,"n":"The Spectacle of Inspection","g":71,"l":"Radz-at-Han","s":310,"f":1}}]}