{"quest":{"name":"For Coin, Country, and Comrades","location":"Ul'dah","id":70185,"patch":6.25,"sort":101,"eventIcon":71221,"issuer":1043777,"target":1043778,"genre":90,"journal":["Kokoshu has the air of one with a message to convey."],"objectives":["Speak with Kokoshu on the Hustings Strip.","Speak with Kokoshu again."],"dialogue":[{"name":"KOKOSHU","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. I am pleased to inform you that the storage vault you discovered has been thoroughly inventoried."},{"name":"KOKOSHU","text":"And as Her Grace previously mentioned, she wishes to discuss the findings with you in person."},{"name":"KOKOSHU","text":"Have you a moment or two to take tea with the sultana?"},{"name":"KOKOSHU","text":"Very good. Pray take the time you need to freshen up and change your wardrobe if you so desire, then meet me on the Hustings Strip."},{"name":"KOKOSHU","text":"Thank you for coming, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>."},{"name":"KOKOSHU","text":"Her Grace will see you now."},{"name":"NANAMOULNAMO","text":"While it is quite amusing to skulk about in disguise, I thought it might be nice to meet in comfort for a change..."},{"name":"NANAMOULNAMO","text":"That said, I am reminded of our private audience around the time of the victory banquet."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Right before I had to flee into the aqueducts..."},{"name":"A1","text":"Not a day I care to recall."},{"name":"NANAMOULNAMO","text":"Those tunnels must occupy a dark place in your memory. I hope our recent explorations have brightened them somewhat..."},{"name":"NANAMOULNAMO","text":"'Twas a dark time, indeed. Let us perforce move on to brighter things, shall we?"},{"name":"NANAMOULNAMO","text":"Kokoshu will have told you of our progress in cataloging the sultans' vault?"},{"name":"NANAMOULNAMO","text":"I deployed a handpicked group of soldiers to compare its contents against the inventory list we recovered, and 'twould seem all items were present and accounted for. There was no evidence of thieving or vandalism, Nald'thal be praised."},{"name":"NANAMOULNAMO","text":"The question, then, is what did the sultan of the Thorne Dynasty deem so precious that it must be concealed in an underground archive constructed for the purpose?"},{"name":"NANAMOULNAMO","text":"'Twas a gift. Other kingly treasures were stored there, of course, but pride of place at the top of the list was a tribute from the Amalj'aa."},{"name":"NANAMOULNAMO","text":"Ul'dahns and Amalj'aa once fought side by side to purge the Sil'dihn Subterrane of the undead, and this tribute commemorated their well-fought victory."},{"name":"NANAMOULNAMO","text":"True accounts of the matter, however, have long been stifled for political expedience. Thus did generations of rulers seek to keep the tribute safe and secret, that evidence of our historic alliance might never be forgotten."},{"name":"NANAMOULNAMO","text":"They believed the world would change for the better. They believed that preserving our peoples' shared past would aid us in embracing harmony when the time was ripe for reconciliation."},{"name":"NANAMOULNAMO","text":"And after the recent happenings at Paglth'an, I believe that time is now."},{"name":"NANAMOULNAMO","text":"“For coin, country, and comrades-in-arms, we bequeath this trust to the House of Ul.” So reads the declaration of our forebears, and so shall I endeavor to answer their charge."},{"name":"NANAMOULNAMO","text":"There are no few on both sides who seek to decry our efforts; that peace between our peoples will not─can not─be attained. Yet with the gift of precedence in hand will I have the means to convince them."},{"name":"NANAMOULNAMO","text":"And I have you to thank for arming me with the truth. Had you not answered my selfish request, or persisted with such patience, I may never have made this wholly unexpected discovery."},{"name":"NANAMOULNAMO","text":"You have my deepest gratitude, <span class=\"highlight\">Forename</span>. Ever shall I cherish the memories of our explorations."},{"name":"NANAMOULNAMO","text":"Oh, but how unseemly of me to dominate the conversation so! What of my distinguished guest? How does Eorzea's tireless champion fare of late?"},{"name":"KOKOSHU","text":"How did you enjoy your tea? The sultana had much to talk to you about, it seems."},{"name":"KOKOSHU","text":"I understand that an adventurer of your caliber is in high demand, and we do so appreciate you taking the time to assist Her Grace─both now and in the days to come."},{"name":"KOKOSHU","text":"I also understand how difficult it can be to finish one's cake in the presence of royalty. Here, I've packed you some sweets for the road. Fare you well, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>!"}],"reward":{"gil":1044,"items":[{"num":3,"id":4713}]},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70182]}},"partials":[{"type":"npc","id":"1043777","obj":{"i":1043777,"n":"Kokoshu","l":40,"q":1}},{"type":"npc","id":"1043778","obj":{"i":1043778,"n":"Kokoshu","l":41,"q":1}},{"type":"item","id":"4713","obj":{"i":4713,"n":"Crowned Pie","l":50,"c":24057,"t":46}},{"type":"quest","id":"70182","obj":{"i":70182,"n":"A Key to the Past","g":90,"l":"Old Sharlayan","s":10,"f":1}}]}