{"quest":{"name":"An Odd Job","location":"Old Sharlayan","id":70187,"patch":6.25,"sort":1,"unlocksFunction":1,"eventIcon":71341,"issuer":1043775,"target":1043775,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must be a Disciple of War or Magic of level 90 or above."},{"name":"OSMON","text":"Hello, how may I help yooou...you're <span class=\"highlight\">Forename Surname</span>, aren't you?"},{"name":"OSMON","text":"Aha! I thought I recognized that heroic mien!"},{"name":"OSMON","text":"How wonderful to meet you! The name's Osmon."},{"name":"OSMON","text":"I'm a gleaner, as you may have surmised, mostly specializing in the collection of rare and curious books...and it would seem fate has brought us together!"},{"name":"OSMON","text":"My work has given me an appetite for well-crafted stories, you see, but recently I've struggled to find any truly engaging material."},{"name":"OSMON","text":"So I thought to myself, “Self! Why waste all this time bemoaning the lack of quality literature, when you could be writing the exact kind of tales you enjoy!”"},{"name":"OSMON","text":"Which is why I'm so excited to be speaking with the vaunted champion, <span class=\"highlight\">Forename</span>! If I could convince you to share some of the minutiae of your adventures, it would lend my fiction an undeniable authenticity!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Let me tell you about the time I was just starting out..."},{"name":"A1","text":"Here's a story of the Dragonsong War you may not have heard..."},{"name":"A1","text":"Well, when I stood beside the Resistance fighters of Ala Mhigo, and later, of Doma..."},{"name":"A1","text":"There's a lot to consider when you visit another world...or the world of the past..."},{"name":"SHALLOWMOOR","text":"(-???-)Well, that was a complete waste of─ Osmon? Are you actually <span class=\"emphasis\">chatting</span>!? Scholar above, it's a miracle! And here I thought you capable of little more than grunts and sighs!"},{"name":"OSMON","text":"Ugh... May I introduce Shallow Moor, my colleague and eternal tormentor."},{"name":"SHALLOWMOOR","text":"Oh, come now, it's just a bit of playful banter. Trisassant and I could use some good humor after failing to track down our quarry..."},{"name":"SHALLOWMOOR","text":"&lt;gasp&gt; I'll be damned!"},{"name":"SHALLOWMOOR","text":"<span class=\"highlight\">Forename</span>, this is an honor...and an incredible stroke of luck! You are the very person we've been searching for."},{"name":"SHALLOWMOOR","text":"If you will indulge me for a moment, I can explain the situation at hand."},{"name":"SHALLOWMOOR","text":"As you know, Sharlayan was charged in antiquity with fulfilling a sacred duty─a duty which kept the gleaners buzzing to and fro like angry hornets."},{"name":"OSMON","text":"Aye, we would complete one grueling list of procurements, only to be handed yet another. Then another. The work was all we knew."},{"name":"SHALLOWMOOR","text":"But now that those days are behind us, the tasks have slowed to a trickle. And we find ourselves, well, strangely idle."},{"name":"SHALLOWMOOR","text":"Thus the guildship, in its wisdom, has forged a partnership with the Adventurers' Guild. We now have a system in place where odd jobs from other countries can be funneled here to us in Sharlayan!"},{"name":"SHALLOWMOOR","text":"The tasks they pass on to us are, for the most part, naught your average gleaner cannot handle."},{"name":"SHALLOWMOOR","text":"There is one client, however, who has asked for you specifically. And as the Adventurers' Guild has no official presence in our city, we agreed to the “odd job” of facilitating that request─think of us as their substitute Sharlayan branch, if you will."},{"name":"SHALLOWMOOR","text":"In any case, I'll be here at the counter, ready to provide you with the details! It doesn't appear to be an urgent matter, so feel free to engage the request whenever your schedule allows."},{"name":"SHALLOWMOOR","text":"Oh, and be sure to browse Trisassant's wares. He has a special selection available for anyone who takes part in our odd job enterprise!"},{"name":"OSMON","text":"Ah, <span class=\"highlight\">Forename</span>...? I didn't quite get the chance before Shallow Moor commandeered the conversation, but I wanted to thank you for indulging me with your stories."},{"name":"OSMON","text":"Do you think we might talk again sometime? I should love to hear how this odd job of yours turns out!"},{"name":"SYSTEM","text":"As a result of the partnership between the Adventurers' Guild and the gleaners' guildship, you are now able to accept an odd job from Shallow Moor at the peristyle."}],"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70000]},"next":[70182]},"partials":[{"type":"npc","id":"1043775","obj":{"i":1043775,"n":"Osmon","l":3706,"q":1}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}},{"type":"quest","id":"70182","obj":{"i":70182,"n":"A Key to the Past","g":90,"l":"Old Sharlayan","s":10,"f":1}}]}