{"quest":{"name":"The Land, Wind, and Sea","location":"Unnamed Island","id":70181,"patch":6.2,"sort":101,"icon":101185,"eventIcon":71221,"issuer":1044156,"genre":89,"journal":["The curious courier is making strange beeping noises.","You speak with the curious courier, who seems nearly at a loss for words at finally having the opportunity to fulfill its function. Nevertheless, it successfully directs you to await Tataru's arrival at the islet inlet.","To your surprise, Tataru arrives with Grand Storm Marshal Eynzahr and the infamous former captain of the Bloody Executioners, Hyllfyr, in tow. Your conversation with them leaves you with the distinct impression that talk of island sanctuaries may soon spread amongst the erstwhile pirates of the Rhotano Sea. For now, however, with the isle all to yourself once again, you may forget about the outside world for a while."],"objectives":["Await Tataru's arrival at the designated location."],"dialogue":[{"name":"OPERATORMAMMET","text":"Contact! Contact from Mistress Tataru!"},{"name":"OPERATORMAMMET","text":"She is currently admiring the island from offshore, and will soon meet you on the inlet to the west!"},{"name":"OPERATORMAMMET","text":"I can't believe it finally happened!"},{"name":"TATARU","text":"<span class=\"highlight\">Forename</span>! How is life on the isle treating you?"},{"name":"TATARU","text":"Apologies for the short notice─the felicitous furball has been keeping me abreast of your progress, but I couldn't wait any longer to see it with my own eyes!"},{"name":"TATARU","text":"It seems you've constructed workshops, granaries, and other amenities besides! I trust the mammets have been a tremendous help?"},{"name":"TATARU","text":"Wonderful! As you can see, I've invited a few of our mutual acquaintances for a little tour of your accomplishments. I hope you don't mind."},{"name":"EYNZAHRSLAFYRSYN","text":"(-Familiar Roegadyn-)I heard from the Admiral that you landed a permit for an island sanctuary, so I thought I would stop by and offer my support. Hyllfyr here is along for the ride, so to speak."},{"name":"EYNZAHRSLAFYRSYN","text":"(-Familiar Roegadyn-)And lest you worry, this is only our first stop on a tour of the Cieldalaes, so we'll be out of your hair before you know it."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"...Do I know you?"},{"name":"A1","text":"Is that you, Grand Storm Marshal?"},{"name":"EYNZAHRSLAFYRSYN","text":"You wound me! After all we've been through together, you don't recognize old Eynzahr? Perhaps I should have worn my Maelstrom uniform..."},{"name":"EYNZAHRSLAFYRSYN","text":"Aye, Eynzahr Slafyrsyn at your service. Half surprised you recognized me without the uniform on."},{"name":"EYNZAHRSLAFYRSYN","text":"On occasion, the Admiral is of a mind to force a leave of absence on me. I thought I'd take this opportunity to have a look around the island sanctuaries, and seeing as this fossil has nothing better to do..."},{"name":"HYLLFYR","text":"After saunterin' onto me ship wi'out a word o' warnin', 'e now sees fit to disparage me! The way 'e barged into me cabin, I thought 'e was fixin' to drag me off to the gaol in me skivvies, not on some damn pleasure cruise."},{"name":"HYLLFYR","text":"Lucky for this bastard, I'd been hopin' to get a closer eye on the Admiral's new venture meself. Somebody needs to steer the whelps aright in these new waters, so I came along peaceful-like."},{"name":"HYLLFYR","text":"&lt;cough&gt; &lt;cough&gt; ...If me thrice-damned body don't finish me off first."},{"name":"EYNZAHRSLAFYRSYN","text":"Don't push yourself, Hyllfyr."},{"name":"EYNZAHRSLAFYRSYN","text":"In fact, you should consider a sanctuary yourself. Solid ground, warm weather, and a fresh breeze for the rest of your days."},{"name":"HYLLFYR","text":"Ye plainly 'it yer noggin, spoutin' such poppycock."},{"name":"HYLLFYR","text":"...But ye may be on to somethin'. When the sea's got no more use fer me, better to welcome the end on land'n rot in that ol' cabin."},{"name":"TATARU","text":"Instead of an end, think of it as a new beginning! And should you require assistance in procuring permits or trading partners, Tataru Taru's Boutique is at your service. We ask only to share in any discoveries you make along the way!"},{"name":"HYLLFYR","text":"Ye've got it all figured out, eh? If yer that keen, might be as I take ye up on yer offer. See if the whelps won't haul out some pigs for the roastin' when they visit..."},{"name":"EYNZAHRSLAFYRSYN","text":"And here I thought you were completely opposed to the idea. Instead, you're planning out supper. Just to be clear, I had better be invited."},{"name":"EYNZAHRSLAFYRSYN","text":"No doubt you'll join as well, <span class=\"highlight\">Forename</span>?"},{"name":"HYLLFYR","text":"The grand storm marshal of the Maelstrom ain't invited to no shindy o' mine. Now, were ye to come as a pirate, might be as I'm open to the prospect."},{"name":"EYNZAHRSLAFYRSYN","text":"Stubbornness only grows with age, they say."},{"name":"EYNZAHRSLAFYRSYN","text":"Having seen this isle and its effects on the obstinate firsthand, I'm convinced the Admiral was right to chart this course for Limsa's future. Full glad am I to have made the trek."},{"name":"TATARU","text":"Hear, hear! Though I'm awfully curious about the other isles as well, so I am afraid we can't stay long."},{"name":"TATARU","text":"More than anything, I'm glad to have found you at ease here, <span class=\"highlight\">Forename</span>. I call that mission accomplished!"},{"name":"EYNZAHRSLAFYRSYN","text":"Llymlaen take me, I nearly forgot! I have something for you."},{"name":"EYNZAHRSLAFYRSYN","text":"The Admiral intended to deliver these to you herself, but as you are aware, one in her position can scarce move freely. And I would be remiss if I did not make it a point to inform you she picked them out personally."},{"name":"TATARU","text":"On that note, I believe it is time we see what the rest of the archipelago has to offer. I very much look forward to seeing what other accomplishments you've made when next I visit!"}],"reward":{"items":[{"id":38212},{"id":38213},{"id":38214},{"id":38216},{"id":38215}]},"reqs":{"quests":[70179]},"next":[70265]},"partials":[{"type":"npc","id":"1044156","obj":{"i":1044156,"n":"Curious Courier","l":4043,"q":2}},{"type":"item","id":"38212","obj":{"i":38212,"n":"Isle Farmhand's Work Shirt","l":1,"c":42867,"t":35,"p":100}},{"type":"item","id":"38213","obj":{"i":38213,"n":"Isle Farmhand's Cotton Gloves","l":1,"c":56011,"t":37,"p":100}},{"type":"item","id":"38214","obj":{"i":38214,"n":"Isle Farmhand's Widebottoms","l":1,"c":47897,"t":36,"p":100}},{"type":"item","id":"38216","obj":{"i":38216,"n":"Isle Farmhand's Cutoffs","l":1,"c":47898,"t":36,"p":100}},{"type":"item","id":"38215","obj":{"i":38215,"n":"Isle Farmhand's Boots","l":1,"c":49494,"t":38,"p":100}},{"type":"quest","id":"70179","obj":{"i":70179,"n":"Seeking Sanctuary","g":89,"l":"Old Sharlayan","s":20,"f":1}},{"type":"quest","id":"70265","obj":{"i":70265,"n":"A Far Eastern Yarn","g":89,"l":"Unnamed Island","s":111}}]}