{"quest":{"name":"A Key to the Past","location":"Old Sharlayan","id":70182,"patch":6.25,"sort":10,"icon":101183,"unlocksFunction":1,"eventIcon":71341,"issuer":1043624,"target":1043624,"genre":90,"journal":["Shallow Moor is watching you expectantly.","Acting as the facilitator for the guildship's odd job initiative, Shallow Moor hands you an explanatory missive from Momodi. The letter details a request from one of the sultana's personal attendants, asking you to travel to Thanalan. After confirming your assent, Shallow Moor contacts Momodi to arrange a meeting, and you find yourself scheduled to speak with one “Kokoshu” outside the Quicksand in Ul'dah.","Kokoshu quickly sets the record straight on who your true client is: the sultana, Nanamo Ul Namo. The lady-in-waiting tells you the tale of an unusual gate discovered in the damaged sections of the Sil'dihn aqueducts, and of Nanamo's desire to see it firsthand. Upon your agreement to help the sultana in this endeavor, Kokoshu cedes the meeting to Nanamo herself. Her Royal Majesty elaborates that the symbol on this portal matches the design of a key gifted to her by her parents, and she is adamant that they meant for her to explore whatever lies beyond. As for your part, Nanamo feels that you are her best choice of escort if she wishes to investigate unimpeded by overprotective guards. It seems she has arranged for you to enter the Sil'dihn ruins via the entrance in central Thanalan, whilst she arrives undetected through the palace's secret tunnels...","The curious-but-dutiful foreman directs you inside the ruins, where you are to rendezvous with Nanamo and her mysterious key. You know not what secrets or perils await you in the subterranean Sil'dihn tunnels, only that opening strange gates often leads to adventure...<br><br>※The Sil'dihn Subterrane can be accessed via the V&C Dungeon Finder.<br>※To open the V&C Dungeon Finder, speak with the Sil'dihn Subterrane foreman or select the option located under Duty in the main menu.","While undoubtedly successful, your expedition into the Sil'dihn Subterrane has raised more questions than it answered. Putting your whirling thoughts aside, you realize the foreman will wish to know that your “assignment” is concluded so that he and his laborers might return to work.","When you inform the foreman that the tunnels are his again, he passes on a message to you from Kokoshu. It seems that Nanamo's lady-in-waiting awaits you near the Quicksand once more.","You speak with Kokoshu─who is actually Nanamo in disguise─and she reflects upon the discoveries you made together during your recent adventure. Convinced that the Sil'dihn Subterrane yet holds far more places of interest to explore, the sultana bids you join her on another foray─when time permits, of course. For now, however, she must return to her usual affairs of state, and it is the real Kokoshu who arrives next to thank you profusely for your cooperation. The circle of gratitude, however, will not be complete until you convey the lady-in-waiting's warm regards to Shallow Moor back in Sharlayan...","Shallow Moor welcomes you back, seemingly pleased by Kokoshu's sincere appreciation. She encourages you to share your adventure with Osmon, but you wonder if after a single expedition you can call this odd job truly finished. As Nanamo has said, there is likely a great deal more inside the Sil'dihn Subterrane, just waiting to be discovered..."],"objectives":["Meet with Kokoshu in Ul'dah.","Speak with the Sil'dihn Subterrane foreman at the Sil'dih excavation site.","Enter the Sil'dihn Subterrane.","Speak with the Sil'dihn Subterrane foreman.","Speak with Kokoshu in Ul'dah.","Speak with Shallow Moor in Old Sharlayan."],"dialogue":[{"name":"SHALLOWMOOR","text":"So, <span class=\"highlight\">Forename</span>, does this mean you've found a spare moment in your busy god-slaying agenda?"},{"name":"SHALLOWMOOR","text":"Wonderful. We actually have a letter addressed to you from Mistress Momodi. Go ahead and read through that, and I'll dig up the linkpearl I'm to use to convey your reply."},{"name":"MOMODI","text":"(-Missive from Momodi-)<span class=\"emphasis\">Dear <span class=\"highlight\">Forename</span>,<br>I hope this letter finds you well and still taking guild jobs, because we've got one here with your name on it.</span>"},{"name":"MOMODI","text":"(-Missive from Momodi-)<span class=\"emphasis\">Ordinarily, I wouldn't bother you with something like this, but the client is a personal attendant to Her Royal Majesty Nanamo Ul Namo. And I'm guessing that piqued your curiosity as much as it did mine.</span>"},{"name":"MOMODI","text":"(-Missive from Momodi-)<span class=\"emphasis\">Let Shallow Moor know if you can make it over to Ul'dah, and I'll set up a meeting with this lady-in-waiting. I'm told it's nothing urgent, so at your earliest convenience!<br>Momodi.</span>"},{"name":"SHALLOWMOOR","text":"What are we thinking? Yea or nay?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Tell Momodi I'm on my way."},{"name":"A1","text":"One does not simply refuse Mistress Momodi."},{"name":"SHALLOWMOOR","text":"Understood! I'll call her right away."},{"name":"SHALLOWMOOR","text":"Hah! I'll take that as assent, then. Let me make the call..."},{"name":"SHALLOWMOOR","text":"And done! Our tiny taskmaster is making arrangements as we speak."},{"name":"SHALLOWMOOR","text":"She says the lady you're to meet is a Lalafell by the name of Kokoshu. Light-brown hair, green eyes."},{"name":"SHALLOWMOOR","text":"She should be awaiting you outside the Quicksand by the time you arrive. Fair fortune and safe travels!"},{"name":"KOKOSHU","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, I presume? I am Kokoshu."},{"name":"KOKOSHU","text":"But let us be clear from the outset: I am not your true client."},{"name":"KOKOSHU","text":"The personage who wishes to engage your services is the sultana, Nanamo Ul Namo herself."},{"name":"KOKOSHU","text":"Firstly, however, pray allow me to explain the request itself. Then you can decide whether or not you wish to proceed."},{"name":"KOKOSHU","text":"I trust you recall the tunnels beneath the city of Ul'dah?"},{"name":"KOKOSHU","text":"I speak of course of the Sil'dihn Subterrane─the passages and waterways through which you made your escape on the day of that ill-fated victory banquet."},{"name":"KOKOSHU","text":"It seems that one of the tunnel sections collapsed during the commotion, and a crew comprised primarily of Immortal Flames has since been put to work on repairs."},{"name":"KOKOSHU","text":"In the process of restoring the masonry, however, they have come across an unexpected gate..."},{"name":"KOKOSHU","text":"It was described as antique in design, inscrutable in purpose, and sealed shut by some mystical force. The report appeared of great interest to the sultana, and she has expressed a desire to investigate this strange portal firsthand."},{"name":"KOKOSHU","text":"Furthermore, she feels that Master Tarupin and the like are “overprotective” and will prevent her from exploring to her heart's content. But are we then to send Her Royal Majesty into potential peril without a trusted escort? You see my dilemma."},{"name":"KOKOSHU","text":"As the proven champion of Eorzea and veteran of countless heroic endeavors, it is to you whom we would entrust the sultana's safety. Besides which, she would have it no other way."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Her Grace's wish is my command!"},{"name":"A2","text":"I'm not sure about this, but if that's what the sultana wants..."},{"name":"KOKOSHU","text":"Thank you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>─it will mean a great deal to Her Grace. Please wait here, and I shall inform the sultana of your decision."},{"name":"NANAMOULNAMO","text":"<span class=\"highlight\">Forename</span>, thank you for coming. I greatly appreciate you indulging this selfish request of mine."},{"name":"NANAMOULNAMO","text":"I should hope for the sake of your adventurous spirit, however, that the mystery at hand proves more intriguing than odious."},{"name":"NANAMOULNAMO","text":"Kokoshu spoke broadly of what to expect, yes? Then allow me to add a few details to the story."},{"name":"NANAMOULNAMO","text":"According to the report, the gate bears an intricate, flowery design. The Flames were unable to ascertain its origin or significance, but I have seen such a motif before..."},{"name":"NANAMOULNAMO","text":"The very same design adorns a key in my possession─the last gift I was ever to receive from my dear departed parents."},{"name":"NANAMOULNAMO","text":"I recall the ceremony with which it was presented, and their promises to take me to the place the key unlocked once I had come of age."},{"name":"NANAMOULNAMO","text":"They spoke excitedly of the choices I might make, of the things I would behold on my chosen path...but they were called away to Thal's halls long before that day would arrive."},{"name":"NANAMOULNAMO","text":"With Mother and Father gone, I despaired of ever learning the key's purpose. And now this portal is found..."},{"name":"NANAMOULNAMO","text":"Surely you understand why I cannot leave it unopened?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"There could be <span class=\"emphasis\">anything</span> behind that gate!"},{"name":"A3","text":"There could be <span class=\"emphasis\">anything</span> behind that gate..."},{"name":"NANAMOULNAMO","text":"You see! I knew I could count on your enthusiasm!"},{"name":"NANAMOULNAMO","text":"How reassuring it will be to have a veteran adventurer at my side. Not that I distrust Papashan or Pipin, of course, but if I told them, they would only seek to dissuade me from my course."},{"name":"NANAMOULNAMO","text":"Indeed. But Mother and Father meant for me to see it, and that is what I intend to do."},{"name":"NANAMOULNAMO","text":"Still, neither Papashan nor Pipin would approve of my plans to investigate in person. I needed someone else I trust, but who trusted my judgment in turn. Will you be that person for me?"},{"name":"NANAMOULNAMO","text":"As for Kokoshu, she was the first I brought into my confidence."},{"name":"NANAMOULNAMO","text":"She is, after all, my lady-in-waiting, and serves as my double when I am away. I hadn't wished to involve anyone else, but she flatly refused to cooperate unless I enlisted a reliable escort."},{"name":"NANAMOULNAMO","text":"Thus here we stand! And though I regret the need to have you complicit in my subterfuge, the idea of exploring with you has me giddy with anticipation!"},{"name":"NANAMOULNAMO","text":"If you could make your way directly to the excavation site in central Thanalan, the foreman there has been instructed to permit you entrance."},{"name":"NANAMOULNAMO","text":"Considering the tunnels reach all the way to the palace, security protocols dictate that we receive reports any time someone enters the ruins. I will take that as my signal to join you─via the secret passages, of course."},{"name":"NANAMOULNAMO","text":"Now, let us make our preparations. We should, as you say, be ready for anything!"},{"name":"ULDAHMILITARY04646","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Lady Kokoshu says you are to have unrestricted access to the ruins for some manner of “confidential assignment.”"},{"name":"ULDAHMILITARY04646","text":"I wonder, does this have anything to do with what they found in that collapsed section, or...?"},{"name":"ULDAHMILITARY04646","text":"Uh, actually, never mind that. I'm not meant to ask any questions."},{"name":"ULDAHMILITARY04646","text":"Ahem. The rubble's been mostly cleared away, but please, do watch your footing down there. Wouldn't want you tripping over a loose rock in the gloom!"},{"name":"ULDAHMILITARY04646","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. All done with your, uh, “assignment,” then?"},{"name":"ULDAHMILITARY04646","text":"Glad to hear it. I'll inform the workers that they're free to head back into the tunnels."},{"name":"ULDAHMILITARY04646","text":"Oh, and before I forget!"},{"name":"ULDAHMILITARY04646","text":"I have a message for you from Lady Kokoshu: she wishes to meet you by the Quicksand upon your return to Ul'dah. Safe travels, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."},{"name":"NANAMOULNAMO","text":"Welcome back, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)...As Kokoshu might say.<br>'Tis I, Nanamo! Did I fool you?"},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)My lady-in-waiting yet plays the role of sultana, but we reasoned it odd if “Kokoshu” were to enter my chambers and never emerge."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)Thus the disguise. It also affords me a way to speak with you without the usual royal fanfare."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)As for our expedition, that was...rather more taxing than I had anticipated. What I had planned as a simple sating of curiosity has given me much to consider."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)I thought I had come to terms with the loss of my parents; that I was content with the few faint memories I had."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)Yet walking into that beautiful secluded garden, and seeing the traces of themselves they left behind... It forced me to acknowledge the grief I hid away as a child, and carry locked within my heart even now."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)Few are aware of Ul'dah's historic alliance with the Amalj'aa. The fortifications we saw are undoubtedly remnants from that period of cooperation─a chapter of our past that has long been kept from the light of day."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)I've been afforded a tangible glimpse into how things once stood between us. And as we continue our struggle to repair ties with the tribes, I am encouraged that they will one day be so harmonious again."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)Ul'dah was built upon sacrifice─Sil'dihn sacrifice. To know this is one thing, but to actually walk through the decaying ruins of a palace is another."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)The victors should not seek to bury the price of victory alongside the bodies of the fallen. I feel that Father, wise sultan that he was, wished for me to learn this lesson."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)I had not, for instance, dreamed our path would lead to a hidden vault─much less one maintained by a succession of sultans."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)I imagine the appointment of this secret trust would have accompanied one's ascension to the throne, but my father's passing was...sudden. He likely only had opportunity to leave a short letter in the vault, and then bequeath me the key in the hopes that I would find it."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)And now I have. Even across the years, the faded parchment conveys their love, and I will honor their memory as daughter and sultana both."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)As for the vault itself, the priority must be to catalog and preserve its contents. You deserve to share in the results of that inspection, thus I will contact you through Kokoshu when I have grasped the extent of our discovery."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)Such revelations aside, I cannot help but dwell upon the fuss which Mother and Father made of the choices I would make, and the paths I would take... Other places of import yet lurk behind those portals, of that I am certain."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)Yes, I should very much like to conduct a more thorough exploration─when time and circumstance permit, of course. Aid me in mapping out this underground enigma, and you will find me a very grateful sultana!"},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)In this very moment, however, there are several dreary affairs of state which demand my attention. I believe Kokoshu wishes a word before you depart, so pray abide here a while, if you would."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)Keep well, <span class=\"highlight\">Forename</span>, and we shall meet again soon."},{"name":"KOKOSHU","text":"Welcome back, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Ah, lest you wonder, I promise I am the real Kokoshu this time."},{"name":"KILFUFU","text":"And I am Kilfufu, Kokoshu's assistant and fellow trusted confidant. A pleasure to make your acquaintance."},{"name":"KILFUFU","text":"As part of Her Grace's, uh, “inner circle,” I simply had to come along to offer my thanks in person."},{"name":"KOKOSHU","text":"Yes, we are most grateful for your steadfast presence."},{"name":"KOKOSHU","text":"I worried what would happen when the sultana first laid out her rather reckless plan, yet she has returned to us not only unharmed, but invigorated."},{"name":"KILFUFU","text":"For the sake of Her Grace's well-being─and our continued peace of mind─we hope that you will agree to further forays at her side."},{"name":"KOKOSHU","text":"We were also informed by Mistress Momodi that the gleaners' guildship was instrumental in facilitating our request."},{"name":"KOKOSHU","text":"When next you visit Sharlayan, please do pass on our warmest regards to Shallow Moor."},{"name":"KOKOSHU","text":"Considering your tendency to range beyond the reach of ordinary mortals, I was not at all certain that our request would reach you. We do appreciate Shallow Moor's zeal in tracking you down!"},{"name":"SHALLOWMOOR","text":"All finished with the job, then, <span class=\"highlight\">Forename</span>? Mistress Momodi called to thank us, and let us know that you'd arrived in Ul'dah."},{"name":"SHALLOWMOOR","text":"So, the little lady-in-waiting sends her regards as well, does she? They sure know how to make a girl feel appreciated!"},{"name":"SHALLOWMOOR","text":"Oh, I should probably give you a nudge in Osmon's direction; he's been scanning the crowd every few moments, hoping you'd be back to regale him with the tale of your odd job adventure."},{"name":"SHALLOWMOOR","text":"If you've the time, I'm sure he'd be thrilled with any scrap of story you care to share!"},{"name":"SYSTEM","text":"The <span class=\"highlight\">Sil'dih Survey Record</span> is now available within the V&C Dungeon Finder in the Duty section of the main menu."},{"name":"SYSTEM","text":"New entries will be added to the log as you complete each possible route through the variant dungeon."}],"reward":{"gil":5055,"instance":36001},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70187]},"next":[70185]},"partials":[{"type":"npc","id":"1043624","obj":{"i":1043624,"n":"Shallow Moor","l":3706,"q":1}},{"type":"instance","id":"36001","obj":{"i":36001,"n":"The Sil'dihn Subterrane","c":61846,"t":"V&C Dungeon Finder","min_lvl":90,"max_lvl":90,"min_ilvl":575,"max_ilvl":635}},{"type":"quest","id":"70187","obj":{"i":70187,"n":"An Odd Job","g":0,"l":"Old Sharlayan","s":1,"f":1}},{"type":"quest","id":"70185","obj":{"i":70185,"n":"For Coin, Country, and Comrades","g":90,"l":"Ul'dah","s":101}}]}