{"quest":{"name":"Reindeer Fame","location":"Gridania","id":70194,"patch":6.2,"sort":223,"icon":101200,"eventIcon":71221,"issuer":1043982,"target":1044007,"genre":204,"journal":["Amh Garanjy is looking for an adventurer filled with Starlight cheer.<br>※This quest is available for a limited time only.","Amh Garanjy, celebrated Starlight celebrant, introduces you to Laurenssen, an associate professor of folklore visiting from Sharlayan. Laurenssen has come to Eorzea in pursuit of the truth─to wit, the origin of Starlight reindeer symbolism. He hopes to prove beyond a shadow of a doubt that reindeer of eld once delighted young children with illusions, and he requires the aid of a cheerful adventurer such as yourself to set the stage for his experiment. You set off to gather a crowd of younglings, but Blitzen, the reindeer at the crux of this operation, shakes his head dolefully, seemingly less than enthusiastic...<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Despite asking various children to come and see your magical reindeer, you end up with only a single taker. Reflecting upon where you might have gone wrong, you head back to Laurenssen.","Laurenssen is disgruntled by the dearth of rosy-cheeked younglings, but decides to try the experiment nonetheless. It ends in abject failure and Laurenssen temporarily excuses himself to regain his composure. You listen to the soothing sounds of Apkallu Falls and wait for his return as you contemplate the finer points of mortal existence.","No matter how long you wait, Laurenssen fails to return. A lesser <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> might simply abandon him, but no─this is the season of generosity, and you are a greater <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>. You set off towards the Greatloam Growery to find him.","Laurenssen admits that he believes the children of Gridania are to blame for his experiment ending in failure, as they were not sufficiently inspiring for his reindeer─who is notably absent. Realizing his companion is no longer shaking his head dolefully beside him─or anywhere, for that matter─Laurenssen rushes off. You remind yourself that you are a champion of the people, and follow him before he trips and hurts himself.","The confident scholar proclaiming his unassailable theories but moments ago is now a shivering mess of nerves. Visibly twitching with the anxiety of losing his trusted assistant, Laurenssen vows to find Blitzen, but it is painfully evident he will need a touch of reassurance from an adventurer's heart before he is fit enough to try..."],"objectives":["Gather children for Laurenssen.","Speak with Laurenssen.","Wait for Laurenssen at the designated location.","Search for Laurenssen.","Speak with Laurenssen."],"dialogue":[{"name":"AMHGARANJY","text":"How good it is to see you again, dear adventurer! You haven't forgotten me since last we met, I hope? It's me, Amh Garanjy."},{"name":"AMHGARANJY","text":"Happy Starlight! You are an adventurer, are you not? I am Amh Garanjy, Starlight celebrant. 'Tis a pleasure to meet you."},{"name":"AMHGARANJY","text":"And may I say you've come at a most opportune moment. You see, we are planning some truly extraordinary festivities this year, but are presently shorthanded..."},{"name":"LAURENSSEN","text":"(-Erudite Man-)It's no good, Celebrant. We will require the aid of an adventurer after all."},{"name":"LAURENSSEN","text":"(-Erudite Man-)Oh! Dare I say <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> <span class=\"emphasis\">is</span> an adventurer, and you have already made the arrangements?"},{"name":"AMHGARANJY","text":"Allow me to introduce Associate Professor Laurenssen of the Studium in Sharlayan. His are the festivities for which I am hoping to secure your assistance."},{"name":"LAURENSSEN","text":"Laurenssen, Faculty of Folklore. Delighted, I'm sure."},{"name":"LAURENSSEN","text":"Without further ado, then, I shall test your knowledge of the season. First question: what creature symbolizes the Starlight Celebration?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Reindeer!"},{"name":"A1","text":"Bear!"},{"name":"A1","text":"Yeeeeeeti!"},{"name":"A1","text":"I don't know..."},{"name":"LAURENSSEN","text":"An easy question, was it not? I apologize if I insulted your intelligence─indeed, the answer is “reindeer.”"},{"name":"LAURENSSEN","text":"Bear? Did you simply select your favorite animal, perhaps? No, my dear <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">sir</span></span>─the correct answer is “reindeer.”"},{"name":"LAURENSSEN","text":"For your information, it is pronounced “yeti” not “yeeeeeeti.” Regardless, why on earth would such a savage creature symbolize the Starlight Celebration!? The correct answer is “reindeer”!"},{"name":"LAURENSSEN","text":"You truly do not know!? Good gods, what impossibly large rock have you been living under? Well, permit me to relieve you of your ignorance─the answer is “reindeer.”"},{"name":"LAURENSSEN","text":"From gifts to garb, Starlight paraphernalia is often emblazoned with or designed in the image of these noble creatures."},{"name":"LAURENSSEN","text":"Now, for my second question─<span class=\"emphasis\">when</span> did the Starlight Celebration begin to make use of this symbolism?"},{"name":"AMHGARANJY","text":"When? You mean to say it was not always so?"},{"name":"LAURENSSEN","text":"No indeed! Any mention of reindeer is conspicuously absent from the tale which inspired the celebration. Thus did I take it upon myself to delve into the truth of the matter."},{"name":"LAURENSSEN","text":"And after many a moon scouring literature, I discovered telling testimony in an ancient Ishgardian tome, which spoke of reindeer that amused younglings with delightful illusions!"},{"name":"LAURENSSEN","text":"It was this spectacular act that earned reindeer their Starlight celebrity, I posit."},{"name":"LAURENSSEN","text":"And in order to prove my theory, I have journeyed to Gridania this Starlight Celebration with this trusty fellow, Blitzen!"},{"name":"BLITZEN","text":"..."},{"name":"AMHGARANJY","text":"Oh! So Blitzen can use reindeer magicks?"},{"name":"LAURENSSEN","text":"Yes, Blitzen is of a rare lineage, one that weaves illusions as a defense against predators. We have been keeping him under our care in Labyrinthos while conducting research on his abilities."},{"name":"LAURENSSEN","text":"Yes, Blitzen is of a rare lineage, one that weaves illusions as a defense against predators. We have been keeping him under our care in Sharlayan while conducting research on his abilities."},{"name":"LAURENSSEN","text":"'Tis my belief that Blitzen can trace his ancestry back to the reindeer who delighted children with illusions in the Ishgardian tome."},{"name":"LAURENSSEN","text":"And I intend to have him do the very same for the children of Eorzea─confirming history by recreating it, as it were!"},{"name":"LAURENSSEN","text":"You see, no matter how much I urged him back in Sharlayan, Blitzen refused to produce child-pleasing illusions. But in Eorzea, where it all began with his noble ancestors, I dare to hope that he will be suitably inspired."},{"name":"AMHGARANJY","text":"I welcome anything that will bring cheer to our sweet children! My duties bind me here, but I believe our adventurer friend will prove a most capable assistant. "},{"name":"LAURENSSEN","text":"Indeed, your cheery disposition tells me you are the perfect candidate for the task I have in store. Can I count on your cooperation?"},{"name":"LAURENSSEN","text":"Splendid. I thank you, as will posterity, I'm sure. Now then, your role is a simple-yet-crucial one─round up the children who will witness Blitzen create his illusion."},{"name":"LAURENSSEN","text":"I shall be at Apkallu Falls, making the necessary preparations. Good luck, and I will see you again anon!"},{"name":"AMHGARANJY","text":"Perhaps you can begin your search along the path from the markets to the Lancers' Guild. I daresay a few younglings will be out gazing at the shops and decorations."},{"name":"AMHGARANJY","text":"Thank you for helping Laurenssen. If I chance upon any younglings, I will be sure to send them along as well!"},{"name":"LAURENSSEN","text":"You'll show us the illusion this time, won't you, Blitzen? You have it in you, I know it!"},{"name":"BLITZEN","text":"..."},{"name":"CHILDA04658","text":"There's going to be illusions?"},{"name":"CHILDA04658","text":"That sounds like fun and all, but I promised my mum I'd help her put up decorations. Sorry."},{"name":"CHILDB04658","text":"Oh... I, er... I was told to buy a Starlight cake and hurry home. Sorry..."},{"name":"CHILDD04658","text":"There's a magical reindeer that can create illusions!? Amazing!"},{"name":"CHILDD04658","text":"I've just finished my chores, so I'll head over at once!"},{"name":"BLITZEN","text":"..."},{"name":"CHILDC04658","text":"Oh, you're here to watch too? Hehe, I can't wait for it to start!"},{"name":"LAURENSSEN","text":"Ah, you are returned! I trust a gaggle of rosy-cheeked younglings will be arriving shortly?"},{"name":"LAURENSSEN","text":"...Only this one!?"},{"name":"LAURENSSEN","text":"&lt;sigh&gt; <span class=\"emphasis\">This</span> is precisely the problem with today's youth─no concept of scholarship or the virtues of academic inquiry!"},{"name":"LAURENSSEN","text":"...I suppose this single ragamuffin will suffice. For the purposes of proof, the <span class=\"emphasis\">number</span> of children isn't consequential, after all."},{"name":"LAURENSSEN","text":"Blitzen! The season of lights is in full glow, and a child stands expectant before you. Hearken unto the spirit of your ancestors, and bring forth your delightful illusions!"},{"name":"BLITZEN","text":"..."},{"name":"LAURENSSEN","text":"...C-Come now, Blitzen! Is this not the Starlight Celebration? And is that not a child, wide-eyed and innocent!?"},{"name":"BLITZEN","text":"..."},{"name":"CHILDD04658","text":"Bah, that's just a normal reindeer! The baby yeti from last year was much better. Oh well!"},{"name":"LAURENSSEN","text":"W-Wait! Don't leave, I beseech you! There are crucial discoveries to be made in the name of folklore, for which your assistance is paramount!"},{"name":"LAURENSSEN","text":"That...did not go as I hoped. &lt;sigh&gt; What am I to do now?"},{"name":"LAURENSSEN","text":"Forgive me, but I need a moment to collect myself. Amidst the calm of the Greatloam Growery, perhaps... I shall return once my thoughts are clear."},{"name":"AMHGARANJY","text":"So it didn't go as planned... That is unfortunate, but it's too soon to be giving up. Please bear with the professor a while longer."},{"name":"SYSTEM","text":"You wait patiently, but Laurenssen does not return. Perhaps you should search for him."},{"name":"LAURENSSEN","text":"Oh, it's you... It seems I've been here rather longer than I thought. My apologies."},{"name":"LAURENSSEN","text":"I have been pondering my dilemma, but I believe I have identified the root of the problem─the children of Gridania are insufficient for my purposes."},{"name":"LAURENSSEN","text":"The original testimony was <span class=\"emphasis\">Ishgardian</span>, after all, meaning that it is Ishgardian children I require. I was a fool to consider proving my theory anywhere else."},{"name":"LAURENSSEN","text":"You are familiar with Ishgard, are you not? Would you be willing to continue assisting me there?"},{"name":"LAURENSSEN","text":"There is just one problem─Ishgard is closed to outsiders. As an adventurer, however, perhaps you know a way for us to enter the city?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"How does Blitzen feel about all this?"},{"name":"A2","text":"You seem to be one reindeer short of a sleigh."},{"name":"A2","text":"I don't think the children are what's insufficient."},{"name":"LAURENSSEN","text":"Blitzen? Why, he would agree with me, of course. Isn't that so, Blit─ ...Oh?"},{"name":"LAURENSSEN","text":"Whatever do you mean? I don't have a─ ...Oh?"},{"name":"LAURENSSEN","text":"What do you mean? Apart from the testing site, what could possibly─ ...Oh?"},{"name":"LAURENSSEN","text":"B-Blitzen! Where did you go!? Blitzen! <span class=\"emphasis\">Blitzen</span>!"},{"name":"LAURENSSEN","text":"I can't find Blitzen anywhere... Where could he have gone?"},{"name":"LAURENSSEN","text":"Gah, so absorbed was I in my thoughts, I must have left him somewhere!"},{"name":"LAURENSSEN","text":"The gods know he can't bear being alone! Oh, he must be so frightened right now!"},{"name":"LAURENSSEN","text":"I-I must find him! M-Must find my dear boy!"}],"reward":{"gil":305},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[70195]},"partials":[{"type":"npc","id":"1043982","obj":{"i":1043982,"n":"Amh Garanjy","l":53,"q":1}},{"type":"npc","id":"1044007","obj":{"i":1044007,"n":"Laurenssen","l":53,"q":2}},{"type":"quest","id":"70195","obj":{"i":70195,"n":"The Ghost of Starlight Present","g":204,"l":"Gridania","s":224}}]}