{"quest":{"name":"The Ghost of Starlight Present","location":"Gridania","id":70195,"patch":6.2,"sort":224,"icon":101201,"eventIcon":71221,"issuer":1044007,"target":1043981,"genre":204,"journal":["Associate Professor Laurenssen is experiencing some panic.<br>※This quest is available for a limited time only.","In light of his reindeer's disappearance, Laurenssen's calm is disintegrating faster than a snowman in midsummer. Being the kind-hearted soul you are, you prepare to /soothe him like none but a somewhat exasperated adventurer can.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Thanks to your diligent patting, Laurenssen regains his composure and is ready to find Blitzen. He sends you off towards Mih Khetto's Amphitheatre to gather witness testimonies, while he retraces his steps back to Apkallu Falls.","Witness testimony has informed you of Blitzen's likely whereabouts. You jingle merrily as you run for some reason, but such things are hardly unusual during the Starlight season. Pay it no mind and head for New Gridania.","You and Laurenssen successfully find Blitzen and, rather unexpectedly, the Saint of Nymeia, who has one of those faces you swear you've seen somewhere before. With a little hinting, Laurenssen realizes the error of his ways. He resolves to think less selfishly and more of the children, and as though fate intends to hold him to it, a despondent and childlike wail breaks out from the other side of the aetheryte plaza.","Upon investigating the source of the noise, Laurenssen is faced with a weepy child in search of her mother. After a crucial assist from Blitzen, who effortlessly quells the child's hysterics with a spectacular illusion, Laurenssen uses his own special powers of shouting very loudly to summon the missing mother without incident. Family reunited and balance restored, the three of you tromp back to Amh Garanjy.","Amh Garanjy thanks you for your help, Laurenssen thanks you for your patience, and Blitzen honks loudly. It is clear now that the mystical illusions of reindeer are only triggered by genuine feelings of fondness and concern for children, and cannot be recreated under contrived pretenses. Embracing this reality with goodness in his heart, Laurenssen asks you to accompany him on a turn of Gridania to deliver cheer and spectacle to as many children as you can find."],"objectives":["/soothe Laurenssen.","Gather information on Blitzen.","Search for Blitzen in New Gridania.","Speak with the tearful tot.","Speak with Amh Garanjy."],"dialogue":[{"name":"AMHGARANJY","text":"Blitzen is missing? Oh no, that's terrible... I hope you find him soon!"},{"name":"LAURENSSEN","text":"Oh, B-Blitzen! Wh-Where could he have gone!?"},{"name":"SYSTEM","text":"Laurenssen is in a state of distress. Try to <span class=\"highlight\">soothe</span> his nerves."},{"name":"LAURENSSEN","text":"M-My poor boy, he must be inconsolable for the loneliness! I-I must find him...but where do I even begin!?"},{"name":"SYSTEM","text":"Laurenssen is in a state of distress. Try to <span class=\"highlight\">soothe</span> his nerves."},{"name":"LAURENSSEN","text":"&lt;gasp&gt; What am I doing? Blitzen needs me, and yet here I am, a blubbering mess..."},{"name":"LAURENSSEN","text":"My apologies for subjecting you to such undignified behavior. Unforeseen circumstances have a tendency of rattling my nerves, but I am well now thanks to you."},{"name":"LAURENSSEN","text":"I shall go and search for Blitzen at once. May I count on your cooperation once more?"},{"name":"LAURENSSEN","text":"My heartfelt thanks. For now, let us focus our search within the city."},{"name":"LAURENSSEN","text":"If you could make inquiries in the direction of Mih Khetto's Amphitheatre, I shall retrace our steps back to Apkallu Falls. Quickly, now!"},{"name":"CITIZENA04659","text":"A reindeer? Why, yes, I saw it go dashing through the snow towards Mih Khetto's Amphitheatre."},{"name":"CITIZENB04659","text":"A reindeer, you say? As a matter of fact, one went trotting by the amphitheatre and down the lane not long ago."},{"name":"CITIZENC04659","text":"Mmm, perfection! Absolute perfection! The very incarnation of crystalline beauty! ...Oh, were you speaking to me?"},{"name":"CITIZENC04659","text":"Reindeer? I can't say that I did, transfixed to this frozen masterpiece as I was."},{"name":"CITIZENC04659","text":"I vaguely recall having heard some clopping noises passing behind me, though... Must have been something of the sort."},{"name":"CITIZENA04659","text":"The reindeer was headed towards the amphitheatre. You should take a look there."},{"name":"CITIZENB04659","text":"Seemed to be in a bit of a rush, that reindeer. Make sure it doesn't run anyone over, eh?"},{"name":"CITIZENC04659","text":"I didn't notice what creature it was that went by, I'm afraid. If indeed it was a creature. But more importantly, have you ever beheld such a magnificent snowman!?"},{"name":"LAURENSSEN","text":"Oh, adventurer! Have you had any luck in locating─"},{"name":"LAURENSSEN","text":"Blitzen! Where have you been!? I have been running myself ragged in search of you!"},{"name":"BLITZEN","text":"Gwoooaaahhh!"},{"name":"LAURENSSEN","text":"B-Blitzen? Why do you bray so?"},{"name":"GODBERT","text":"(-???-)Why, to summon me, of course! Ho ho ho!"},{"name":"LAURENSSEN","text":"And you are...?"},{"name":"GODBERT","text":"(-Saint of Nymeia-)I am the Saint of Nymeia, and I have come at our antlered friend's behest to lead your misguided soul unto the soothing bosom of the Starlight Celebration."},{"name":"GODBERT","text":"(-Saint of Nymeia-)I will ask you plainly, young scholar─do you understand why you were unable to coax forth the legendary twinkling of this reindeer's magicks?"},{"name":"LAURENSSEN","text":"I-I... I..."},{"name":"GODBERT","text":"(-Saint of Nymeia-)So you do not know. Fortunately for you, naught escapes the Saint of Nymeia's all-seeing eyes!"},{"name":"GODBERT","text":"(-Saint of Nymeia-)You see it too, do you not? The reason why our scholarly friend failed?"},{"name":"Q1","text":"What will you say to Laurenssen?"},{"name":"A1","text":"You've lost sight of the spirit of the Starlight Celebration."},{"name":"A1","text":"You've forgotten who the celebration is held for."},{"name":"LAURENSSEN","text":"What? Of course I haven't lost sight. All know that the Starlight Celebration is held for the benefit of..."},{"name":"LAURENSSEN","text":"What? Of course I haven't forgotten. All know that the Starlight Celebration is held for the benefit of..."},{"name":"LAURENSSEN","text":"...The children."},{"name":"GODBERT","text":"(-Saint of Nymeia-)So you finally understand. Indeed, the Starlight Celebration exists for the good children of the realm. This, our antlered friend knows well."},{"name":"GODBERT","text":"(-Saint of Nymeia-)But you, my scholarly friend─you were so obsessed with your work that you could only see the children as a means to prove your theory. Is it any wonder, then, that Blitzen was not minded to oblige your demands?"},{"name":"LAURENSSEN","text":"It is as you say, good saint. Respecting the customs one seeks to understand is basic folklorist fieldwork. I shame my profession in forgetting it..."},{"name":"BLITZEN","text":"Gwoooah! Gwoooah!"},{"name":"LAURENSSEN","text":"My thanks for comforting me, my friend. And my apologies for ignoring your feelings."},{"name":"GODBERT","text":"(-Saint of Nymeia-)Ho ho ho! It seems my job here is done."},{"name":"GODBERT","text":"(-Saint of Nymeia-)I leave this man and this reindeer in your capable hands, adventurer. Happy Starlight to all, and to all a good <span class=\"alternative-container\"><span class=\"alternative\">night</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span>!"},{"name":"LAURENSSEN","text":"Right, there isn't a moment to lose. Let us resume our research─erm, forgive me. Force of habit...<br>Ahem! Let us resume our <span class=\"emphasis\">celebration</span> of this wondrous season by bringing joy and happiness to children!"},{"name":"CHILDA04659","text":"(-Tearful Tot-)Waaaaaaaaaaaah! I want my mummyyyyyyyyy!"},{"name":"LAURENSSEN","text":"That cry of distress... It comes from the other side of the aetheryte plaza. Come, my friends!"},{"name":"LAURENSSEN","text":"O-Oh dear, what does one do at a time like this? Er, whimper not, little one! All shall be well!"},{"name":"BLITZEN","text":"Gwoooah..."},{"name":"AMHGARANJY","text":"A crying child, you say? Please give them what comfort you can, and try to work out what the matter is."},{"name":"CHILDA04659","text":"(-Tearful Tot-)Waaaaaaaaaaaah! I want my mummyyyyyyyyy!"},{"name":"LAURENSSEN","text":"Oh dear... Distraught as she is, how are we to learn what ails her?"},{"name":"LAURENSSEN","text":"W-We need to settle her somehow... With sweets, perhaps...or toys?"},{"name":"BLITZEN","text":"Gwoooaaah!"},{"name":"CHILDA04659","text":"(-Tearful Tot-)Ooooooh! How pretty!"},{"name":"LAURENSSEN","text":"Well done, Blitzen! Well done! Now we may ask after the source of her woes!"},{"name":"BLITZEN","text":"Gwoah!"},{"name":"LAURENSSEN","text":"Er, greetings, little one. Tell me─what is it that troubles you?"},{"name":"CHILDA04659","text":"(-Tearful Tot-)Well, me and Mummy were on our way to the markets. B-But suddenly she wasn't there, and I got scared!"},{"name":"LAURENSSEN","text":"I see. I expect that your mother is still nearby. In which case..."},{"name":"LAURENSSEN","text":"IS ANYONE MISSING A CHILD!? WE HAVE A LOST CHILD IN SEARCH OF HER MOTHER!"},{"name":"BLITZEN","text":"GWOOOOOOOOOAAAAAAAAAHHHHHHHHH!"},{"name":"MOTHER04659","text":"Oh, there you are! Thank goodness!"},{"name":"CHILDA04659","text":"(-Tearful Tot-)Mummyyy! You were there...then suddenly you were gone! I was so scared!"},{"name":"MOTHER04659","text":"Oh, I'm so sorry, sweetling. I'm here now."},{"name":"MOTHER04659","text":"Thank you so much for looking after my daughter, sir."},{"name":"CHILDA04659","text":"(-Tearful Tot-)Thank you, sir! And you too, Mister Reindeer! Those shiny presents were really pretty."},{"name":"Q2","text":"What will you say to Laurenssen?"},{"name":"A2","text":"I think congratulations are in order."},{"name":"A2","text":"Your hypothesis was correct, I see."},{"name":"LAURENSSEN","text":"What? ...Oh, right! I suppose Blitzen just proved my theory, didn't he? I was too concerned with helping the little one to notice..."},{"name":"LAURENSSEN","text":"Well, I shan't complain. Seeing as we've fulfilled our objective, shall we report back to Amh Garanjy?"},{"name":"AMHGARANJY","text":"Ah, welcome back, everyone! How did you fare in the end?"},{"name":"LAURENSSEN","text":"Very well, I'm pleased to say. We managed to reunite a lost child with her mother...and for a happy side benefit, succeeded in proving my theory."},{"name":"AMHGARANJY","text":"...My, my, the three of you have been busy indeed. Thank you for your help, adventurer."},{"name":"LAURENSSEN","text":"Allow me to offer my gratitude as well. Were it not for you, I would have remained blind to what's truly important."},{"name":"BLITZEN","text":"Gwoah!"},{"name":"AMHGARANJY","text":"Hehe, saying thanks as well, are you?"},{"name":"AMHGARANJY","text":"But it seems to me you played as important a role as any today, Blitzen. You are as dependable a little helper as I have ever known."},{"name":"AMHGARANJY","text":"It's curious, though. At first he seemed wholly unmotivated to act, but then showed the illusion of his own volition. What do you suppose inspired his change of heart?"},{"name":"LAURENSSEN","text":"I believe the answer is “concern.” In the beginning, he could tell that I held none for the children and sought only academic satisfaction. Pure of heart as he is, how could Blitzen be moved to assist me?"},{"name":"LAURENSSEN","text":"However, when he sensed that the concern I held for that crying child was genuine, he no longer felt resistance to using his powers."},{"name":"AMHGARANJY","text":"Blitzen sounds like quite the intuitive fellow!"},{"name":"LAURENSSEN","text":"Reindeer generally are. As herd animals, they are accustomed to sensing even the slightest shift in feeling or intent."},{"name":"LAURENSSEN","text":"And this is but another theory, but I suspect that Blitzen's ancestors conjured their illusions in response to the feelings of love and kindness they sensed in the people around them."},{"name":"LAURENSSEN","text":"Such reindeer were far more plentiful back then─some were even domesticated to pull sleighs. No doubt younglings had ample opportunity to witness the same spectacular illusions we now find so precious..."},{"name":"AMHGARANJY","text":"It is truly unfortunate that Blitzen's kin have so declined in number..."},{"name":"AMHGARANJY","text":"But I will cherish their invaluable contribution to the Starlight Celebration. Thank you for sharing this fascinating history with us."},{"name":"LAURENSSEN","text":"If I was able to impart even a modicum of the passion I feel towards my subject, I will count myself very blessed indeed. Ah, but that reminds me."},{"name":"LAURENSSEN","text":"There is one last task for which I would appreciate your assistance. To wit, sharing Blitzen's miraculous illusions─and the joy they inspire─with as many children as we can find."},{"name":"AMHGARANJY","text":"Speaking in the true spirit of Starlight, Laurenssen! I daresay you'll be a little helper yet."},{"name":"BLITZEN","text":"Gwooooooaaaaaahhhhhhhhh!"},{"name":"SYSTEM","text":"Speak with Laurenssen to accompany him on a special Starlight Celebration mission."},{"name":"SYSTEM","text":"Who knows what familiar faces you might encounter...?"}],"reward":{"items":[{"id":38460}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[70194]}},"partials":[{"type":"npc","id":"1044007","obj":{"i":1044007,"n":"Laurenssen","l":53,"q":2}},{"type":"npc","id":"1043981","obj":{"i":1043981,"n":"Amh Garanjy","l":53,"q":1}},{"type":"item","id":"38460","obj":{"i":38460,"n":"Starlight Steed Horn","l":1,"c":26038,"t":63}},{"type":"quest","id":"70194","obj":{"i":70194,"n":"Reindeer Fame","g":204,"l":"Gridania","s":223}}]}