{"quest":{"name":"An Auspicious Opportunity","location":"Old Sharlayan","id":70198,"patch":6.3,"sort":30,"icon":101216,"eventIcon":71221,"issuer":1042599,"target":1042599,"genre":80,"journal":["Mehdjina has an urgent request to make of you.","Hancock, the industrious overseer of the East Aldenard Trading Company's Far Eastern operations, has proposed a partnership with Tataru Taru's Boutique. As a condition, however, he has requested that you attend the negotiations in Kugane. Though his motivations are unclear─and probably suspect─you can only hope that this impromptu journey affords you the opportunity to procure another suitable treasure for the restoration of Tataru's necklace.","In Kugane, Hancock reveals to you and Tataru his struggles with a recent business endeavor: a draper shop selling imported Ul'dahn finery, which has failed to appeal to the local populace. In a bid to salvage the operation, he seeks to feature the Far Eastern-styled wares of Tataru's boutique. A reasonable strategy, but one that did not require your involvement─which Hancock readily admits. Indeed, it seems he only invited you at the behest of another party, who has requested that you meet with them at Sakazuki in the Ruby Sea.","Soroban and the Four Lords are waiting to receive you in Sakazuki, having sought your aid regarding a disturbing discovery. A merchant in Kugane is calling himself the descendant of Tenzen, and the auspices suspect he is using the name of their former companion to swindle unsuspecting folk. Though Suzaku and Seiryu would like nothing more than to slaughter the pretender for his misdeeds, Genbu believes you should first take his measure for yourselves, and to that end proposes that you all travel to Kugane. The auspices assure you that they can keep their identities hidden, but precisely how remains to be seen...","It transpires that the auspices' foolproof disguises were somewhat conspicuous costumes they acquired in their travels. For the time being, they appear to prove sufficient, allowing you to search for Tenzen's “descendant” on Kogane Dori. It is there you find your quarry, wearing armor identical to that of Tenzen's, declaring his storied lineage to a crowd of onlookers. He proceeds to summon the “Four Lords” to further bolster his claims─three mummers and a cat─as the auspices look on with a mixture of disbelief and disgust. As he uses Tenzen's name to sell fake charms to the gathered people, it becomes plain that his scheme is to profit off Tenzen's good name, and that an intervention is warranted.","To expose the man as a fraud, it is decided that you will present yourself as Tenzen's descendant, and the genuine Four Lords will reveal themselves when the time is right. Soroban and Byakko depart for Reisen Temple to prepare for any contingencies, leaving you with Suzaku and Seiryu to locate the impostor, who is still somewhere in Kugane.","Paying no heed to the bewildered looks of nearby Hingans, you lead the pair of strangely dressed auspices through the streets of the city in search of your quarry.<br><br>※You must be accompanied by Suzaku and Seiryu to complete this task. Speak with them again should you become separated.","You find and question a superstitious woman who purchased one of the impostor's good-luck charms, hoping she may recall which way he went. She indicates he departed in the direction of Tasogare Bridge, and so you and your conspicuous comrades journey there next.<br><br>※You must be accompanied by Suzaku and Seiryu to complete this task. Speak with them again should you become separated.","Seeing no sign of your quarry at Tasogare Bridge, you speak instead with an exasperated man who bore witness to the spectacle. Alas, he has no useful information to share, and so you prepare to search elsewhere─but in that moment of resignation, the incorrigible Gyodo waddles onto the scene. He tells you of the swindler's true identity─a seamster named Isshu─and of his dealings with Kageyama, the notorious soy sauce baron. Though Isshu is clearly guilty of deceiving others, Gyodo was surprised that the seamster embraced a life of crime, given his otherwise upstanding reputation. Nevertheless, the Namazu directs you to the Isle of Bekko, where the conspirators will soon be meeting in secret.","Hiding in the shadows, you and the two auspices eavesdrop on Isshu and Kageyama's conversation, and learn that Isshu, having lost his job, has been masquerading as Tenzen's descendant at the baron's behest. Realizing that the seamster was but a pawn in Kageyama's scheme, you confront the mastermind and demand he cease his villainy. Naturally, he refuses, and so aided by Soroban and Byakko's timely arrival, you and the Four Lords put the fear of the kami into his very soul. As you hold the Phoenix Blade aloft, the auspices reveal their true forms, and a thoroughly cowed Kageyama is convinced that you are Tenzen's rightful heir. He flees in terror, crying out for mercy and vowing never again to use Tenzen's name for ill.","A contrite Isshu intends to make amends by turning himself into the Sekiseigumi in the knowledge that he will surely be imprisoned for his crimes. Hancock, however, has other ideas; upon arriving with Tataru, he explains that he has already convinced the authorities that Isshu was as much a victim as his customers, thus ensuring he will suffer no punishment. Furthermore, he wishes to hire the seamster, as he is still in need of a replacement for the draper shop. With matters resolved, you are free to go your separate ways─but not before Tataru chides the Four Lords for not involving her in your adventure. And so you bid the auspices farewell...though you have no doubt you have not seen the last of them.","At the Ruby Bazaar, Isshu presents you with a parcel containing fine garments as an expression of his gratitude. Hancock coyly mentions a “little something” he included as well─no doubt the treasure you sought to procure for Tataru's necklace. Noting this exchange, Tataru questions the smirking merchant, who effortlessly deflects her suspicions with the truth: it is payment for helping him to forge a relationship with the auspices, to whom he hopes to sell anything and everything he can. Satisfied and annoyed in equal measure, she proceeds to tell you that the East Aldenard Trading Company and Tataru Taru's Boutique have agreed to form a partnership. Eager to get to work immediately, Tataru asks that you return to Old Sharlayan to inform Mehdjina of their joint venture. And indeed you will deliver the news─along with Hancock's token of his appreciation.","Though pleased by the boutique's new partnership, Mehdjina is more delighted to see what sort of item Hancock picked out for Tataru's necklace. While the stylish ensemble Isshu wove is striking, it is no match for the otherworldly beauty of the black pearl, an exceedingly rare gemstone harvested from blacklip oysters in the Ruby Sea. Its darker shade should serve as a contrast to the brilliant sapphire centerpiece, and thereby make it stand out even more. The gift is yet more evidence of Hancock's impressive wealth and resourcefulness, and a reminder that despite any personal misgivings, he is a valuable ally worth retaining. Mehdjina thanks you for your hard work, and bids you rest until your services are needed once more─which may well be sooner than you think."],"objectives":["Wait at the designated location in Kugane.","Wait at the designated location on Sakazuki.","Speak with Soroban in Kugane.","Speak with Soroban.","Speak with Suzaku.","Inquire after the impostor while accompanied by Suzaku and Seiryu.","Speak with Suzaku on the Isle of Bekko.","Speak with Byakko.","Speak with Isshu in Kugane.","Speak with Mehdjina in Old Sharlayan."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the Four Lords quest series."},{"name":"SYSTEM","text":"The starting quest, “An Auspicious Encounter,” may be undertaken by speaking with Soroban in the Ruby Sea."},{"name":"SYSTEM","text":"You may review your progress under “Chronicles of a New Era - The Four Lords” in your journal."},{"name":"MEHDJINA","text":"Ah, <span class=\"highlight\">Forename</span>! You couldn't have come at a better time. Do you have a moment to talk?"},{"name":"MEHDJINA","text":"My thanks. You see, a foreign merchant approached the boutique with a proposal not long ago."},{"name":"MEHDJINA","text":"Hancock, of the East Aldenard Trading Company. Perhaps you've heard of him?"},{"name":"MEHDJINA","text":"Ah, so you have a history! No wonder Mistress Tataru declared him unscrupulous and deserving of infinite caution."},{"name":"MEHDJINA","text":"Though there is risk in dealing with a man of such flexible principles, his knowledge of the Hingan markets would do much to bolster our efforts to make inroads in the Far East."},{"name":"MEHDJINA","text":"That is why, despite her misgivings, Mistress Tataru seeks to negotiate a partnership. But for some reason or another, he has requested you be present at their meeting in Kugane."},{"name":"MEHDJINA","text":"I realize business negotiations are not your forte, but we would be most grateful if you'd indulge his request."},{"name":"MEHDJINA","text":"Of course, there is also the matter of our secret mission..."},{"name":"MEHDJINA","text":"Once it has been fully restored, this gorgeous sapphire will serve as the centerpiece of Mistress Tataru's necklace. I hope that one day she may look upon it as a memento of not only her mother, but of her many dear friends and allies."},{"name":"MEHDJINA","text":"Perhaps during your visit to Kugane, fortune shall favor us with the discovery of an additional treasure to grace her keepsake."},{"name":"MEHDJINA","text":"In any case, I believe that covers everything."},{"name":"MEHDJINA","text":"Mistress Tataru shall meet you at the Ruby Bazaar in Kugane. I wish you a safe journey."},{"name":"MEHDJINA","text":"Do try not to delay your rendezvous with Mistress Tataru. I fear for her spirits should she be forced to keep the company of Master Hancock much longer."},{"name":"TATARU","text":"<span class=\"highlight\">Forename</span>, I'm so glad you could make it!"},{"name":"HANCOCK","text":"I am equally thrilled by your arrival, though I expect I must apologize for the sudden invitation."},{"name":"TATARU","text":"Yes, you should. But more importantly, I'd like to know what the scheme is and how you intend to involve us."},{"name":"HANCOCK","text":"Oh my, so quick to assume the worst!"},{"name":"HANCOCK","text":"While I would love nothing more than lay bare all my dirty little secrets, 'twould be prudent to discuss my proposal first."},{"name":"HANCOCK","text":"Loath though I am to admit it, a draper shop but recently launched by the company has not been well received by the locals."},{"name":"HANCOCK","text":"Our intention was to promote the sale of imported apparel woven by the Ul'dahn Weavers' Guild. Alas, it seems Western fashion holds little appeal for the citizens of Kugane."},{"name":"HANCOCK","text":"So we rethought our strategy─we would produce Hingan couture, but with world-renowned Ul'dahn silks. Kimono, as they are the favored choice of wear in the Far East."},{"name":"HANCOCK","text":"Or rather, that <span class=\"emphasis\">was</span> our plan, until our seamster fell ill."},{"name":"HANCOCK","text":"It was as I faced the unpleasant decision of abandoning this venture entirely that I chanced to hear of Tataru's boutique─and the assorted Far Eastern-styled equipment they had on offer."},{"name":"TATARU","text":"You are referring to our samurai and ninja-inspired sets of armor, yes?"},{"name":"HANCOCK","text":"Indeed. By putting your exemplary goods on display, the East Aldenard Trading Company would demonstrate that we, a Western trader, are capable of making garments suited to the needs of our local patrons."},{"name":"HANCOCK","text":"Correct me if I'm wrong, but I have been informed that you wish to establish a foothold in Hingashi and East Othard."},{"name":"HANCOCK","text":"What better way to make your Kugane debut than to have us showcase your quality wares?"},{"name":"TATARU","text":"...It's not without its appeal, I admit. The perfect venue to gauge interest in our goods."},{"name":"HANCOCK","text":"Isn't it just? If I may take your grudging concession as a sign of interest, perhaps we can discuss the finer points of my proposed partnership."},{"name":"TATARU","text":"Oh, we'll be discussing it at length. But I've yet to see how any of this would require <span class=\"highlight\">Forename</span>'s involvement."},{"name":"HANCOCK","text":"Indeed, I was just about to get to that part..."},{"name":"HANCOCK","text":"Not long ago, I crossed paths with a group of certain someones who were eager to call on <span class=\"highlight\">Forename</span> again."},{"name":"HANCOCK","text":"I found myself quite taken with them, charming as they were, that I felt compelled to facilitate this reunion. And of course, one can never collect too many favors."},{"name":"HANCOCK","text":"Alas, I know that you are predisposed to question the motives behind any invitation from the East Aldenard Trading Company─and with good cause, I concede. So I instead invited you here under the guise of assisting Tataru with a boutique-related affair."},{"name":"HANCOCK","text":"I hope you will forgive the deception. Rest assured that you shall be rewarded for your aid in this matter with your choice of recompense."},{"name":"HANCOCK","text":"Just before your arrival, I took the liberty of informing my new acquaintances that you would soon be making landfall on these shores. They ask that you meet them at Sakazuki in the Ruby Sea, as soon as you are able."},{"name":"HANCOCK","text":"I believe it is a matter of some urgency, so if you could travel there forthwith..."},{"name":"HANCOCK","text":"Excellent. I leave them in your capable hands."},{"name":"TATARU","text":"Don't worry─I'm no stranger to Hancock's tricks. I'll make sure not to agree to anything until we've settled every last detail. Just do what you need to do, and return when you can."},{"name":"HANCOCK","text":"If you are looking for Tataru, she stepped away but moments ago. Fret not─I'm sure she will have returned by the time you've attended to the matter we discussed."},{"name":"SOROBAN","text":"Apologies, <span class=\"highlight\">Forename</span>. I pray you have not been waiting long."},{"name":"SOROBAN","text":"You look surprised. Did Hancock not tell you who requested your aid? Ah, but never mind that. I am simply glad that you are here."},{"name":"SOROBAN","text":"How have I been? Well, my training as the next Genbu continues apace. I must tell you, my friend, each day has been more trying than the last..."},{"name":"SOROBAN","text":"Why, just the other day, the auspices placed ninety-nine wasabi–filled tako–yaki on a platter before me, and instructed me to divine which single ball out of the entire batch was not filled with that dreadful spice!"},{"name":"SOROBAN","text":"\"Training to sharpen my foresight,“ they claimed, but it felt more akin to torture. By the end I was reduced to a dithering sea turtle, swimming in a puddle of my own tears."},{"name":"SOROBAN","text":"That is all to say, I am only marginally closer to assuming my place as one of the Four Lords."},{"name":"SOROBAN","text":"(-Genbu-)Bah, get to the point already, Soroban!"},{"name":"SOROBAN","text":"Gah! I was just about to arrive at it!"},{"name":"SOROBAN","text":"Ahem. Come, my friends! Show yourselves!"},{"name":"BYAKKO","text":"It has been some time, <span class=\"highlight\">Forename</span>."},{"name":"SUZAKU","text":"I am relieved to see you in good health. I understand you have been through a great deal."},{"name":"SEIRYU","text":"Your concern is unwarranted. This is the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who quelled our aramitama and inherited Tenzen's legacy. There is no trial <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> cannot overcome."},{"name":"SUZAKU","text":"You misunderstand me, my brother. That, or you deliberately insinuate that I lack faith in <span class=\"highlight\">Forename</span>'s capabilities."},{"name":"BYAKKO","text":"Enough. We indebted ourselves to the merchant to obtain this meeting. Let us not distract ourselves with this nonsense and get to the heart of the matter."},{"name":"SEIRYU","text":"...Very well. You may not know this, but Senri's craving for dango often brings her to Kugane. It was during such a visit that she spied a suspicious individual on Kogane Dori."},{"name":"SEIRYU","text":"A man who not only wore raiments identical to Tenzen's, but who also claimed to be his long-lost descendant."},{"name":"BYAKKO","text":"This “descendant” was selling good-luck charms utterly devoid of benediction. His ploy is plain: he uses Tenzen's name to trick fools into buying his rubbish."},{"name":"SUZAKU","text":"Any who would dare sully Tenzen's name shall face my wrath. My flames will cleanse him of his sin and burn his soul to ash!"},{"name":"SEIRYU","text":"Too merciful a punishment, I say. I shall personally render unto him every pain imaginable!"},{"name":"SOROBAN","text":"By the kami, is it possible they have both succumbed to the aramitama once more...?"},{"name":"SOROBAN","text":"(-Genbu-)Ahem. The charlatan boasts of more than an esteemed heritage. He also claims to have the Four Lords at his beck and call."},{"name":"SOROBAN","text":"(-Genbu-)Insulting, yes, but I would still rather resolve this without flames and torture. But having lived apart from men for so long, I fear we may be ill-equipped to do so on our own. Hence why we have turned to you for assistance."},{"name":"SOROBAN","text":"(-Genbu-)You needn't agree to anything just yet, but why don't we all at least seek out this descendant and take his measure ourselves?"},{"name":"SOROBAN","text":"I beg your pardon? Putting myself aside, the three of you approaching any settlement─let alone one as large as Kugane─would surely cause an uproar."},{"name":"BYAKKO","text":"Calm yourself, Soroban. You forget we are the Four Lords. 'Tis a trifling matter to assume a less conspicuous guise."},{"name":"SEIRYU","text":"Let us reconvene in Kugane. Soroban is to go first, while we three shall make our own approach separately to avoid attracting undue attention─just in case."},{"name":"SUZAKU","text":"Long has it been since I walked the streets of a city of this size. I did so once to visit a teahouse with Tenzen."},{"name":"SUZAKU","text":"I accompanied him in disguise. How my heart raced at the thrill and joy of it...until a priest saw through my glamour. Oh, the commotion that followed..."},{"name":"SEIRYU","text":"We met Hancock by pure chance. Recognizing us as the auspices of legend, he said he wished to help us out of the kindness of his heart. I almost believed him."},{"name":"BYAKKO","text":"Do not think I haven't noticed you eyeing my costume. If you must know, I acquired it during my travels in the West. I am rather fond of its soft and fluffy texture. "},{"name":"SOROBAN","text":"It would seem we have managed to arrive with little fuss."},{"name":"SOROBAN","text":"...But only the kami know how long our presence will remain secret."},{"name":"SEIRYU","text":"Again with the needless worrying. Our disguises are perfect."},{"name":"SOROBAN","text":"None may suspect you are the Four Lords at first glance, but you are suspicious in the extreme."},{"name":"BYAKKO","text":"We could have used our power to assume the form of men, but those of keen sight would still be able to discern our true nature. The costumes were an innocuous alternative."},{"name":"SOROBAN","text":"There's nothing innocuous about them!"},{"name":"SUZAKU","text":"Senri said she found the swindler on Kogane Dori, yes? Let us head there at once."},{"name":"ISSHU","text":"(-???-)Gather round, friends, gather round!"},{"name":"ISSHU","text":"(-Tenzen's Descendant?-)As you have no doubt surmised from my crimson armor, I am the proud descendant of Tenzen, the famous hero of eld who once slew an entire host of fearsome oni!"},{"name":"ISSHU","text":"(-Tenzen's Descendant?-)But do not take my word for it. Behold!"},{"name":"ISSHU","text":"(-Tenzen's Descendant?-)In this hand I hold Tenzen's beloved katana, the Phoenix Blade!"},{"name":"SILLYBIGMAN04662","text":"I don't know what it looks like, but if he's got the Phoenix Blade, then he <span class=\"emphasis\">must</span> be who he claims!"},{"name":"SEIRYU","text":"Idiots. The true blade has remained in our care since Tenzen's passing."},{"name":"SKEPTICALWOMAN04662","text":"Something seems off..."},{"name":"ISSHU","text":"(-Tenzen's Descendant?-)I see there are some who remain unconvinced. Very well, you leave me no choice. Allow me to introduce you to my sworn allies...the Four Lords!"},{"name":"SOROBAN","text":"(-Genbu-)Oh dear... I'm almost afraid to look."},{"name":"ISSHU","text":"(-Tenzen's Descendant?-)(That's your signal. I expect my money's worth.)"},{"name":"ISSHU","text":"(-Tenzen's Descendant?-)Introducing Genbu, the turtle auspice and foreseer of calamity!"},{"name":"ISSHU","text":"(-Tenzen's Descendant?-)Suzaku, the avian auspice and master of the flames of resurrection!"},{"name":"ISSHU","text":"(-Tenzen's Descendant?-)Seiryu, the dragon auspice and devourer of young maidens!"},{"name":"ISSHU","text":"(-Tenzen's Descendant?-)Last but not least adorable, we have Byakko, the small and fluffy feline auspice! "},{"name":"BYAKKO","text":"Why am I alone a cuddly creature!? Surely he could have hired a Hrothgar or Miqo'te to portray me!"},{"name":"SEIRYU","text":"At least he did not slander your character. “Devourer of young maidens.” Pah!"},{"name":"STUNNEDMAN04662","text":"What is this rabble? All who've heard the Tale of Tenzen know that the Four Lords are <span class=\"emphasis\">beasts</span>, not three mummers and a cat!"},{"name":"ISSHU","text":"(-Tenzen's Descendant?-)These are the glamoured forms they assume so they may roam the realms of men undiscovered. Surely you can imagine the chaos that would ensue if they went about undisguised."},{"name":"STUNNEDMAN04662","text":"Even so, there's no way they'd wear such ridiculous outfits!"},{"name":"SOROBAN","text":"And yet here they are, dressed in far worse."},{"name":"SUZAKU","text":"This farce is infuriating. I will not abide him making mock of the bonds we shared with Tenzen."},{"name":"SEIRYU","text":"We are of one mind, my sister. He must be silenced."},{"name":"STUNNEDMAN04662","text":"Does Tenzen even have a descendant!? There was nothing in the legends about him fathering any children!"},{"name":"ISSHU","text":"(-Tenzen's Descendant?-)But there <span class=\"emphasis\">was</span> mention of one who loved him more dearly than life itself! Aye, the woman to whom I owe my storied lineage is none other than the sublime, crimson beauty standing before you─Suzaku!"},{"name":"SUZAKU","text":"...Let him speak. Perhaps he is not wholly deserving of immolation."},{"name":"SEIRYU","text":"Bah, how easily your rage is quelled!"},{"name":"ISSHU","text":"(-Tenzen's Descendant?-)Having proven my ancestry to your satisfaction, my lords and ladies, I bid you partake of my good fortune, for I have <span class=\"emphasis\">auspicious</span> wares to share with you today!"},{"name":"ISSHU","text":"(-Tenzen's Descendant?-)Tenzen put countless oni to the sword long ago, 'tis true, but <span class=\"emphasis\">only</span> by the grace of these miraculous good-luck charms!"},{"name":"ISSHU","text":"(-Tenzen's Descendant?-)Just one will confer unto you all manner of fortune. Good health, a happy family, scholarly achievement, financial success, romantic fulfillment and much, much more!"},{"name":"ISSHU","text":"(-Tenzen's Descendant?-)But that's not all! Purchase a charm now, and I'll even throw in a stylish strap featuring a Four Lords' design of your choosing! My stock is limited, so be sure to buy while supplies last!"},{"name":"SILLYBIGMAN04662","text":"I'll take two─no, <span class=\"emphasis\">ten</span>!"},{"name":"BYAKKO","text":"My blood boils to see Tenzen's good name used in this manner."},{"name":"SEIRYU","text":"As does mine. We cannot sit idly by and allow this to continue."},{"name":"SOROBAN","text":"(-Genbu-)I think our purveyor of good fortune is in need of a proper scare. Are you convinced as well, <span class=\"highlight\">Forename</span>?"},{"name":"SUZAKU","text":"He is a most persuasive and cunning adversary. I was very nearly convinced I had given birth to Tenzen's child."},{"name":"SEIRYU","text":"That so many would fall for such an obvious deception... No matter the age, mortals see only that which they wish to."},{"name":"BYAKKO","text":"Lest you worry, despite his preposterous depiction of me, I have no intention of harming the swindler."},{"name":"SOROBAN","text":"He seemed quite pleased with himself as he packed up his stall. Business was good, no doubt. How shall we proceed?"},{"name":"SOROBAN","text":"(-Genbu-)With care and preparation. We all saw how deftly he countered accusations of fraud. A more clever approach is needed."},{"name":"SOROBAN","text":"(-Genbu-)We must limit his ability to spin more lies. Have you any ideas, <span class=\"highlight\">Forename</span>?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"I could present myself as Tenzen's true descendant."},{"name":"A4","text":"The presence of the Four Lords should be more than enough to convince him."},{"name":"SOROBAN","text":"(-Genbu-)...And thereby beat him at his own game. A sound suggestion."},{"name":"SOROBAN","text":"(-Genbu-)Ohoho, indeed! Our very existence alone is enough to prove his claims false."},{"name":"SOROBAN","text":"(-Genbu-)Then it is settled. You shall play the role of Tenzen's true descendant, and we shall accompany you. With us at your side, the impostor will have no choice but to confess his crimes."},{"name":"BYAKKO","text":"Still, we would be wise to prepare for contingencies."},{"name":"BYAKKO","text":"With me, Soroban. We make for Reisen Temple."},{"name":"SEIRYU","text":"Then it is up to us to find and confront the swindler. As you are familiar with this city, I bid you lead the way. Speak with Suzaku when you are ready."},{"name":"SEIRYU","text":"We must track him down before he dishonors us further with his insipid trinkets."},{"name":"SUZAKU","text":"His customers may have seen where he went, so let us begin by questioning them."},{"name":"SEIRYU","text":"I would also know more of his true identity. Of all the heroes of legend, why claim Tenzen's name? The answer may help us to stop him without resorting to violence─since some of you apparently lack the stomach for it."},{"name":"SYSTEM","text":"Suzaku and Seiryu are now accompanying you. Keep them at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave your quest companions behind by entering a different area, or by speaking with them and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have your companions join you again, return and speak with them at the original location."},{"name":"Q5","text":"What will you do?"},{"name":"A5","text":"Talk."},{"name":"A5","text":"Part ways."},{"name":"A5","text":"Nothing."},{"name":"SUZAKU","text":"Senri made mention of a wonderful teahouse she frequents to feed her dango addiction. She is kind enough to bring back a portion to us at the temple after every visit."},{"name":"SUZAKU","text":"I know, I know. Rice dumplings have naught to do with our purpose. But should we find a spare moment, know that I am particularly fond of mitarashi dango."},{"name":"SEIRYU","text":"This experience brings to mind the days when we traveled with Tenzen."},{"name":"SEIRYU","text":"Never one to sit still, he would pursue every opportunity for adventure, heedless of the trouble that would invariably follow for us all. I gather you are cut from the same cloth."},{"name":"SYSTEM","text":"Are you sure you wish to part ways with your companions?"},{"name":"SUZAKU","text":"You are needed elsewhere? Very well. We will wait for you on Kogane Dori, but do try to return quickly. Brilliant though our disguises may be, we risk discovery by remaining here too long."},{"name":"SEIRYU","text":"Duty calls? Far be it from me to stop you, but remember that every moment we allow this pretender to roam free is another opportunity for him to deceive others."},{"name":"SUZAKU","text":"Ah, you are returned! I was beginning to worry..."},{"name":"SEIRYU","text":"Took you long enough. Come, let's have done with the villain."},{"name":"CONTENTEDWOMAN4662","text":"Yes? Did you need something?"},{"name":"SYSTEM","text":"You must be accompanied by Suzaku and Seiryu, and have them at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"Your companions have yet to arrive. Be sure they are at your side before attempting to continue."},{"name":"CONTENTEDWOMAN4662","text":"Kami be praised! To have met Tenzen's descendant─and get this good-luck charm besides!"},{"name":"CONTENTEDWOMAN4662","text":"What a fool I was to doubt him, he who commands the Four Lords of legend!"},{"name":"CONTENTEDWOMAN4662","text":"As long as I have this, fortune shall surely shine upon me..."},{"name":"CONTENTEDWOMAN4662","text":"Oh, has my good-luck charm caught your eye? If you wanted one for yourself, you are sadly out of luck. The merchant selling them said that was the last of his stock, and he did not think he would be able to acquire more."},{"name":"CONTENTEDWOMAN4662","text":"But if you wish to hear it from him, he was headed towards Tasogare Bridge. You will know him by his attire─I swear, he was the spitting image of Tenzen from the storybooks!"},{"name":"SUZAKU","text":"She speaks of yonder bridge, does she not? Others may have taken note of our quarry as he passed."},{"name":"CONTENTEDWOMAN4662","text":"With this, perhaps I shall finally meet the one I've been waiting for..."},{"name":"STUNNEDMAN04662","text":"Have I seen a man claiming to be Tenzen's descendant?"},{"name":"STUNNEDMAN04662","text":"The one who was selling good-luck charms by the dozens, you mean? No, he didn't come this way. But kami give me strength, I'll never understand how some can be so gullible..."},{"name":"SEIRYU","text":"Let us continue our search elsewhere."},{"name":"GYODO","text":"Well, well, well, look who it is!"},{"name":"GYODO","text":"It has been quite some time. What brings you to Kugane this <span class=\"alternative-container\"><span class=\"alternative\">eve</span><span class=\"alternative\">day</span></span>?"},{"name":"GYODO","text":"A hawker claiming to be Tenzen's descendant? Probably Isshu. I saw him not long ago, yes, yes."},{"name":"SEIRYU","text":"You know him?"},{"name":"GYODO","text":"My peculiar and suspicious friend, there is no merchant in Kugane who hasn't heard of the entrepreneur. He's made a fortune masquerading as Tenzen's heir."},{"name":"GYODO","text":"It's a brilliant scheme. Very profitable. Tried to get in on it myself, but the baron will suffer no competition."},{"name":"SUZAKU","text":"Who is this baron of whom you speak?"},{"name":"GYODO","text":"The soy sauce one, who else? Kageyama. A dangerous man, yes, yes, with fingers in every pie. I fear him almost as much as I envy him."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Their deception must be exposed."},{"name":"A3","text":"What can you tell us of Isshu?"},{"name":"A3","text":"How many times do I have to teach the “baron” the same lesson..."},{"name":"GYODO","text":"Well, all good schemes must come to an end. I'm surprised Isshu agreed to it in the first place, though. He's a skilled seamster─very passionate about his work."},{"name":"GYODO","text":"He is a skilled seamster, dedicated to his craft. Honestly, I never understood why he partnered with Kageyama. Thought he had a conscience. Just goes to show you never know what anyone is capable of, yes, yes."},{"name":"GYODO","text":"Oh, you have had dealings with him, have you?"},{"name":"GYODO","text":"If you know, then you know. Isshu, on the other hand, is still something of an enigma. A skilled seamster, dedicated to his craft, yet he partnered with Kageyama. I never would've guessed he had it in him."},{"name":"SEIRYU","text":"There is more to this than meets the eye. We must investigate further. Have you any idea where Isshu may have gone?"},{"name":"GYODO","text":"You want information, yes, yes? I want coin. Give me coin, and I'll give you information!"},{"name":"SUZAKU","text":"That can be arranged, if you are willing to journey to Reisen Temple. Our friend Furi can escort you."},{"name":"GYODO","text":"A temple? And one I've never heard of at that. Wait─is it the sort of place where mortals fear to tread and malevolent spirits do dwell?"},{"name":"SEIRYU","text":"Malevolent spirits? No, no. Just a somewhat ominous crystal."},{"name":"GYODO","text":"I'll take your word for it. As for Isshu, he came to me and requested passage to the Isle of Bekko, where he was to rendezvous with Kageyama. I refused─better to not involve myself in the baron's affairs, you understand."},{"name":"SUZAKU","text":"Gyodo, was it? You have our thanks. We shall fulfill our end of the bargain, you need not fear."},{"name":"SUZAKU","text":"There is no time to waste. I shall have a messenger instruct Byakko and Soroban to meet us at the isle."},{"name":"SEIRYU","text":"We are the first to arrive..."},{"name":"SUZAKU","text":"Isshu and Kageyama will want to keep away from prying eyes. Somewhere near these rocks, perhaps. Let us take cover and eavesdrop on their conversation when they join us."},{"name":"KAGEYAMA","text":"Gahahaha! A fine day's work, Isshu. It pays to have fools for customers."},{"name":"ISSHU","text":"Master Kageyama, please, this cannot continue. I shudder to think how the Four Lords would react if they learned of our crimes."},{"name":"KAGEYAMA","text":"&lt;sigh&gt; Remind me. Who was it who delivered you from a life of destitution after you lost your job as a seamster? Pray tell, <span class=\"emphasis\">who</span>?"},{"name":"ISSHU","text":"...You, Master Kageyama. And I am forever grateful for your help, without which my family would be without house and home. But even so, what we are doing...is <span class=\"emphasis\">wrong</span>."},{"name":"KAGEYAMA","text":"Want to wash your hands of this dirty, dirty business and be a seamster again? Is that it? But once the truth comes out─and I would see that it does─who would dare to trust you? No, Isshu, you're going to continue the act. Or you and your kin will starve in the streets."},{"name":"SEIRYU","text":"So that's the way of it. Isshu was coerced by Kageyama into this performance, and for his family's sake could not stop."},{"name":"SUZAKU","text":"Indeed. In light of this, how shall we proceed?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We help Isshu, of course!"},{"name":"A1","text":"We put the fear of the kami into Kageyama."},{"name":"KAGEYAMA","text":"Who are you!? And why are you wearing such ridiculous outfits!?"},{"name":"SUZAKU","text":"Hearken to me, mortal. I will suffer you to sully Tenzen's name no longer. Defy me, and you shall not like the consequences."},{"name":"KAGEYAMA","text":"Hmph! Sully Tenzen's name, you say? His flesh and blood are free to do with it as they please! Unless you can prove that Isshu is not in fact his descendant, I suggest you get out of my sight."},{"name":"SOROBAN","text":"Then prove it we shall!"},{"name":"BYAKKO","text":"<span class=\"highlight\">Forename</span>, here!"},{"name":"SEIRYU","text":"It is time we revealed our true selves to these mortals!"},{"name":"KAGEYAMA","text":"K-Kami forfend...!"},{"name":"ISSHU","text":"It cannot be..."},{"name":"ISSHU","text":"That flame-kissed katana you hold in your hand... Is that the Phoenix Blade!?"},{"name":"GENBU","text":"For the crimes you have wrought in Tenzen's name, your punishment will be severe indeed!"},{"name":"SEIRYU","text":"Beg not for mercy!"},{"name":"SUZAKU","text":"Take heart, my dears. I shall make your deaths painless. Hearken to my melody..."},{"name":"BYAKKO","text":"There is no turning back! Steel yourselves!"},{"name":"KAGEYAMA","text":"Gyaaah! Somebody! Anybody! Help meee!"},{"name":"KAGEYAMA","text":"Wh-What was that...?"},{"name":"KAGEYAMA","text":"Not only do you possess the Phoenix Blade, but the Four Lords themselves stand at your side. Tell me...are <span class=\"emphasis\">you</span> Tenzen's descendant?"},{"name":"KAGEYAMA","text":"P-Please, have mercy, I beg of you! I vow to never again use the name of your ancestor! You have my word!"},{"name":"ISSHU","text":"I do not blame Master Kageyama for fleeing in terror. Yet, as odd as it sounds, I did not feel as though you meant me harm..."},{"name":"SUZAKU","text":"You looked every bit as dignified as Tenzen did in his day. The Phoenix Blade suits you."},{"name":"SEIRYU","text":"A mere illusion and the man loses his head. Some “baron” he is."},{"name":"SOROBAN","text":"It is thanks to Furi that we made it here in time. And now we can rest easy in the knowledge that Kageyama's scheme has been ended."},{"name":"BYAKKO","text":"At Tenzen's behest, I once played the role of a ferocious tiger to frighten the peoples of a village and drive them to flee before they were buried in a landslide."},{"name":"BYAKKO","text":"He took part in the deception as well─but to be honest, your acting put his to shame. Have you considered auditioning at the Mujikoza theater?"},{"name":"ISSHU","text":"H-Honored lords and lady, and descendant of Tenzen, I...I know not how to make amends for my sins. Though actions speak louder than words, I wish to say that I am truly sorry."},{"name":"BYAKKO","text":"Man or beast, we all make mistakes."},{"name":"SOROBAN","text":"I am told you are a master seamster."},{"name":"ISSHU","text":"I might not go so far as to say “master,” but with my skill I managed to put food on the table."},{"name":"SOROBAN","text":"Then perhaps I shall have a word with an old friend..."},{"name":"BYAKKO","text":"That can wait, Soroban. We must escort this young man to a safer location."},{"name":"BYAKKO","text":"This is far enough. It is past time we returned home."},{"name":"SEIRYU","text":"We are once more in your debt."},{"name":"SUZAKU","text":"It is because of you that this affair could be concluded before Tenzen's reputation suffered irreparable harm. Thank you, <span class=\"highlight\">Forename</span>."},{"name":"BYAKKO","text":"Now that you are no longer bound to Kageyama, what will you do?"},{"name":"ISSHU","text":"Well... I know I must take responsibility for my actions. I will confess my crimes to the Sekiseigumi."},{"name":"ISSHU","text":"After I am released from my imprisonment...I shall take up an honest trade once more, and not rest until I have repaid each and every victim of my deception."},{"name":"SOROBAN","text":"Ah yes, I had been meaning to tell you... But I will let Hancock explain when he arrives shortly."},{"name":"HANCOCK","text":"Dreadfully sorry to have kept you all waiting."},{"name":"SOROBAN","text":"Ah, speak of the devil!"},{"name":"SOROBAN","text":"(-Genbu-)And the urchin girl came as well. It has been far too long."},{"name":"TATARU","text":"You're looking green as ever, Soroban of the Blue! And once again, Genbu, that's Tataru! Ta-ta-ru! Though I'm sure I'll have to remind you next time, too."},{"name":"HANCOCK","text":"You are Isshu, the seamster Soroban spoke of, yes?"},{"name":"HANCOCK","text":"If it is gainful employment you seek, the East Aldenard Trading Company would be thrilled to hire one of your expertise to work at our draper shop."},{"name":"HANCOCK","text":"The seamster in our service fell ill, and we've been looking for a replacement."},{"name":"ISSHU","text":"I-I have no words! I am grateful, truly... But I cannot accept, for once I confess my crimes to the Sekiseigumi, they will surely imprison me for a time."},{"name":"HANCOCK","text":"Ah, yes, the Sekiseigumi. I had a chat with them not long ago. They are aware that the scheme was contrived by Kageyama, and that you too are one of his victims. You will be required to assist them in their investigation, of course, but you needn't steel yourself for even a brief incarceration."},{"name":"SEIRYU","text":"Hancock. You have our thanks for calling <span class=\"highlight\">Forename</span> to our aid."},{"name":"HANCOCK","text":"Oh no, not at all. I am pleased to have been of service."},{"name":"HANCOCK","text":"I have not forgotten our arrangement, <span class=\"highlight\">Forename</span>. Have you decided upon a reward?"},{"name":"HANCOCK","text":"Oh, how that warms the heart! A material to help restore the keepsake of a dear friend..."},{"name":"HANCOCK","text":"I have just the thing. I won't spoil the surprise now, but do look forward to it."},{"name":"TATARU","text":"I suppose we had better return to the city. But before that..."},{"name":"TATARU","text":"You could've called upon me too, you know! It's not like I wasn't part of the whole “saving the Ruby Sea from becoming consumed by roaring flames” endeavor or anything!"},{"name":"SOROBAN","text":"(-Genbu-)Ohohoho, forgive us, urchin gir─ahem. Tataru. We assumed you were busy. That, and you did struggle mightily to help <span class=\"highlight\">Forename</span> restrain Soroban that one time, so there was some concern that you might prove a liability should it come to blows. Nevertheless, we will take your words to heart."},{"name":"BYAKKO","text":"Perhaps we should assume our guises and walk among men more often. It was a refreshing change of pace, on the whole."},{"name":"SEIRYU","text":"I would not be against it. We were in a bit of a rush on this occasion, but with a longer visit, we might better appreciate men's curious ways."},{"name":"SUZAKU","text":"I have no doubt we shall meet again. I but pray that the time comes sooner than later."},{"name":"TATARU","text":"You and me both!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Until that day."},{"name":"A2","text":"I'll be sure to stop by the temple later. "},{"name":"SEIRYU","text":"I will consider that a promise."},{"name":"SUZAKU","text":"You know you are always welcome. The others would be thrilled to see you and Tataru both."},{"name":"SEIRYU","text":"Now then, I say we resume Soroban's training upon our return to the temple."},{"name":"SOROBAN","text":"Erm, must we so soon?"},{"name":"SOROBAN","text":"(-Genbu-)You did well to apprise Hancock of Isshu's predicament. He may now make amends by putting his talents to good use, and continue to provide for his family."},{"name":"SUZAKU","text":"Indeed. 'Twas behavior befitting one destined to become the next Genbu."},{"name":"BYAKKO","text":"The road ahead is long, but we doubt not that you are worthy. And so we want only to encourage you to reach your full potential."},{"name":"SOROBAN","text":"If that is how you all feel, then I have little choice but to do my best."},{"name":"ISSHU","text":"I can still hardly believe the Sekiseigumi only wished to question me... Master Hancock must have a way with words. Speaking of which, I believe he and Mistress Tataru will be joining us shortly."},{"name":"HANCOCK","text":"Isshu, you will be pleased to know that I've just finished making arrangements for your immediate employment. May our profits soar that you may give your family the life they deserve!"},{"name":"ISSHU","text":"M-Master Hancock...I do not deserve such kindness. I will do my best to earn my keep."},{"name":"ISSHU","text":"I want you to know that I intend to work hard to make up for the many mistakes that I've made."},{"name":"ISSHU","text":"It is not much, but I have prepared a gift for you as an expression of my gratitude. A set of garments that I made before I was embroiled in Master Kageyama's schemes. The lords and ladies of Kugane once held my work in high regard, and I hope you will as well."},{"name":"HANCOCK","text":"You will also find a little something from me included within. A well-deserved reward."},{"name":"TATARU","text":"Wait, what exactly did you give <span class=\"highlight\">Forename</span>?"},{"name":"HANCOCK","text":"Payment for introducing the East Aldenard Trading Company to prospective new clients, what else?"},{"name":"TATARU","text":"I can't say I'm surprised you would try to peddle goods to the Four Lords themselves, but still─have you no shame?"},{"name":"TATARU","text":"Regardless, now's as good a time as any to inform <span class=\"highlight\">Forename</span> of the result of our deliberations."},{"name":"TATARU","text":"Said result being, we have agreed to an official partnership with the East Aldenard Trading Company. One which I will exploit for all it's worth to make Tataru Taru's Boutique a household name in Kugane!"},{"name":"HANCOCK","text":"Ahaha! For my part, I pray this is the start of a <span class=\"emphasis\">mutually</span> beneficial partnership."},{"name":"TATARU","text":"To business. I would have a tour of this draper shop of yours immediately, if you don't mind."},{"name":"TATARU","text":"Sorry to cut things short, <span class=\"highlight\">Forename</span>, but time is money, and I have precious little to spare. Once you've seen to any other unresolved matters you have here, I'd be grateful if you'd return to Old Sharlayan and inform Mehdjina of our new arrangement."},{"name":"MEHDJINA","text":"Welcome back! Negotiations with Master Hancock were fruitful, I hope?"},{"name":"MEHDJINA","text":"Well! I expected nothing less from you and Mistress Tataru!"},{"name":"MEHDJINA","text":"As for Mistress Tataru's necklace─you say Master Hancock slipped a gift into the parcel you received from Isshu, yes? May I have a look?"},{"name":"MEHDJINA","text":"My goodness, what a stunning set of garments! They certainly offer a taste of the Far East."},{"name":"MEHDJINA","text":"As for the item Master Hancock set aside for Mistress Tataru's necklace..."},{"name":"MEHDJINA","text":"By the Sisters...a black pearl! Do you have any idea how rare these are? They can only be harvested from blacklip oysters in the Ruby Sea!"},{"name":"MEHDJINA","text":"I cannot be certain until it has been incorporated into the necklace, but I believe the darker shade will serve as contrast to the brilliant sapphire centerpiece, and make it stand out even more."},{"name":"MEHDJINA","text":"To part with such a precious treasure─Master Hancock is either very wealthy or very well-connected. Or both. We would do well to maintain a good relationship with the East Aldenard Trading Company."},{"name":"MEHDJINA","text":"But that is the boutique's concern. After all you have done for us, I am sure you want nothing more than a good rest. Thank you again for your continued assistance!"},{"name":"MEHDJINA","text":"When next we discover a client we'd like to add to our ever-growing list, I hope we can count on your assistance once more!"}],"reward":{"items":[{"id":39509},{"id":39510},{"id":39511},{"id":39512},{"id":39513}]},"reqs":{"jobs":[{"lvl":90,"id":1}],"quests":[70119]}},"partials":[{"type":"npc","id":"1042599","obj":{"i":1042599,"n":"Mehdjina","l":3706,"q":3}},{"type":"item","id":"39509","obj":{"i":39509,"n":"Yakaku Kamidome","l":1,"c":56564,"t":34,"p":100}},{"type":"item","id":"39510","obj":{"i":39510,"n":"Yakaku Dogi","l":1,"c":42945,"t":35,"p":100}},{"type":"item","id":"39511","obj":{"i":39511,"n":"Yakaku Koshita","l":1,"c":47974,"t":36,"p":100}},{"type":"item","id":"39512","obj":{"i":39512,"n":"Yakaku Geta","l":1,"c":49568,"t":38,"p":100}},{"type":"item","id":"39513","obj":{"i":39513,"n":"Yakaku Fundoshi","l":1,"c":47977,"t":36,"p":100}},{"type":"quest","id":"70119","obj":{"i":70119,"n":"Small Business, Big Dreams","g":80,"l":"Old Sharlayan","s":10}}]}