{"quest":{"name":"Shadowed Pasts Once More","location":"Radz-at-Han","id":70197,"patch":6.3,"sort":20,"icon":101213,"eventIcon":71221,"issuer":1044133,"target":1044135,"genre":67,"journal":["The Radiant scout is keeping a close eye on the sullen-eyed voidsent.","You are conversing with the sullen-eyed voidsent at the Hall of the Radiant Host when the being suddenly senses the rest of itself in the city. As before, there are four of them all told, and as before, you are tasked with tracking them down and sending them back to rejoin themselves.","You have located all four remaining wayward hecteyes, from whom you learn about the pasts of two mighty voidsent─none other than your erstwhile foes, the archfiends Cagnazzo and Rubicante. With your task thus accomplished, you make your way back to the Hall of the Radiant Host.","Having been reunited with all of its selves, the sullen-eyed voidsent is finally whole again. And thanks to its ability to see its kind from a great distance, it seems likely to find employment with the Radiant Host, thus allowing it to fulfill its dream of abiding in the Source. Voidsent were once people in the past, and they may yet have a future. As the creature sets a hopeful gaze upon the road ahead, you cannot help but wonder what lies in store for it."],"objectives":["Search for the wayward hecteyes.","Speak with the sullen-eyed voidsent."],"dialogue":[{"name":"SCOUT04660","text":"Ah, if it isn't <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. Since last we spoke, I have continued keeping an eye on the voidsent."},{"name":"SCOUT04660","text":"While the creatures have given me no reason to believe that they pose a danger, the rest of them remain at large."},{"name":"SCOUT04660","text":"My fellows and I have yet to come by any eyewitness information, but their forms being what they are, they cannot have gotten far. Of course, it would make our search easier if they were likewise drawn to Radz-at-Han..."},{"name":"HECTEYES","text":"My other selves have been telling me about their adventures. Truly, your world is a fascinating place!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"There's nothing like exploring a new city."},{"name":"A1","text":"Your world is fascinating too."},{"name":"HECTEYES","text":"You've seen a lot of this world, have you not? I wish to do the same, and travel to all sorts of places!"},{"name":"HECTEYES","text":"Once I've found the rest of me, that is... It would be unthinkable to leave even a sliver of myself out of the experience."},{"name":"HECTEYES","text":"So you've enjoyed hearing my tales? I would be glad to share more with you."},{"name":"HECTEYES","text":"Once I've found the rest of me, that is... The others have more knowledge of mighty voidsent, you see."},{"name":"HECTEYES","text":"Hm? This sensation... Could it be...?"},{"name":"HECTEYES","text":"Yes, I feel them! The rest of myself! They're very close now!"},{"name":"HECTEYES","text":"There's four of them, and unless I'm mistaken, they're somewhere in the city. Please find them for me, that I might be whole again!"},{"name":"HECTEYES","text":"As before, by way of payment, they will tell you about powerful voidsent and their pasts."},{"name":"HECTEYES","text":"Now, the nearest appears to be this way. Perhaps that's a good place to start."},{"name":"SCOUT04660","text":"The rest of its fellows have appeared in the city? Then you had best track them down!"},{"name":"SCOUT04660","text":"Judging by the direction, I expect the nearest one is in Dharma. I leave the creatures in your capable hands!"},{"name":"SCOUT04660","text":"Worry not, I will see to it that these ones do not wander off. Best of luck finding their fellows!"},{"name":"HECTEYES","text":"The others will have seen some sights of their own. How I look forward to hearing their tales!"},{"name":"SYSTEM","text":"You have found the last of the voidsent. Time to head back to the Hall of the Radiant Host."},{"name":"VOIDSENT04660","text":"You've been looking for me, you say? Sorry for the trouble. I found a place with beautiful water and thought I'd have a rollick, but ended up being washed away..."},{"name":"VOIDSENT04660","text":"I tried to get back upstream, swimming against the flow, and had managed to come this far when you appeared."},{"name":"VOIDSENT04660","text":"After all that effort, I'd like nothing more than to reunite with my other selves. But if you've been promised a tale, then you shall have one!"},{"name":"FISHERA04661","text":"&lt;sigh&gt; Nothing but small fry..."},{"name":"VOIDSENT04660","text":"See that mortal there? He fished me up, but promptly released me while calling me a “hideous slug.” I don't know what that was about, but it worked out well enough."},{"name":"FISHERA04661","text":"Oh, to be out in the open sea and catch something <span class=\"emphasis\">big</span>..."},{"name":"FISHERA04661","text":"But until I can afford a halfway decent rod, I'll just have to put up with this tired old fishing hole... &lt;sigh&gt;"},{"name":"VOIDSENT04660","text":"I know the feeling well. The desire to chase after big fish. I used to be a fisherman too, you see. Together with my brother."},{"name":"VOIDSENT04660","text":"But the Contramemoria wreaked havoc on the ocean's aether, and nary any fish remained to be caught. Each morning we would wake up not knowing whether we'd have food to fill our bellies."},{"name":"VOIDSENT04660","text":"(-Wayward Hecteye-)On a day like so many before, we were waiting in vain for a bite. My brother's face was fixed in a grimace, and I assumed he was cursing the war in his mind. But it turned out he was thinking about something else altogether. And when he finally spoke, the frustration was plain in his voice."},{"name":"VOIDSENT04660","text":"(-Wayward Hecteye-)“Even if there were fish to catch, is this how I'm going to live out my days? Sitting endlessly with a pole in hand? It's like dying a slow death, and I can't take it anymore.”"},{"name":"VOIDSENT04660","text":"(-Wayward Hecteye-)More so than our privation, it was the mundane, unchanging nature of our lives that bothered him."},{"name":"VOIDSENT04660","text":"(-Wayward Hecteye-)In the next instant he blurted out, “That's it─if there's a war, I'm going to fight too! That way I won't be bored, at least!”"},{"name":"VOIDSENT04660","text":"(-Wayward Hecteye-)And just like that, he threw aside his rod and set off. Right into the thick of the conflict..."},{"name":"MEMORIAMASTERA04661","text":"D-Damn it!"},{"name":"MEMORIAMASTERB04661","text":"It's over!"},{"name":"MEMORIAMASTERB04661","text":"Ungh... Wh-Who the hells are you!?"},{"name":"MEMORIAMASTERA04661","text":"Whoever you are, I'm in your debt. Having exhausted my powers, I was all but defeated, but now none remain to oppose me here."},{"name":"MEMORIAMASTERA04661","text":"Perhaps you would consider serving me? You would be well rewarded, of course. I could grant you riches, castles..."},{"name":"MEMORIAMASTERA04661","text":"Wh-What's the meaning of this!? Weren't you a friend!?"},{"name":"WATERMONOLITH","text":"<span class=\"emphasis\">Friend</span>? I'm just after some excitement. So come on, give it to me!"},{"name":"FISHERB04661","text":"There you are, thank heavens! What were you thinking, taking on memoriates with your bare fists? However strong you may be, you're lucky to be alive!"},{"name":"WATERMONOLITH","text":"Alive..."},{"name":"WATERMONOLITH","text":"Yes, I've never felt so...<span class=\"emphasis\">alive</span>!"},{"name":"FISHERB04661","text":"Wh-Where are you going?"},{"name":"WATERMONOLITH","text":"No more chasing small fry for me. From now on, I'm going to live for the thrill of battle."},{"name":"WATERMONOLITH","text":"I'll seek out those stronger than me, and I'll give 'em all a taste of my fist!"},{"name":"VOIDSENT04660","text":"(-Wayward Hecteye-)“Never have I felt so alive as I did, risking life and limb,” he said as he strode away, never to return."},{"name":"VOIDSENT04660","text":"(-Wayward Hecteye-)Some time afterwards, a rumor reached me of a fearsome warrior. The man would arrive unannounced on a battlefield, trounce anyone and everyone indiscriminately, before disappearing again."},{"name":"VOIDSENT04660","text":"(-Wayward Hecteye-)Cagnazzo, he was called, and cursed for a feral dog. That was enough for me to know that my brother still lived."},{"name":"VOIDSENT04660","text":"It was only when I became a voidsent that I came to understand my brother. To understand the emptiness he felt in his mundane life."},{"name":"VOIDSENT04660","text":"It inspired me to want to break free from my own unchanging existence, and instilled in me a longing for this world."},{"name":"VOIDSENT04660","text":"And for all his quirks, he was a good and kind brother, always looking out for me and helping me with my fishing."},{"name":"VOIDSENT04660","text":"Like everyone, he must have turned into a voidsent. If he had the chance to come here, I believe he would've found a purpose in life. A proper one."},{"name":"VOIDSENT04660","text":"Hehe, thanks to you, I could relive those old memories. And with that, I had best go and join my other selves. Be seeing you!"},{"name":"VOIDSENT04660","text":"Hm? What business does a mortal have with me?"},{"name":"VOIDSENT04660","text":"So the rest of me are safe!? Thank goodness... It was worth risking myself to let the others escape."},{"name":"VOIDSENT04660","text":"No sooner had we arrived in this world than we were attacked by fearsome creatures of stone. I drew their attention, and after scrambling hither and yon, managed to get myself to safety."},{"name":"VOIDSENT04660","text":"But to so jealously guard treasure, you mortals must truly be fond of it. Lo─there's another place for storing it right there."},{"name":"SHIRAZADE","text":"They say it's mountain after mountain of treasure in there. We just need to find the coffers that act as portals."},{"name":"ADVENTURERA04661","text":"And then survive the guardians and deadly fiends... I don't like our chances with just the three of us."},{"name":"ADVENTURERB04661","text":"Less of us means a bigger share for each!"},{"name":"SHIRAZADE","text":"Exactly. Besides, what's an adventure without a little danger?"},{"name":"ADVENTURERA04661","text":"Hmmm... I'm really not sure about this..."},{"name":"VOIDSENT04660","text":"To willingly throw oneself into danger... It's truly a strange mortal quirk. Unlike your kind, we voidsent are quite risk averse. For instance, we wouldn't think to challenge a stronger being."},{"name":"VOIDSENT04660","text":"Except for <span class=\"emphasis\">him</span>, perhaps. An odd fellow who loved fighting for its own sake..."},{"name":"VOIDSENT04660","text":"His name was Cagnazzo, and there was nothing he feared in his domain."},{"name":"VOIDSENT04660","text":"Employing deception, he trapped his foes and drowned them in a bottomless mire. It mattered not how strong they were. All fell before him."},{"name":"VOIDSENT04660","text":"Yet despite his victories, he never felt truly satisfied. And through a chance meeting, he would learn the reason why."},{"name":"WATERMONOLITH","text":"That you should repel my attack... You're tougher than I expected!"},{"name":"BLACKKNIGHT","text":"(-Knight in Black-)To whom do I speak?"},{"name":"WATERMONOLITH","text":"I am Cagnazzo! And I'll bet you're the one they say is seeking out the strong. Well, if it's battle you want, then you need look no further!"},{"name":"BLACKKNIGHT","text":"(-Knight in Black-)Lest you misunderstand, I do not desire fruitless battle. On the contrary, 'twould seem that it is you who seek out the strong. Why?"},{"name":"WATERMONOLITH","text":"When you're hungry, you devour. It doesn't matter who. Your luck ran out when you strolled into my domain!"},{"name":"BLACKKNIGHT","text":"(-Knight in Black-)None would so risk themselves simply because of an empty stomach. Nay, my friend. The source of your hunger lies elsewhere."},{"name":"WATERMONOLITH","text":"Wh-What is this aether, so pure and sublime!? There's so much of it I'm ripe to burst! And yet..."},{"name":"WATERMONOLITH","text":"I still don't feel satisfied..."},{"name":"BLACKKNIGHT","text":"(-Knight in Black-)Do you see? 'Tis not for aether that you thirst, but battle."},{"name":"BLACKKNIGHT","text":"(-Knight in Black-)You'll not quench this thirst with stagnant swamp water. Nay, naught save that of a raging torrent will sate you!"},{"name":"WATERMONOLITH","text":"What do you mean?"},{"name":"BLACKKNIGHT","text":"(-Knight in Black-)There is no joy to be had in ensnaring your quarry. For victory to have savor, you must place yourself in the midst of danger."},{"name":"BLACKKNIGHT","text":"(-Knight in Black-)If you join me, I shall see to it you never want for dread foes to grant you satisfaction. What say you?"},{"name":"WATERMONOLITH","text":"Heh, why do I feel as though I've remembered something important? Whoever you are, I would know more."},{"name":"VOIDSENT04660","text":"And thus did he find a place to belong─upon the fine line that divides the devourer and the devoured."},{"name":"VOIDSENT04660","text":"If he could do battle with just one worthy foe, he told himself, he could go to his rest forever satisfied."},{"name":"VOIDSENT04660","text":"From that day forth, Cagnazzo tirelessly sought out those who might be able to best him. Each time hoping for bliss, but knowing that, like as not, disappointment ultimately awaited."},{"name":"VOIDSENT04660","text":"A yearning so strong, nothing else matters... Do you have such a thing driving you too, mortal?"},{"name":"VOIDSENT04660","text":"Looking back, it was extremely reckless of me to come to this world. But it has been worth every bit of danger and more."},{"name":"VOIDSENT04660","text":"Ahhh, I can't wait to share my experiences with myself! I'll be on my way now─thanks for coming to find me!"},{"name":"VOIDSENT04660","text":"The rest of me are here too? What a relief! I was taking in the sights in a village nearby when I realized I had become separated..."},{"name":"VOIDSENT04660","text":"I'm glad I decided to follow the clamor and head to this city. There are so many mortals here, so many beautiful buildings!"},{"name":"BOY04661","text":"Father, what is this building?"},{"name":"DAD04661","text":"This, my boy, is the resting place of the great Alzadaal."},{"name":"DAD04661","text":"Centuries ago, he journeyed here from the mainland, and helped to end the war between the Matanga tribes─an act which laid the foundation for the nation of Radz-at-Han."},{"name":"BOY04661","text":"So it's thanks to him that we all get along!"},{"name":"VOIDSENT04660","text":"Ah, a tomb. A place for mortals to remember their dead. It calls to mind people from my own past..."},{"name":"VOIDSENT04660","text":"My mother, who died in the Contramemoria. And the ones who laid her to rest..."},{"name":"VOIDSENT04660","text":"(-Wayward Hecteye-)Long, long ago, there lived two powerful mages."},{"name":"VOIDSENT04660","text":"(-Wayward Hecteye-)It was said that none could match their might, yet they nevertheless continued to hone their skills at their training ground, atop a peak called Mount Ordeals."},{"name":"VOIDSENT04660","text":"(-Wayward Hecteye-)One day, fell fiends began attacking villages unprovoked. Upon hearing the grim tidings, the mages came to a resolution."},{"name":"VOIDSENT04660","text":"(-Wayward Hecteye-)“Through years of training, we have mastered our flames. 'Tis time for us to employ them for the salvation of the world.”"},{"name":"VOIDSENT04660","text":"(-Wayward Hecteye-)So it was that the pair descended the mountain, and set about vanquishing the fiends."},{"name":"FIREMONOLITH","text":"Just that one left!"},{"name":"MAGE04661","text":"Leave it to me!"},{"name":"GIRL04661","text":"(-Frightened Girl-)No! Don't!"},{"name":"GIRL04661","text":"Please don't hurt her! Don't hurt my mother!"},{"name":"MAGE04661","text":"Y-Your mother?"},{"name":"MAGE04661","text":"Arrrgh!"},{"name":"GIRL04661","text":"Please save her! I beg you!"},{"name":"FIREMONOLITH","text":"Grrr... What do I do!?"},{"name":"FIREMONOLITH","text":"It seems I have no choice..."},{"name":"GIRL04661","text":"What? She's...she's turned into a crystal!"},{"name":"FIREMONOLITH","text":"I said that I would save the world...but I couldn't save even a single life!"},{"name":"FIREMONOLITH","text":"My flames were meant to be like the sun... They were meant to protect─to keep warm and light the way... And yet...and yet─!"},{"name":"VOIDSENT04660","text":"(-Wayward Hecteye-)In his great fury at his failings, the mage's face turned red as a ruby. Thus did the girl choose to call him Rubicante."},{"name":"VOIDSENT04660","text":"(-Wayward Hecteye-)The mage returned to his mountain, where he buried his comrade. Upon the gravestone he etched words of admonishment, and continued his training alone."},{"name":"VOIDSENT04660","text":"(-Wayward Hecteye-)One day, when visiting his comrade's grave, he found that a familiar crystal had been left there."},{"name":"VOIDSENT04660","text":"(-Wayward Hecteye-)Its presence lifted a great weight off his chest. Without words, it told him that that girl was grateful for what he did."},{"name":"VOIDSENT04660","text":"(-Wayward Hecteye-)That day, he regained something he had lost. And descending the mountain once more, he embarked upon a journey, determined to use his powers for good."},{"name":"VOIDSENT04660","text":"As sad as it is to lose a precious life, it's sadder still, I think, to lose one's purpose."},{"name":"VOIDSENT04660","text":"Mount Ordeals has been swallowed up by Darkness, and his comrade's grave with it. But wherever Rubicante may be, I like to believe that the little girl still remains in his heart..."},{"name":"VOIDSENT04660","text":"Well, it's past time I rejoined the others. It was nice talking to you, mortal!"},{"name":"VOIDSENT04660","text":"...What? I'm calling me, you say? I can appreciate my separation anxiety, but I answer to no one─not even myself."},{"name":"VOIDSENT04660","text":"I am my own master. I do what I like, when I like. I will rejoin the others at my own leisurely pace."},{"name":"VOIDSENT04660","text":"Mortals, on the other hand, always seem to be busy at work. Short as your lives are, one would think you'd spend more time on leisure. You're truly strange creatures."},{"name":"ALCHEMIST04661","text":"Still burning strong, just like the start of the experiment..."},{"name":"ALCHEMIST04661","text":"Ugh, by the Sisters, but tending the flame is mind-numbing work. Someone has to do it, I suppose, but I just wish it wasn't me..."},{"name":"VOIDSENT04660","text":"Tending the flame... That reminds me of a voidsent I once knew."},{"name":"VOIDSENT04660","text":"He watched over a beacon fire, seeing to it that it remained ever lit. Unlike that mortal, however, he did it of his own volition."},{"name":"VOIDSENT04660","text":"Such an act served no practical purpose in our world─even if night and day existed, we voidsent don't rely upon light. Yet he persisted."},{"name":"VOIDSENT04660","text":"Though perplexed by his curious ritual, I somehow found myself helping him with it..."},{"name":"VOIDSENT04660","text":"Rubicante was his name, and he went about his task dutifully."},{"name":"VOIDSENT04660","text":"Others mocked him for his meaningless act."},{"name":"VOIDSENT04660","text":"But it must have held some manner of meaning to him. And so, when I chanced to find the beacon guttered out, I made certain to let him know."},{"name":"VOIDSENT04660","text":"For time out of mind this routine continued uninterrupted. Until that fateful day..."},{"name":"BLACKKNIGHT","text":"(-Knight in Black-)I see flames dancing in the distance; who should I find tending it but a mage of considerable might. With such power, surely you can do more than keep a beacon lit?"},{"name":"FIREMONOLITH","text":"My flames serve not to smite others nor to sate my hunger."},{"name":"BLACKKNIGHT","text":"(-Knight in Black-)Then what purpose do they serve?"},{"name":"FIREMONOLITH","text":"I cannot say for certain...but to simply behold this flame somehow sets my heart at ease."},{"name":"BLACKKNIGHT","text":"(-Knight in Black-)I see... 'Twould seem you lack the power to comprehend the feelings engraved upon your soul."},{"name":"BLACKKNIGHT","text":"(-Knight in Black-)But such a lack is readily rectified."},{"name":"FIREMONOLITH","text":"This warmth, invigorating and comforting... Where have I felt it before?"},{"name":"FIREMONOLITH","text":"Of course─the sun! That which once shone its light upon creation!"},{"name":"FIREMONOLITH","text":"Though it would set, never did it fail to rise again. And like the sun, my flames must never die!"},{"name":"BLACKKNIGHT","text":"(-Knight in Black-)So that is the way of it. Through your flames, you sought to recreate the sun's journey. To recreate the world as it was before."},{"name":"FIREMONOLITH","text":"Who are you, who could unearth memories buried in the deepest recesses of my heart?"},{"name":"BLACKKNIGHT","text":"(-Knight in Black-)It matters not who I am, but what I seek to do. Join me, and together we shall banish the Darkness and see that the sun rises again."},{"name":"VOIDSENT04660","text":"According to the mysterious knight, the price to save the world was dear: the inhabitants of the neighboring reality must be sacrificed. To which Rubicante replied..."},{"name":"VOIDSENT04660","text":"“I have sworn to use my power to save the world. If innocent souls must be consumed by my flames, then I shall bear responsibility for the sin.”"},{"name":"VOIDSENT04660","text":"Thus did he choose his path─of his own volition. And his spirit lives on in me, as an undying flame."},{"name":"VOIDSENT04660","text":"A world engulfed in Darkness had become the norm for me. But since coming here and basking in the sun, I've been reminded of all that we had lost."},{"name":"VOIDSENT04660","text":"I understand Rubicante better now. Understand why he was willing to sacrifice all to restore the world to the way it was. To him, it was worth the price."},{"name":"VOIDSENT04660","text":"...Well, I must say, it felt great to take a squirm down memory lane. With that, I shall now rejoin the others─of my own volition, of course!"},{"name":"SCOUT04660","text":"One, two, three... Um, is this all of them, then?"},{"name":"HECTEYES","text":"You did it! You found all of me!"},{"name":"HECTEYES","text":"I trust I upheld my part of the bargain, and told you about more mighty voidsent?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I learned about the pasts of Cagnazzo and Rubicante."},{"name":"A2","text":"Those voidsent fought fiercely, but they'll fight no more."},{"name":"HECTEYES","text":"So you had already crossed paths with them... Though the tales may not help you in the battles ahead, I daresay they gave you something to think upon."},{"name":"HECTEYES","text":"As mortals, then voidsent, then archfiends, these troubled souls fought with all their being. And now their fight is over..."},{"name":"HECTEYES","text":"Well, I myself have only heard the tales from the others. If I'm to make their feelings my own, I need to become whole again. Which I can now do, thanks to you."},{"name":"SCOUT04660","text":"So all of them are accounted for? Then by all means, let's have them return to the way they were."},{"name":"HECTEYES","text":"Without further ado, then! To me, my selves!"},{"name":"HECTEYES","text":"At last, we're whole again! There's nothing we need fear!"},{"name":"HECTEYES","text":"And that which each of us experienced since coming here... It's as if I had experienced it all for myself!"},{"name":"HECTEYES","text":"I say it again, but this world is truly a fascinating place! I must see more of it. Yes, I must!"},{"name":"SCOUT04660","text":"I'm not sure what I was expecting...but now that it's whole, I can't help but feel that it's more of a danger."},{"name":"SCOUT04660","text":"Yet with the undersea portal destroyed, there's no way to return it whence it came. Whatever should we do now...?"},{"name":"HECTEYES","text":"Hm? What's this I see?"},{"name":"HECTEYES","text":"Oh, it's voidsent. There's a few of them in that direction. More of my brethren made it over, it seems. Curious, though─this is much farther than I can usually perceive..."},{"name":"HECTEYES","text":"I can only assume my vision has improved. Could this be the accumulative effect of our experiences here...?"},{"name":"SCOUT04660","text":"What? It can sense its kind from a vast distance?"},{"name":"SCOUT04660","text":"Amazing! Such an ability would make the task of tracking down invading voidsent a breeze!"},{"name":"SCOUT04660","text":"If the creature would agree to assist us in this manner, I'm confident that I can convince my superiors to forge a pact with it!"},{"name":"HECTEYES","text":"Oho! If it means I can remain in this world, then I'd gladly agree to that arrangement!"},{"name":"HECTEYES","text":"I can't say how much I'm indebted to you, mortal. Working with this fellow here, I'll find a way to communicate with your kind and make myself useful. Thank you for everything!"}],"reward":{"gil":1734,"items":[{"id":39594}]},"reqs":{"jobs":[{"lvl":90,"id":142}],"questsType":"all","quests":[70196,70214]}},"partials":[{"type":"npc","id":"1044133","obj":{"i":1044133,"n":"Radiant Scout","l":3707,"q":1}},{"type":"npc","id":"1044135","obj":{"i":1044135,"n":"Sullen-eyed Voidsent","l":3707,"q":2}},{"type":"item","id":"39594","obj":{"i":39594,"n":"Somewhere in the World (Ambitions Writhe) Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"quest","id":"70196","obj":{"i":70196,"n":"Shadowed Pasts","g":67,"l":"Radz-at-Han","s":10}},{"type":"quest","id":"70214","obj":{"i":70214,"n":"Gods Revel, Lands Tremble","g":12,"l":"Thavnair","s":646}}]}