{"quest":{"name":"Delve into Myth","location":"Mor Dhona","id":70199,"patch":6.35,"sort":301,"icon":101217,"unlocksFunction":1,"eventIcon":71341,"issuer":1011655,"target":1044504,"genre":88,"journal":["Koh Rabntah is eyeing you like a bird who has found its prey.","What appears to be an unassuming Miqo'te researcher is─for the moment─currently inhabited by the essence of legendary Allagan archmagus Noah, and it appears that your deeds have impressed the exacting teacher enough that she has decided to entrust you with a matter of utmost import. Before divulging the details of her request, however, she asks that you summon G'raha Tia to the Eight Sentinels, as he apparently also has a role in her plan.","Upon G'raha Tia's arrival, Noah reveals the purpose for which she has gathered you both at the Crystal Tower. Using G'raha Tia's royal blood as a key, she hopes to gain access to Eureka Orthos, a secret Allagan facility that held the empire's most clandestine research. After the gates are unlocked, she would have you delve into its long-forgotten halls, braving the dangers lying in wait and bringing Allag's secrets to the surface. The archmagus promises to help ensure─or at least promote─your survival, and seems eager to finish your preparations.","The archmagus furnishes you with a special suit of armor which will shield you from the facility's enervating wards as well as a demiclone generator, which can make sense of any data you find in your search. Although you have everything you need to begin your expedition, protocol must be followed. Present your equipment to Khatun for a final inspection.","Confirming that all the bits and pieces of your gear are in working order, Khatun clears you for entrance into Eureka Orthos. Your first goal is to descend to the thirtieth floor of the labyrinthine facility, fighting your way through any opposition that stands before you.<br><br>※You may speak with Burnel at Revenant's Toll to teleport to the Eight Sentinels."],"objectives":["Wait at the designated location.","Speak with Koh Rabntah.","Show your equipment to Khatun."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first clear floor 50 of the Palace of the Dead."},{"name":"SYSTEM","text":"To gain access to the Palace of the Dead, you must complete the quest “The House That Death Built.”"},{"name":"KOHRABNTAH","text":"How fare you, brave adventurer?"},{"name":"KOHRABNTAH","text":"...Or should I call you the hero of the Scions? An intrepid researcher for NOAH, perhaps? Which appellation do you prefer, <span class=\"highlight\">Forename Surname</span>?"},{"name":"KOHRABNTAH","text":"Now, now, there is no need for alarm. I am but a humble member of the Sons of Saint Coinach, although plainly not a son. My name is Koh Rabntah... "},{"name":"KOHRABNTAH","text":"...Well, strictly speaking, it would be more accurate to say that Koh Rabntah is the name of the vessel I inhabit. To explain matters simply, I am borrowing her for a spell."},{"name":"KOHRABNTAH","text":"My true name is Noah. Yes, <span class=\"emphasis\">that</span> Noah, famed archmagus of the Allagan Empire."},{"name":"KOHRABNTAH","text":"Surprised you, did I? I assure you I speak the truth─before you stands the very person after whom you have named your esteemed research group. Or her essence, rather."},{"name":"KOHRABNTAH","text":"You have braved Syrcus Tower, yes? 'Twas there that Koh chanced upon the orb which harbored me."},{"name":"KOHRABNTAH","text":"Awakened into an entirely new age, I was eager to abscond from my stuffy home and stretch my legs, so to speak. So Koh and I came to an agreement: she would lend me her body from time to time, and in return would receive the honor of being my vessel."},{"name":"KOHRABNTAH","text":"Fear not, this is nothing so base as voidsent possession─I can leave this body whensoever I please. But I did not seek you out to discuss the finer points of magic. No, there is something much more important we must discuss."},{"name":"KOHRABNTAH","text":"Ah, fancy meeting you here, <span class=\"highlight\">Forename</span>. Have you been well?"},{"name":"KOHRABNTAH","text":"Doubtless your adventuring duties have left you with little time for our humble organization. Still, I trust you have found a spare moment here and there to contribute to NOAH's ongoing research. You are so very good at it, after all."},{"name":"KOHRABNTAH","text":"Splendid, splendid. As you can see, my circumstances leave little room for complaint."},{"name":"KOHRABNTAH","text":"My vessel remains intact, and this age has yet to lose its luster. All told, Koh's discovery of the orb containing my essence in Syrcus Tower was a happy twist of fate indeed."},{"name":"KOHRABNTAH","text":"Not only have I been able to drink my fill of this world's mysteries and delights, but Koh seems more than happy to allow me all the time I need to indulge my curiosity."},{"name":"KOHRABNTAH","text":"Now, before you pass judgment, I must remind you that this arrangement was carried out under mutual agreement. I fully intend to relinquish control to her as soon as my work here is done, and it just so happens you may be able to help with that."},{"name":"KOHRABNTAH","text":"Rammbroes can scarcely stop talking about your adventures with the Scions of the Seventh Dawn, you see. I have heard the stories countless times..."},{"name":"KOHRABNTAH","text":"How in a strange turn of fate, G'raha Tia was awoken from his slumber in the Crystal Tower, far earlier than he should have been."},{"name":"KOHRABNTAH","text":"How the Ascian Fandaniel, who set our star on course toward the Final Days, was in fact Amon all along. "},{"name":"KOHRABNTAH","text":"Events of earth-shaking import─events in which you invariably played a pivotal role."},{"name":"KOHRABNTAH","text":"Your pedigree means there is none better suited to receive my request."},{"name":"KOHRABNTAH","text":"Firstly, however, I would ask that you summon G'raha Tia to the Eight Sentinels. I suspect he will answer the call of a comrade-in-arms much more readily than an anonymous researcher calling themselves an archmagus."},{"name":"GRAHATIA","text":"(-G'raha Tia-)Yes, this is he."},{"name":"GRAHATIA","text":"(-G'raha Tia-)<span class=\"highlight\">Forename</span>!? What a pleasant surprise! I can't remember the last time <span class=\"emphasis\">you</span> called <span class=\"emphasis\">m</span>─ Oh my!"},{"name":"GRAHATIA","text":"(-G'raha Tia-)Oh...that? 'Twas nothing, nothing at all! I'm much more interested in you, my friend. Are you well? You aren't in some sort of trouble, are you?"},{"name":"GRAHATIA","text":"(-G'raha Tia-)That's...quite the yarn. You say the archmagus Noah, inhabiting the body of a young researcher, has asked you to ask me to make haste to the Eight Sentinels. Have I got it right?"},{"name":"GRAHATIA","text":"(-G'raha Tia-)......"},{"name":"GRAHATIA","text":"(-G'raha Tia-)...Absolutely fascinating!"},{"name":"GRAHATIA","text":"(-G'raha Tia-)I'll be there at once! As soon as I conclude my current business, that is. I promise to be quick."},{"name":"GRAHATIA","text":"(-G'raha Tia-)Tell Noah─or is it Koh?─that I am eager to make her acquaintance! Until then, <span class=\"highlight\">Forename</span>!"},{"name":"KOHRABNTAH","text":"Well, I certainly did not mean to rush the poor lad. I hope his haste does not come at the expense of caution..."},{"name":"KOHRABNTAH","text":"Even so, hearing the loyalty you inspire in others makes me feel secure in my choice to place this task in your hands."},{"name":"KOHRABNTAH","text":"Now then, it would be improper for us to be late to our appointment after pulling G'raha Tia away from his work. Feel free to go on ahead─I shall be not far behind."},{"name":"Q0","text":"Enter the Eight Sentinels?"},{"name":"GRAHATIA","text":"I came as quickly as I could. I haven't kept you waiting, have I?"},{"name":"GRAHATIA","text":"...Good, good. When you told me that Noah herself was a party in all this, I knew this was an opportunity I would be loathe to miss."},{"name":"GRAHATIA","text":"When placed against the rebirth of both Xande and Amon, the survival of Noah's essence seems almost quaint. Still, I can't help but be excited to meet her and hear what this request of hers entails."},{"name":"GRAHATIA","text":"If I were to hazard a guess, it has something to do with the Crystal Tower."},{"name":"KOHRABNTAH","text":"(-???-)Your instincts are correct. Now, let me see those eyes...a deep crimson the likes of which I have not seen in many an age."},{"name":"KOHRABNTAH","text":"(-???-)Oh, this? Magicks are required on the road ahead, and I had to prepare accordingly."},{"name":"KOHRABNTAH","text":"(-???-)While adept enough as a researcher, I am afraid Koh's aptitude in the aetherial arts is nonexistent. It was necessary for me to acquire the proper attire, that I might in some small way make up for this deficiency."},{"name":"KOHRABNTAH","text":"While my abilities now are but a shade of what they were at my zenith, they shall suffice. You can thank Rowena's House of Splendors for meeting even the most esoteric of my demands."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You've truly captured the spirit of Allag!"},{"name":"A1","text":"Did you really have to change her hair?"},{"name":"A1","text":"Uh... Who are you?"},{"name":"KOHRABNTAH","text":"Why, thank you! I did try. Every magus knows that function must be married with looks─those that fail to learn that lesson seldom last long."},{"name":"KOHRABNTAH","text":"Truth be told, I never did understand why Koh felt the need to hide her face with her hair. Why limit one's field of vision so? With this simple change, it feels the world has opened itself to me."},{"name":"KOHRABNTAH","text":"Hoho, <span class=\"highlight\">Forename</span>, so quick with the jests. Unless you were serious...? Either way, I shall take your statement to mean that my change is an overall improvement."},{"name":"KOHRABNTAH","text":"However, I do wish I could have added a touch more flair. Amon would have clucked his tongue in disapproval at the sight of me."},{"name":"KOHRABNTAH","text":"Alas, I had to appease Koh's preferences as well. She insisted that the first few outfits I selected were much too gaudy, and eventually we landed on this compromise. Beauty truly is in the eye of the beholder, I suppose..."},{"name":"GRAHATIA","text":"Yes, yes, truly fascinating, most illustrious Noah. I could listen for days..."},{"name":"GRAHATIA","text":"Yet there is the question of why I was summoned here. And <span class=\"highlight\">Forename</span>, for that matter. Why have you gone to such lengths to seek us out?"},{"name":"KOHRABNTAH","text":"...Yes, quite right. To understand where we are heading, I must first tell you what came before. In the twilight of the Third Astral Era, with the Allagan Empire at the height of its glory, a laboratory was constructed beneath the Crystal Tower. There, the empire's most sensitive research was conducted."},{"name":"KOHRABNTAH","text":"The means of achieving eternal life and resurrection. Clone technology. Control mechanisms for the eikons and the eventual completion of the Dalamud prototype."},{"name":"KOHRABNTAH","text":"Those were but few of the many projects pursued deep under the earth. All in absolute secrecy, with the full blessings and guidance of the royal family."},{"name":"KOHRABNTAH","text":"It was dubbed Eureka Orthos by the emperor himself. A fitting name for a place which would become a nexus of creation."},{"name":"GRAHATIA","text":"Eureka!? You can't mean what I think you mean..."},{"name":"GRAHATIA","text":"Eureka is one of the oldest legends of Allag."},{"name":"GRAHATIA","text":"I believe you and Krile are well familiar with the “Forbidden Land”?"},{"name":"GRAHATIA","text":"When that island appeared suddenly in the waters of the Far East, it was dubbed “Eureka” after the Allagan legend."},{"name":"GRAHATIA","text":"The stories say that in the center of a vast labyrinth slumbers a weapon of incomprehensible power."},{"name":"KOHRABNTAH","text":"Oh, so the passage of time has not erased our deeds entirely."},{"name":"KOHRABNTAH","text":"That legend has a hint of truth in it. The development of specialized weapons was a main subject of research within Eureka Orthos. It comes as no surprise that rumors of what transpired there would eventually grow into the tales of which you speak."},{"name":"KOHRABNTAH","text":"However, Eureka Orthos is no myth─it exists as surely as you or I, and it was every bit as magnificent a feat as Syrcus Tower. I have reason to believe it survived the chaos of the Fourth Umbral Calamity relatively unscathed. "},{"name":"KOHRABNTAH","text":"I know where it is, and I know how we can gain entrance."},{"name":"KOHRABNTAH","text":"My peerless knowledge of teleportation magicks shall take us to the gates, and the royal blood flowing through G'raha Tia's veins shall open them."},{"name":"KOHRABNTAH","text":"I would very much like to once again set foot within those halls, where I refined and perfected the means of transferring my essence to and from various objects. "},{"name":"KOHRABNTAH","text":"Which brings me to my request. I would have you delve into the deepest regions of Eureka Orthos, and drag its secrets kicking and screaming into today."},{"name":"KOHRABNTAH","text":"With the flow of time within the Crystal Tower restored, the laboratory should be fully active, its unfinished experiments and long-dormant security measures wandering aimlessly in search of intruders."},{"name":"KOHRABNTAH","text":"The first order of the day shall be to put these obstacles to rest, and advance to the thirtieth floor of the facility."},{"name":"GRAHATIA","text":"I'll accompany you. If this place is as dangerous as it sounds, you'll need every extra weapon you can get."},{"name":"KOHRABNTAH","text":"I am afraid I cannot permit that. Your role in this ends once the gates to Eureka Orthos have opened."},{"name":"KOHRABNTAH","text":"I understand your disappointment, but the same blood that makes you useful as a key makes you a hindrance to fulfilling this mission. It ties you too strongly to the empire."},{"name":"KOHRABNTAH","text":"Unlike the Crystal Tower, there is no need for Eureka Orthos to inspire hope."},{"name":"KOHRABNTAH","text":"Allag is gone, its inheritors long dead. I wish for the empire's deeds─no matter how unsavory─to be beholden with eyes unclouded by legacy, that they might be judged for what they were."},{"name":"KOHRABNTAH","text":"So, <span class=\"highlight\">Forename</span>, I know I have been long in the asking, but will you accept this task?"},{"name":"KOHRABNTAH","text":"Naturally, I shall offer all the help I can muster, and you are free to take any spoils you may find. There is much that could be of use to one such as you."},{"name":"KOHRABNTAH","text":"I knew you would find the scent of adventure irresistible, but I thank you nonetheless. Drink your fill of ancient secrets and buried sin."},{"name":"KOHRABNTAH","text":"Well then, I suppose it is time to make our ingress. Allow us to borrow the key that Unei and Doga entrusted to you so long ago."},{"name":"KOHRABNTAH","text":"Ah, the connection seems to be stable. Very good."},{"name":"GRAHATIA","text":"Promise me you'll come back in one piece, <span class=\"highlight\">Forename</span>. Return in any other shape, and not even another Calamity will convince me to open these gates."},{"name":"KOHRABNTAH","text":"Must you fuss over <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> like a child? <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> to whom Allagan ruins are almost commonplace─who bested even Amon in combat. Compared to such trials, this will be but a footnote in a long list of heroics."},{"name":"KOHRABNTAH","text":"Once <span class=\"highlight\">Forename</span> returns from <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> expedition, you are more than welcome to return here and listen to the report. Rest assured you shall remain fully apprised of any world-threatening developments."},{"name":"GRAHATIA","text":"That's a small reassurance, but I suppose it must suffice. ...Should you find yourselves at an impasse, do remember that I'm only a call away, won't you?"},{"name":"KOHRABNTAH","text":"Now then, let us make ready. The secrets of Eureka Orthos lie in wait to be found!"},{"name":"KOHRABNTAH","text":"Here we are. Rammbroes has furnished me with all the manpower I requested."},{"name":"KOHRABNTAH","text":"The capable researchers of the Sons of Saint Coinach stand ready to organize your expeditions and appraise any rarities you may find."},{"name":"KOHRABNTAH","text":"As for my part, I have managed to offset the magical limitations of this vessel with my boundless knowledge, procuring two tools that should be of great use to you."},{"name":"KOHRABNTAH","text":"First, special armor. You see, in the days before the Fourth Umbral Calamity, the researchers of Eureka Orthos fortified it with wards that enervate the faculties of any intruders."},{"name":"KOHRABNTAH","text":"Even the most masterful weapons are rendered useless if they cannot be swung. To overcome this, I have imbued a set of armor with opposing wards which should nullify the effect, thus allowing you to fight with gusto!"},{"name":"KOHRABNTAH","text":"Second is a handy little device called a demiclone generator. As the name implies, it is capable of creating near-clones in a matter of moments. "},{"name":"KOHRABNTAH","text":"Such clones, while imperfect, were often used in experiments. If you come across tomestones containing data on such experiments, the generator can make sense of them."},{"name":"KOHRABNTAH","text":"Furthermore, while the aether of the clones dissipates as quickly as vapor in a hot beaker, an extra hand or two may prove useful in pulling you from a perilous situation."},{"name":"KOHRABNTAH","text":"Take these tools in good health, and may they serve you well! Once you have steeled your nerves and sharpened your weapons, speak with Khatun to begin!"},{"name":"KOHRABNTAH","text":"The way forward is open, and all the tools for the job are in your hands. All that is left is to take the next step, eh, adventurer?"},{"name":"KHATUN","text":"Well met, <span class=\"highlight\">Forename</span>! I'm Khatun, and Mistress Noah has tasked me with overseeing all manner of support for your expeditions into Eureka Orthos. "},{"name":"KHATUN","text":"That lass over there is Valeroine, and she'll appraise the worth of any trinkets or treasure you may find. Mistress Noah has also provided us with a synthesis node, and we're standing by to offer whatsoever aid we can!"},{"name":"KHATUN","text":"I take it the archmagus has given you the two pieces of equipment she was so proud of making? Excuse me, but for your own safety, I must ask you to show them to me before I allow you to set foot into the unknown."},{"name":"KHATUN","text":"Everything appears to be in working order. Now then, you're ready to go!"},{"name":"KHATUN","text":"Our first goal is to reach the thirtieth floor of the facility! Go forth, <span class=\"highlight\">Forename</span>, and show the realm that Allag's most deadly creations are no match for <span class=\"emphasis\">our</span> heroes!"},{"name":"SYSTEM","text":"You now have access to Eureka Orthos."},{"name":"SYSTEM","text":"You may enter the deep dungeon by speaking with Khatun again."},{"name":"SYSTEM","text":"You must be a Disciple of War or Magic of level 81 or above to participate, and your level will be adjusted to 81 upon entering Eureka Orthos for the first time."},{"name":"SYSTEM","text":"Further details can be had by speaking with Khatun."},{"name":"SYSTEM","text":"To return to this location, you may speak with Burnel at Revenant's Toll."}],"reward":{"gil":958},"reqs":{"jobs":[{"lvl":81,"id":142}],"quests":[70000]},"next":[70200]},"partials":[{"type":"npc","id":"1011655","obj":{"i":1011655,"n":"Koh Rabntah","l":67,"q":3}},{"type":"npc","id":"1044504","obj":{"i":1044504,"n":"Khatun","l":67,"q":1}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}},{"type":"quest","id":"70200","obj":{"i":70200,"n":"Rage Extinguished","g":88,"l":"Mor Dhona","s":310,"f":1}}]}