{"quest":{"name":"In Heavenly Company","location":"The Omphalos","id":70203,"patch":6.3,"sort":160,"icon":101210,"unlocksFunction":1,"eventIcon":71341,"issuer":1044304,"target":1044315,"genre":27,"journal":["Menphina is fairly bouncing up and down in her eagerness to set forth.","Urged on by the eager Menphina, your motley party sets forth for your designated marks of the Twelve. The first is that of Thaliak, which overlooks Silvertear Lake at a place called Rathefrost.","Upon arriving at Thaliak's stone, you promptly commit the information it holds to your instrument. Menphina and Halone then take the opportunity to speak about the stones, explaining that they were created due to the love men bear for gods, and the love gods bear for the star. Your business thus concluded at the first location, you set off for the next─the mark of Halone, located within the Fury's Gaze in the central highlands of Coerthas.","While Deryk extracts the information from Halone's stone, you tell your accompanying gods what you know of the worship of the Fury. With great enthusiasm, Menphina then sets off ahead of the party for the third and final mark─her own, which lies by the cliff west of the Steel Vigil.","As you approach the mark of the Lover, you encounter a man leaving it. He is revealed to be a former member of the Lambs of Dalamud, the doomsday cult which emerged prior to the Calamity. Though he did not share the fanatical views of his fellows, he suffered as a result of their murderous actions, and had become disillusioned with his faith. Thanks to Deryk's words of guidance, however, he is able to find renewed hope amidst his despair.","At Deryk's behest, you extract the information from the final stone. Menphina then lays her heart bare on the subject of mankind's faith in the divine. The gods have no wish to bring grief to mortals, she explains, but they are who they are because of those who believe in them. And though they may not be all-powerful, she assures you that men's prayers are always heard."],"objectives":["Speak with Deryk at Rathefrost.","Speak with Deryk at the Fury's Gaze.","Search for Menphina.","Speak with Deryk."],"dialogue":[{"name":"DERYK","text":"&lt;sigh&gt; Of all the self-indulgent things..."},{"name":"HALONE","text":"Menphina is winsome, is she not? We all think of her as our youngest sister."},{"name":"BABYOPOOPO","text":"Ook! Ook!"},{"name":"MENPHINA","text":"Well, what are we waiting for? Let us seek out the marks at once!"},{"name":"DERYK","text":"Yes, yes... No need to be so hasty."},{"name":"DERYK","text":"Shall we, then, <span class=\"highlight\">Forename</span>?"},{"name":"DERYK","text":"The nearest mark is Thaliak's, just outside in Mor Dhona. If memory serves, it overlooks the lake at a place called Rathefrost."},{"name":"HALONE","text":"This is indeed the place."},{"name":"MENPHINA","text":"Do you like traveling, <span class=\"highlight\">Forename</span>? I <span class=\"emphasis\">adore</span> it, and not simply for its own sake."},{"name":"MENPHINA","text":"It's an important way to perform one of our foremost duties, you see─peering into the hearts of mortals."},{"name":"BABYOPOOPO","text":"Ook..."},{"name":"DERYK","text":"Now then, we're to hold out an instrument to the stone. Would you care to do the honors here, <span class=\"highlight\">Forename</span>?"},{"name":"SYSTEM","text":"The instrument vibrates rapidly!"},{"name":"HALONE","text":"'Tis done. The information held in the stone has been etched."},{"name":"MENPHINA","text":"As Althyk said, these stones are eternal. No matter their shape or location, their nature is unchanging."},{"name":"MENPHINA","text":"Together with the monument in the Omphalos, they have remained the same since time immemorial."},{"name":"HALONE","text":"'Twas the love that men bear for us, and we for the star, that compelled us to create the monument and the stones."},{"name":"HALONE","text":"And though men do not know the truth of the stones, they offer them prayer."},{"name":"HALONE","text":"This act is a manifestation of your bond with us."},{"name":"HALONE","text":"While the stones are a manifestation of our bond with the star."},{"name":"MENPHINA","text":"And so, by praying to the stones, you effectively cultivate a bond between yourselves and us <span class=\"emphasis\">and</span> the star! Delightful, is it not?"},{"name":"DERYK","text":"Ahem. Though we appreciate your eagerness to talk, perhaps we should save some conversation for the destinations to come."},{"name":"DERYK","text":"If we linger too long in any one place, we are liable to be late to reconvene with the others."},{"name":"HALONE","text":"Then let us make for the central highlands of Coerthas. Within the Fury's Gaze, my own mark awaits."},{"name":"HALONE","text":"In this land where mankind's faith in me is strong, I cannot help but feel uplifted."},{"name":"MENPHINA","text":"There is nothing like taking to the road with agreeable company, do you not agree?"},{"name":"BABYOPOOPO","text":"O-Ook! O-Ook!"},{"name":"SYSTEM","text":"The baby opo-opo shivers uncontrollably in the cold..."},{"name":"DERYK","text":"There it is─the mark of the Fury."},{"name":"DERYK","text":"It wouldn't do to burden you constantly. I shall extract the information this time."},{"name":"MENPHINA","text":"Looking back, Halone, you've grown noticeably more imposing this past millennium. There are also more statues in the Heaven of Ice..."},{"name":"MENPHINA","text":"Ooh, but an idea occurs to me! <span class=\"highlight\">Forename</span>─this time I want <span class=\"emphasis\">you</span> to share what you know about the worship of Halone."},{"name":"MENPHINA","text":"I daresay it will be interesting to hear what mankind thinks of her from your perspective!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"The Ishgardian Orthodox Church is the heart of faith in the Fury."},{"name":"A1","text":"You often hear Halone's name invoked in battle."},{"name":"A1","text":"The church is returning to its roots, and moves to separate itself from the state."},{"name":"HALONE","text":"Ah, yes. The prayers of the people are fervent indeed, and through the church they evolved─a change I felt with my very being."},{"name":"HALONE","text":"Ah, yes. Ever did I feel the people's fervent desire to be strong, that they might protect that which they hold dear."},{"name":"HALONE","text":"Ah, so the people's faith continues to evolve. You and yours are ever on the move, marching inexorably forward. 'Tis a quality I find admirable."},{"name":"MENPHINA","text":"Well, how very fascinating! 'Tis a fine thing indeed to hear directly from mortals."},{"name":"MENPHINA","text":"Still...as much as Halone loves her children, it troubled her to see them at war with the dragons. To see those who share this star spill each other's blood."},{"name":"HALONE","text":"As you should well know, Menphina, it isn't our place to judge the faith of mortals."},{"name":"HALONE","text":"Even when we lend them our aid, we must refrain from intervening in their affairs."},{"name":"HALONE","text":"Lest there be any doubt, mankind's faith in us is mankind's alone."},{"name":"HALONE","text":"By your prayers, our forms are become that which they need to be."},{"name":"DERYK","text":"Apologies for the wait."},{"name":"MENPHINA","text":"Acquired the information, have you? Excellent. Let us proceed to the next mark─mine!"},{"name":"MENPHINA","text":"As I recall, it lies near the Steel Vigil, by the cliff west of the entrance. Follow me!"},{"name":"MENPHINA","text":"Well now, aren't we quick? My mark lies just ahead. Let's wait for the others and then continue together."},{"name":"MENPHINA","text":"Oh look, someone's praying. Hehe, how delightful to see one of my faithful children!"},{"name":"REDROBEMAN04668","text":"(-Red-robed Man-)O benevolent goddess... Grant me deliverance, I beseech you. Save my soul..."},{"name":"REDROBEMAN04668","text":"(-Red-robed Man-)Y-You! You're the one who was hunting down the Lambs of Dalamud!"},{"name":"REDROBEMAN04668","text":"(-Red-robed Man-)I knew it─knew you wouldn't stop till you've dealt with every last one of us. And now you've come for me... Ah, to think that this is Her will..."},{"name":"DERYK","text":"The Lambs of Dalamud..."},{"name":"DERYK","text":"They are the cult that appeared prior to the Seventh Umbral Calamity, are they not? In the name of their faith, they abducted and sacrificed innocent souls, and did not fear death."},{"name":"REDROBEMAN04668","text":"I've committed no crimes, I swear it! Menphina as my witness!"},{"name":"REDROBEMAN04668","text":"In the beginning, we simply prayed to the twin moons─for Dalamud to one day shepherd our souls to the bosom of His mistress."},{"name":"REDROBEMAN04668","text":"But it all changed when Dalamud began turning red. More and more of us began believing that He was our savior. That we must prove our loyalty with our lives, else we would suffer eternal damnation..."},{"name":"DERYK","text":"So that's how your group took on its fanatical ways, and came to be branded a dangerous cult."},{"name":"DERYK","text":"And at some point, I assume you were tasked with hunting them down."},{"name":"REDROBEMAN04668","text":"I used to be a merchant in Ul'dah. But timid as I am, I struggled to survive in that cutthroat world."},{"name":"REDROBEMAN04668","text":"That's why I turned to Menphina. I wanted to bask in Her gentle acceptance, and gain courage from Her strong and faithful hound. They were my solace─the only way I could be at peace with myself."},{"name":"REDROBEMAN04668","text":"But they took it from me! My fellows who committed those horrible deeds, and those who reviled me as one of them! They took it away!"},{"name":"REDROBEMAN04668","text":"Y-You're strong, aren't you? Grant me deliverance, I beg you! Judge me and show me the way!"},{"name":"REDROBEMAN04668","text":"&lt;sob&gt; I just can't bear it anymore... What good is a god I can't see, who won't grant me a thimble of succor no matter how much I pray?"},{"name":"DERYK","text":"...You mustn't seek in men what you seek in gods."},{"name":"DERYK","text":"Strong as <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is but a mortal. Like you, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is made of flesh and blood and possessed of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> own will. Nothing more, nothing less."},{"name":"DERYK","text":"It avails you naught to raise others up while belittling yourself. You are your own person, with a path of your own to walk. Even should you be taken by despair, that you are here now makes you no different from this <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>."},{"name":"DERYK","text":"So believe me when I say, all will be well. Keep your faith in Menphina─believe in Her love and grace─and you will surely learn to love others as well as yourself."},{"name":"REDROBEMAN04668","text":"Please forgive me for my unseemly outburst... I had been feeling lost, and all my anguish came spilling out."},{"name":"REDROBEMAN04668","text":"It was Menphina Herself who brought you here, I'm certain of it. To encourage and guide me. Taking your words to heart, I'll try searching for a new path."},{"name":"DERYK","text":"Should you feel lost again─take to the road. See what is out there. Learn how others live and think. And you are bound to find your way."},{"name":"MENPHINA","text":"Blessings be upon you on the road ahead, dear child."},{"name":"REDROBEMAN04668","text":"Did you say something?"},{"name":"HALONE","text":"Your faith in us can harm as well as heal, but never forget: that faith belongs to mankind, and mankind alone."},{"name":"MENPHINA","text":"That child will be fine, I am certain of it."},{"name":"BABYOPOOPO","text":"Ook?"},{"name":"DERYK","text":"&lt;sigh&gt; Unsolicited though it was, I don't regret saying those words to him. He needed to hear them."},{"name":"DERYK","text":"But come, <span class=\"highlight\">Forename</span>. This time it's your turn to extract the information."},{"name":"SYSTEM","text":"The instrument vibrates rapidly!"},{"name":"MENPHINA","text":"Forgive me, <span class=\"highlight\">Forename</span>. I fear I've caused you trouble."},{"name":"MENPHINA","text":"I'm relieved to know that. You truly are strong, in body and spirit both."},{"name":"MENPHINA","text":"Far be it from me to ask this of you, but please do not hold it against that child."},{"name":"MENPHINA","text":"We do not wish for our existence to bring grief to our children."},{"name":"MENPHINA","text":"Yet no matter which faith, we are who we are because of those who believe in us."},{"name":"MENPHINA","text":"My hound is no exception. He was born when men came to worship the object their ancestors cast unto the heavens."},{"name":"MENPHINA","text":"We are not all-powerful. We can't grant all of mankind's wishes."},{"name":"MENPHINA","text":"Nonetheless, we always─<span class=\"emphasis\">always</span>─hear you. No hope is too small, no prayer too faint."},{"name":"MENPHINA","text":"I just wanted to make that clear. Lest you forget, we love mankind dearly!"}],"reward":{"gil":5000},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70202]},"next":[70204]},"partials":[{"type":"npc","id":"1044304","obj":{"i":1044304,"n":"Menphina","l":4031,"q":1}},{"type":"npc","id":"1044315","obj":{"i":1044315,"n":"Deryk","l":63,"q":2}},{"type":"quest","id":"70202","obj":{"i":70202,"n":"Return to the Phantom Realm","g":27,"l":"Mor Dhona","s":150,"f":1}},{"type":"quest","id":"70204","obj":{"i":70204,"n":"Divine Nonintervention","g":27,"l":"Coerthas Central Highlands","s":170,"f":1}}]}