{"quest":{"name":"An Unforeseen Bargain","location":"Garlemald","id":70209,"patch":6.3,"sort":641,"icon":101228,"eventIcon":71201,"issuer":1044252,"target":1044259,"genre":12,"journal":["This distressed soldier has ill tidings to share with you.","A horde of voidsent has been sighted approaching from the east, prompting an immediate evacuation of the area. Alisaie asks Zero to assist in the effort, but she refuses, stating that she will not risk her life without suitable compensation. Jullus, however, succeeds in persuading Zero to help guard Tertium by reminding her of the buuz he gave her. With the memoriate keeping watch, Alphinaud believes that the encampment will be safe enough in your absence, and suggests heading outside to find your other comrades.","Together with Alphinaud and Alisaie, you seek out Y'shtola and the others. Fortunately, they are quite capable of defending themselves, though it remains to be seen how Jullus and Zero are faring back at Tertium.","You later learn that, while you and the twins were occupied with rampaging voidsent, Jullus received word that a unit had gone silent while en route to Camp Broken Glass. As he prepared to set out from Tertium to investigate, Zero, much to his surprise, offered to go in his stead. She arrived in time to save a pair of soldiers from voidsent, but soon found herself overwhelmed. Thankfully, you arrived in time to save her and put the enemy to rout.","With the danger passed, you enjoy a brief moment of respite while waiting for Zero to recover and Y'shtola and the others to return. In that quiet aftermath, Alisaie muses what might have compelled Zero to─despite her earlier objections─resolve to risk her life to save others..."],"objectives":["Speak with Alphinaud.","Speak with Alisaie."],"dialogue":[{"name":"ALPHINAUD","text":"This seems urgent..."},{"name":"ALISAIE","text":"I've got a bad feeling about this."},{"name":"MYSTERIOUSPERSON","text":"Well? Shouldn't you see what's wrong?"},{"name":"JULLUS","text":"He was out on patrol, so if he's come back early, then..."},{"name":"GARLEANSOLDIER10320","text":"Forgive me the interruption, but I come with grave news!"},{"name":"GARLEANSOLDIER10320","text":"A horde of voidsent are approaching from the mountains to the east. Their numbers are beyond anything we've ever seen!"},{"name":"ALISAIE","text":"What!? But Y'shtola and the others..."},{"name":"ALPHINAUD","text":"Anyone outside of Tertium is in danger. We must find and bring them all here at once!"},{"name":"ALISAIE","text":"Can we count on your aid, Zero?"},{"name":"MYSTERIOUSPERSON","text":"I've already settled the debt for my question. I'm not obligated to help."},{"name":"MYSTERIOUSPERSON","text":"What's more, death in this world is absolute. You ask me to put my life on the line."},{"name":"MYSTERIOUSPERSON","text":"Without suitable payment, I will do no such thing."},{"name":"ALISAIE","text":"That's fair... What do we have to offer that might be enough?"},{"name":"JULLUS","text":"You're right, Zero. You're not obligated to help, and I wouldn't presume otherwise."},{"name":"JULLUS","text":"Nevertheless, we are in need. Assuming the buuz I gave you is worth anything, would you at least be willing to stand watch at this encampment?"},{"name":"JULLUS","text":"That way, more of us will be able to go out and see the people to safety."},{"name":"MYSTERIOUSPERSON","text":"...Very well. Unless we come under attack, I'll do no more than stand watch."},{"name":"ALPHINAUD","text":"I daresay Tertium will be safe enough with Zero here."},{"name":"ALPHINAUD","text":"Let us go and find Y'shtola and the others, and assist with the evacuation."},{"name":"MYSTERIOUSPERSON","text":"Do what you must. I will remain here."},{"name":"JULLUS","text":"Please hurry. Time is of the essence."},{"name":"GARLEANSOLDIER10320","text":"Never have I seen so many voidsent... We've got to round up as many hands as we can to assist with the evacuation effort."},{"name":"ALISAIE","text":"Come, we need to find our comrades."},{"name":"ALPHINAUD","text":"Tertium will be fine. Jullus and his people have weathered far worse."},{"name":"ALPHINAUD","text":"We must make haste to the snowcraft, where our friends and the engineer should be."},{"name":"ALPHINAUD","text":"Given their position, they may soon find themselves at the mercy of the voidsent. If it comes to it, we must be prepared for battle."},{"name":"ALISAIE","text":"I'm ready, don't you worry."},{"name":"ALISAIE","text":"How about you, <span class=\"highlight\">Forename</span>?"},{"name":"SYSTEM","text":"Upon departing from Tertium, several cutscenes will play in sequence.<br>It is recommended that you set aside sufficient time to view these scenes in their entirety."},{"name":"SYSTEM","text":"In addition, you will be required to participate in battle. Your progress will be saved at certain points. In the event that you are defeated, you will be able to try again from the most recent of these."},{"name":"SYSTEM","text":"Please note that if you enter battles associated with other quests or log out from the game, this progress will be lost."},{"name":"SYSTEM","text":"You must be a Disciple of War or Magic of level 90 or above to proceed."},{"name":"ALPHINAUD","text":"For a mercy, there appears to have been no casualties in Tertium or elsewhere."},{"name":"JULLUS","text":"I've also received word that the transport arrived safely at Camp Broken Glass. They send their thanks to the “woman in black.”"},{"name":"MYSTERIOUSPERSON","text":"...I'm fine. I just need rest."},{"name":"ALISAIE","text":"Zero's convalescing aboard the train. Jullus has already given her something to eat, so I suppose all we can do is wait."},{"name":"ALISAIE","text":"I can't help but wonder, though... What possessed her to go and fight all those voidsent on her own? Not that I know the going rate for such things, but I doubt one buuz would suffice. I think <span class=\"emphasis\">someone</span> has been a bad influence on her."},{"name":"ALISAIE","text":"Oh, I'm just joking. Or am I?"},{"name":"ALISAIE","text":"In any case, many people owe her their lives. I'll be sure to thank her when she's back on her feet."}],"reward":{"gil":2855,"items":[{"id":33917,"one":1},{"id":33921,"one":1},{"id":33928,"one":1},{"id":33929,"one":1}]},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70208]},"next":[70210]},"partials":[{"type":"npc","id":"1044252","obj":{"i":1044252,"n":"1st Legion Soldier","l":3710,"q":1}},{"type":"npc","id":"1044259","obj":{"i":1044259,"n":"Alisaie","l":3710,"q":1}},{"type":"item","id":"33917","obj":{"i":33917,"n":"Piety Materia IX","l":560,"c":20281,"t":58,"materia":{"tier":8,"value":12,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"item","id":"33921","obj":{"i":33921,"n":"Battledance Materia IX","l":560,"c":20281,"t":58,"materia":{"tier":8,"value":12,"attr":"Tenacity","category":0}}},{"type":"item","id":"33928","obj":{"i":33928,"n":"Quickarm Materia IX","l":560,"c":20282,"t":58,"materia":{"tier":8,"value":12,"attr":"Skill Speed","category":0}}},{"type":"item","id":"33929","obj":{"i":33929,"n":"Quicktongue Materia IX","l":560,"c":20282,"t":58,"materia":{"tier":8,"value":12,"attr":"Spell Speed","category":0}}},{"type":"quest","id":"70208","obj":{"i":70208,"n":"Kindled Spirit","g":12,"l":"Garlemald","s":640}},{"type":"quest","id":"70210","obj":{"i":70210,"n":"King of the Mountain","g":12,"l":"Garlemald","s":642}}]}