{"quest":{"name":"Orthos Unveiled","location":"Mor Dhona","id":70201,"patch":6.35,"sort":320,"icon":101219,"unlocksFunction":1,"eventIcon":71341,"issuer":1044501,"target":1044508,"genre":88,"journal":["Koh Rabntah would hear more of your expeditions into Eureka Orthos.","You report your encounters in the deepest depths of Eureka Orthos to Noah, and the archmagus seems both impressed and delighted with your bravery. She wishes to share the story of Excalibur with you, but it seems she would prefer to do so while moving her legs. Accompany her to hear this long-forgotten tale.","After a brisk stroll, Noah tells you of an eikon whose existence was guarded so closely that the mere utterance of its name was forbidden. This being possessed the power to make dreams into reality─a power which requires little imagination to envision how it could be misused. Before continuing the tale, the archmagus sets off again, as much to keep her own blood flowing as to keep you from dozing off.","Noah's story continues as she reveals that the buried eikon was the source of the Allagan trigger weapons, which enabled the summoning of those divine beings without all the pomp and circumstance that was usually required. She tells you that Excalibur was just such a weapon, and once again walks off into the distance, clearly with the intent that you should follow.","Noah confesses that she has no knowledge of the eikon's current whereabouts, but remains assured that so long as you are the realm's defender, there is nothing to fear from its immense power. She sets her sights on the final leg of her journey before departing, beckoning you to follow suit.","At the final stop of your journey, Noah relates to you the story of Artorius, who was returned to life in Amon's quest to revive Xande. Once king of a prosperous nation, Artorius saw his home and people subjugated by the Allagans before being made to serve under their banner. Upon his resurrection he returned to the empire's ranks but found that his sympathies lay with the rebels. When these cracks in his loyalty were exposed, Artorius was slain by an assassin wielding Excalibur, after which he was transformed into a twisted abomination that crushed the rebellion at the empire's behest. With Noah's store of secrets exhausted, her essence departs the vessel of Koh Rabntah for the final time─or so the archmagus thinks. The young researcher protests most shrilly, pleading for Noah to remain and share more of her encyclopedic knowledge. Noah begrudgingly obliges, but there is a sense that the archmagus is happy to remain. With you and Koh Rabntah to carry on the story of Allag's deeds, the empire's legacy may endure well into the ages yet to come."],"objectives":["Speak with Koh Rabntah.","Speak with Koh Rabntah again.","Speak with Koh Rabntah once more.","Speak with Koh Rabntah one last time."],"dialogue":[{"name":"KOHRABNTAH","text":"I understand your desire for plunder and hidden knowledge has won out over your survival instincts. I am dying to know─what awaited you at the bottom of Eureka Orthos?"},{"name":"KOHRABNTAH","text":"So, it really was there. You stood against Excalibur and lived to tell the tale─the first to do so, I wager!"},{"name":"KOHRABNTAH","text":"Hahaha! To think I ever feared for your safety! Amon himself would have been hard-pressed to match your bravery!"},{"name":"KOHRABNTAH","text":"Well then, as I promised, I shall share with you the final scrap of lore I have to offer you. Listen well, for even among the researchers of Eureka Orthos this was a closely guarded secret."},{"name":"KOHRABNTAH","text":"Hmm... But perhaps a stroll would add the proper gravitas to the story. Besides, there is much to tell, and I would rather not stand here while my legs cramp and my mouth becomes parched."},{"name":"KOHRABNTAH","text":"So walk with me. Hearken to the tale of the sword Excalibur─and the man who became its slave."},{"name":"KOHRABNTAH","text":"Now, where to begin...?"},{"name":"KOHRABNTAH","text":"As you are doubtless well aware, a major subject of Allagan research were the eikons─or as you know them, primals."},{"name":"KOHRABNTAH","text":"One among them stood apart. It had the power to work dreams─no matter how outlandish─into reality."},{"name":"KOHRABNTAH","text":"It was sealed deep within Eureka Orthos, to hide it away from those who would misuse it. Researchers were even forbidden to speak its name, as if that would erase all trace of its existence from the world."},{"name":"KOHRABNTAH","text":"In time, this verboten eikon forged a weapon of spectacular power, whose creation left several aether streams desiccated, never to give life again."},{"name":"KOHRABNTAH","text":"Ah, but I am reminded of my days as a teacher, when my pupils would doze off despite the gravity of the facts being laid out before them. Perhaps a change in scenery would freshen things up, yes? Let us walk."},{"name":"KOHRABNTAH","text":"Now, where was I...? Oh yes─Eureka's eikon was instrumental in the development of the Allagan trigger weapons."},{"name":"KOHRABNTAH","text":"Meant only to be wielded by those deemed worthy, these armaments would make summoning an eikon a simple task. The chosen wielder need but hold the weapon aloft, and divine strength would be at her beck and call."},{"name":"KOHRABNTAH","text":"Without the use of specialized materials such as auracite, the manufacture of trigger weapons <span class=\"emphasis\">should</span> have been impossible...and yet Eureka's eikon managed it all the same."},{"name":"KOHRABNTAH","text":"Excalibur, as you have no doubt concluded, was one of the fruits of that endeavor. Come."},{"name":"KOHRABNTAH","text":"&lt;pant&gt; I had thought by now we would have reached the Sons of Saint Coinach. Now I am reminded why I spent so much time perfecting teleportation magicks... "},{"name":"KOHRABNTAH","text":"Well, I suppose I can catch my breath while I finish this little yarn. As to what became of this all-powerful eikon, it was transported somewhere far away in the days preceding the Fourth Umbral Calamity."},{"name":"KOHRABNTAH","text":"The researchers knew that the rebels were drawing in, and keeping the entity's powers out of their clutches was a top priority."},{"name":"KOHRABNTAH","text":"And that is where my knowledge of the matter ends. Why, it is entirely possible that the eikon slumbers in some hidden cloister even now, waiting to grant the wishes of those who would dare awaken it..."},{"name":"KOHRABNTAH","text":"I jest, of course! Yet even if I were not, and the eikon were unleashed upon the realm once more, I have no doubt you would lay it low before its powers were used for evil."},{"name":"KOHRABNTAH","text":"So you believe you may have already bested this entity? Well, I suppose I should not be surprised, considering your deeds thus far."},{"name":"KOHRABNTAH","text":"Yes...that tidings of “Eureka's” fate would be delivered by you is no coincidence. This is destiny if I ever knew it."},{"name":"KOHRABNTAH","text":"Well then, thanks to you we can put a nice little bow on this era-spanning legend. Excellent work, <span class=\"highlight\">Forename</span>, although you are hardly in need of <span class=\"emphasis\">my</span> praise."},{"name":"KOHRABNTAH","text":"Now, let us get our feet moving again, or else I may very well use magicks to bring an end to this interminable walking."},{"name":"KOHRABNTAH","text":"Only a few more yalms to go, eh? One foot in front of the other..."},{"name":"KOHRABNTAH","text":"But before we conclude this little jaunt, <span class=\"emphasis\">I</span> should conclude the story of Excalibur."},{"name":"KOHRABNTAH","text":"Long before the sword's creation, Amon had fervently searched for a means by which to resurrect Xande. He revived countless fallen heroes in his experimentation, but we are concerned with one in particular..."},{"name":"KOHRABNTAH","text":"I speak of the revered Artorius, a legendary king said to have united Ilsabard long before the Allagan Empire."},{"name":"KOHRABNTAH","text":"While the nation he fostered was prosperous, it could not withstand the burgeoning tide of Allagan might. Artorius was forced to pledge his service to his conquerors, and he lived the rest of his days as a general in the imperial military."},{"name":"KOHRABNTAH","text":"Once reborn by Amon's hands, he was given the mantle of general yet again. Unsurprisingly, he often found himself at odds with the direction the empire was headed."},{"name":"KOHRABNTAH","text":"Although he did not forsake his position, he found himself sympathizing with the rebels more deeply by the day."},{"name":"KOHRABNTAH","text":"Whether it was due to the strength of Phlegethon's convictions or the strength of his blade I do not know, but whispers abound that Artorius and the rebel hero were more friends than foes."},{"name":"KOHRABNTAH","text":"Through their many encounters on the battlefield they forged a bond of mutual respect. And this bond would prove to be Artorius's undoing..."},{"name":"KOHRABNTAH","text":"The empire would not suffer the slightest hint of treason within its ranks, and when these whispers reached the ears of high command, they sent an assassin to end Artorius's life. "},{"name":"KOHRABNTAH","text":"And so it was done. Artorius met his end at the tip of Excalibur's blade."},{"name":"KOHRABNTAH","text":"As the once-noble king drew his final breath, an eikon descended from the heavens, twisting his body into a grotesque form. His mind was shattered, and he was reduced to a mindless puppet, to be controlled by Excalibur and the Allagans who wielded it."},{"name":"KOHRABNTAH","text":"In a cruel twist of fate, it was this perverted shade of Artorius that stamped out the fires of revolution and put Phlegethon in shackles."},{"name":"KOHRABNTAH","text":"A tragic story, to be sure, but such tales serve to remind us of war's horrors. And now that you have quite plumbed the depths of my knowledge on this subject, the time is come for me to move on."},{"name":"NOAHSSOUL","text":"(-Noah's Essence-)Are you surprised? I did say I would relinquish this vessel when I no longer had need of it. I am sure Koh is eager to return to her life."},{"name":"NOAHSSOUL","text":"(-Noah's Essence-)As for me, I believe I fancy a new journey. A new vessel perhaps. Or perhaps I shall simply dissolve my essence into the Lifestream if I fail to find a satisfactory diversion."},{"name":"NOAHSSOUL","text":"(-Noah's Essence-)Now, now, there is no need for that dour expression. I am but an echo of the past─a fleeting dream whose end is as inevitable as waking."},{"name":"NOAHSSOUL","text":"(-Noah's Essence-)That my brief reverie in this age allowed me to claim you as a colleague is nothing short of a miracle, which I shall treasure until the end of my days."},{"name":"NOAHSSOUL","text":"(-Noah's Essence-)Be well, <span class=\"highlight\">Forename</span>, and promise me you shall not allow the name Noah to be forgotten by time."},{"name":"KOHRABNTAH","text":"(-???-)W-Wait!"},{"name":"KOHRABNTAH","text":"Don't go... Please, don't go!"},{"name":"NOAHSSOUL","text":"(-Noah's Essence-)Koh, what are you saying?"},{"name":"KOHRABNTAH","text":"You want the entire world to know of your pupils' devotion and works, yes? Then tell me about them as well! Don't put such a heavy burden on just <span class=\"highlight\">Forename</span>'s shoulders!"},{"name":"KOHRABNTAH","text":"There's so much you can teach us besides. About Allag, about yourself─countless nuggets of knowledge that have yet to be recorded in any book..."},{"name":"KOHRABNTAH","text":"If ever you need me as your vessel again, I'll happily oblige. Just stay here and tell me everything!"},{"name":"KOHRABNTAH","text":"Just don't say farewell. I forbid it..."},{"name":"KOHRABNTAH","text":"And besides..."},{"name":"KOHRABNTAH","text":"You must make amends for forcing me to don this dreadful attire! I practically died from embarrassment, but I held my tongue because I knew it was important to you."},{"name":"KOHRABNTAH","text":"And so...and so, you're in my debt!"},{"name":"KOHRABNTAH","text":"And you can't just off and disappear while you still owe me! Right!? Right."},{"name":"NOAHSSOUL","text":"(-Noah's Essence-)Koh... What has gotten into you?"},{"name":"NOAHSSOUL","text":"(-Noah's Essence-)Why am I cursed with the most headstrong, infuriating, and inquisitive students the realm manages to beget. Over and over..."},{"name":"NOAHSSOUL","text":"(-Noah's Essence-)Very well. Fortunately for you, I have yet to exhaust my interest for this age."},{"name":"KOHRABNTAH","text":"I owe you my thanks, <span class=\"highlight\">Forename</span>. For all you've done for Noah, and in a way...for me, as well."},{"name":"KOHRABNTAH","text":"If you should ever wish to step foot into Eureka Orthos again, my colleagues in the Sons of Saint Coinach shall be eager to lend assistance."},{"name":"KOHRABNTAH","text":"NOAH─and Noah, surely─look forward to working with you again!"},{"name":"KOHRABNTAH","text":"Now, I believe it's time to return to the Eight Sentinels. Oh, I have so many questions to ask! If you have need of us in the future, I suspect we shall be easy to find, deep in fascinating conversation."},{"name":"SYSTEM","text":"Congratulations! You have completed Eureka Orthos."},{"name":"SYSTEM","text":"You can exchange Orthos tomestones for four types of accessories by presenting them to the synthesis node."},{"name":"SYSTEM","text":"If you speak to Koh Rabntah with all four of these accessories equipped or in your inventory, you will earn an achievement and a rare item."}],"reward":{"gil":1001},"reqs":{"jobs":[{"lvl":81,"id":142}],"quests":[70200]}},"partials":[{"type":"npc","id":"1044501","obj":{"i":1044501,"n":"Koh Rabntah","l":67,"q":2}},{"type":"npc","id":"1044508","obj":{"i":1044508,"n":"Koh Rabntah","l":67,"q":1}},{"type":"quest","id":"70200","obj":{"i":70200,"n":"Rage Extinguished","g":88,"l":"Mor Dhona","s":310,"f":1}}]}