{"quest":{"name":"Return to the Phantom Realm","location":"Mor Dhona","id":70202,"patch":6.3,"sort":150,"icon":112505,"unlocksFunction":1,"eventIcon":71341,"issuer":1042264,"target":1044303,"genre":27,"journal":["Deryk betrays a gleam in his eyes at the sight of you.","Outside Revenant's Toll, Deryk informs you that G'raha Tia and Krile are on their way hither, having prepared for the next stage of your investigation of the phantom realm. They soon arrive, with the Miqo'te carrying the advanced-if-hefty aetheric analyzer borrowed from the Forum. This contraption will allow you to record detailed data of the gods' domain, to which end you set forth for the Omphalos, where your companion Snoegeim awaits.","Snoegeim has further studied the monument in the Omphalos, and found that the magic it harbors takes the form of an epigraph. The inscription is incomplete, however, and you must fill in the missing information if you are to decipher it. The mythologist suggests asking the gods themselves for help, and to everyone's surprise, Nophica appears in response to your whimsical charm. She promises you the key to unlocking the mystery, but in exchange you must do battle with more gods, herself included. The Matron then takes her leave, and you turn to discuss the developments with your comrades.","Though the original plan was to revisit the Heavens of Lightning and Fire, it is decided that you will prioritize Nophica's invitation and sally forth into the Heaven of Earth with G'raha Tia. As the Archon must focus on acquiring data with the aetheric analyzer, it falls to you to give the gods the battle they desire, and you prepare yourself for another grueling foray into their sanctum.<br><br>※Euphrosyne can be accessed via the Duty Finder.","As you did once before, you fight your way through the gods' heavenly domain, and bring the mighty beings to their knees. Your task thus accomplished, you and G'raha Tia make your way back to the Omphalos.","Gracing you with their presence once more, the gods reveal that the information you seek is contained within eternal stones scattered across Eorzea─stones which Snoegeim deduces are the marks of the Twelve. As G'raha Tia proposes splitting up to acquire the information, the divinities decide to accompany you. Having assumed their disguises, each chooses a member of your band as a traveling companion─though for some reason, you and Deryk appear to have been treated as a pair.","Deryk appears none too impressed with the gods' spontaneous demand. And for your part, you struggle to imagine what an adventure will be like in the company of the divine..."],"objectives":["Enter the Omphalos.","Speak with G'raha Tia.","Enter Euphrosyne.","Speak with Deryk."],"dialogue":[{"name":"DERYK","text":"Oh, greetings, <span class=\"highlight\">Forename</span>."},{"name":"DERYK","text":"If you've come to ask about developments in our phantom realm investigation, then your timing couldn't be better."},{"name":"DERYK","text":"A short while ago, I received word from G'raha Tia. He and Krile have completed their preparations in Sharlayan, and are ready to resume fieldwork."},{"name":"DERYK","text":"Even as we speak, they make their way hither. Let's wait for them together, shall we?"},{"name":"DERYK","text":"Ah, there they are."},{"name":"GRAHATIA","text":"&lt;pant&gt; &lt;pant&gt;"},{"name":"DERYK","text":"What in the heavens are you carrying?"},{"name":"GRAHATIA","text":"This, my friends, is the latest technological marvel to come out of Sharlayan..."},{"name":"GRAHATIA","text":"I give you the aetheric analyzer!"},{"name":"GRAHATIA","text":"Holding it thus, you take a measure of the ambient aether..."},{"name":"GRAHATIA","text":"...Whose waveform is then recorded by the aetherotranscriber at the back. This provides us with detailed data of the environment, which we can study at our leisure."},{"name":"GRAHATIA","text":"As you know, the phantom realms are hidden by illusions. In order to ascertain their nature, I suggested to Krile that we record the data with proper equipment."},{"name":"KRILE","text":"Alas, said equipment is tremendously cumbersome. Raha has done well to bring it here in one piece, and as expensive as it doubtless is, I hope we can return it in the same condition..."},{"name":"DERYK","text":"Return it?"},{"name":"KRILE","text":"Yes, to the Forum. In approving our investigation, they granted us use of the device in addition to their financial backing."},{"name":"KRILE","text":"Despite the Students' greatly reduced scale, the Forum has faith in our endeavors─thus did the approval notice declare, I'm proud to say."},{"name":"KRILE","text":"We owe much of this goodwill to the Scions, yourself not least of all."},{"name":"KRILE","text":"That being said, we can't depend on the Forum indefinitely. No, we must stand on our own two feet again, and it begins with our efforts in this investigation."},{"name":"KRILE","text":"The Twelve are meant to be Eorzea's guardian deities, yet they seek battle with mankind. What could it possibly be that motivates them?"},{"name":"KRILE","text":"In treating with them earnestly, I am hopeful that we will find the answer."},{"name":"KRILE","text":"Well, we shouldn't keep Snoegeim waiting. Without further ado, let's join her in the Omphalos."},{"name":"SNOEGEIM","text":"Welcome back!"},{"name":"SNOEGEIM","text":"Well now, if that isn't the aetheric analyzer! You've done well to get a hold of it!"},{"name":"GRAHATIA","text":"Indeed, we're duly grateful to the Forum for the loan. It's no small thing to be lugging about, but I've always wanted to try it."},{"name":"KRILE","text":"If you are ready, Raha, you may proceed with measuring the aether of the phantom realm. <span class=\"highlight\">Forename</span>─please assist him, will you?"},{"name":"KRILE","text":"In the meantime, I have a mind to further examine the monument with Snoegeim. How does that sound?"},{"name":"SNOEGEIM","text":"Like a plan! As a matter of fact, I've already done a little bit of work on that front."},{"name":"SNOEGEIM","text":"As you previously determined, the monument harbors some manner of magic. And this magic, I've since found, takes the form of an epigraph!"},{"name":"SNOEGEIM","text":"By consulting Professors Rurusha and Namono, Sharlayan's foremost experts in the field of archaeology, I was able to make a discovery."},{"name":"SNOEGEIM","text":"By consulting experts in the field of archaeology, I was able to make a discovery."},{"name":"SNOEGEIM","text":"Oh yes, a most startling discovery!"},{"name":"SNOEGEIM","text":"...That is, the epigraph is largely incomplete, so we can't read it."},{"name":"DERYK","text":"So you <span class=\"emphasis\">didn't</span> make a discovery...?"},{"name":"SNOEGEIM","text":"Ah, but see, establishing what one <span class=\"emphasis\">doesn't</span> know is also an important step in research!"},{"name":"SNOEGEIM","text":"For a blessing, the language used doesn't appear to be completely unknown. If we can but fill in the missing information, it should be possible to make sense of it."},{"name":"GRAHATIA","text":"But where do we even begin looking for such information?"},{"name":"SNOEGEIM","text":"Why, we ask the gods themselves, of course!"},{"name":"SNOEGEIM","text":"By giving them the battle they desire, we're doing them a favor, are we not? That being the case, I daresay they would grace us with their presence if called. Please come with me!"},{"name":"SNOEGEIM","text":"Oh, the things I would ask them if they really did appear..."},{"name":"SNOEGEIM","text":"Now, going by astrology, the Heaven of Earth should be the next to open. And it just so happens I know the perfect incantation for this purpose!"},{"name":"SNOEGEIM","text":"Open Mun-Tuy!"},{"name":"SNOEGEIM","text":"It's a time-honored charm passed down in Gridania, whose patron is Nophica, one of the deities said to dwell in the Heaven of Earth. Come, everyone─say it with me!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Open Mun-Tuy!"},{"name":"A1","text":"...Open Mun-Tuy."},{"name":"GRAHATIA","text":"(-All-)Open Mun-Tuy!"},{"name":"NOPHICA","text":"(-Cheery Voice-)Hehe, what delightful children you are. I too have desired to speak with you."},{"name":"SNOEGEIM","text":"B-By the Twelve! It's her! It's really her!"},{"name":"SNOEGEIM","text":"She looks precisely as depicted in legend! Amazing!"},{"name":"KRILE","text":"'Tis an honor to meet you, Nophica. If I may, what is it that you wish to speak about?"},{"name":"NOPHICA","text":"You seek to decipher the monument, do you not? If you face more of us in battle, I myself included, we shall grant you the key to unlocking that mystery."},{"name":"GRAHATIA","text":"We would of course be much obliged for such a gift, but are you certain? The gods before were not exactly forthcoming with your secrets."},{"name":"NOPHICA","text":"Closely have we watched you from our respective sanctums. Watched as you faced us and pursued the truth with pure hearts and minds."},{"name":"NOPHICA","text":"In light of what we have seen, we have concluded thus:"},{"name":"NOPHICA","text":"Even should you uncover the monument's purpose, you would still be willing to lend us your aid."},{"name":"NOPHICA","text":"Help us to fulfill our heart's desire, and so too shall we grant you yours."},{"name":"NOPHICA","text":"I look forward to receiving you in my sanctum, my dear children."},{"name":"KRILE","text":"Our efforts to understand the Twelve appear to have paid off."},{"name":"DERYK","text":"I wasn't expecting a god to actually appear. 'Twas but a coincidence, surely..."},{"name":"SNOEGEIM","text":"It worked! The charm reached the Matron! If it can be repeated, I shall have to mention it in my thesis!"},{"name":"GRAHATIA","text":"The original plan was to revisit the Heavens of Lightning and Fire..."},{"name":"GRAHATIA","text":"But I believe all would agree that we should prioritize Nophica's invitation."},{"name":"KRILE","text":"Well, Snoegeim, your charm did the trick. The way to another heaven lies open, and beyond it the truth of the monument."},{"name":"SNOEGEIM","text":"I can scarcely wait to pore over the aetheric data! Raha, <span class=\"highlight\">Forename</span>─I leave it in your capable hands!"},{"name":"KRILE","text":"As for you, Deryk─may we rely on your guidance once more?"},{"name":"DERYK","text":"Now that we know what awaits, I do not feel my presence is necessary; on the contrary, I would only be a burden."},{"name":"KRILE","text":"As you wish, of course."},{"name":"KRILE","text":"We can still count on you to pray for our friends, though, I trust?"},{"name":"GRAHATIA","text":"I'm glad that I can join you this time, <span class=\"highlight\">Forename</span>."},{"name":"GRAHATIA","text":"Encumbered as I am with the analyzer, I fear I won't be able to assist in battle, but I shall do my part and secure the data we need!"},{"name":"GRAHATIA","text":"Curious about my attire, are you? I borrowed it alongside the analyzer. It's the choice of gleaners, cleverly designed to help one bear great loads."},{"name":"GRAHATIA","text":"And hefty as the analyzer is, by now I'm quite used to the feel of it. That's to say, I won't unduly slow you down. Come, let us set forth!"},{"name":"KRILE","text":"In actually fighting the gods, yours is the hardest task of all."},{"name":"KRILE","text":"The rest of us are truly grateful to you, and we shall do our utmost to support your efforts."},{"name":"DERYK","text":"Knowing you, you should have no trouble finding your way without me. I will cheer you on from here."},{"name":"SNOEGEIM","text":"Thanks to the aetheric analyzer, even those who can't accompany you will have access to valuable data. Compliments to the Forum for the loan!"},{"name":"KRILE","text":"You're both safe, thank goodness!"},{"name":"SNOEGEIM","text":"You have the data, then? Wonderful, wonderful!"},{"name":"SNOEGEIM","text":"I don't suppose I could do the honors and replace the transcriber cartridge? I've always wanted to take a closer look!"},{"name":"GRAHATIA","text":"Take care removing it, now. We don't want anything to happen to the data."},{"name":"SNOEGEIM","text":"Carefully does it... Come to me, O knowledge divine! Come to me!"},{"name":"MENPHINA","text":"(-???-)What is that?"},{"name":"GRAHATIA","text":"Uwaaaaaah!"},{"name":"SNOEGEIM","text":"Oh..."},{"name":"SNOEGEIM","text":"I-It's all right! Th-The cartridge is safe!"},{"name":"GRAHATIA","text":"Let's finish the task before there are any more surprises..."},{"name":"ALTHYK","text":"You have our gratitude for bringing us closer to achieving our dream."},{"name":"NYMEIA","text":"Oh, Althyk, must you always be so formal? Although he has trouble expressing it, I assure you, my brother is absolutely giddy with joy."},{"name":"HALONE","text":"Why are you here, Nophica? Have you not sufficiently amused yourself with the mortals?"},{"name":"NOPHICA","text":"Not nearly! I would talk to them some more."},{"name":"MENPHINA","text":"Nophica promised you the key to deciphering the monument, did she not?"},{"name":"KRILE","text":"Yes, that's correct."},{"name":"ALTHYK","text":"Then you would do well to hold in your minds that which harbors information."},{"name":"NYMEIA","text":"Come now, Brother, you need to speak plainer than that. To clarify, we shall create the objects you need, but your assistance is required to give them form."},{"name":"NYMEIA","text":"Worry not─appearance has no effect on function. Just try and imagine that which, in your minds, is used to hold information."},{"name":"NYMEIA","text":"There. These instruments shall be useful in your quest."},{"name":"ALTHYK","text":"Across Eorzea lie eternal stones that hold the information required to complete the words of the monument."},{"name":"ALTHYK","text":"By holding an instrument out to a stone, it will take that information unto itself."},{"name":"ALTHYK","text":"We scattered these stones across the realm that mortals would not uncover our secrets. Of late, however, 'twould seem you have found alternate uses for them as objects of worship."},{"name":"SNOEGEIM","text":"Could they be the marks of the Twelve!?"},{"name":"SNOEGEIM","text":"They are, aren't they? Oh, to think that they harbored information on the gods!"},{"name":"GRAHATIA","text":"It seems we have our next destinations. Aside from the three city-states, I believe the marks are located in Coerthas and Mor Dhona."},{"name":"GRAHATIA","text":"I propose we split up, the quicker to finish the task."},{"name":"MENPHINA","text":"I wish to come too."},{"name":"NOPHICA","text":"No, Menphina. 'Twould not do to burden these children so."},{"name":"MENPHINA","text":"After all this time, we finally have the chance to speak with mortals─to learn about them from up close. And we're not like to have another..."},{"name":"HALONE","text":"I must say, I share Menphina's view."},{"name":"NOPHICA","text":"Even you, Halone..."},{"name":"SNOEGEIM","text":"I'd like to learn about you too, and I believe I speak for all of us! By all means, let us travel together!"},{"name":"MENPHINA","text":"Music to my ears! We shall watch over you and see that you safely reach your destinations. Without further ado, then..."},{"name":"AZEYMA","text":"(-Azeyma-)Not so fast!"},{"name":"AZEYMA","text":"(-Meerkat with Azeyma's Voice-)Did you think you could go frolicking without us? The others have our domain well in hand, so we are coming too."},{"name":"MENPHINA","text":"Well now, far be it from us to stop you. Let us assume our disguises too, and then each choose a mortal to accompany!"},{"name":"GRAHATIA","text":"Please, let it be something inconspicuous..."},{"name":"SNOEGEIM","text":"Hm-hm! I believe my destination is Thanalan. Then it's La Noscea for Raha, the Twelveswood for Krile..."},{"name":"SNOEGEIM","text":"And last but not least, Mor Dhona and Coerthas for Deryk and <span class=\"highlight\">Forename</span>."},{"name":"GRAHATIA","text":"Will you be all right, Krile?"},{"name":"KRILE","text":"I shall be fine. You needn't worry."},{"name":"MENPHINA","text":"Never before have I traveled with mortals. Ahhh, such fun this will be!"},{"name":"HALONE","text":"Others will remain to keep watch over our domain. You needn't worry on our account."},{"name":"DERYK","text":"We abided by the gods' selections...but why do you suppose the two of us were grouped together?"},{"name":"MENPHINA","text":"Why, because you make the most intriguing pair. The gods-felling hero, and the world-faring explorer!"},{"name":"MENPHINA","text":"I shall relish the chance to learn about both of you!"},{"name":"MENPHINA","text":"Now then, the others have already set forth, so let us do the same. Aside from my own mark, I believe we'll find those of Thaliak and Halone in Mor Dhona and Coerthas."},{"name":"BABYOPOOPO","text":"Ook! Ook!"},{"name":"MENPHINA","text":"Oh my, what an adorable creature! Delighted to meet you, little one."},{"name":"HALONE","text":"It seems to want to join us too."},{"name":"DERYK","text":"What an unusual company this has become... The gods truly know no inhibition."},{"name":"DERYK","text":"Forgive me, <span class=\"highlight\">Forename</span>. I couldn't have anticipated this turn of events..."}],"reward":{"gil":5270,"instance":30125},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70075]},"next":[70203]},"partials":[{"type":"npc","id":"1042264","obj":{"i":1042264,"n":"Deryk","l":67,"q":3}},{"type":"npc","id":"1044303","obj":{"i":1044303,"n":"Deryk","l":4031,"q":1}},{"type":"instance","id":"30125","obj":{"i":30125,"n":"Euphrosyne","c":61802,"t":"Raids","min_lvl":90,"max_lvl":90,"min_ilvl":595}},{"type":"quest","id":"70075","obj":{"i":70075,"n":"The Face of an Explorer","g":27,"l":"Rhalgr's Reach","s":140,"f":1}},{"type":"quest","id":"70203","obj":{"i":70203,"n":"In Heavenly Company","g":27,"l":"The Omphalos","s":160,"f":1}}]}