{"quest":{"name":"Once More unto the Void","location":"Radz-at-Han","id":70206,"patch":6.3,"sort":638,"icon":101227,"eventIcon":71201,"issuer":1039645,"target":1044293,"genre":12,"journal":["Varshahn's eyes seem to brighten at your arrival.","After arriving in the Source, Zero required time to regain her strength, but Varshahn has informed you that, thanks to a ready supply of food, she has made a full recovery. Eager to resume the search for his sister, he bids you relay his intent to the voidsent, whom he believes may be enjoying a view of the city from the corridor connecting Yuj and Kama.","You find Zero observing the people of Radz-at-Han while ruminating on the ephemeral existence of mortals. When she finally gives you her attention, you inform her of your purpose, and together make your way to Meghaduta to join the others.","Your preparations complete, you and your comrades are about to set forth for the void when, without warning, Vrtra emerges from the palace and lets out a mighty roar. When he speaks again as Varshahn, he reveals that he felt his sister's presence far to the north. This unexpected turn of events prompts a change of plans─rather than the void, you now set your sights on Garlemald."],"objectives":["Speak with Zero.","Speak with Varshahn."],"dialogue":[{"name":"VARSHAHN","text":"Ah, <span class=\"highlight\">Forename</span>. As always, your timing is most fortuitous. I wish to share with you news concerning Zero."},{"name":"VARSHAHN","text":"You will recall that, in exchange for aether, she agreed to aid us in our search for my sister."},{"name":"VARSHAHN","text":"At Y'shtola's suggestion, I began providing said aether in the form of food. Zero has found the arrangement to be agreeable, and has been eating steadily."},{"name":"VARSHAHN","text":"In large part due to that, she claims to have already made a full recovery."},{"name":"VARSHAHN","text":"If you and the others are ready as well, I would set forth for the void once more."},{"name":"VARSHAHN","text":"Excellent. I shall inform Y'shtola and Estinien, and then go to collect my other vessel from the alchemists."},{"name":"VARSHAHN","text":"In the meantime, might I ask you to fetch Zero?"},{"name":"VARSHAHN","text":"She was absent when I visited her chambers earlier, but I suspect you will find her in the corridor connecting Yuj and Kama. It seems she's grown partial to the view of the city it affords."},{"name":"VARSHAHN","text":"Once we have attended to our respective tasks, let us gather here."},{"name":"YSHTOLA","text":"I've been at the Great Work, discussing our experiences in the void with the alchemists."},{"name":"YSHTOLA","text":"Though they found much of it surprising, they were especially shocked to learn that Darkness prevents souls from finding rest."},{"name":"ESTINIEN","text":"If you're ready to get back to it, then so am I."},{"name":"MYSTERIOUSPERSON","text":"So much aether... I can't remember the last time I felt such fullness. I could get used to this."}],"reward":{"gil":1044},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70136]},"next":[70207]},"partials":[{"type":"npc","id":"1039645","obj":{"i":1039645,"n":"Varshahn","l":3707,"q":5}},{"type":"npc","id":"1044293","obj":{"i":1044293,"n":"Varshahn","l":3707,"q":1}},{"type":"quest","id":"70136","obj":{"i":70136,"n":"Buried Memory","g":12,"l":"Radz-at-Han","s":637}},{"type":"quest","id":"70207","obj":{"i":70207,"n":"A Cold Reunion","g":12,"l":"Radz-at-Han","s":639}}]}