{"quest":{"name":"Divine Nonintervention","location":"Coerthas Central Highlands","id":70204,"patch":6.3,"sort":170,"icon":101211,"unlocksFunction":1,"eventIcon":71341,"issuer":1044315,"target":1044331,"genre":27,"journal":["Something appears to weigh upon Deryk's mind.","Having finished visiting your destinations, Deryk expresses his concern for Krile on account of her earlier exchange with G'raha Tia. It is decided that you will check on her, to which end you first make your way to Gridania.","In Gridania, Menphina and Halone waste no time sensing Nophica and Byregot, but curiously note that the two are in different locations. Observing that Nophica is close by, Halone dashes off to find her sister goddess, and you hurry after her.","Halone leads you true, and you locate Nophica in the altar of her namesake. When pressed as to why she isn't with the others, the Matron explains that Krile wished to complete her task without divine supervision. Byregot still follows her discreetly, however, and so you decide to rendezvous with the Builder, who is near Camp Tranquil in the South Shroud.","Byregot informs you that Krile now makes her way to Althyk's stone. In order to hasten your passage, he summons a pair of Rhalgr's hawks to bear you and Deryk.","You and Deryk take to the air in search of Krile, and find her already at the stone. There, she reveals that it was the desire to seek the answers in her own way and prove herself capable that prompted her to send the gods away. Your concerns thus laid to rest, Krile then turns to the task of extracting information, and bids you await her in Quarrymill.","Speaking with Deryk in Quarrymill, you learn how he feels about involving himself in the lives of others. Though he believes it wrong to interfere, it seems he can't help but extend a helping hand when it comes to it."],"objectives":["Speak with Deryk in Gridania.","Speak with Halone.","Search for Byregot at Rootslake.","Speak with Deryk.","Speak with Deryk again."],"dialogue":[{"name":"HALONE","text":"Among us Twelve, Menphina is the most approachable to mortalkind. 'Tis one of her positive traits."},{"name":"MENPHINA","text":"Suffice it to say we love you too, <span class=\"highlight\">Forename</span>!"},{"name":"BABYOPOOPO","text":"Ook...?"},{"name":"DERYK","text":"With this, we have completed our task and may return to the Omphalos..."},{"name":"DERYK","text":"Yet I can't help but think about Krile."},{"name":"DERYK","text":"G'raha Tia seemed to be worried about her, did he not? 'Twas as if something weighed on her mind. Though she is in the company of deities, I find myself worrying too."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Whatever it is, there's only one way to find out!"},{"name":"A1","text":"You could ask her directly."},{"name":"A1","text":"..."},{"name":"DERYK","text":"Yes, I suppose so..."},{"name":"DERYK","text":"So you didn't notice anything amiss? Perhaps I simply imagined it, but I worry nonetheless."},{"name":"DERYK","text":"If there are no objections, let us seek out Krile."},{"name":"MENPHINA","text":"She has headed to the Twelveswood with Nophica and Byregot, yes?"},{"name":"MENPHINA","text":"They are presently too far away for us to sense, but we should be able to locate them once in the forest."},{"name":"DERYK","text":"I see. In that case, let us make for Gridania."},{"name":"HALONE","text":"As I understand it, mortals hold that Nophica and I are at odds. Like other details about us, you are free to believe what you wish."},{"name":"MENPHINA","text":"For all his preference for solitude, Deryk certainly seems concerned for the welfare of others. How very intriguing..."},{"name":"BABYOPOOPO","text":"Ook!"},{"name":"DERYK","text":"So, here we are in Gridania. Can you sense Nophica and Byregot?"},{"name":"MENPHINA","text":"I do...but something is strange."},{"name":"HALONE","text":"Indeed. They appear to be in different places."},{"name":"HALONE","text":"Nophica is the nearer of the two, and is quite close by. I shall go and find her."},{"name":"DERYK","text":"Wait! You mustn't go off on your own!"},{"name":"DERYK","text":"Ugh, confound it all! After her, <span class=\"highlight\">Forename</span>!"},{"name":"DERYK","text":"I'd thank you not to do that again..."},{"name":"MENPHINA","text":"Both Nophica and Halone are very good to me. 'Tis our way to look out for one another."},{"name":"BABYOPOOPO","text":"Ook..."},{"name":"NOPHICA","text":"Oh? Have you already finished visiting your stones?"},{"name":"HALONE","text":"There she is."},{"name":"NOPHICA","text":"Well now, I wasn't expecting to see you all here... Is aught the matter?"},{"name":"DERYK","text":"You're supposed to be with Krile and Byregot. Where are they?"},{"name":"NOPHICA","text":"Oh, we became separated while I was distracted, listening to the elementals."},{"name":"NOPHICA","text":"The beings are the voice of those who call the wood home. As I'm the patron of this land, they could not help but report to me."},{"name":"DERYK","text":"You gods can sense each other. Even should you become separated, shouldn't it be a simple matter to find them again?"},{"name":"HALONE","text":"Indeed. 'Twould seem you are keeping something from us, Nophica."},{"name":"NOPHICA","text":"Oh, Halone, there is simply no fooling you. Very well, I shall confess all."},{"name":"NOPHICA","text":"The child Krile wanted to visit our stones alone, you see. To complete her task without us watching over her."},{"name":"NOPHICA","text":"We merely respected that wish."},{"name":"NOPHICA","text":"With her abilities, I do not believe she is in any danger. But the worrier that he is, Byregot decided to follow after her discreetly."},{"name":"MENPHINA","text":"If this is her wish, then indeed, we must abide by it."},{"name":"NOPHICA","text":"As for Byregot... Ah, yes. I sense him in the place men call the South Shroud."},{"name":"DERYK","text":"One of the stones is situated there, I believe near Camp Tranquil. Let us search that area for Byregot─if we find him, we should find Krile as well."},{"name":"SYSTEM","text":"You scour the undergrowth, but see no signs of Byregot. It must have simply been the wind."},{"name":"SYSTEM","text":"You search the broken barrel, but find no god disguised as an adorable critter."},{"name":"BYREGOT","text":"...What brings you all here?"},{"name":"DERYK","text":"We understand you've been following Krile. Where is she?"},{"name":"BYREGOT","text":"Having acquired information from my stone, she now makes for Althyk's."},{"name":"BYREGOT","text":"I keep my distance to avoid being seen, and was about to continue on when you appeared."},{"name":"NOPHICA","text":"Althyk's stone is her last destination, is it not? Let us all go and meet her there."},{"name":"BYREGOT","text":"If everyone so wishes, then very well."},{"name":"BYREGOT","text":"To hasten our passage, I shall call upon Master Rhalgr's servants to bear the mortals."},{"name":"DERYK","text":"It seems we have the use of these hawks. Let's see if we can spot Krile from above."},{"name":"DERYK","text":"I will bring our companions, so you needn't worry about them. Are you ready, <span class=\"highlight\">Forename</span>?"},{"name":"SYSTEM","text":"Mount the hawk and search for Krile?"},{"name":"DERYK","text":"Go, my feathered friend. Fly like the wind. "},{"name":"DERYK","text":"I must thank you, <span class=\"highlight\">Forename</span>. Talking to you helped me to find the resolve to seek out Krile."},{"name":"DERYK","text":"No signs of her here... Let's continue on to Althyk's stone."},{"name":"DERYK","text":"There she is already. She certainly wasted no time."},{"name":"KRILE","text":"Well, now... Did you come all this way just to check on me?"},{"name":"KRILE","text":"I've been on edge, worrying that I might stumble into Odin, so you gave me a bit of a fright."},{"name":"DERYK","text":"Nophica tells us that you wished to travel alone. What prompted you to send the gods away?"},{"name":"KRILE","text":"Hmmm... It's difficult to explain."},{"name":"KRILE","text":"I suppose... I suppose I wanted to seek the answers in my own way."},{"name":"KRILE","text":"As the gods told us, if we wish to know the truth, we must discover it for ourselves."},{"name":"KRILE","text":"In spite of this, they've seen fit to not only set us upon the right path, but accompany us besides."},{"name":"KRILE","text":"This bespeaks the faith that they have in man's spirit of inquiry. And it gives me heart."},{"name":"KRILE","text":"After all, 'tis the selfsame spirit that defines the Students of Baldesion."},{"name":"KRILE","text":"Like everyone, I want to uncover the truth of the Twelve. To know their aspirations and understand them."},{"name":"KRILE","text":"And having seen a dear friend embark on countless adventures, I've developed the desire to see and experience the world for myself."},{"name":"KRILE","text":"There are dangers out there, of course, but I wanted to prove that I could handle them and perform my task."},{"name":"DERYK","text":"...I see. Indeed, as much as we can learn from others, there's no substitute for seeing with one's own eyes."},{"name":"DERYK","text":"And in yours, I see the gleam of yearning for exploration and discovery. It reveals to me the love you bear for our star...and it makes me glad."},{"name":"KRILE","text":"Wh-What's this all of a sudden? It's embarrassing when you say such things with a straight face..."},{"name":"KRILE","text":"Right, then. I've yet to acquire the information here, so I'll tend to it at once. Perhaps you'd like to wait for me at Quarrymill?"},{"name":"HALONE","text":"In this land, those voices raised in praise for Nophica are especially strong."},{"name":"MENPHINA","text":"Nophica and Byregot are also kind, are they not?"},{"name":"BABYOPOOPO","text":"Ook, ook!"},{"name":"DERYK","text":"Let's wait for Krile here. Nophica and Byregot are with her, so she will be fine."},{"name":"DERYK","text":"&lt;sigh&gt; First the man at Menphina's mark, and now Krile... In the course of traveling with you and yours, it seems I inevitably end up encroaching upon others' lives."},{"name":"BABYOPOOPO","text":"Ook! Ook, ook!"},{"name":"DERYK","text":"Aye, yours as well... Though nothing binds you to me, you've followed me ever since I tended your wounds. You're free to go anywhere, you know."},{"name":"DERYK","text":"A person's life belongs to that person alone. Others can't be expected to assume responsibility for it, and thus is it wrong to interfere."},{"name":"DERYK","text":"Alas, once I've glimpsed someone's heart, I find I can't avert my gaze. It truly is difficult to be amidst people..."}],"reward":{"gil":2500},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70203]},"next":[70205]},"partials":[{"type":"npc","id":"1044315","obj":{"i":1044315,"n":"Deryk","l":63,"q":2}},{"type":"npc","id":"1044331","obj":{"i":1044331,"n":"Deryk","l":56,"q":2}},{"type":"quest","id":"70203","obj":{"i":70203,"n":"In Heavenly Company","g":27,"l":"The Omphalos","s":160,"f":1}},{"type":"quest","id":"70205","obj":{"i":70205,"n":"The Secret of the Twelve","g":27,"l":"South Shroud","s":180,"f":1}}]}