{"quest":{"name":"The Secret of the Twelve","location":"South Shroud","id":70205,"patch":6.3,"sort":180,"icon":101212,"unlocksFunction":1,"eventIcon":71341,"issuer":1044331,"target":1042264,"genre":27,"journal":["Deryk casts a languid gaze to and fro.","Having extracted the information from her final stone, Krile rejoins you in Quarrymill. She expresses her thanks to her companions, mortal and divine alike, and together you make your way back to the Omphalos.","You arrive in the Omphalos to find G'raha Tia and Snoegeim already returned from their respective pilgrimages. After the gods take their leave, you use the information you acquired to complete the monument's epigraph. Appearing to be written by the gods themselves, it explains that they were brought forth by the will of the star, before going on to describe the duties of each deity. The revelations have given you and your companions much to ponder, and you all sink into contemplative silence.","G'raha Tia posits that the gods created the epigraph so that they might never lose sight of their duty, no matter how much their nature might be altered over millennia. And Krile, identifying the will of the star as Hydaelyn, turns her attention to the watcher on the moon, who could well be the thirteenth unnamed being.<br><br>As it stands, you have yet to encounter three of the Twelve, and there is no telling what may happen once you have fought them all. In order to determine how best to proceed, Krile and G'raha Tia decide to return to Sharlayan to compile your findings. Deryk also excuses himself and heads out of the Omphalos, but Snoegeim bids you follow after the aloof explorer, unsettled by his melancholy musings.","In response to Snoegeim's fears that he might suddenly vanish, Deryk philosophizes that all things must come to an end. Saddened though he will be when the time comes to part ways, he accepts that sadness as part of the joy he has derived from your companionship, and declares his intention to strive with you to the last. Inspired by his words, you inwardly pledge to follow the mystery of the Twelve to its very end."],"objectives":["Enter the Omphalos.","Speak with G'raha Tia.","Speak with Deryk outside Revenant's Toll."],"dialogue":[{"name":"HALONE","text":"In this land, those voices raised in praise for Nophica are especially strong."},{"name":"MENPHINA","text":"Nophica and Byregot are also kind, are they not?"},{"name":"BABYOPOOPO","text":"Ook, ook!"},{"name":"DERYK","text":"It doesn't take too long to extract the information. Krile should be here any moment now."},{"name":"KRILE","text":"Apologies for the wait. With that, I've obtained information from all of my stones."},{"name":"KRILE","text":"You've taken care of yours already, yes?"},{"name":"KRILE","text":"Thank you for worrying about me. While it's good to know that I can handle myself, I'm heartened to be doing this with you all."},{"name":"KRILE","text":"I owe you thanks as well, Byregot and Nophica, for accepting my request with good grace."},{"name":"BYREGOT","text":"Think naught of it. You did well to see your task through, little one."},{"name":"NOPHICA","text":"Indeed. Come, come, let us all return to the Omphalos."},{"name":"GRAHATIA","text":"You took your time, <span class=\"highlight\">Forename</span>. Did something happen?"},{"name":"SNOEGEIM","text":"Ah, so you rendezvoused with Krile. How was your experience with the gods, if I may ask?"},{"name":"GRAHATIA","text":"Not only did you help a disillusioned man find his way, you looked in on Krile besides..."},{"name":"GRAHATIA","text":"Thank you, <span class=\"highlight\">Forename</span>. And you as well, Deryk."},{"name":"DERYK","text":"...I fear I overstepped my bounds, but what's done is done."},{"name":"MENPHINA","text":"We shall return to our sanctums. You have our gratitude for the delightful time!"},{"name":"NYMEIA","text":"By holding your instruments out to the monument, you will be able to augment the missing information. Be well, dear children."},{"name":"GRAHATIA","text":"Shall we, then?"},{"name":"KRILE","text":"Amazing! What was impossible to decipher is now crystal clear!"},{"name":"KRILE","text":"Without further ado, I shall read out the epigraph..."},{"name":"KRILE","text":"(-Omphalos Monument-)As beings who endure by the will of the star, we are susceptible to the influence of hopes and prayers. Thus do we commit our yokes herein, lest we stray from our purpose."},{"name":"KRILE","text":"(-Omphalos Monument-)He who is named Byregot shall preside over construction. His duty: to fortify the works of men, and encourage them to build."},{"name":"KRILE","text":"(-Omphalos Monument-)He who is named Rhalgr shall preside over destruction. His duty: to galvanize the star's beating heart, and facilitate mankind's regeneration."},{"name":"KRILE","text":"(-Omphalos Monument-)She who is named Azeyma shall preside over the sun. Her duty: to nurture its life-giving light, and illuminate the truth for all to see."},{"name":"KRILE","text":"(-Omphalos Monument-)He who is named Nald'thal shall preside over the subterrane. His duty: to make gleam the riches hidden in the darkest depths─and in men themselves."},{"name":"KRILE","text":"(-Omphalos Monument-)She who is named Nophica shall preside over fertility. Her duty: to fill the land with life, and prepare a path of peace and plenty."},{"name":"KRILE","text":"(-Omphalos Monument-)He who is named Althyk shall preside over space and time. His duty: to endow the star with material vigor, that mankind's march may never cease."},{"name":"KRILE","text":"(-Omphalos Monument-)She who is named Halone shall preside over the glaciers. Her duty: to hold the melting ice at bay, and imbue men with constancy and tranquility."},{"name":"KRILE","text":"(-Omphalos Monument-)She who is named Menphina shall preside over the moon. Her duty: to perpetuate the turning of night and day, and foster love in the hearts of all."},{"name":"KRILE","text":"(-Omphalos Monument-)He who is named Thaliak shall preside over the rivers. His duty: to quench the thirst of men, and water their minds with wisdom."},{"name":"KRILE","text":"(-Omphalos Monument-)She who is named Nymeia shall preside over the stars. Her duty: to preserve the celestial fabric of the seasons, and weave the threads of men's lives."},{"name":"KRILE","text":"(-Omphalos Monument-)She who is named Llymlaen shall preside over the seas. Her duty: to administer the tides, and inspire men to come together as one and seek new horizons."},{"name":"KRILE","text":"(-Omphalos Monument-)He who is named Oschon shall preside over the mountains. His duty: to sustain the breath of the firmament, and in wandering share in men's solitude."},{"name":"KRILE","text":"(-Omphalos Monument-)He who is unnamed shall watch unflinching. His duty: to stand guard over his charge, always and unto the end."},{"name":"KRILE","text":"There the epigraph concludes. We've been given quite a lot to ponder..."},{"name":"KRILE","text":"Our yokes...lest we stray..."},{"name":"DERYK","text":"Curiouser and curiouser..."},{"name":"SNOEGEIM","text":"Writings about the gods, written by the gods themselves... This is utterly unprecedented!"},{"name":"BABYOPOOPO","text":"Ook? Ook?"},{"name":"GRAHATIA","text":"Hopes and prayers influencing their nature..."},{"name":"GRAHATIA","text":"Have you any thoughts on the contents of the epigraph, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"The prayers of her faithful made Halone more imposing."},{"name":"A1","text":"The worship of Dalamud brought forth Menphina's hound."},{"name":"SNOEGEIM","text":"You mean to say that prayers have changed the Twelve into their present forms? That is rather hard to believe..."},{"name":"GRAHATIA","text":"Given what we now know of dynamis, I believe it is entirely possible. In the presence of that energy, hopes and prayers have more tangible results than one might expect."},{"name":"GRAHATIA","text":"Its power may be curbed upon our star, but over thousands of years of worship, it could have influenced the gods in various ways."},{"name":"GRAHATIA","text":"Ways such as that which <span class=\"highlight\">Forename</span> just described, for one. Others that come to mind are Halone's shield and spear, which reflect her status as a goddess of war, and Nymeia's spinning wheel, which is an apt apparatus for a goddess of fate."},{"name":"GRAHATIA","text":"Thus did they create this monument─this yoke─that they might never lose sight of their duty, no matter how much they may change."},{"name":"KRILE","text":"I'm inclined to agree with Raha."},{"name":"KRILE","text":"The gods wrote that they endure by “the will of the star.”"},{"name":"KRILE","text":"Who that refers to, we all know too well."},{"name":"KRILE","text":"Hydaelyn."},{"name":"KRILE","text":"By sundering reality, She must have known that She would shake the very foundation of existence. Anticipating the potential chaos, I suspect She charged Her collaborators with maintaining stability."},{"name":"GRAHATIA","text":"If this is true, then might not the thirteenth unnamed being be the watcher on the moon?"},{"name":"KRILE","text":"The pieces certainly fall into place. I wonder if he would be willing to share what he knows..."},{"name":"KRILE","text":"As it stands, we've yet to encounter three gods. As there's no telling what may happen once we've fought them all, I believe we should try to uncover as much of the truth as we can, the better to know how to proceed."},{"name":"KRILE","text":"To that end, ere we seek out the watcher, Raha and I shall return to Sharlayan to compile our findings─the data from the analyzer not least of all."},{"name":"SNOEGEIM","text":"To think that the investigation might lead us to the moon! I eagerly look forward to the next stage of our fieldwork!"},{"name":"GRAHATIA","text":"<span class=\"highlight\">Forename</span>. Like as not, yet more grueling encounters with the gods await. You should rest up and gather your strength."},{"name":"DERYK","text":"Not long now ere we arrive at the truth..."},{"name":"DERYK","text":"For the longest time I've journeyed alone, not involving myself in the affairs of others."},{"name":"DERYK","text":"But I've enjoyed our time together. You've undertaken the investigation with all earnestness, and it has been a pleasure to be part of it."},{"name":"DERYK","text":"When I imagine the moment we must part ways, I can't help but be saddened. And it surprises me that I feel that way."},{"name":"DERYK","text":"...Forgive me, I didn't mean to wax sentimental. If you'll excuse me, I shall head outside for some fresh air."},{"name":"SNOEGEIM","text":"There he goes again... <span class=\"highlight\">Forename</span>─do you suppose you could follow after him?"},{"name":"SNOEGEIM","text":"I can't quite say why, but I feel as though he'll suddenly vanish one day, never to return..."},{"name":"DERYK","text":"Oh, 'tis you, <span class=\"highlight\">Forename</span>. What is it?"},{"name":"DERYK","text":"Snoegeim's worried that I'll suddenly vanish, you say..."},{"name":"DERYK","text":"Well, as the saying goes, all things must come to an end. Whether we will it or no."},{"name":"DERYK","text":"When our work is finished, we must go our separate ways."},{"name":"DERYK","text":"Doing so will sadden me, as you know."},{"name":"DERYK","text":"Yet that sadness is part of the joy I have derived from our companionship."},{"name":"DERYK","text":"So I will accept it when the time comes, and strive with you to the last."},{"name":"BABYOPOOPO","text":"Ook...?"},{"name":"DERYK","text":"As you know, my friend, I would rather you live your own life. But having helped you, I won't send you away against your will."},{"name":"DERYK","text":"...Well, you are a busy <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, so I won't keep you."},{"name":"DERYK","text":"As before, rest assured I will share with you any tidings I receive from Krile. Take care, my friend, and see you again in due course."}],"reward":{"gil":2500},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70204]}},"partials":[{"type":"npc","id":"1044331","obj":{"i":1044331,"n":"Deryk","l":56,"q":2}},{"type":"npc","id":"1042264","obj":{"i":1042264,"n":"Deryk","l":67,"q":3}},{"type":"quest","id":"70204","obj":{"i":70204,"n":"Divine Nonintervention","g":27,"l":"Coerthas Central Highlands","s":170,"f":1}}]}