{"quest":{"name":"The Incredible Machines","location":"Mare Lamentorum","id":70218,"patch":6.35,"sort":2,"icon":101222,"beast":17,"unlocksFunction":1,"eventIcon":71341,"issuer":1044402,"target":1044928,"genre":28,"usedItems":[38844,38845],"journal":["Dreamingway has big plans for Hoper's Hold.<br>※The difficulty of this quest will be synced to your current level.","Though the musicking and shopping stations have been a resounding success, Dreamingway laments that Hoper's Hold still has few dreams on offer. Fortunately, Managingway has a suggestion for another Loporrit you might bring into the fold─Repairingway─so you resolve to have her come and set up a station in the Dreaming Workshop forthwith.<br><br>※Please note that you may not proceed with a class or job that is different from when you accepted this quest.","You speak with Repairingway, who it seems is far too busy keeping the moon in shipshape to join the Dreaming Workshop, much as she appreciates the need for it. All is not lost, however, as she is able to offer the name of another machine enthusiast with far more time to spare.","Following Repairingway's advice, you offer Inventingway a station where he might innovate to his heart's content. The struggling Loporrit gladly takes you up on this, eager to at last find employment where his passion will be seen as a boon rather than a liability.","Back in Hoper's Hold, you consult with Dreamingway as to your role in preparing the machining station. He passes on Managingway's instructions for what items to craft, as well as the materials you will need to create them.","You present your finished machining accoutrements to a duly impressed Dreamingway. The very moment he delivers them to Inventingway, the eccentric Loporrit jumps into action, and soon an array of perplexing machines stands before you. Their utility─or lack thereof─aside, they make for an inspiring sight, and will hopefully spark a new sense of purpose in many a Loporrit, though you would be remiss to rest upon your laurels now. There are surely more Loporrits out there with dreams to share, and not all comers have been impressed with the offerings thus far..."],"objectives":["Search for Repairingway.","Speak with Dreamingway.","Speak with Dreamingway again.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Dreamingway</span></span>."],"dialogue":[{"name":"DREAMINGWAY","text":"Our musicking station is a rousing success! I must admit that I understand less than half of what Coiningway says about the circulation of carats, but they seem rather pleased with the shopping station's results as well."},{"name":"DREAMINGWAY","text":"I do wish we had more dreams on offer, however. This cannot possibly be enough to satisfy every Loporrit's needs."},{"name":"MANAGINGWAY","text":"Dreams... Passion... Ingenuity..."},{"name":"MANAGINGWAY","text":"I believe I know a Loporrit who can help."},{"name":"DREAMINGWAY","text":"A Loporrit with a vision─nay, a <span class=\"emphasis\">dream</span>!?"},{"name":"MANAGINGWAY","text":"Just so. She adores fixing all manner of things, whether they need it or not. You may have some difficulty convincing her to set up a station here, however."},{"name":"DREAMINGWAY","text":"Surely we can convince her if we try! What's her name?"},{"name":"MANAGINGWAY","text":"Repairingway. She's been rather fixated on the machines in Greatest Endsvale of late, so I shouldn't be surprised to find her there."},{"name":"DREAMINGWAY","text":"In that case, let us sally forth forthwith!"},{"name":"DREAMINGWAY","text":"...And by “us,” I of course mean you and me, <span class=\"highlight\">Forename</span>! We require your powers of persuasion as a person of Etheirys."},{"name":"DREAMINGWAY","text":"Oooh, that is one dilapidated supporter! We must have found the right Loporrit."},{"name":"DREAMINGWAY","text":"Pardon me─are you Repairingway?"},{"name":"REPAIRINGWAY","text":"That I am. And you are...?"},{"name":"DREAMINGWAY","text":"I'm Dreamingway, and this is the illustrious <span class=\"highlight\">Forename</span>! We're here to invite you to join a project of utmost import."},{"name":"REPAIRINGWAY","text":"Oh? And what would that be?"},{"name":"REPAIRINGWAY","text":"...Yes, I can see why that problem sorely needs fixing. I can't reach half the mechanisms in Bestways Burrow for melancholy Loporrits draping themselves about."},{"name":"REPAIRINGWAY","text":"Even so, my paws are quite full, I'm afraid. Should I be derelict in my repair duties, we'll be even shorter on supporters than we already are. Or the moon will go flying off into the great expanse, and then where would we be?"},{"name":"DREAMINGWAY","text":"Good point. I should hate to inconvenience everyone by hurling us out into the cosmos..."},{"name":"REPAIRINGWAY","text":"I can recommend someone with similar talents, however. His name is Inventingway, and he is quite mechanically inclined."},{"name":"DREAMINGWAY","text":"And you think he would be willing to assist?"},{"name":"REPAIRINGWAY","text":"Oh my, yes. He has been more than happy to help in the past. I would call upon him more often, in fact, if only his repairs weren't so...experimental."},{"name":"REPAIRINGWAY","text":"In any case, you need only say that your project will allow him to work with machines, and he shall doubtless agree without any further consideration."},{"name":"REPAIRINGWAY","text":"I'm certain he would be happier experimenting freely in your workshop than operating within the confines of practicality out here."},{"name":"REPAIRINGWAY","text":"Why, just the other day I asked him to repair one of our carrot creation stations, and next I knew, the thing had sprouted limbs and was dancing about to “improve sprinkler efficacy”..."},{"name":"DREAMINGWAY","text":"He certainly sounds like my kind of Loporrit! Do you know where we might find him now?"},{"name":"REPAIRINGWAY","text":"To the north of here, perhaps? I've noticed that he enjoys gazing out upon the machinery while he considers his next harebrained schematic."},{"name":"DREAMINGWAY","text":"Thank you ever so much for your assistance! Oh, and best of luck with the repairs."},{"name":"INVENTINGWAY","text":"(A potential client...? Be calm, Inventingway. Temper your enthusiasm. Temper...it... &lt;wheeze&gt;)"},{"name":"REPAIRINGWAY","text":"I do hope Inventingway finds his place with you. He means well, I'm relatively certain."},{"name":"DREAMINGWAY","text":"Well met! Are you Inventingway?"},{"name":"INVENTINGWAY","text":"Wh-Who's asking!? ...That is to say, how may I help you?"},{"name":"DREAMINGWAY","text":"Repairingway told us that you might be willing to join us in Hoper's Hold. You see..."},{"name":"INVENTINGWAY","text":"Sweet Mother Hydaelyn! I thought you were here with a repair job, but you're saying that I can make any machine I dream up?"},{"name":"DREAMINGWAY","text":"Essentially, yes."},{"name":"INVENTINGWAY","text":"Anything I can dream of, huh..."},{"name":"INVENTINGWAY","text":"This is the greatest day of my life!!!"},{"name":"INVENTINGWAY","text":"...That is to say, I would be delighted to join you. I enjoy working on machines a normal amount!"},{"name":"INVENTINGWAY","text":"It was I who invented the supporters, in fact. Granted, I didn't anticipate that your people would turn out to be so small, which inevitably resulted in the supporters identifying them as unauthorized organisms and initializing their “murderous rampage” sequences..."},{"name":"INVENTINGWAY","text":"...But I <span class=\"emphasis\">wanted</span> to fix that! If I had been given the chance, I know I could have. Project management, though, wanted to “go another way.”"},{"name":"INVENTINGWAY","text":"Repairingway's offered a few odd jobs to keep me occupied while I look for a new role, but I think my innovative take on carrot cultivation may have been the last straw..."},{"name":"INVENTINGWAY","text":"Which is why I am truly grateful for a position where I can be myself! How can I possibly thank you, er..."},{"name":"DREAMINGWAY","text":"Dreamingway! And no thanks necessary─I only hope you'll do your best to share your dream with our fellow Loporrits."},{"name":"INVENTINGWAY","text":"You bet I will! I'll share like no one has ever shared before, and then they'll see! <span class=\"emphasis\">They'll all see</span>!"},{"name":"INVENTINGWAY","text":"...That is to say, I look forward to working with you. I have a number of large projects in mind, so I may bring along a few friends with time on their paws, and..."},{"name":"INVENTINGWAY","text":"&lt;gasp&gt; NOOOOOO!"},{"name":"INVENTINGWAY","text":"Where ever am I going to find a pneumatic saw? All my best tools were reappropriated when I was dismissed from my position..."},{"name":"DREAMINGWAY","text":"Why don't you come back to the Dreaming Workshop and discuss it with Managingway? They have a way of finding what we need."},{"name":"INVENTINGWAY","text":"That's good, because I need a great many things."},{"name":"DREAMINGWAY","text":"We'll be setting up a whole new station, so please come and find us in Hoper's Hold when you have a chance."},{"name":"INVENTINGWAY","text":"Bugger me! And here I always thought this was a closet!"},{"name":"SUPPORTER","text":"Greetings! If you require direction, please speak with Dreamingway. &lt;blip&gt; Today's automatically generated suggestion is: Crater Sledding!"},{"name":"DREAMINGWAY","text":"Welcome back! As expected, Managingway turned Inventingway's requests into a tidy and particular list, then hopped off to oversee their procurement."},{"name":"DREAMINGWAY","text":"They did mention something that they would like you to prepare. Er, what was it again...?"},{"name":"DREAMINGWAY","text":"Ah, yes! “Ahem! Tools suitable for tuning machines large and small. Extra durable, in case Inventingway's enthusiasm gets the best of him.”"},{"name":"DREAMINGWAY","text":"Ah, yes! “Ahem! Insulation suitable for preventing any unwanted shocks or conflagrations.”"},{"name":"DREAMINGWAY","text":"Ah, yes! “Ahem! Machine oil that passing Loporrits will not mistake for a refreshing beverage.”"},{"name":"DREAMINGWAY","text":"That seems simple enough, doesn't it? They even provided the necessary materials."},{"name":"DREAMINGWAY","text":"If you run out, of course, feel free to ask the dreaming supporter for more!"},{"name":"DREAMINGWAY","text":"We stocked the dreaming supporter with extra supplies, but please do take only as much as you need. Coiningway says our budget margins are rather starved at present, the poor things."},{"name":"DREAMINGWAY","text":"We stocked the dreaming supporter with extra supplies, but please do take only as much as you need. Coiningway says our budget margins are rather starved at present, the poor things."},{"name":"DREAMINGWAY","text":"We stocked the dreaming supporter with extra supplies, but please do take only as much as you need. Coiningway says our budget margins are rather starved at present, the poor things."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Oh dear! It appears that sufficient supplies are in your possession. Project management gently reminds you that all materials must be used before more are provided."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Oh dear! It appears that sufficient supplies are in your possession. Project management gently reminds you that all materials must be used before more are provided."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Oh dear! It appears that sufficient supplies are in your possession. Project management gently reminds you that all materials must be used before more are provided."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Here you are─may all your digits remain intact!"},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Here you are─may all your digits remain intact!"},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Here you are─may all your digits remain intact!"},{"name":"DREAMINGWAY","text":"I do hope you enjoyed crafting those items! If you're satisfied with what you've made, I can take them off your paws."},{"name":"DREAMINGWAY","text":"Good heavens, such fine quality! Have you ever thought about changing your name to “Craftingway”?"},{"name":"DREAMINGWAY","text":"I'll leave you to think about that while I get Inventingway set up. No doubt he is itching to astound us with his creations!"},{"name":"DREAMINGWAY","text":"Oooh, I'm astounded! Also confounded─but mostly astounded!"},{"name":"INVENTINGWAY","text":"Rest assured that this was merely the warm-up before the sprint! Ah, my mind races with ideas..."},{"name":"MANAGINGWAY","text":"They certainly are...unique. I daresay even I would struggle to find a use for most of these─but as we never specified you do aught but live your dream, I suppose it's only fair to rate your performance “above average.”"},{"name":"INVENTINGWAY","text":"And here they come─my disciples! Gaze upon these machines and let the inspiration flow through you!"},{"name":"MANAGINGWAY","text":"Welcome to the Dreaming Workshop! If anyone would like to try their paw at the dreams we have on display, please do inquire about our free trials!"},{"name":"TALKINGWAY","text":"(-???-)And now useless machines. Is it not enough that we have no use ourselves?"},{"name":"TALKINGWAY","text":"(-???-)Hmmm... If I can use this ironic display to demonstrate the depths of our irrelevance, my petition to reactivate the hibernation stations may at last be approved."},{"name":"TALKINGWAY","text":"(-???-)...Struggle to your hearts' content, my friends. Show us the meaning of futility."},{"name":"MANAGINGWAY","text":"Who was that?"},{"name":"DREAMINGWAY","text":"Someone who's not interested in the machining station, it seems. But we have plenty of Loporrits who are, and that's what matters!"},{"name":"DREAMINGWAY","text":"If we continue to draw such enthusiastic crowds to each station we build, everyone will have their own dream in no time!"},{"name":"SYSTEM","text":"The Dreaming Workshop is now home to a brand-new machining station, and many technological wonders besides. There is much yet to be done, however, if each Loporrit is to find new purpose. Continue expanding the workshop to see what dreams may come!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Trusted</span> reputation with the Dreaming Ways."},{"name":"SYSTEM","text":"You may raise their faith in you further by continuing to assist with the Dreaming Workshop."},{"name":"SYSTEM","text":"New Loporrit tribal daily quests are now available from Managingway in Hoper's Hold."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Managingway as a reputation bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Managingway. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from Coiningway."}],"reward":{"gil":1055},"reqs":{"beastrank":3,"jobs":[{"lvl":80,"id":33}],"quests":[70217]},"next":[70219]},"partials":[{"type":"npc","id":"1044402","obj":{"i":1044402,"n":"Dreamingway","l":3711,"q":5}},{"type":"npc","id":"1044928","obj":{"i":1044928,"n":"Dreamingway","l":3711,"q":1}},{"type":"item","id":"38844","obj":{"i":38844,"n":"Machining Supply Materials","l":1,"c":26001,"t":61}},{"type":"item","id":"38845","obj":{"i":38845,"n":"Machining Supplies","l":430,"c":21012,"t":61}},{"type":"quest","id":"70217","obj":{"i":70217,"n":"Must Be Dreaming(way)","g":28,"l":"Old Sharlayan","s":1,"f":1}},{"type":"quest","id":"70219","obj":{"i":70219,"n":"Too Few Cooks","g":28,"l":"Mare Lamentorum","s":3,"f":1}}]}