{"quest":{"name":"Desires Untold","location":"Thavnair","id":70213,"patch":6.3,"sort":645,"icon":101229,"eventIcon":71201,"issuer":1037646,"target":1044291,"genre":12,"journal":["Now apprised of the situation, Nahbdeen is eager to take action.","As Nahbdeen resolves to instruct the people to seek shelter, you offer to investigate Khadga, where the fiend that arose from the Bhaflau remnants is believed to be. Grateful for the help, the Radiant commander suggests that you speak with the quarry workers at the Giantsgall Grounds, which is situated at Khadga's base. Apparently, a man named Qetanur is likely to know one of the paths to the summit.","According to Qetanur, a rockslide may have rendered the primary path nigh impassable. Thankfully, one of his fellow quarry workers, Sramul, is said to climb like a langur, and may know an alternate route.","Though initially reluctant to send you headlong into danger, Sramul shows you an alternate trail that leads to the mountaintop. And so you begin your climb to ascertain who or what has made its nest atop Khadga.","At the summit of Khadga, you come face to face with the archfiend of fire, Rubicante. While the coming battle promises to be difficult, you can but hope that victory will bring you one step closer to uncovering Golbez's scheme.<br><br>※Mount Ordeals can be accessed via the Duty Finder. ","Rubicante rains fire upon you and your comrades, but his flame soon flickers and fails. Battered and beaten, the archfiend offers to tell you his lord's grand design, confident that the knowledge will not change the outcome.","Golbez is intent on invading the Source, that the denizens of the void may be granted true death and return to the Lifestream. The revelation rattles Zero, who chastises the archfiend for his methods in pursuit of release. For pride and honor, Rubicante then reveals where Golbez and Azdaja may be found: on the moon of the Thirteenth.","Though she understands Rubicante's motivations, it remains to be seen if Golbez is driven by a similar hunger. Indeed, with his dying breath, Rubicante suggested that his lord harbors a desire all his own... Regardless, Zero believes there is a better way forward, a future she hopes to one day see made reality. "],"objectives":["Speak with Qetanur at the Giantsgall Grounds.","Speak with Sramul.","Confront Rubicante at Mount Ordeals.","Speak with Zero."],"dialogue":[{"name":"NAHBDEEN","text":"Confound it. We were so concerned with the explosion that we failed to recognize that the threat had not yet passed!"},{"name":"NAHBDEEN","text":"We must alert command at once and instruct the people to seek shelter."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Is there a way to the top of Khadga?"},{"name":"A1","text":"I'll go and see if the fiend is indeed there."},{"name":"NAHBDEEN","text":"What? You mean to go there to investigate!?"},{"name":"NAHBDEEN","text":"But there is no telling what manner of enemy this may be!"},{"name":"NAHBDEEN","text":"Then again...you are more than capable of defending yourself... As you wish. We will leave this in your hands."},{"name":"NAHBDEEN","text":"The Giantsgall Grounds are situated at the base of Khadga. I myself am not familiar with the mountain paths, but the quarry workers are bound to know many."},{"name":"NAHBDEEN","text":"Qetanur, for instance─he has worked there the longest. Go well, my friend, and may the Sisters keep you."},{"name":"NAHBDEEN","text":"If someone can tell you how to scale Khadga, it will be Qetanur. Seek him out at the Giantsgall Grounds."},{"name":"QETANUR","text":"You want to climb Khadga!? You couldn't have chosen a worse time..."},{"name":"QETANUR","text":"There was an earthquake earlier, and it triggered a rockslide. I'm afraid the main path to the summit may be blocked."},{"name":"QETANUR","text":"But if you're determined to go, then I suggest you speak with Sramul. He climbs like a langur, and might know some other way up, if not the gentlest."},{"name":"QETANUR","text":"If you commit to climbing Khadga, take care not to slip. Most routes were treacherous before, and I don't dare to imagine how they are now."},{"name":"NAHBDEEN","text":"I thank you for your offer of help. I pray the Sisters speed your way to the summit─and keep you safe from whatever you find there."},{"name":"SRAMUL","text":"How to reach the top of Khadga!? After what has happened, that should be the last place anyone sane would want to be..."},{"name":"SRAMUL","text":"But yes, I am familiar with another route that should still be passable. I was once afraid of heights, you see, and used it to build up my courage."},{"name":"SRAMUL","text":"Though I cannot say I have the courage to brave it under these conditions! I'll take you to where the route starts, but no further, all right?"},{"name":"Q2","text":"Proceed to Khadga?"},{"name":"SRAMUL","text":"I can show you where my route to the top of Khadga begins, but you'll have to head up there on your own. Some may call me a coward, but they will not call me a fool."},{"name":"Q2","text":"Proceed to Khadga?"},{"name":"FIREMONOLITH","text":"Masked. Report if displayed."},{"name":"MYSTERIOUSPERSON","text":"My inquiries delayed me. I'm not accustomed to conversation."},{"name":"MYSTERIOUSPERSON","text":"But I'm glad I arrived in time to speak with Rubicante..."},{"name":"MYSTERIOUSPERSON","text":"As much as I understand his motives, I believe there's a better way─yours."},{"name":"MYSTERIOUSPERSON","text":"The future you strive for is one I wish to see."},{"name":"MYSTERIOUSPERSON","text":"And I want to know why I feel this way. Why this fire burns in my breast."}],"reward":{"gil":4235,"items":[{"id":33918,"one":1},{"id":33919,"one":1},{"id":33920,"one":1}],"instance":20086},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70212]},"next":[70214]},"partials":[{"type":"npc","id":"1037646","obj":{"i":1037646,"n":"Nahbdeen","l":3709,"q":2}},{"type":"npc","id":"1044291","obj":{"i":1044291,"n":"Zero","l":3709,"q":2}},{"type":"item","id":"33918","obj":{"i":33918,"n":"Heavens' Eye Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"33919","obj":{"i":33919,"n":"Savage Aim Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Critical Hit","category":0}}},{"type":"item","id":"33920","obj":{"i":33920,"n":"Savage Might Materia IX","l":560,"c":20284,"t":58,"materia":{"tier":8,"value":12,"attr":"Determination","category":0}}},{"type":"instance","id":"20086","obj":{"i":20086,"n":"Mount Ordeals","c":61804,"t":"Trials","min_lvl":90,"max_lvl":90,"min_ilvl":595}},{"type":"quest","id":"70212","obj":{"i":70212,"n":"Paths Barred","g":12,"l":"Garlemald","s":644}},{"type":"quest","id":"70214","obj":{"i":70214,"n":"Gods Revel, Lands Tremble","g":12,"l":"Thavnair","s":646}}]}