{"quest":{"name":"Gods Revel, Lands Tremble","location":"Thavnair","id":70214,"patch":6.3,"sort":646,"icon":101230,"eventIcon":71201,"issuer":1044291,"target":1039645,"genre":12,"journal":["Zero is already contemplating your next move.","Now that the embers have settled on Khadga, Zero suggests returning to Meghaduta. There is much to discuss with your comrades.","Estinien suspects Golbez is desperate for time to carry out his plans without interference, meaning it is imperative you find a way back to the void as quickly as possible. Wishing to explore alternative methods of crossing the rift, Y'shtola departs to Sharlayan to carry out her research. Estinien, meanwhile, intends to find productive ways to occupy his time, as should you.","Varshahn thanks you once more for all you have done to aid in his search for Azdaja. Until such time as Y'shtola returns, he bids you rest and prepare, for an arduous journey awaits when next you venture unto the void."],"objectives":["Speak with the accommodating official outside Meghaduta.","Speak with Varshahn."],"dialogue":[{"name":"MYSTERIOUSPERSON","text":"There's nothing more for us here. What of Alzadaal's Legacy? Has there been word from Y'shtola and the others?"},{"name":"MYSTERIOUSPERSON","text":"I see... Frustrating, perhaps, but better that the gate be destroyed than used to unleash more voidsent."},{"name":"MYSTERIOUSPERSON","text":"We should return to Meghaduta and rejoin the others."},{"name":"MYSTERIOUSPERSON","text":"It seems the others are already inside. Let's join them."},{"name":"OFFICIAL04535","text":"It is good to see you both returned hale and whole."},{"name":"OFFICIAL04535","text":"Your friends arrived not long ago, and are already with the satrap. Shall I show you in?"},{"name":"SYSTEM","text":"Enter Meghaduta?"},{"name":"VARSHAHN","text":"Before you leave, I would once more express my gratitude."},{"name":"VARSHAHN","text":"By your hand has Thavnair been saved yet again."},{"name":"VARSHAHN","text":"But before you delivered my people, you helped me rediscover hope. When the sight of my sister's eye left me bereft and adrift for a time."},{"name":"VARSHAHN","text":"We may have lost the gate in Alzadaal's Legacy, but there must be another way to travel to the void. And together, we will find it."},{"name":"VARSHAHN","text":"For now, I bid you rest and recover your strength. I, too, shall have my vessel improved ahead of our next foray."},{"name":"VARSHAHN","text":"To achieve his ends, Golbez has sacrificed his four generals. Such a ruthless foe is unpredictable in the extreme. But no matter what he plots, we shall do our utmost to see that he does not succeed."},{"name":"SYSTEM","text":"Meanwhile, on the moon in the Thirteenth..."}],"reward":{"gil":1274},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70213]},"next":[70197]},"partials":[{"type":"npc","id":"1044291","obj":{"i":1044291,"n":"Zero","l":3709,"q":2}},{"type":"npc","id":"1039645","obj":{"i":1039645,"n":"Varshahn","l":3707,"q":5}},{"type":"quest","id":"70213","obj":{"i":70213,"n":"Desires Untold","g":12,"l":"Thavnair","s":645}},{"type":"quest","id":"70197","obj":{"i":70197,"n":"Shadowed Pasts Once More","g":67,"l":"Radz-at-Han","s":20}}]}