{"quest":{"name":"Too Few Cooks","location":"Mare Lamentorum","id":70219,"patch":6.35,"sort":3,"icon":101223,"beast":17,"unlocksFunction":1,"eventIcon":71341,"issuer":1044402,"target":1044937,"genre":28,"usedItems":[38846,38847],"journal":["Dreamingway is practically vibrating with enthusiasm.<br>※The difficulty of this quest will be synced to your current level.","Hopes bolstered by the success of the machining station, Dreamingway is eager to continue expanding the dreams on offer, and Managingway naturally has detailed thoughts on potential next steps. They suggest cooking as a dream unlikely to have occurred to many a Loporrit before─though due to this population-wide dearth of culinary expertise, the new station must needs be manned by Cookingway, or no one at all. With that in mind, you and Dreamingway set out for Old Sharlayan, where the Loporrit chef has been continuing his studies into Etheirys's cuisine of late.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You join Dreamingway at your pre-arranged meeting spot in Old Sharlayan's aetheryte plaza before any knee-based harm comes to him. In the name of efficiency, you and your companion first resolve to determine where in the city Loporrits have recently been sighted ere you guess at Cookingway's whereabouts.","You speak with several Sharlayans, and it transpires that not one, but two Loporrits have been in the area recently. One is quickly identified due to overwhelming pudding-related evidence, but another was sighted heading for the Studium─possibly in search of recipes─and may be the Way you seek.","A search of Phenomenon confirms that the aforementioned Loporrit was indeed Cookingway. Though he was unaware of his fellows' plight until this very moment, he feels an immediate call to assist them, and readily agrees to operate a cooking station in Hoper's Hold. As the residents of Bestways Burrow typically plate whole carrots─if, indeed, the carrot gets that far─and gnaw upon them directly, however, place settings and utensils will be required.","At Cookingway's suggestion, you inquire with Dickon at the Last Stand about the accoutrements necessary for serving proper cuisine. He provides you with a robust list to deliver to Managingway, noting that he himself would love to partake of lunar fare should the opportunity arise.","Back in Hoper's Hold, you inquire with Dreamingway as to your part in setting up the cooking station. He duly conveys Managingway's instructions as to what you are to create, and sends you off with the necessary materials and a reminder that more can be had from the dreaming supporter.","Having created restaurant supplies of Loporrit proportions, you make your delivery to Dreamingway so that the cooking can begin. Soon, a wide array of dishes is laid out before you, attracting passersby with delicious aromas. With such bold flavor horizons now open to them, many a Way is sure to stumble upon new aspirations."],"objectives":["Speak with Dreamingway in Old Sharlayan and have him accompany you.","Speak with the people of Old Sharlayan while accompanied by Dreamingway.","Speak with Cookingway while accompanied by Dreamingway.","Speak with Dickon.","Speak with Dreamingway in Hoper's Hold.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Dreamingway</span></span>."],"dialogue":[{"name":"DREAMINGWAY","text":"The machining station has surpassed our wildest imaginings! What <span class=\"emphasis\">are</span> those things?"},{"name":"DREAMINGWAY","text":"Mechanical mysteries aside, we've gathered a good crowd. Yet I know we can do more. I feel it in my ears!"},{"name":"DREAMINGWAY","text":"I asked the others if they had any ideas, and apparently, Managingway has it all planned out."},{"name":"DREAMINGWAY","text":"Managingway, can you share your thoughts with <span class=\"highlight\">Forename</span>?"},{"name":"MANAGINGWAY","text":"Certainly. Ahem! Consider, if you will, the traditional Loporrit diet─carrots, carrots, and more carrots. Many of us, myself included, have in fact subsided <span class=\"emphasis\">exclusively</span> on carrots."},{"name":"MANAGINGWAY","text":"Contact with the people of Etheirys, however, has revealed a whole world of non-carrot foodstuffs, in addition to fascinating trades and traditions entirely centered around food."},{"name":"MANAGINGWAY","text":"If a Loporrit's heart harbored a secret passion for such cuisine, how would they know? They would not─until they visited our one-of-a-kind cooking station, that is."},{"name":"DREAMINGWAY","text":"A delicious idea, is it not? ...I'm genuinely asking─I too have eaten naught but carrots, you see."},{"name":"MANAGINGWAY","text":"And thus we arrive at our primary issue─staffing. There are few Loporrits with sufficient knowledge of cuisine..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"What about Puddingway? He's certainly...enthusiastic."},{"name":"A1","text":"I know a cooking Way─Cookingway."},{"name":"MANAGINGWAY","text":"Oh, no. Oh, no no no. Hoper's Hold would be stuffed to the brim with pudding before the day is out! The acoustics would be <span class=\"emphasis\">dreadful</span>─and I doubt Inventingway's machines are pudding-proof."},{"name":"DREAMINGWAY","text":"Perhaps we should ask Cookingway after all. There truly is no better Loporrit for the job!"},{"name":"MANAGINGWAY","text":"He does seem to be the natural choice, doesn't he?"},{"name":"MANAGINGWAY","text":"Unfortunately, he's currently studying with the Sharlayans. We would need to coax him back to the moon if he is to work with us."},{"name":"DREAMINGWAY","text":"Perhaps he won't need coaxing! We won't know until we try!"},{"name":"DREAMINGWAY","text":"...Though I don't fancy wandering through the city by myself again, what with the gleaners running to and fro. They never watch where they're swinging those pointy knees of theirs. Please, would you come and protect me from the knees?"},{"name":"DREAMINGWAY","text":"I am in your debt! Together we shall brave the fearsome aetheryte plaza..."},{"name":"DREAMINGWAY","text":"All those people... All those knees... But we must approach if we are to inquire as to Cookingway's whereabouts!"},{"name":"DREAMINGWAY","text":"Not that the folk of Etheirys are terribly good at telling us Loporrits apart. Hmmm..."},{"name":"DREAMINGWAY","text":"Perhaps we can begin by simply asking if they've seen any Loporrits about. Aside from me, that is. Shall we?"},{"name":"SYSTEM","text":"Dreamingway is now accompanying you. Keep him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave Dreamingway behind by entering a different area, or by speaking with him and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have Dreamingway join you again, return and speak with him at the original location."},{"name":"Q2","text":"What will you do?"},{"name":"A2","text":"Talk."},{"name":"A2","text":"Part ways with Dreamingway."},{"name":"A2","text":"Nothing."},{"name":"DREAMINGWAY","text":"I see why your tours of Etheirys come so highly recommended! My fear of becoming hopelessly lost or trampled has fallen at least fifty percent with you by my side."},{"name":"DREAMINGWAY","text":"Quick, to the Studium! Wherever that is!"},{"name":"A2","text":"<span class=\"highlight\">Discuss the Rostra.</span>"},{"name":"DREAMINGWAY","text":"Gazing at it from the faraway moon, we always imagined Etheirys to be the most beautiful place..."},{"name":"DREAMINGWAY","text":"And truly, it is. I'm glad it's still here."},{"name":"A2","text":"<span class=\"highlight\">Discuss the Agora.</span>"},{"name":"DREAMINGWAY","text":"Seeing so many shops lined up, I can't help but feel excited─who knows what's in store?"},{"name":"DREAMINGWAY","text":"We wanted the other Loporrits to experience that same sense of anticipation, so Managingway and I used this place as a reference for the Dreaming Workshop. Can you tell?"},{"name":"Q3","text":"Are you sure you wish to part ways with Dreamingway?"},{"name":"DREAMINGWAY","text":"Oh, did you have a personal matter to take care of? All right! I'll go and stand very still in the aetheryte plaza until you get back."},{"name":"DREAMINGWAY","text":"Standing very still suited me far better than becoming hopelessly lost! Shall we continue our search now?"},{"name":"DREAMINGWAY","text":"Standing very still suited me far better than becoming hopelessly lost! Shall we continue our search now?"},{"name":"SYSTEM","text":"You must be accompanied by Dreamingway and have him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"Dreamingway has yet to arrive. Be sure he is at your side before attempting to continue."},{"name":"CITIZENA04683","text":"Loporrits? I have seen a few in passing, though I have not yet had the pleasure of speaking with any."},{"name":"CITIZENA04683","text":"Loporrits? Yes, I do recall seeing a few of your kin earlier this <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">afternoon</span></span>."},{"name":"CITIZENA04683","text":"One appeared to be off to the Last Stand, while the other was walking toward the Studium."},{"name":"DREAMINGWAY","text":"Sharlayans truly are as knowledgeable as they say! Thank you, good sir!"},{"name":"CITIZENB04683","text":"What adorable little creatures those Loporrits are. Is it acceptable to ruffle their fur, I wonder..."},{"name":"CITIZENB04683","text":"I did see a Loporrit not long ago, in fact. They were watching diners at the Last Stand and muttering something about..."},{"name":"CITIZENB04683","text":"...Pudding? Yes, I could have sworn they were murmuring, “How's the pudding?” Most peculiar."},{"name":"DREAMINGWAY","text":"Hmmm... I have a sneaking suspicion that your mystery mutterer is not the Loporrit we're looking for, but I appreciate the information nevertheless!"},{"name":"CITIZENC04683","text":"What a lovely breeze we're having!"},{"name":"CITIZENC04683","text":"Oh, another Loporrit! This must be my lucky day!"},{"name":"CITIZENC04683","text":"I was indeed just speaking with one of your kind about his research into Far Eastern recipes─a particular interest of mine. I must say, that fellow has good taste."},{"name":"DREAMINGWAY","text":"Recipes, you say? Why, that must have been Cookingway! Do you happen to know where he went?"},{"name":"CITIZENC04683","text":"Not precisely, though he headed off toward the west side of town. Perhaps he went to research more recipes."},{"name":"DREAMINGWAY","text":"In any case, your assistance in this matter has been greatly appreciated!"},{"name":"DREAMINGWAY","text":"Based on what we've gleaned thus far, I believe the unidentified Loporrit headed for the Studium is most likely our Cookingway. In which case, we shall be right on his tail!"},{"name":"CITIZENA04683","text":"I assume the fellow headed for the Last Stand was planning on a meal, and the one approaching the Studium was engaged in research of some kind. Though for all I know, it could be the opposite."},{"name":"CITIZENB04683","text":"...Is there something in the pudding that I should be aware of?"},{"name":"CITIZENC04683","text":"I do hope that little fellow finds the recipes he's searching for!"},{"name":"COOKINGWAY","text":"Why, if it isn't <span class=\"highlight\">Forename</span>! You're well, I hope?"},{"name":"DREAMINGWAY","text":"Salutations, Cookingway!"},{"name":"COOKINGWAY","text":"Dreamingway, is that you?"},{"name":"COOKINGWAY","text":"What happened to your clothing? It's very...yellow."},{"name":"DREAMINGWAY","text":"Well, since you asked..."},{"name":"COOKINGWAY","text":"Heavens! I had no idea that our fellow Loporrits were in such dire straits."},{"name":"COOKINGWAY","text":"It's only right that I do what I can to help them."},{"name":"COOKINGWAY","text":"...And I must admit that I'm eager to test the many recipes I have learned here on Etheirys."},{"name":"COOKINGWAY","text":"I know I've been a bit fixated upon carrots in the past, but I'm a changed Loporrit now. There's a whole world of flavor out there, and it's time that we brought it to Bestways Burrow!"},{"name":"DREAMINGWAY","text":"Huzzah! Flavor!"},{"name":"COOKINGWAY","text":"Of course, I will need a kitchen..."},{"name":"COOKINGWAY","text":"I can provide my own pots and pans, but I would appreciate your assistance with dishes and utensils. Most of Etheirys's cuisine is not so conducive to gnawing as one might expect."},{"name":"DREAMINGWAY","text":"Leave it to us! I saw a “chop stick” once!"},{"name":"COOKINGWAY","text":"Yes, about that... It would probably be best for you to consult Master Dickon at the Last Stand about the details. He'll show you what you'll need to prepare, and in what quantities."},{"name":"COOKINGWAY","text":"Meanwhile, I shall return to the burrow and begin preparing my kitchen. There is much to be done!"},{"name":"DREAMINGWAY","text":"Thank heavens he agreed!"},{"name":"DREAMINGWAY","text":"Let's go and speak with this “Master Dickon.” I imagine that you have a rough idea of what utensils are, but it never hurts to get a second opinion."},{"name":"DICKON","text":"Well, if it isn't my favorite temporary server."},{"name":"DICKON","text":"...And I see you've brought one of the cute little moon fellows, too."},{"name":"DICKON","text":"Tableware for the Loporrits? Well, why not?"},{"name":"DICKON","text":"You'll need dishes and bowls, of course, some cutlery...perhaps tablecloths and mats as well. One moment─I'll make a list."},{"name":"DICKON","text":"This should be everything."},{"name":"DREAMINGWAY","text":"Thank you very much!"},{"name":"DICKON","text":"Don't mention it─just save a place for me. I'll get up there one of these days..."},{"name":"DREAMINGWAY","text":"Please do! I'll even send you a proper invitation once we're operational."},{"name":"DREAMINGWAY","text":"Speaking of which─it's time we returned to Hoper's Hold. Those sticks won't chop themselves!"},{"name":"DICKON","text":"I hope your friend's as good as his word─I'd love to try lunar cuisine."},{"name":"COOKINGWAY","text":"Huh. I always thought this was a cupboard."},{"name":"SUPPORTER","text":"Greetings! If you require direction, please speak with Dreamingway. &lt;blip&gt; Today's automatically generated suggestion is: Treant Trimming!"},{"name":"DREAMINGWAY","text":"Ah, there you are! I turned Master Dickon's list over to Managingway, of course, so preparations are well underway."},{"name":"DREAMINGWAY","text":"They did ask me to ask <span class=\"emphasis\">you</span> to craft a few things though, if you don't mind."},{"name":"DREAMINGWAY","text":"Specifically─metal cutlery! Oh, how exciting."},{"name":"DREAMINGWAY","text":"Specifically─fancy table mats! Oh, how exciting."},{"name":"DREAMINGWAY","text":"Specifically─gentle dish soaps! Oh, how exciting."},{"name":"DREAMINGWAY","text":"I have the necessary supplies here, so you can set to work straightaway."},{"name":"DREAMINGWAY","text":"As always, we've stocked the dreaming supporter with surplus supplies, so feel free to ask for more in case of unforeseen misfortune! If I had a carat for every time I've accidentally hopped too hard on one of our components..."},{"name":"DREAMINGWAY","text":"Got a bit carried away with the materials, did you? Yes, I quite understand. The dreaming supporter can provide you with replacements."},{"name":"DREAMINGWAY","text":"Got a bit carried away with the materials, did you? Yes, I quite understand. The dreaming supporter can provide you with replacements."},{"name":"DREAMINGWAY","text":"Got a bit carried away with the materials, did you? Yes, I quite understand. The dreaming supporter can provide you with replacements."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Oh dear! It appears that sufficient supplies are in your possession. Project management once again reminds you that all materials must be used before more are provided."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Oh dear! It appears that sufficient supplies are in your possession. Project management once again reminds you that all materials must be used before more are provided."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Oh dear! It appears that sufficient supplies are in your possession. Project management once again reminds you that all materials must be used before more are provided."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Here you are─may your synthesis be finished well in time for supper!"},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Here you are─may your synthesis be finished well in time for supper!"},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Here you are─may your synthesis be finished well in time for supper!"},{"name":"DREAMINGWAY","text":"<span class=\"highlight\">Forename</span>! I trust your work went to plan─Managingway's plan, that is."},{"name":"DREAMINGWAY","text":"Oh, is <span class=\"emphasis\">that</span> what those are supposed to look like? Fascinating..."},{"name":"DREAMINGWAY","text":"Cookingway has already arranged his kitchen according to his <span class=\"emphasis\">very</span> exacting preferences, so we should have everything we need to get started. I hope you worked up an appetite!"},{"name":"DREAMINGWAY","text":"Feast your eyes on the cooking station! Mmm... What shall we eat first?"},{"name":"COOKINGWAY","text":"Welcome! Do taste as many dishes as you like─each recipe has been prepared with loving care. If you have any questions about the flavors or techniques involved, I should be more than happy to instruct you."},{"name":"DREAMINGWAY","text":"I remember that Loporrit!"},{"name":"DREAMINGWAY","text":"I should like to speak with them, but they're always running off..."},{"name":"SYSTEM","text":"The cooking station is now open, servicing the hungry Loporrits of Hoper's Hold and beyond. There is much yet to be done, however, if each is to find new purpose. Continue expanding the workshop to see what dreams may come!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Respected</span> reputation with the Dreaming Ways."},{"name":"SYSTEM","text":"You may raise their faith in you further by continuing to assist with the Dreaming Workshop."},{"name":"SYSTEM","text":"New Loporrit tribal daily quests are now available from Managingway in Hoper's Hold."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Managingway as a reputation bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Managingway. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from Coiningway."}],"reward":{"gil":1215,"items":[{"num":3,"id":37282}]},"reqs":{"beastrank":4,"jobs":[{"lvl":80,"id":33}],"quests":[70218]},"next":[70220]},"partials":[{"type":"npc","id":"1044402","obj":{"i":1044402,"n":"Dreamingway","l":3711,"q":5}},{"type":"npc","id":"1044937","obj":{"i":1044937,"n":"Dreamingway","l":3711,"q":1}},{"type":"item","id":"37282","obj":{"i":37282,"n":"Calamari Ripieni","l":590,"c":24331,"t":46}},{"type":"item","id":"38846","obj":{"i":38846,"n":"Restaurant-grade Supply Materials","l":1,"c":26001,"t":61}},{"type":"item","id":"38847","obj":{"i":38847,"n":"Restaurant-grade Supplies","l":430,"c":21012,"t":61}},{"type":"quest","id":"70218","obj":{"i":70218,"n":"The Incredible Machines","g":28,"l":"Mare Lamentorum","s":2,"f":1}},{"type":"quest","id":"70220","obj":{"i":70220,"n":"Teamwork Makes the Dream Work","g":28,"l":"Mare Lamentorum","s":4,"f":1}}]}