{"quest":{"name":"A Dragon's Resolve","location":"Lapis Manalis","id":70211,"patch":6.3,"sort":643,"eventIcon":71201,"issuer":1044271,"target":1044284,"genre":12,"journal":["Varshahn stares at the floor despondently."],"objectives":["Speak with Alphinaud.","Search for a leakproof container.","Fill the leakproof container with ceruleum at the ceruleum spring.","Deliver the ceruleum-filled tank to the designated location.","Wait at the designated location.","Speak with Alphinaud."],"dialogue":[{"name":"YSHTOLA","text":"If Cagnazzo's intent was for his parting words to give us pause, then he has succeeded."},{"name":"YSHTOLA","text":"To embrace death, to find satisfaction in oblivion... Perhaps it is indeed true that many voidsent yearn to return to the Lifestream."},{"name":"MYSTERIOUSPERSON","text":"Why does he look so defeated? We are closer to finding his sister, are we not?"},{"name":"ESTINIEN","text":"The eye explains <span class=\"emphasis\">how</span> they managed to cross over, but we still don't know <span class=\"emphasis\">why</span> they chose this time and this place for an incursion."},{"name":"ENGINEER04671","text":"Looking to head back to Lapis Manalis? Just say the word."},{"name":"SYSTEM","text":"Venture to Lapis Manalis?"},{"name":"VARSHAHNBIG","text":"Oh, Azdaja... What has become of you, that even your eye should be so spent of aether..."},{"name":"VARSHAHNBIG","text":"I cannot bear the thought of her being held captive a moment longer, but how will I find her? What must I do?"},{"name":"ESTINIEN","text":"Calm yourself, Vrtra."},{"name":"ESTINIEN","text":"I appreciate that you are upset, but such passion clouds your judgment. You must endeavor to remain composed."},{"name":"ESTINIEN","text":"When your mind is clear, we may consider how to proceed with our search."},{"name":"VARSHAHNBIG","text":"&lt;sigh&gt; You are right..."},{"name":"ESTINIEN","text":"In the meantime, I will help Alphinaud and Alisaie back at the village."},{"name":"YSHTOLA","text":"That sounds like a fine idea. We should go as well."},{"name":"ALISAIE","text":"Oh, you've come too."},{"name":"ESTINIEN","text":"Leave Vrtra be. He needs time alone with his thoughts."},{"name":"YSHTOLA","text":"Let us take comfort in the knowledge that the voidgate is closed, and that the people of Garlemald need fear the voidsent hordes no longer."},{"name":"MYSTERIOUSPERSON","text":"We're to help Alphinaud and Alisaie, are we? There's little else of interest here, so I wouldn't be opposed to the diversion."},{"name":"VARSHAHNBIG","text":"Pray give me a moment longer."},{"name":"ALPHINAUD","text":"I don't see Vrtra with you. Is everything all right?"},{"name":"ESTINIEN","text":"He needs a moment to himself. While he is indisposed, we thought we'd lend you a hand."},{"name":"ALISAIE","text":"I've just finished patrolling the area, so we're fine on that front."},{"name":"ALISAIE","text":"There are no signs of voidsent, and I doubt we'll see any more now that the gate has been closed."},{"name":"ALISAIE","text":"As for Alphinaud, he's set his sights on the ceruleum spring. We're hoping to take as much of the stuff as the snowcraft can bear."},{"name":"ALISAIE","text":"That much fuel would keep the people warm for a good while."},{"name":"ALPHINAUD","text":"We've managed to procure a few suitable containers for transporting the ceruleum, and were about to return to the spring."},{"name":"ESTINIEN","text":"If you've a mind to scrounge up more containers, I can take what you have now and get them filled."},{"name":"ALPHINAUD","text":"Thank you, Estinien. The more we can load into the snowcraft, the better."},{"name":"ALISAIE","text":"Would you and Y'shtola mind helping us with our search, then?"},{"name":"ALISAIE","text":"You'll need to take any suitable containers to the spring, and then back to the snowcraft once you've filled them with ceruleum."},{"name":"ALPHINAUD","text":"Any luck finding a container?"},{"name":"ALISAIE","text":"Hmmm, will this be solid enough?"},{"name":"YSHTOLA","text":"It is a welcome change to have Zero helping of her own volition. Perhaps she is finally beginning to trust us."},{"name":"SYSTEM","text":"This is less a container and more a sieve, given its poor condition and visible holes..."},{"name":"SYSTEM","text":"The container appears to be well suited for repurposing. It would be a fine choice for ceruleum storage."},{"name":"MYSTERIOUSPERSON","text":"We just need to carry this liquid fire to the snowcraft? Sounds simple enough."},{"name":"SYSTEM","text":"The container is now filled to the brim with ceruleum."},{"name":"MYSTERIOUSPERSON","text":"If that one has been filled, you should hurry and take it to the snowcraft."},{"name":"MYSTERIOUSPERSON","text":"Estinien has already seen to the rest."},{"name":"MYSTERIOUSPERSON","text":"Go on ahead. The others asked that I remain here in the event they find more."},{"name":"ESTINIEN","text":"Good work, my friend. I expect we'll have a sizable load to deliver."},{"name":"SYSTEM","text":"The snowcraft is all but overflowing with ceruleum containers. However, several of your comrades have yet to arrive. Perhaps a nearby vantage point will afford you a more favorable view of their return."},{"name":"ALISAIE","text":"It was good seeing you again. I hope you'll remember to call on us sooner the next time you need help."},{"name":"ESTINIEN","text":"Vrtra has quelled the tempest within his heart. He should be fine."},{"name":"YSHTOLA","text":"That Azdaja's eye hasn't succumbed to Darkness bespeaks her incredible resilience."},{"name":"YSHTOLA","text":"So let us trust in this sign that she yet lives, and be not deterred in our efforts. "},{"name":"MYSTERIOUSPERSON","text":"I'm not your keeper, nor do I know what you expect of me. But I will keep my word."},{"name":"VARSHAHNBIG","text":"I must apologize for my bout of melancholy. To be so easily shaken ill becomes a great wyrm."},{"name":"VARSHAHNBIG","text":"You have remained at my side and ever offered me support and encouragement. I haven't the words to thank you."},{"name":"ALPHINAUD","text":"I suppose this is where we part ways for now."},{"name":"ALPHINAUD","text":"Though we have every faith in you, we will pray for your safety all the same."},{"name":"ALISAIE","text":"I'm glad we had the chance to talk, Zero. Take care, and till next time!"},{"name":"MYSTERIOUSPERSON","text":"Till next time."}],"reward":{"gil":1346},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70210]},"next":[70212]},"partials":[{"type":"npc","id":"1044271","obj":{"i":1044271,"n":"Varshahn","l":4295,"q":1}},{"type":"npc","id":"1044284","obj":{"i":1044284,"n":"Alphinaud","l":3710,"q":1}},{"type":"quest","id":"70210","obj":{"i":70210,"n":"King of the Mountain","g":12,"l":"Garlemald","s":642}},{"type":"quest","id":"70212","obj":{"i":70212,"n":"Paths Barred","g":12,"l":"Garlemald","s":644}}]}