{"quest":{"name":"King of the Mountain","location":"Garlemald","id":70210,"patch":6.3,"sort":642,"icon":112502,"eventIcon":71201,"issuer":1044260,"target":1044270,"genre":12,"journal":["Relief is writ plain on Alphinaud's face.","With the voidsent driven off, and Zero resting, Alphinaud suggests waiting for your comrades to return from the lake.","The immediate threat of voidsent is gone for now, but having fought them in such numbers, you are all but certain a voidgate is indeed somewhere on the nearby mountain. Happily, the repairs on the snowcraft are nearing completion, and it is decided that you will head back to its location in Cerulea Ingens. Alisaie is only too eager to depart, and much to her surprise, Zero offers to accompany you without the need for a bargain, seemingly having been inspired by Alisaie's earnest desire to help others. Alphinaud joins you as well, and so together you set forth, with Y'shtola and Estinien leading the way.","You arrive at Cerulea Ingens to find a fully functioning snowcraft. To ensure you safely reach your destination on the mountain, the engineer offers to serve as your pilot. Thus do you climb aboard and steel yourself for what dangers may await at Lapis Manalis.<br><br>※To enlist your companion NPCs for this duty, speak with them near the entrance or access Duty Support via the main menu. Use the Duty Finder if you wish to complete the instance alongside fellow players.","In the depths of Lapis Manalis, you and your companions finally locate the voidgate. There you come face-to-face with the archfiend of water, Cagnazzo, and make ready for what promises to be a torrential encounter.<br><br>※In the event that you leave Lapis Manalis, you may re-enter by speaking with the spirited engineer.","The archfiend suffers a crushing defeat at your hands, and yet he seems strangely satisfied with the outcome. Delight is writ plain on Cagnazzo's face as he reveals what you believed to be Varshahn's sister was, in fact, only her eye. With his dying breath, Cagnazzo bids you seek out Golbez to learn what has truly become of Azdaja. He then dissipates into aether, leaving a crestfallen Varshahn holding the eye of his beloved sister.","Though Golbez's ultimate aim remains unclear, knowing he likely requires immense stores of aether to see his plans through, you have cause to believe Azdaja yet lives. Even so, Y'shtola cannot help but wonder why he would choose now to finally put his plans into motion."],"objectives":["Wait at the designated location.","Speak with the spirited engineer.","Enter Lapis Manalis.","Speak with Y'shtola at Deepspine."],"dialogue":[{"name":"ALISAIE","text":"Thank goodness we found Zero when we did."},{"name":"JULLUS","text":"I've also received word that the transport arrived safely at Camp Broken Glass. They send their thanks to the “woman in black.”"},{"name":"MYSTERIOUSPERSON","text":"...I'm fine. I just need rest."},{"name":"ALPHINAUD","text":"As Alisaie said, many people owe Zero their lives."},{"name":"ALPHINAUD","text":"This is not her world, nor her battle to fight, yet she risked life and limb for us nonetheless. That will not be soon forgotten."},{"name":"ALPHINAUD","text":"Now then, I expect that our friends will return soon. Once everyone has gathered, we can take stock of the situation."},{"name":"ALPHINAUD","text":"We've naught to do but wait for the others. They should not be much longer."},{"name":"ALISAIE","text":"Perhaps you should have a rest too."},{"name":"MYSTERIOUSPERSON","text":"Apologies for the delay. I've finished replenishing my aether."},{"name":"ALPHINAUD","text":"Full glad am I to hear it. We must thank you again, Zero."},{"name":"ALISAIE","text":"Indeed, many are still alive because of you. Those soldiers not least of all."},{"name":"MYSTERIOUSPERSON","text":"...How fared you? Better than I did, by all accounts."},{"name":"ALISAIE","text":"We had to contend with our fair share of voidsent en route to the snowcraft, but we had the benefit of numbers."},{"name":"ESTINIEN","text":"With their help, we quickly dispatched all the voidsent that came our way. Thankfully, they stay dead in our world."},{"name":"ESTINIEN","text":"We were trying to decide what to do next when we received word about the transport."},{"name":"ALPHINAUD","text":"Which is how Alisaie, <span class=\"highlight\">Forename</span>, and I came to find you."},{"name":"YSHTOLA","text":"While the immediate threat has been addressed, we cannot rest easy yet. For voidsent to appear in such numbers, we must assume that a voidgate has indeed been opened nearby."},{"name":"JULLUS","text":"Meaning more of them can come through at their leisure."},{"name":"JULLUS","text":"It seems the best course of action is to investigate Lapis Manalis, as you intend. What is the state of the snowcraft?"},{"name":"YSHTOLA","text":"Nearly operational, I believe. Vrtra is with the engineer, who is hard at work as we speak. Why don't we join them in Cerulea Ingens?"},{"name":"ALISAIE","text":"Finally, a chance to go on the offensive!"},{"name":"MYSTERIOUSPERSON","text":"...I would join you as well."},{"name":"ALISAIE","text":"I wouldn't dream of refusing you. But...what did you have in mind for payment?"},{"name":"MYSTERIOUSPERSON","text":"Payment won't be necessary."},{"name":"MYSTERIOUSPERSON","text":"I will do this because...I want to."},{"name":"MYSTERIOUSPERSON","text":"You have...kindled something within me. A compulsion─a desire to act─that has been burning since you came to my aid out in the snow."},{"name":"MYSTERIOUSPERSON","text":"I do not understand it, but I wish to, and to that end I will heed it. Then perhaps I'll understand your answer."},{"name":"ALPHINAUD","text":"I would also like to join you in tracing the voidsent to their origin. Though that would mean neglecting my duties here..."},{"name":"JULLUS","text":"Don't worry about us. Between my people and the contingent, we can keep things running well enough. Just find where the voidsent are coming from, and see that they stop."},{"name":"JULLUS","text":"Take care, Zero."},{"name":"MYSTERIOUSPERSON","text":"I will."},{"name":"ALPHINAUD","text":"For the sake of our friends, I pray we succeed in our mission."},{"name":"ALPHINAUD","text":"The voidgate is of course our main objective, but if we can also find useful salvage, then all the better."},{"name":"ALISAIE","text":"I'm glad the engineer is safe. I'd never forgive myself if something had happened to him on our account."},{"name":"ESTINIEN","text":"Vrtra insisted on staying behind to guard the snowcraft. He's anxious to get up that mountain, and understandably so."},{"name":"YSHTOLA","text":"“Mammoth” is an apt name for the craft. Its prodigious size made defending it difficult, but it came through unscathed."},{"name":"MYSTERIOUSPERSON","text":"To have to go to such lengths to traverse a single mountain... The people of this land do not have easy lives."},{"name":"VARSHAHNBIG","text":"'Tis good to see you all safe and well. The craft stands ready, I am pleased to say. Our engineer friend has worked tirelessly, his zeal a match for any of my alchemists."},{"name":"ENGINEER04671","text":"There you are! Your timing couldn't be better."},{"name":"ENGINEER04671","text":"Thanks to Varshahn's help, I've managed to finish the repairs faster than I anticipated. The mammoth's ready for the snow once more!"},{"name":"ENGINEER04671","text":"You can leave the piloting to me, too. It'd be my pleasure to get you to where you need to go!"},{"name":"ALISAIE","text":"You are too kind. Thank you."},{"name":"ALISAIE","text":"Let's be on our way then, shall we?"},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Small talk."},{"name":"A1","text":"Form a party and enter Lapis Manalis."},{"name":"A1","text":"Nothing."},{"name":"ALPHINAUD","text":"As we hopefully demonstrated, we're still capable of holding our own in battle. Which is to say, please don't hesitate to rely on us."},{"name":"ALISAIE","text":"When we find whoever's responsible for unleashing the voidsent, I'm going to give them a piece of my mind!"},{"name":"ESTINIEN","text":"I don't make a habit of fighting atop magitek, but it shouldn't be any more difficult than doing so astride a dragon. I welcome the change of pace."},{"name":"YSHTOLA","text":"Once aboard the mammoth, we will all need to change into attire more suitable for combat."},{"name":"YSHTOLA","text":"It can be no coincidence that a voidgate has opened where Vrtra sensed his sister. In all likelihood, something is in the offing, and we must be prepared."},{"name":"MYSTERIOUSPERSON","text":"If there is indeed a voidgate, then there will be voidsent, and not merely lesser ones."},{"name":"MYSTERIOUSPERSON","text":"Be on your guard for all manner of threats."},{"name":"VARSHAHNBIG","text":"Come, <span class=\"highlight\">Forename</span>. Let us find the truth of my sister's aura!"},{"name":"ENGINEER04671","text":"Just say the word and we're off."},{"name":"ENGINEER04671","text":"Whenever you're ready, friend."},{"name":"SYSTEM","text":"Venture to Lapis Manalis?"},{"name":"VARSHAHNBIG","text":"Oh, Azdaja..."},{"name":"ESTINIEN","text":"That they should go so far as to use Azdaja's eye as bait... What could they be after?"},{"name":"MYSTERIOUSPERSON","text":"Why does he look so defeated? We are closer to finding his sister, are we not?"},{"name":"YSHTOLA","text":"So, we have discovered the source of the voidsent outbreak in Garlemald."},{"name":"ESTINIEN","text":"A gate forced open from the void..."},{"name":"YSHTOLA","text":"The barrier between our worlds is especially thin here, I suspect."},{"name":"YSHTOLA","text":"Elsewise I see little reason why the reapers chose to live in such an inhospitable place."},{"name":"ESTINIEN","text":"Even if the conditions are ideal, we're talking about a gate that could pass an archfiend. Opening one so large could not have been easy."},{"name":"YSHTOLA","text":"In the age of Allag, Emperor Xande created an enormous portal using a prodigious amount of aether harnessed by the Crystal Tower."},{"name":"YSHTOLA","text":"In theory, a similar feat should be possible from within the void. One need but have the requisite amount of aether...such as that harbored by a great wyrm's eye."},{"name":"VARSHAHNBIG","text":"And its aether is indeed greatly diminished..."},{"name":"ESTINIEN","text":"In <span class=\"highlight\">Forename</span>'s vision, Golbez let his archfiends feed upon Azdaja's aether. If he has also taken an eye to open this gate..."},{"name":"YSHTOLA","text":"It does not bode well, I know. Nevertheless, we must remain hopeful and continue our search."},{"name":"YSHTOLA","text":"What I find curious is why our foes chose to strike <span class=\"emphasis\">now</span>, some five thousand years after Azdaja vanished into the void."},{"name":"YSHTOLA","text":"And while their overarching plan remains a mystery, what exactly was Cagnazzo's part in it that he had finished?"},{"name":"SYSTEM","text":"You may now enter Lapis Manalis with a party of NPC avatars. To make use of this feature, open the <span class=\"highlight\">Trust</span> interface located under <span class=\"highlight\">Duty</span> in the main menu."},{"name":"SYSTEM","text":"Moreover, be advised that you may use mounts within Lapis Manalis, but only during this quest."}],"reward":{"gil":5184,"instance":89},"reqs":{"jobs":[{"lvl":90,"id":142}],"quests":[70209]},"next":[70211]},"partials":[{"type":"npc","id":"1044260","obj":{"i":1044260,"n":"Alphinaud","l":3710,"q":1}},{"type":"npc","id":"1044270","obj":{"i":1044270,"n":"Y'shtola","l":4295,"q":1}},{"type":"instance","id":"89","obj":{"i":89,"n":"Lapis Manalis","c":61801,"t":"Dungeons","min_lvl":90,"max_lvl":90,"min_ilvl":590}},{"type":"quest","id":"70209","obj":{"i":70209,"n":"An Unforeseen Bargain","g":12,"l":"Garlemald","s":641}},{"type":"quest","id":"70211","obj":{"i":70211,"n":"A Dragon's Resolve","g":12,"l":"Lapis Manalis","s":643}}]}