{"quest":{"name":"Must Be Dreaming(way)","location":"Old Sharlayan","id":70217,"patch":6.35,"sort":1,"icon":101221,"beast":17,"unlocksFunction":1,"eventIcon":71341,"issuer":1044910,"target":1044921,"genre":28,"usedItems":[38842,38843],"journal":["Dreamingway is looking every which way.<br>※The difficulty of this quest will be synced to your current level.","You politely inquire with Dreamingway as to his purpose on Etheirys─which, as it transpires, is to beg your aid. Many of his comrades fell into a most un-Loporrit-like listlessness upon the abrupt cessation of the exodus, and it would seem they have yet to recover. Unable to abandon them to their melancholy, you agree to travel to the moon to help determine how best to revive their spirits.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Upon your arrival in Bestways Burrow, Dreamingway encourages you to speak with a few of his moping fellows. Though their countenances indicate anything but an eagerness for conversation, you nevertheless resolve to get to the bottom of their acedia.","Speaking to the listless Loporrits reveals them to be universally devastated by their newfound lack of purpose. In retrospect, Hydaelyn really ought to have anticipated that, but as She can no longer be consulted, Dreamingway will have to do.","You report to Dreamingway to suggest that his fellow Loporrits would be best served by finding a dream they might aspire to, much as he once did. He eagerly agrees, and proposes the creation of a venue for providing inspiration to would-be dreamers. This, however, will require Livingway's permission before aught else.","Though you lend your support to Dreamingway's petition, it appears that it was hardly needed, for Livingway herself has been much concerned with the matter of finding new activities for Loporrits at loose ends. Readily acquiescing to your proposal, she is quick to provide not only a space for Loporrit enrichment activities, but also two assistants with dreams of their own to share─Managingway and Coiningway. With no time to waste when so many exciting possibilities lie in store, your little group sets off to explore Hoper's Hold.","You speak with Dreamingway, who is more than satisfied with what Hoper's Hold has to offer as a venue, and he suggests that you set to work posthaste. Managingway, fortunately, is quick to remind him that it is necessary to decide what one intends to build before building it─and thus are a musical stage and sales booth added neatly to the agenda. Now equipped with at least a general understanding of the task ahead, you set about crafting durable components to be used in construction.","Managingway is more than satisfied with your carefully crafted components, which are swiftly rendered into the stage of Dreamingway's dreams. Before you know it, his music is drawing other Loporrits to Hoper's Hold. Though there is certainly much yet to be done, their smiling faces bode well for the future of your endeavor."],"objectives":["Speak with Dreamingway in Bestways Burrow.","Speak with the listless Loporrits.","Report to Dreamingway.","Speak with Dreamingway.","Speak with Dreamingway again.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Managingway</span></span>."],"dialogue":[{"name":"DREAMINGWAY","text":"<span class=\"highlight\">Forename</span>, my friend! My chum, my pal, my old earthen flatware... How delighted I am to finally, finally see you again!"},{"name":"DREAMINGWAY","text":" ...You do remember me, don't you?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Of course, Dreamingway!"},{"name":"A1","text":"Which one were you again?"},{"name":"DREAMINGWAY","text":"Phew! You had me worried for a moment there, with how your eyes glazed over like that..."},{"name":"DREAMINGWAY","text":"Why, I am the Way whom you helped to find his way─Dreamingway!"},{"name":"DREAMINGWAY","text":"I knew we'd get there eventually!"},{"name":"DREAMINGWAY","text":"In any case, I am truly glad to have found you at last. Etheirys is quite a bit larger than one anticipates, isn't it?"},{"name":"DREAMINGWAY","text":"And it is ever so <span class=\"emphasis\">intact.</span> A touch of widespread destruction, yes, but you and your friends did a remarkable job of saving it."},{"name":"DREAMINGWAY","text":"I can see why you prefer to stay, really I do..."},{"name":"DREAMINGWAY","text":"...But you must understand, you've left a fair few of my fellow Loporrits in a bind."},{"name":"DREAMINGWAY","text":"Their sole purpose in life was to prepare the moon for mankind, and now that you're not coming... Well, they're depressed. Not to mention bored!"},{"name":"DREAMINGWAY","text":"I know what that's like. To while away the days drifting from one dull task to another, occasionally bumping into walls..."},{"name":"DREAMINGWAY","text":"You managed to set me to rights, though. My days of listlessness are over, and I'm happier pursuing music than ever I was before! So I wondered..."},{"name":"DREAMINGWAY","text":"Could you not help my fellow Loporrits as you helped me? Not all by yourself, of course─I promise that I'll be there every hop, skip, and jump of the way!"},{"name":"DREAMINGWAY","text":"I knew you'd agree!"},{"name":"DREAMINGWAY","text":"It would be best if you met the Loporrits in question yourself, so please join me in Bestways Burrow as soon as you are able."},{"name":"DREAMINGWAY","text":"Thank you! They're in a sorry state at the moment, but surely we can find some way to help..."},{"name":"DREAMINGWAY","text":"Well come, <span class=\"highlight\">Forename</span>!"},{"name":"DREAMINGWAY","text":"Now that you're here, you've likely noticed that some of the other Loporrits seem a bit...floppy. Perhaps if you speak with them, you can get a clearer understanding of their plight."},{"name":"DREAMINGWAY","text":"Once you're done, we shall formulate a plan of action forthwith!"},{"name":"DREAMINGWAY","text":"Do you see what I mean about the others? They're like carrots with the juice sucked out!"},{"name":"LOPORRITA04681","text":"Why do I seem so sad? Oh, I don't know, perhaps because my entire life's work was all for naught? What a question..."},{"name":"LOPORRITA04681","text":"Yes, a few representatives from Etheirys have come to visit Livingway's new archive, but it's not the same!"},{"name":"LOPORRITA04681","text":"The moon was supposed to be hustling─bustling, even─with people, who would all live happily ever after in our wondrous residential facilities."},{"name":"LOPORRITA04681","text":"But not a single one of you has moved in..."},{"name":"LOPORRITA04681","text":"What's so wrong with moon living, huh!?"},{"name":"LOPORRITA04681","text":"We worked so hard to make sure you would be comfortable here, and it's gone entirely to waste."},{"name":"LOPORRITB04681","text":"To think my carrots will ever remain untasted by mankind..."},{"name":"LOPORRITB04681","text":"And what of the Loporrits? Day in, day out, we eat carrots, we grow carrots, we eat carrots again..."},{"name":"LOPORRITB04681","text":"...It's as if the carrots are growing <span class=\"emphasis\">us</span>. Was this their plot all along!?"},{"name":"LOPORRITC04681","text":"You know those days that simply feel <span class=\"emphasis\">bad</span>? When the carrots taste bland, and nothing sounds like fun, and you don't want to talk to your friends even though they're <span class=\"emphasis\">right here...</span>"},{"name":"LOPORRITC04681","text":"Well, all of my days are those days..."},{"name":"LOPORRITA04681","text":"Is dusty old Sharlayan <span class=\"emphasis\">that</span> much better than the moon? Is it!?"},{"name":"LOPORRITB04681","text":"I'm trapped... Trapped in a vicious carrot-based cycle..."},{"name":"LOPORRITC04681","text":"Maybe I'll take a nap. Again."},{"name":"LOPORRITA04681","text":"Do <span class=\"emphasis\">you</span> want to live here? No, I didn't think so..."},{"name":"DREAMINGWAY","text":"I see from your face that you've met some of our wayward Ways. Depressing, isn't it?"},{"name":"DREAMINGWAY","text":"I wish I knew how to bring them out of the doldrums. Did you have any ideas?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Perhaps they can yet find new dreams of their own."},{"name":"A2","text":"Why not start by telling them of your dream?"},{"name":"DREAMINGWAY","text":"New dreams! Why, I cannot believe I hadn't thought of that myself!"},{"name":"DREAMINGWAY","text":"You mean the one about the carrots the size of starships, or─ Oh! My <span class=\"emphasis\">dream.</span>"},{"name":"DREAMINGWAY","text":"If each of my fellows had their own dream to guide them, they would be cured of their melancholy as surely as I was!"},{"name":"DREAMINGWAY","text":"Of course, finding one's dream is easier said than done..."},{"name":"DREAMINGWAY","text":"Perhaps we can help them on their respective ways by introducing the myriad options available. It took significant trial and error in my case, after all."},{"name":"DREAMINGWAY","text":"If we gather the Loporrits who already <span class=\"emphasis\">have</span> dreams together in a centralized location, that should make for a decent start."},{"name":"DREAMINGWAY","text":"We simply show my listless fellows the fun to be had in various pursuits, and─BAM!─they'll be struck with inspiration so hard that we'll have to carry them out on stretchers."},{"name":"DREAMINGWAY","text":"An operation of this scale will require permission from Livingway, though...and I am but one of the frankly excessive number of Loporrits under her authority. As she often reminds us, our passing whims must be processed in the order they are received."},{"name":"DREAMINGWAY","text":"<span class=\"emphasis\">Your</span> whims, on the other paw, are practically the whims of Etheirys itself, and would be prioritized accordingly! You'll lend your support to my petition, won't you?"},{"name":"DREAMINGWAY","text":"It's her! Quickly, put on your best “person of Etheirys with high hopes for the future” face!"},{"name":"LIVINGWAY","text":"Why, <span class=\"highlight\">Forename</span>! What a pleasure to see you. May I say that you're looking especially person-like today?"},{"name":"LIVINGWAY","text":"And Dreamingway besides! Is there something I can assist you with? I have yet to find a willing instructor in the Ishgardian horn, I'm afraid..."},{"name":"DREAMINGWAY","text":"Oh, no, um... That is to say, you will have doubtless noticed that many a Loporrit's fur is looking less than sleek lately. As to what can be done about it..."},{"name":"LIVINGWAY","text":"I see... I have been grappling with the selfsame concern. Large though projects like the Excitatron are, they are simply insufficient to occupy everyone here."},{"name":"LIVINGWAY","text":"So I say─why not? We have the whole moon at our disposal, and there's no reason a small portion of it should not be dedicated to Loporrit enrichment."},{"name":"LIVINGWAY","text":"I even know a few folks who I am certain would be willing to share their dreams. Wait just a moment..."},{"name":"LIVINGWAY","text":"And here they are!"},{"name":"LIVINGWAY","text":"First, allow me to introduce Coiningway. They have a zest for monetary matters big and small, and dream of minting their own currency."},{"name":"LIVINGWAY","text":"Though your venue will primarily be a marketplace of dreams, you shall doubtless require a more tangible system to ensure that your collaborators are compensated fairly."},{"name":"COININGWAY","text":"That, I daresay, is where I come in! Rest assured that your participation in my experimental market will be invaluable in proving the moon's viability as an economic power."},{"name":"LIVINGWAY","text":"...Managingway here will also be happy to join you. They were responsible for determining the layout of our facilities, delineating development projects, ensuring goals were met by each work division, and other such administrative matters."},{"name":"LIVINGWAY","text":"Unfortunately, with the exodus canceled, much of their work has dried up, and it has been...difficult to find another suitable outlet for their enthusiasm."},{"name":"MANAGINGWAY","text":"According to my projections, each and every stage of this project must needs be <span class=\"emphasis\">strictly</span> scheduled in order to meet target metrics. Would you like to see my charts?"},{"name":"DREAMINGWAY","text":"Oooh, charts! How fortunate we are to be working with true experts in...whatever it was that you said."},{"name":"DREAMINGWAY","text":"As well as <span class=\"highlight\">Forename</span>, of course! You will be staying, I hope?"},{"name":"DREAMINGWAY","text":"There is no greater expert in helping Loporrits find their dreams than you. Even should we scour the moon─nay, the universe─"},{"name":"MANAGINGWAY","text":"Ahem! If I may..."},{"name":"MANAGINGWAY","text":"We <span class=\"emphasis\">will</span> require a skilled artisan if we are to meet our goals. My files indicate that you have significant experience in this area?"},{"name":"MANAGINGWAY","text":"I have already added your name to the list of staff. It would be disruptive to remove it now, so I too must ask for your cooperation."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Let's build some dreams!"},{"name":"A3","text":"I do have other commitments..."},{"name":"DREAMINGWAY","text":"Phew! I feel much better knowing you will be here to help."},{"name":"DREAMINGWAY","text":"Of course you do! Who do you think you are?"},{"name":"DREAMINGWAY","text":"W-Wait! You mean to say that you won't help us?"},{"name":"DREAMINGWAY","text":"B-B-B-B-But what about everyone's dreams? And hopes? And hopeful dreams? Certainly you could spare a <span class=\"emphasis\">moment</span> or two?"},{"name":"DREAMINGWAY","text":"Phew! I feel much better knowing you will be here to help."},{"name":"LIVINGWAY","text":"Do try to avoid causing <span class=\"highlight\">Forename</span> undue trouble, yes?"},{"name":"LIVINGWAY","text":"Now, I have taken the liberty of designating a space for your activities."},{"name":"LIVINGWAY","text":"Just beyond that door is a room to which we never assigned a real purpose. We've been using it for storage, but no one will be terribly put out if you use it as your venue."},{"name":"DREAMINGWAY","text":"I cannot thank you enough, Livingway!"},{"name":"DREAMINGWAY","text":"I suppose the best way to show my gratitude will be to put that room─and my staff here─to good use. Come along, everyone!"},{"name":"LIVINGWAY","text":"I fear they know not what trials lie in wait. One trial, in particular... &lt;sigh&gt; What ever shall we do with our most wayward Way?"},{"name":"MANAGINGWAY","text":"There, there, and... Yes, that layout will allow us to maximize efficiency..."},{"name":"COININGWAY","text":"I must say, I was expecting a glorified closet, but this location is not half bad."},{"name":"SUPPORTER","text":"&lt;blip&gt; Greetings! This supporter has been programmed to assist with dreaming-related needs. Today's automatically generated suggestion is: Chocobo Jousting!"},{"name":"DREAMINGWAY","text":"I didn't think it was possible to dream any bigger than I already have, but look at this place!"},{"name":"DREAMINGWAY","text":"It still needs a lot of work before we can open to the dreamless public, however, so without further ado..."},{"name":"MANAGINGWAY","text":"Ahem! If I may..."},{"name":"MANAGINGWAY","text":"Before we begin to build, it is vital that we clarify our vision to ensure unity of purpose and stoke the flames of motivation. Otherwise, we shall find ourselves giving up halfway through─or worse, executing <span class=\"emphasis\">inefficient processes</span>."},{"name":"DREAMINGWAY","text":"I...see? In that case, I suppose my vision is to build a stage for musical performances. That is my dream, after all."},{"name":"COININGWAY","text":"We will also require a commercial area wherein my new currency can change paws. I imagine we might procure a variety of merchandise as well."},{"name":"DREAMINGWAY","text":"No objections here!"},{"name":"COININGWAY","text":"Then I assume you will take care of the more tedious labor. Meanwhile, I shall be polishing my currency and meditating upon the finer points of value determination. I can scarcely wait to begin <span class=\"emphasis\">pricing</span>!"},{"name":"MANAGINGWAY","text":"As far as labor is concerned, I am happy to contract Buildingway's services. The construction systems at his disposal should see our tasks carried out that much the swifter."},{"name":"MANAGINGWAY","text":"That said, the components we use in our construction efforts will greatly benefit from a master crafts<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>'s touch. <span class=\"highlight\">Forename</span>, that is to be your responsibility."},{"name":"MANAGINGWAY","text":"I like your attitude, <span class=\"highlight\">Forename</span>! I can see that you'll go far here."},{"name":"MANAGINGWAY","text":"For the moment, you should focus on creating metal components for Dreamingway's stage. It is vital that we prevent any wibbling, wobbling, or outright collapse."},{"name":"MANAGINGWAY","text":"For the moment, you should focus on creating components for the frame of Dreamingway's stage. It is vital that we prevent any wibbling, wobbling, or outright collapse."},{"name":"MANAGINGWAY","text":"For the moment, you should focus on creating varnish for Dreamingway's stage. It is vital that we prevent errant splinters from hindering our performers' potential. Do mind the aesthetics as well."},{"name":"MANAGINGWAY","text":"I have taken charge of our inventory, so you need only deliver the fruits of your labor to me."},{"name":"MANAGINGWAY","text":"That should be everything you need, but if you require additional raw materials, you will find this dreaming supporter fully stocked!"},{"name":"MANAGINGWAY","text":"Please consult the dreaming supporter if you require raw materials. Now, where was I..."},{"name":"MANAGINGWAY","text":"Please consult the dreaming supporter if you require raw materials. Now, where was I..."},{"name":"MANAGINGWAY","text":"Please consult the dreaming supporter if you require raw materials. Now, where was I..."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Oh dear! It appears that the necessary supplies are in your possession. Project management requires that all materials be used before more are provided."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Oh dear! It appears that the necessary supplies are in your possession. Project management requires that all materials be used before more are provided."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Oh dear! It appears that the necessary supplies are in your possession. Project management requires that all materials be used before more are provided."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Here you are─happy laboring!"},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Here you are─happy laboring!"},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Here you are─happy laboring!"},{"name":"DREAMINGWAY","text":"Oh, I can scarcely wait to see our new stage!"},{"name":"COININGWAY","text":"Please leave the matter of our currency to me. I assure you it will be worth its weight in gold."},{"name":"MANAGINGWAY","text":"You're finished? If I may..."},{"name":"MANAGINGWAY","text":"These are precisely what I asked for! Well done, <span class=\"highlight\">Forename</span>."},{"name":"MANAGINGWAY","text":"Now, for liability reasons, I must ask you to wait here during construction. Pray give us a few moments to activate the building systems."},{"name":"DREAMINGWAY","text":"Behold! The stage of my dreams, from which we shall share the joys of music with all of Loporrit-kind!"},{"name":"DREAMINGWAY","text":"Impressive, is it not? Even more so when we..."},{"name":"DREAMINGWAY","text":"Turn up the music!!!"},{"name":"DREAMINGWAY","text":"I wrote this one myself! Doesn't it make you want to hippity hop?"},{"name":"MANAGINGWAY","text":"Frankly, you've exceeded my expectations. Rarely is the first stage of a project such a success."},{"name":"COININGWAY","text":"Allow me to draw your attention to the shopping station. When you are handsomely rewarded with my original Loporrit carats, you will doubtless enjoy spending them here."},{"name":"MANAGINGWAY","text":"You've certainly outdone yourself. Though I still have my doubts as to whether you'll find anyone to purchase that slide."},{"name":"COININGWAY","text":"But wait─there's more! If you will kindly follow me..."},{"name":"COININGWAY","text":"Naught bespeaks a well-run organization with plentiful financial returns like uniforms!"},{"name":"MANAGINGWAY","text":"I do feel rather more official now. These shirts should keep our mutual goals at the forefront of our minds."},{"name":"COININGWAY","text":"A friend mentioned to me that the bards and musicians of Etheirys often don peculiar accessories, so the glasses seemed appropriate for Dreamingway. And now we can locate our leader at a distance!"},{"name":"DREAMINGWAY","text":"Thank you, Coiningway! They do lend a certain weight, possibly of expectation. I will do my utmost not to disappoint!"},{"name":"LOPORRIT04681","text":"Pardon me, but what is this place? I couldn't help but follow the music, and before I knew what was happening, I had hopped all the way here!"},{"name":"DREAMINGWAY","text":"This, my friend, is a workshop─the workshop of dreams!"},{"name":"DREAMINGWAY","text":"Hm, that does have a nice ring to it, doesn't it? Almost...musical. In any case, feel free to stay for as long as you like!"},{"name":"LOPORRIT04681","text":"Where...am I? Everyone looks so...happy. Am I allowed to join in? Oh, I wish someone could tell me what to do..."},{"name":"MANAGINGWAY","text":"Ahem! If I may..."},{"name":"DREAMINGWAY","text":"I do hope they find their way. Surely there's a dream out there for everybody..."},{"name":"DREAMINGWAY","text":"Thank you for helping to make mine a reality."},{"name":"DREAMINGWAY","text":"But we're just getting started! There are still plenty of dreams out there to make space for, and Loporrits to lure into our helpful clutches!"},{"name":"DREAMINGWAY","text":"I'm counting on you, <span class=\"highlight\">Forename</span>!"},{"name":"TALKINGWAY","text":"(-???-)What is this ruckus? Can't they just be quiet? Hopping around like fools won't change anything one whit..."},{"name":"SYSTEM","text":"Dreamingway's Dreaming Workshop is now open to the public! Patrons can dance the night away at the musicking station, or shop until they flop at the shopping station."},{"name":"SYSTEM","text":"There is much yet to be done, however, if each Loporrit is to find new purpose. Continue expanding the workshop to see what dreams may come!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Friendly</span> reputation with the Dreaming Ways."},{"name":"SYSTEM","text":"Loporrit tribal quests are now available from Managingway in Hoper's Hold."},{"name":"SYSTEM","text":"Furthermore, you may now purchase wares from Coiningway."},{"name":"SYSTEM","text":"For your convenience, the Loporrits have linked the teleportation portal in the Dreaming Workshop to one near the aetheryte in Bestways Burrow."}],"reward":{"gil":1255},"reqs":{"jobs":[{"lvl":80,"id":33}],"questsType":"all","quests":[70055,70000]},"next":[70218]},"partials":[{"type":"npc","id":"1044910","obj":{"i":1044910,"n":"Dreamingway","l":3706,"q":1}},{"type":"npc","id":"1044921","obj":{"i":1044921,"n":"Managingway","l":3711,"q":1}},{"type":"item","id":"38842","obj":{"i":38842,"n":"Musicking Station Component Materials","l":1,"c":26001,"t":61}},{"type":"item","id":"38843","obj":{"i":38843,"n":"Musicking Station Component","l":430,"c":21012,"t":61}},{"type":"quest","id":"70055","obj":{"i":70055,"n":"Dream a Little Dream","g":124,"l":"Mare Lamentorum","s":1954,"f":1}},{"type":"quest","id":"70000","obj":{"i":70000,"n":"Endwalker","g":11,"l":"Ultima Thule","s":618}},{"type":"quest","id":"70218","obj":{"i":70218,"n":"The Incredible Machines","g":28,"l":"Mare Lamentorum","s":2,"f":1}}]}