{"quest":{"name":"Teamwork Makes the Dream Work","location":"Mare Lamentorum","id":70220,"patch":6.35,"sort":4,"icon":101224,"beast":17,"unlocksFunction":1,"eventIcon":71341,"issuer":1044402,"target":1044947,"genre":28,"usedItems":[38848,38849],"journal":["Dreamingway is concerned with the fate of one Loporrit in particular.<br>※The difficulty of this quest will be synced to your current level.","Dreamingway raises the matter of the ashen-furred Loporrit, who it seems can often be found loitering near the Watcher's Palace. He wishes to inquire as to what about the Dreaming Workshop has failed to inspire this wayward Way, and thus do the two of you make for the wide open spaces of Mare Lamentorum.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Though you find the pallid Loporrit and inquire as to their state of mind, they seem unwilling to divulge much beyond cynical quips. They do mention Livingway's name, however, along with their desire to return to the hibernation from which you once saw the furry tribe awaken.","Upon consulting with Dreamingway, you agree that your next course of action is to inquire with Livingway. It is possible that the Loporrits' leader has valuable information as to the source of the distress that plagues this most melancholy of Loporrits.","Livingway tells you the story of Counselingway, a passionate Loporrit with the weighty responsibility of helping people with their troubles─a role which they spent their life eagerly anticipating, only to be told that the people of Etheirys would not be coming after all. This disappointment understandably plunged them into the depths of despair, and they have yet to emerge. Though the task that lies ahead may be more difficult than you could have anticipated, if anyone is to convince Counselingway that life remains worth living, it must be the Dreaming Ways.","You reconvene with Dreamingway in Hoper's Hold, where he shares the tragic tale of Counselingway with Managingway. Managingway points out that this is not the only Loporrit the Dreaming Workshop has yet to inspire─and that these wayward Ways share the commonality of having once been tasked with interacting with the people of Etheirys directly. As their distress appears to originate with the loss of the friendly interaction they had anticipated, Dreamingway proposes that you get them together in pursuit of a common goal once more, that camaraderie might stimulate their dormant motivation.","As one of the very people of Etheirys that the listless Loporrits once dreamed of meeting, you have little difficulty convincing them to join you in the creation of a mural in Hoper's Hold. One can only hope that they will feel slightly more up to the challenge once they have their paintbrushes in paw.","With your artists successfully recruited, you speak with Dreamingway. He provides you with details and materials for the art supplies that you must create, and you set to work.","Making the absolute most of your proffered supplies, the no-longer-listless Loporrits create works of art that testify to their most profound emotions─and they enjoy doing it, too. Though this is still not enough to convince the cynical Counselingway, you have brought great happiness to Bestways Burrow this day, which is a success worth painting about."],"objectives":["Search for the ashen-furred Loporrit at the lurking location.","Speak with Dreamingway.","Speak with Dreamingway again.","Speak with Dreamingway yet again.","Recruit listless Loporrits.","Speak with Dreamingway.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Dreamingway</span></span>."],"dialogue":[{"name":"DREAMINGWAY","text":"<span class=\"highlight\">Forename</span>! You recall that curious character who we've seen─for lack of a better term─lurking about Hoper's Hold, don't you?"},{"name":"DREAMINGWAY","text":"Well, I hear tell that they also spend a great deal of time lurking about the Watcher's Palace. A regular Lurkingway, that one."},{"name":"DREAMINGWAY","text":"In any case, it seems that the Dreaming Workshop isn't meeting their needs. I should like to ask them how we can be more helpful. Would you join me?"},{"name":"DREAMINGWAY","text":"Perfect! I've already checked all our nooks and crannies, so with any luck, they'll be lurking by the Watcher's Palace as we speak..."},{"name":"DREAMINGWAY","text":"They must be around here somewhere..."},{"name":"DREAMINGWAY","text":"Perhaps they grew tired of the view, and decided to take their lurking elsewhere..."},{"name":"DREAMINGWAY","text":"Oh, it's them!"},{"name":"DREAMINGWAY","text":"Quickly, before they slip away!"},{"name":"DREAMINGWAY","text":"Hail, my good Way! If I'm not mistaken, you have come to enjoy the offerings of our Dreaming Workshop a number of times, have you not?"},{"name":"TALKINGWAY","text":"...Enjoy? Hardly."},{"name":"TALKINGWAY","text":"Though I suppose watching you pointlessly exert yourselves has been entertaining enough."},{"name":"DREAMINGWAY","text":"That's, er...good? But I was hoping that we might assist you in finding a dream of your own!"},{"name":"TALKINGWAY","text":"And what is it you expect me to dream of? Fanciful machines? Colorful cuisines? I think not. "},{"name":"TALKINGWAY","text":"Without the people of Etheirys to delight in them, such pursuits are meaningless, one and all."},{"name":"DREAMINGWAY","text":"I...cannot say I agree..."},{"name":"TALKINGWAY","text":"No matter. Your exertions have their place─in supporting my petition to Livingway."},{"name":"TALKINGWAY","text":"When she authorizes my hibernation, I shall dream sweet dreams at last..."},{"name":"DREAMINGWAY","text":"So their dream is...to sleep?"},{"name":"DREAMINGWAY","text":"That's a lot of nonsense, if I do say so myself. You can hardly follow your dreams while you're asleep!"},{"name":"DREAMINGWAY","text":"Perhaps Livingway will understand better than I do. It sounds like our ashen-furred friend has spoken of this matter to her before."},{"name":"DREAMINGWAY","text":"Why is it so difficult to find anyone today? Livingwaaay!"},{"name":"DREAMINGWAY","text":"There you are, Livingway! Might we have a word?"},{"name":"LIVINGWAY","text":"So soon? I had thought your project was proceeding apace."},{"name":"DREAMINGWAY","text":"Overall, yes...but we're struggling with one Way in particular. Are you familiar with an ashen-furred Loporrit? Red eyes, mysterious, absolutely adorable until they open their mouth?"},{"name":"LIVINGWAY","text":"Oh, yes. I was aware they had paid visit to Hoper's Hold, but I wasn't aware that <span class=\"emphasis\">you</span> were aware..."},{"name":"LIVINGWAY","text":"Perhaps you may yet succeed where I have not."},{"name":"LIVINGWAY","text":"You are aware, <span class=\"highlight\">Forename</span>, that the Loporrits were created to prepare the moon for man's arrival, and that these preparations required substantial time and effort."},{"name":"LIVINGWAY","text":"All bent toward our common goal in their own way, but some Loporrits went above and beyond. One in particular..."},{"name":"LIVINGWAY","text":"The very same."},{"name":"LIVINGWAY","text":"This most passionate of Ways took the name “Counselingway.” Their role was to lend a listening ear and provide advice to the people of Etheirys─something we anticipated would be sorely needed, given the abrupt displacement you all were to face."},{"name":"LIVINGWAY","text":"More than any other, they sought to understand your people. They studied, they practiced..."},{"name":"LIVINGWAY","text":"...And they looked forward to the day when they would finally, finally meet you."},{"name":"LIVINGWAY","text":"As you can imagine, the change of plans came as a terrible shock. They became uninterested in their former pursuits, and are adamant that naught of worth remains for them to do."},{"name":"LIVINGWAY","text":"I was unable to persuade them otherwise─and after some time, they disappeared from the burrow altogether."},{"name":"LIVINGWAY","text":"It was shortly thereafter that other Loporrits began sighting an ashen-furred Way wandering Mare Lamentorum."},{"name":"DREAMINGWAY","text":"Oh dear..."},{"name":"LIVINGWAY","text":"Even I didn't recognize them at first. I wondered whence this new Way had sprung."},{"name":"LIVINGWAY","text":"Then I watched them stand out there, gazing at the sky─at Etheirys─and I realized..."},{"name":"LIVINGWAY","text":"It was the grief that had changed them. A loss too heavy to bear."},{"name":"LIVINGWAY","text":"It came as no surprise when they asked to be put back into hibernation."},{"name":"LIVINGWAY","text":"...Yet I cannot allow it. Even with the Final Days averted, there must be a place for us in this world. I know there is─we need only reach out our paws."},{"name":"LIVINGWAY","text":"I said as much, but it's as if they cannot hear me. And no matter how many times I refuse them, they return with their petition for eternal sleep."},{"name":"DREAMINGWAY","text":"It would be a tragedy to lose a Loporrit with so much love in their heart..."},{"name":"DREAMINGWAY","text":"We must find a way to help them! To give them a new dream."},{"name":"DREAMINGWAY","text":"Not that I know what that would be..."},{"name":"DREAMINGWAY","text":"Thank you for telling us of this, Livingway."},{"name":"DREAMINGWAY","text":"We should ask the others for help. This matter is of dire import!"},{"name":"DREAMINGWAY","text":"I shall see you in Hoper's Hold soon, then."},{"name":"LIVINGWAY","text":"A moment, <span class=\"highlight\">Forename</span>."},{"name":"LIVINGWAY","text":"If anyone can save Counselingway, it's you lot. And they <span class=\"emphasis\">can</span> be saved─I must believe that."},{"name":"LIVINGWAY","text":"So please, do everything in your power. On behalf of Loporrit-kind, I beseech you."},{"name":"DREAMINGWAY","text":"There you are! Come, we must bring Managingway into our confidence."},{"name":"DREAMINGWAY","text":"So...what do we do!?"},{"name":"MANAGINGWAY","text":"This Counselingway has visited the workshop several times, correct? Yet we have seen no measurable results thus far."},{"name":"MANAGINGWAY","text":"And they are not the only Loporrit to have been dissatisfied with our offerings. Though a significant portion have gravitated to the dreams on display, many remain uninterested."},{"name":"MANAGINGWAY","text":"We must try a different tack─one that targets this demographic specifically."},{"name":"DREAMINGWAY","text":"I see! But what could a Loporrit who doesn't fancy music <span class=\"emphasis\">or</span> mechanics <span class=\"emphasis\">or</span> mealtime possibly enjoy?"},{"name":"MANAGINGWAY","text":"We might look to what else they have in common..."},{"name":"MANAGINGWAY","text":"Assuming my mental register is correct─and it usually is─the remaining wayward Ways had roles that would have involved direct contact with the people of Etheirys."},{"name":"MANAGINGWAY","text":"In addition to consulting roles like Counselingway's, there were those specializing in guiding the people around our facilities, interpreting, and other aspects of hospitality."},{"name":"DREAMINGWAY","text":"Oh. That means..."},{"name":"DREAMINGWAY","text":"All of them would have been especially disappointed to find out that our guests weren't coming. They could hardly carry out their work alone..."},{"name":"DREAMINGWAY","text":"...Alone!"},{"name":"DREAMINGWAY","text":"What if we didn't wait for them to take interest in a new dream all by themselves?"},{"name":"DREAMINGWAY","text":"If we bring everyone together to work toward a common goal, it may remind them what it's like to have a purpose again!"},{"name":"MANAGINGWAY","text":"Teamwork is key, to be sure, but what sort of project could we give them?"},{"name":"DREAMINGWAY","text":"Uh..."},{"name":"DREAMINGWAY","text":"Uuuuuuh..."},{"name":"DREAMINGWAY","text":"Do you have any ideas, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Not singing. Please no singing..."},{"name":"A1","text":"Never underestimate the value of art."},{"name":"DREAMINGWAY","text":"Yes, I imagine the musically disinclined wouldn't enjoy singing very much. Perhaps something that involves using their paws..."},{"name":"DREAMINGWAY","text":"Such as...painting?"},{"name":"DREAMINGWAY","text":"Look at these boring walls we have! Surely they could use a touch of paint, or─gasp!─a <span class=\"emphasis\">mural</span>."},{"name":"MANAGINGWAY","text":"Expressing oneself through art <span class=\"emphasis\">is</span> a proven means of processing negative experiences... Though some may prefer a medium other than paint. Never fear─I shall arrange for a variety of supplies."},{"name":"MANAGINGWAY","text":"At minimum, we can expect to attract Counselingway's attention once more."},{"name":"DREAMINGWAY","text":"Just where we want them─paying attention!"},{"name":"DREAMINGWAY","text":"For the time being, let us focus on gathering as many wayward Ways as possible."},{"name":"DREAMINGWAY","text":"With you here, it should be easy! Even the most listless Loporrit would jump at the chance to work together with a representative of mankind."},{"name":"DREAMINGWAY","text":"We only need to find them! Again."},{"name":"LOPORRITA04684","text":"Painting? I don't know much about art, I'm afraid."},{"name":"LOPORRITA04684","text":"But if you insist, I can join you as moral support. My job was supposed to be helping people in need, after all..."},{"name":"LOPORRITB04684","text":"You want to create something...together? Is that allowed? I can't see much of a point in it."},{"name":"LOPORRITB04684","text":"Yet I can hardly refuse a request from a person of Etheirys. Even now..."},{"name":"LOPORRITC04684","text":"Express my feelings through art? That sounds difficult."},{"name":"LOPORRITC04684","text":"Though if it helps people─or even just you─I suppose we can give it a try..."},{"name":"SUPPORTER","text":"Greetings! If you require direction, please speak with Dreamingway. &lt;blip&gt; Today's automatically generated suggestion is: Whisker Waxing!"},{"name":"LOPORRITC04684","text":"I suppose that does look...fun."},{"name":"DREAMINGWAY","text":"Thanks to your persuasive person-ing, we have more participants than we know what to do with!"},{"name":"DREAMINGWAY","text":"I jest, of course. Managingway always knows what to do! Speaking of which..."},{"name":"DREAMINGWAY","text":"They've asked that you create a few brushes out of metal. Some of our painters may become quite...vigorous in their expression."},{"name":"DREAMINGWAY","text":"They've asked that you create a few palettes. Some of our painters would like to use a great many colors!"},{"name":"DREAMINGWAY","text":"They've asked that you create additional paints. Some of our painters firmly believe that quantity equals quality!"},{"name":"DREAMINGWAY","text":"As always, Managingway has provided supplies─for your convenience and ours. More can be had from the dreaming supporter if you need them."},{"name":"DREAMINGWAY","text":"I may step away to make sure that no one else attempts to paint the wall with Cookingway's frosting, but trust that you will find me here when you're done!"},{"name":"DREAMINGWAY","text":"I love the smell of fresh art supplies! &lt;sniff&gt; Don't you?"},{"name":"DREAMINGWAY","text":"I love the smell of fresh art supplies! &lt;sniff&gt; Don't you?"},{"name":"DREAMINGWAY","text":"I love the smell of fresh art supplies! &lt;sniff&gt; Don't you?"},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Oh dear! It appears that sufficient supplies are in your possession. Project management <span class=\"emphasis\">firmly</span> reminds you that all materials must be used before more are provided."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Oh dear! It appears that sufficient supplies are in your possession. Project management <span class=\"emphasis\">firmly</span> reminds you that all materials must be used before more are provided."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Oh dear! It appears that sufficient supplies are in your possession. Project management <span class=\"emphasis\">firmly</span> reminds you that all materials must be used before more are provided."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Here you are─may you inhale only a minimal amount of toxic fumes!"},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Here you are─may you inhale only a minimal amount of toxic fumes!"},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Here you are─may you inhale only a minimal amount of toxic fumes!"},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."},{"name":"DREAMINGWAY","text":"Just in time to prevent further frosting-based incident! I'll take those off your paws."},{"name":"DREAMINGWAY","text":"I shall see these distributed to our artists posthaste!"},{"name":"DREAMINGWAY","text":"I can hardly wait to see the finished product..."},{"name":"DREAMINGWAY","text":"I had hoped they would enjoy themselves, but I never imagined they would become so absorbed in their work─nor create such a magnificent mural! This is by far our greatest success yet."},{"name":"TALKINGWAY","text":"Art? Truly, you're making my task too easy..."},{"name":"DREAMINGWAY","text":"Counselingway!"},{"name":"TALKINGWAY","text":"Do <span class=\"emphasis\">not</span> call me that. 'Tis a relic of a life I care not to remember."},{"name":"DREAMINGWAY","text":"Noted! Would you like to try your paw at painting?"},{"name":"TALKINGWAY","text":"...Hmph. Not particularly."},{"name":"MANAGINGWAY","text":"There is a distinct lack of unified vision here...yet somehow, it works. Art is a mystery indeed."},{"name":"LOPORRITA04684","text":"I had no idea that art could be so liberating. I haven't had this much fun in ages!"},{"name":"TALKINGWAY","text":"...Fun? Perhaps I once knew what that was like..."},{"name":"DREAMINGWAY","text":"With all of the Loporrits we've helped, I'd like to think we've done our part."},{"name":"DREAMINGWAY","text":"Still, we cannot stop. No─we will not stop! Not until we've helped Counselingway, and anyone else who has yet to find a dream."},{"name":"SYSTEM","text":"The imaging station is now open, allowing once-wayward Ways to vent their innermost emotions through creative pursuits. There are yet Loporrits that want for new purpose, however. Continue expanding the workshop to see what dreams may come!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Honored</span> reputation with the Dreaming Ways."},{"name":"SYSTEM","text":"You may raise their faith in you further by continuing to assist with the Dreaming Workshop."},{"name":"SYSTEM","text":"New Loporrit tribal daily quests are now available from Managingway in Hoper's Hold."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Managingway as a reputation bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Managingway. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from Coiningway."}],"reward":{"gil":1335},"reqs":{"beastrank":5,"jobs":[{"lvl":80,"id":33}],"quests":[70219]},"next":[70221]},"partials":[{"type":"npc","id":"1044402","obj":{"i":1044402,"n":"Dreamingway","l":3711,"q":5}},{"type":"npc","id":"1044947","obj":{"i":1044947,"n":"Dreamingway","l":3711,"q":1}},{"type":"item","id":"38848","obj":{"i":38848,"n":"Painting Supply Materials","l":1,"c":26001,"t":61}},{"type":"item","id":"38849","obj":{"i":38849,"n":"Painting Supplies","l":430,"c":21012,"t":61}},{"type":"quest","id":"70219","obj":{"i":70219,"n":"Too Few Cooks","g":28,"l":"Mare Lamentorum","s":3,"f":1}},{"type":"quest","id":"70221","obj":{"i":70221,"n":"A Million Malms Away","g":28,"l":"Mare Lamentorum","s":5,"f":1}}]}