{"quest":{"name":"A Million Malms Away","location":"Mare Lamentorum","id":70221,"patch":6.35,"sort":5,"icon":101225,"beast":17,"unlocksFunction":1,"eventIcon":71341,"issuer":1044402,"target":1044955,"genre":28,"usedItems":[38850,38851],"journal":["Dreamingway is contemplatively eyeing the remaining open space in Hoper's Hold.<br>※The difficulty of this quest will be synced to your current level.","Dreamingway summons you to a meeting of minds, intent on dreaming up a station that can revive the ashen-furred Loporrit's zest for life. You settle on an idea that would allow them to communicate with the people of Etheirys regardless of distance─radio. As you have only ever been on the listening end of such devices, however, the technical requirements will need to be gleaned from experts before you can set to work. In the meanwhile, Dreamingway asks that you accompany him to tempt no-longer-Counselingway with word of the project.","You and Dreamingway find the ashen-furred Loporrit in their usual spot, gazing at the faraway Etheirys. The mention of radio prompts the lengthiest proclamation you've heard from them thus far, revealing that they maintain a keen interest in being of the utmost aid to mankind. Whether they will follow through on their stated intent to provide additional input on programming remains to be seen, but it appears you have at least piqued their interest...","Back in Hoper's Hold, you consult Dreamingway and Managingway about the equipment required for creating radio transmissions. Though the instructions are somewhat unclear, your craftsman's competence has carried you through thus far, and there is no reason to believe it shall not do so again.","You present the necessary equipment─probably─to Dreamingway, and the broadcasting station is created with minimal incident. With some encouragement, the ashen-furred Loporrit is persuaded to voice the inaugural broadcast, transmitting a message of newfound hope to people across Etheirys. Are you listening?"],"objectives":["Speak with Dreamingway.","Speak with Dreamingway again.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Dreamingway</span></span>."],"dialogue":[{"name":"DREAMINGWAY","text":"Could you join us for a moment, <span class=\"highlight\">Forename</span>?"},{"name":"MANAGINGWAY","text":"My survey of Bestways Burrow morale indicates that the situation is as we suspected─though our efforts have reached the majority of wayward Ways, a few yet remain in the doldrums."},{"name":"MANAGINGWAY","text":"The erstwhile Counselingway first among them, of course."},{"name":"DREAMINGWAY","text":"I've stretched my imagination ever so hard for dreams that might inspire them, but nothing concrete has come to mind..."},{"name":"MANAGINGWAY","text":"I propose that we examine the issue of their personal motivation more closely. Per Livingway, they were once passionate about their work, after all."},{"name":"MANAGINGWAY","text":"We cannot change the fact that the people of Etheirys won't be coming to live on the moon, but reaching out to them is hardly beyond our means."},{"name":"MANAGINGWAY","text":"There is naught stopping us from utilizing our ashen-furred associate's communication skills to aid mankind, albeit remotely."},{"name":"DREAMINGWAY","text":"Thus making their <span class=\"emphasis\">old</span> dream their <span class=\"emphasis\">new</span> dream... But what sort of station would be suitable?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"One for sharing useful information with the people of Etheirys."},{"name":"A1","text":"Perhaps a station that individuals could contact with questions?"},{"name":"DREAMINGWAY","text":"Your people's ears aren't very large, though. How could they hear what's being said?"},{"name":"DREAMINGWAY","text":"That would be quite similar to not-Counselingway's previous job. How would people contact us, though?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You might use one of those Garlean “radios”─so long as you refrain from any mind-bending schemes."},{"name":"A1","text":"Everyone and their minion seems quite happy to call me via linkpearl."},{"name":"DREAMINGWAY","text":"\"Schemes“ sound bad, but ”radio“ sounds intriguing! Tell me more..."},{"name":"DREAMINGWAY","text":"...And you can truly hear distant voices through the tiny box? Incredible!"},{"name":"DREAMINGWAY","text":"Linkpearls! I had entirely forgotten. That would have made finding you on Etheirys a lot easier..."},{"name":"MANAGINGWAY","text":"Unfortunately, to purchase dedicated linkpearls for the entire population of the star would be stretching our budget rather thin. To say naught of the nightmarish logistics of distribution..."},{"name":"DREAMINGWAY","text":"Aw..."},{"name":"DREAMINGWAY","text":"We simply must find a way to transmit to these radios. For science!"},{"name":"MANAGINGWAY","text":"Eyes on the project objectives, please. That said, I quite agree."},{"name":"MANAGINGWAY","text":"If Garlemald has such technology, it is likely that the Sharlayans have studied it, if not invented similar devices of their own."},{"name":"MANAGINGWAY","text":"If so, they may have shared its secrets with Livingway. No doubt Inventingway will have thoughts on the matter as well..."},{"name":"DREAMINGWAY","text":"I leave the technical details in your capable paws, Managingway. In the meanwhile, I should like to have a chat with the Loporrit formally known as Counselingway..."},{"name":"DREAMINGWAY","text":"Please join me in inviting them to join us!"},{"name":"TALKINGWAY","text":"You again, I see."},{"name":"TALKINGWAY","text":"You want me to assist the people of Etheirys...remotely?"},{"name":"DREAMINGWAY","text":"Construction of the station is underway as we speak. Using the magic known as “radio,” we can transmit all manner of noises across space and...darker space!"},{"name":"DREAMINGWAY","text":"For instance...music! Goodness, we could share my music, couldn't we?"},{"name":"TALKINGWAY","text":"Do <span class=\"emphasis\">not</span> bother the people of Etheirys with that noisome beeping."},{"name":"TALKINGWAY","text":"If we are to employ this station of yours, surely there are myriad better uses."},{"name":"DREAMINGWAY","text":"Better than music?"},{"name":"TALKINGWAY","text":"If you ask me..."},{"name":"TALKINGWAY","text":"Many of Etheirys's people lost loved ones during the Final Days, did they not? We could let them know that they're not alone."},{"name":"TALKINGWAY","text":"Or─purely as an example, you understand─we could use our unique vantage point to describe cloud formations."},{"name":"DREAMINGWAY","text":"Oooh... I don't follow!"},{"name":"TALKINGWAY","text":"&lt;sigh&gt; With that information, those on the ground could more accurately predict incoming storms, forestalling ill-fated forays."},{"name":"DREAMINGWAY","text":"You truly are an expert in helpfulness! Those things never would have occurred to me."},{"name":"TALKINGWAY","text":"I suppose I can come and look in on you once you've completed your facilities. Clearly, someone needs to tell you where you're going wrong..."},{"name":"DREAMINGWAY","text":"Please do!"},{"name":"DREAMINGWAY","text":"I can hardly wait for you to join us. Together, we shall create radio noises like no one has heard before..."},{"name":"DREAMINGWAY","text":"...Though I suppose we need to actually finish the station first."},{"name":"DREAMINGWAY","text":"We'll see you there! In the Dreaming Workshop! Make sure to come!"},{"name":"TALKINGWAY","text":"If I do...will you listen?"},{"name":"SUPPORTER","text":"Greetings! If you require direction, please speak with Dreamingway. &lt;blip&gt; Today's automatically generated suggestion is: Unsettling Staring!"},{"name":"DREAMINGWAY","text":"Is construction proceeding apace?"},{"name":"MANAGINGWAY","text":"We are on schedule─though I have been awaiting <span class=\"highlight\">Forename</span>'s return. I trust <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> will have little difficulty producing equipment to the vague and mysterious specifications provided by our Sharlayan correspondents."},{"name":"MANAGINGWAY","text":"Ahem! If I may..."},{"name":"MANAGINGWAY","text":"We will require a “microphone,” or several. I am told that the material inside the device responds to sound waves to produce a signal that can then be transmitted via radio. "},{"name":"MANAGINGWAY","text":"We will require a “soundboard.” I am told that this device adjusts the signal produced by the “microphone”─and can even produce sounds of its own."},{"name":"MANAGINGWAY","text":"We will require tiny bottles of oil for knobs, dials, and the like. No, I do not know what sort of knobs and dials."},{"name":"MANAGINGWAY","text":"These are the materials─I assume you can manage the rest on your own."},{"name":"MANAGINGWAY","text":"Should you require additional supplies, as always, our stocks are with the dreaming supporter."},{"name":"MANAGINGWAY","text":"I will be occupied in ensuring that no one shocks themselves into a stupor whilst assembling the booth, but Dreamingway should be free to collect your finished creations."},{"name":"DREAMINGWAY","text":"Having trouble creating the thingamabobs, are you? Surely Managingway won't mind if you collect a few more supplies from the dreaming supporter..."},{"name":"DREAMINGWAY","text":"Having trouble creating the thingamabobs, are you? Surely Managingway won't mind if you collect a few more supplies from the dreaming supporter..."},{"name":"DREAMINGWAY","text":"Having trouble creating the thingamabobs, are you? Surely Managingway won't mind if you collect a few more supplies from the dreaming supporter..."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Oh dear! It appears that the necessary supplies are in your possession. All materials must be used before more are provided. Project management is no longer asking."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Oh dear! It appears that the necessary supplies are in your possession. All materials must be used before more are provided. Project management is no longer asking."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Oh dear! It appears that the necessary supplies are in your possession. All materials must be used before more are provided. Project management is no longer asking."},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Here you are─may none of the tiny parts roll away, never to be seen again!"},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Here you are─may none of the tiny parts roll away, never to be seen again!"},{"name":"SUPPORTER","text":"Thank you for your materials request! &lt;blip&gt; Here you are─may none of the tiny parts roll away, never to be seen again!"},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."},{"name":"DREAMINGWAY","text":"This equipment is incredibly delicate, you say? Well, I suppose I don't <span class=\"emphasis\">need</span> to shake the box, strictly speaking..."},{"name":"DREAMINGWAY","text":"Oooh, it's even weirder than I expected."},{"name":"DREAMINGWAY","text":"I shall exercise the utmost caution as I hop over to Managingway with this, I promise!"},{"name":"TALKINGWAY","text":"So this is radio..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Won't you dream of a brighter future with us?"},{"name":"A2","text":"If you wish to speak to my people, the microphone is yours."},{"name":"TALKINGWAY","text":"...Dream?"},{"name":"TALKINGWAY","text":"My dream was always to be of help to your people."},{"name":"TALKINGWAY","text":"I have always wished to speak with the people of Etheirys."},{"name":"TALKINGWAY","text":"I must ask..."},{"name":"TALKINGWAY","text":"Do you think my voice will reach them?"},{"name":"DREAMINGWAY","text":"Of course it will! That's the magic of radio."},{"name":"TALKINGWAY","text":"...Very well."},{"name":"TALKINGWAY","text":"I would like to assist with this station, if you're still amenable to the idea. You won't find a harder working Way─I promise you that."},{"name":"DREAMINGWAY","text":"And with that, the broadcasting station is complete! Though we might want to check whether it's working."},{"name":"MANAGINGWAY","text":"We never did decide on the content of our first message. For once, I fear I am rather at a loss..."},{"name":"DREAMINGWAY","text":"That's where our newest Way comes in!"},{"name":"DREAMINGWAY","text":"Take it away, my friend!"},{"name":"TALKINGWAY","text":"Wh─? Me!?"},{"name":"DREAMINGWAY","text":"There must be something you'd like to share with the people of Etheirys in honor of this special occasion."},{"name":"TALKINGWAY","text":"Test... Test... P-People of Etheirys, are you there?"},{"name":"TALKINGWAY","text":"Can you hear me, far away as I am? All the way from the moon?"},{"name":"TALKINGWAY","text":"I hope I can be of use to you. I hope I can tell you something you didn't know before. I hope that, in your darkest moments, I can lift your spirits..."},{"name":"TALKINGWAY","text":"...But perhaps I should start from the beginning."},{"name":"TALKINGWAY","text":"For so long, I..."},{"name":"TALKINGWAY","text":"<span class=\"emphasis\">We</span> awaited your arrival on the moon. 'Twas to be under the most unfortunate circumstances, to be sure─yet that only increased the determination with which we set to our preparations."},{"name":"TALKINGWAY","text":"In the end, of course, the Final Days were averted. The moon was no longer needed."},{"name":"TALKINGWAY","text":"We were no longer needed."},{"name":"TALKINGWAY","text":"Make no mistake─we are glad for your fortune! If you are happy, we are happy. But for many of us─myself included─this marked an end to our very reason for being."},{"name":"TALKINGWAY","text":"...Until some Loporrits dared to dream again. To show us that there is always hope, so long as we reach for each other."},{"name":"TALKINGWAY","text":"Should you ever lose sight of your dreams, I hope you'll remember that you are not alone. We are here, and the future is a dream we all share."},{"name":"TALKINGWAY","text":"...And now, the weather!"},{"name":"TALKINGWAY","text":"That concludes our inaugural broadcast. Thank you, one and all, for listening."},{"name":"TALKINGWAY","text":"From the bottom of my heart, and on behalf of Loporrit-kind, I wish you the very best."},{"name":"TALKINGWAY","text":"Was it too long? It felt awfully short... Do you think they could hear well enough?"},{"name":"TALKINGWAY","text":"I suppose we shall never truly know our audience."},{"name":"TALKINGWAY","text":"But if my voice reached even one person...that is enough for me."},{"name":"TALKINGWAY","text":"That is my dream."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Sworn</span> reputation with the Dreaming Ways."},{"name":"SYSTEM","text":"You may raise their faith in you further by continuing to assist with the Dreaming Workshop."},{"name":"SYSTEM","text":"You will receive an experience point bonus upon completion of the Loporrit tribal daily quests."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from Coiningway."}],"reward":{"gil":1095},"reqs":{"beastrank":6,"jobs":[{"lvl":80,"id":33}],"quests":[70220]},"next":[70222]},"partials":[{"type":"npc","id":"1044402","obj":{"i":1044402,"n":"Dreamingway","l":3711,"q":5}},{"type":"npc","id":"1044955","obj":{"i":1044955,"n":"Dreamingway","l":3711,"q":1}},{"type":"item","id":"38850","obj":{"i":38850,"n":"Radio Equipment Materials","l":1,"c":26001,"t":61}},{"type":"item","id":"38851","obj":{"i":38851,"n":"Radio Equipment","l":430,"c":21012,"t":61}},{"type":"quest","id":"70220","obj":{"i":70220,"n":"Teamwork Makes the Dream Work","g":28,"l":"Mare Lamentorum","s":4,"f":1}},{"type":"quest","id":"70222","obj":{"i":70222,"n":"Dreams Come True","g":28,"l":"Mare Lamentorum","s":6,"f":1}}]}