{"quest":{"name":"Dreams Come True","location":"Mare Lamentorum","id":70222,"patch":6.35,"sort":6,"icon":101226,"beast":17,"unlocksFunction":1,"eventIcon":71341,"issuer":1044402,"target":1044402,"genre":28,"journal":["Dreamingway's pockets rustle as he moves...<br>※The difficulty of this quest will be synced to your current level.","Upon your inquiring with Dreamingway, he produces a stack of letters─mail for the Loporrits from the people of Etheirys. It seems that the Dreaming Ways' broadcasts have been both received and appreciated, and you are entrusted with delivering the good news to those who have shared their aspirations over the radio.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You deliver the first letter to Coiningway, who is delighted to read that Sharlayan's economists have taken an interest in the unique market he established in Hoper's Hold. Perhaps one day the Loporrit carat will see wider circulation...or perhaps not.","The second letter is for Inventingway, whose passions have resonated with the mechanically minded people of Garlemald. A representative of the fallen nation entreats his aid in rebuilding─a request to which he is most willing to acquiesce. One can only imagine what surprises might await next you visit the Garlean capital...","You carry your next letter to Cookingway, who has seen a surge in orders at the cooking station. Despite the popularity of his proffered fare, he is concerned that carrots remain a dominant ingredient, and, with a solely Loporrit clientele, has few sources of inspiration as to alternatives. Fortunately, his delivery is from Dickon at the Last Stand, who has helpfully included a recipe of his own design, along with a request that Cookingway send along any ideas he subsequently dreams up. With this fruitful partnership established, Hoper's Hold is certain to be home to fresh flavors in no time.","The final two letters are intended for the erstwhile Counselingway. They open the missives to find words of gratitude and admiration, and are deeply moved to learn that they have touched hearts on Etheirys after all. They offer you their thanks for helping them find their way, and introduce you to their new appellation─Talkingway─in anticipation of many friendly conversations to come.","Having seen each letter to its rightful recipient, you report to Dreamingway. He reflects on the unlikely but indisputable success of the Dreaming Workshop, thanking you for your contribution on behalf of Loporrit-kind. You part ways with a formal invitation to visit any time you like─for, even with new dreams in their hearts, the Loporrits will always be waiting for you."],"objectives":["Deliver a listener letter to Coiningway.","Deliver a listener letter to Inventingway.","Deliver a listener letter to Cookingway.","Deliver listener letters to the ashen-furred Loporrit.","Report to Dreamingway."],"dialogue":[{"name":"DREAMINGWAY","text":"<span class=\"highlight\">Forename</span>! I have a task of the utmost import for you."},{"name":"DREAMINGWAY","text":"After our inaugural broadcast, many of the Dreaming Workshop's Loporrits were inspired to share their own histories and aspirations via the radio..."},{"name":"DREAMINGWAY","text":"And it seems the people of Etheirys have been listening!"},{"name":"DREAMINGWAY","text":"We've received a number of letters, you see─addressed to all and sundry Ways."},{"name":"DREAMINGWAY","text":"I haven't been able to stop smiling since I read mine. I am painfully delighted!"},{"name":"DREAMINGWAY","text":"Yet I would doubtless be more so had my letter been delivered by a person of Etheirys in the flesh. What do you say?"},{"name":"DREAMINGWAY","text":"Those letters are for Coiningway, Inventingway, Cookingway, and Ta─er, the Loporrit of many names! Some of them “Counselingway” and others “the voice behind the microphone”...way? Ahem."},{"name":"DREAMINGWAY","text":"In any case, I cannot wait to hear how they all react!"},{"name":"DREAMINGWAY","text":"Though I am certain the shrieks of jubilation will carry, do fill me in on the particulars, yes?"},{"name":"COININGWAY","text":"Not here to spend your carats today? A pity. I do work so tirelessly to price our merchandise fairly..."},{"name":"COININGWAY","text":"What is this? A letter from a Sharlayan economist...? Oh, heavens. It's happening. It's finally happening!"},{"name":"COININGWAY","text":"(-Economist's Letter-)<span class=\"emphasis\">Having heard the fascinating tale of your success in establishing a new currency and independent market, my colleagues and I would like to formally invite you to submit to our rousing quarterly report...</span>"},{"name":"COININGWAY","text":"Such a heartwarming letter I have never received! I must pen a reply posthaste─not to mention my submission."},{"name":"COININGWAY","text":"I owe you thanks, <span class=\"highlight\">Forename</span>. Without your earnest cooperation, the carat's time to shine may never have come. Trust me when I say that my gratitude is beyond measure."},{"name":"COININGWAY","text":"It is most fortunate that I thought to offer wares sold in gil. The economists of Etheirys shall revel in the comparisons I am able to provide..."},{"name":"INVENTINGWAY","text":"Hail, <span class=\"highlight\">Forename</span>! Have you seen a loose screw anywhere?"},{"name":"INVENTINGWAY","text":"...No matter, I can carry on regardless. Doubt not that this next machine will astonish even your adventurer's eyes!"},{"name":"INVENTINGWAY","text":"...A letter from Etheirys? Curious. I wasn't aware that the postmoogle teleporters had passed safety inspection."},{"name":"INVENTINGWAY","text":"Let me see... Bugger me, these letters are tiny..."},{"name":"INVENTINGWAY","text":"Why, the writer is Garlean! “Restoration”...“recovered scrap”...“minimal explosions”..."},{"name":"INVENTINGWAY","text":"I see! With this information, I can surely design a machine or two to assist in Garlemald's reconstruction. How fortunate that they heard my broadcast."},{"name":"INVENTINGWAY","text":"It is only a matter of time before my inventions are beloved far and wide. First Garlemald, then Etheirys, then...the universe!"},{"name":"INVENTINGWAY","text":"...That is to say, I look forward to being of assistance to people in need."},{"name":"COOKINGWAY","text":"Can I interest you in a turn at the whisk? We've been overwhelmed with orders of late─what you see behind me is the last Way standing."},{"name":"COOKINGWAY","text":"Nevertheless, I am glad that everyone appreciates our Etheirys-inspired cuisine."},{"name":"COOKINGWAY","text":"I must confess─I worry that my inclinations still tend too heavily toward carrots. Yet I can hardly ask this lot for other ideas..."},{"name":"COOKINGWAY","text":"Fresh inspiration, you say? I certainly hope so..."},{"name":"COOKINGWAY","text":"A letter from Master Dickon himself! What a happy surprise."},{"name":"COOKINGWAY","text":"...And he's included a recipe of his own devising! This is precisely what I need to break free from my carrot-based confines."},{"name":"COOKINGWAY","text":"“Let me know if this inspires any new dishes up there,” he says. I certainly will."},{"name":"COOKINGWAY","text":"And I hope that you will sample whatever we cook up next!"},{"name":"COOKINGWAY","text":"Do come back for a meal once in a while, <span class=\"highlight\">Forename</span>─or at least dessert."},{"name":"TALKINGWAY","text":"Ah, well met! Can I help you with anything this <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">afternoon</span></span>?"},{"name":"TALKINGWAY","text":"For me? From <span class=\"emphasis\">persons of Etheirys</span>? Oh, I hope I didn't say something to offend them..."},{"name":"TALKINGWAY","text":"The first is from a Garlean refugee... “I miss my homeland dearly, but your voice reminded me that even here, I'm not alone. Thank you for lifting my spirits.”"},{"name":"TALKINGWAY","text":"And this one appears to have been written by a child's paw..."},{"name":"TALKINGWAY","text":"(-Child's Letter-)<span class=\"emphasis\">Dear Radio Loppit,<br>How did you learn to talk like people? You are very good. I want to be a radio when I grow up too!<br>Love, Me</span>"},{"name":"TALKINGWAY","text":"...They really are listening."},{"name":"TALKINGWAY","text":"I once believed I would never again look forward to tomorrow..."},{"name":"TALKINGWAY","text":"But Dreamingway's hope is infectious, isn't it? I owe him─and you─more than I can say."},{"name":"TALKINGWAY","text":"I'd like to share something with you, if you don't mind..."},{"name":"TALKINGWAY","text":"I've been pondering a new name for myself. My dream may have not changed all that much, but I am a different Way than I once was."},{"name":"TALKINGWAY","text":"I was alone for quite some time, you understand─long enough to make me appreciate the value of a kind word. Now that I have returned to the fluffle, I find myself wanting to speak with your people and my fellow Loporrits as much as I can. So, after some discussion..."},{"name":"TALKINGWAY","text":"(-Talkingway-)I have chosen to become “Talkingway.”"},{"name":"TALKINGWAY","text":"(-Talkingway-)I shall be a friendly voice to the people of Etheirys─and to those closer to home."},{"name":"TALKINGWAY","text":"(-Talkingway-)By which I mean... W-Well..."},{"name":"TALKINGWAY","text":"(-Talkingway-)I hope you will consider me a friend, too."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I wouldn't have it any other way."},{"name":"A1","text":"Say no more, Talkingway! ...Or do! Yes."},{"name":"TALKINGWAY","text":"(-Talkingway-)Thank you, <span class=\"highlight\">Forename</span>! For your kindness...and for listening."},{"name":"SYSTEM","text":"With this delivery to your new friend Talkingway, all of the letters have been safely seen into the right paws."},{"name":"SYSTEM","text":"Dreamingway will surely be delighted to know of the joy with which they were received."},{"name":"DREAMINGWAY","text":"<span class=\"highlight\">Forename</span>! Were they excited? Delighted?"},{"name":"DREAMINGWAY","text":"That's even better than I dreamed! The people of Etheirys have been ever so kind..."},{"name":"DREAMINGWAY","text":"...Including those who have yet to listen to our broadcast!"},{"name":"DREAMINGWAY","text":"According to one of the letters Managingway received, word of our station has spread far and wide, and many of your fellows are keen to get their paws on radios of their own─to little success, I'm afraid..."},{"name":"DREAMINGWAY","text":"But we're here to help! Inventingway has gathered his disciples, and they are producing radios as we speak. We shall see them delivered to Etheirys with all speed!"},{"name":"DREAMINGWAY","text":"Can you imagine? The whole star, listening to us!"},{"name":"DREAMINGWAY","text":"To be honest, I was uncertain we would ever make it this far. To find new dreams for each and every Loporrit seemed a monumental task..."},{"name":"DREAMINGWAY","text":"Yet look at them now! They've come so far...and who knows what they'll dream up next?"},{"name":"DREAMINGWAY","text":"Of course, as for me..."},{"name":"DREAMINGWAY","text":"I'm eager to start composing again. Get ready to hop along to my next hit!"},{"name":"DREAMINGWAY","text":"None of our dreams would have been possible without you, <span class=\"highlight\">Forename</span>. On behalf of all of us─thank you ever so much!"},{"name":"DREAMINGWAY","text":"And remember─should you want for a friendly ear or a well-eared friend, we are always here for you!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Bloodsworn</span> reputation with the Dreaming Ways."},{"name":"SYSTEM","text":"You will receive an experience point bonus upon the completion of Loporrit tribal daily quests."},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Ear Wiggle</span>!"}],"reward":{"gil":1055,"emote":"Ear Wiggle"},"reqs":{"beastrank":7,"jobs":[{"lvl":80,"id":33}],"quests":[70221]}},"partials":[{"type":"npc","id":"1044402","obj":{"i":1044402,"n":"Dreamingway","l":3711,"q":5}},{"type":"quest","id":"70221","obj":{"i":70221,"n":"A Million Malms Away","g":28,"l":"Mare Lamentorum","s":5,"f":1}}]}