{"quest":{"name":"Hare-raising Thrills","location":"Mare Lamentorum","id":70235,"patch":6.35,"sort":113,"interval":"daily","repeatable":1,"beast":17,"eventIcon":71222,"issuer":1044403,"target":1044403,"genre":29,"usedItems":[38870,38871],"journal":["An unusual request from Thrillingway has left Managingway utterly baffled.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with Keepingway.","Deliver the requested item to the trembling Loporrit.","Report to Managingway."],"objectives":["Speak with Keepingway.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to the trembling Loporrit</span></span>.","Report to Managingway."],"dialogue":[{"name":"MANAGINGWAY","text":"Tell me, have you heard of a fellow by the name of Thrillingway? An eccentric one, he is─he believes it is the sublime rush of a thrill that colors the blandness of life with meaning. I cannot say I agree, but nevertheless, he seeks our help with fulfilling his dream."},{"name":"MANAGINGWAY","text":"He desires an instrument of some kind to help him discover new thrills. Unfortunately, our very best minds have been unable to grasp what precisely it is that he wishes for."},{"name":"MANAGINGWAY","text":"Do you remember Thrillingway? He's come to us again, seeking a new instrument for thrills. My fellows have tried everything, but have again been unable to come up with anything that would please him."},{"name":"MANAGINGWAY","text":"As a person who has seen thrills of all sorts, I believe you are the only one who can understand him. You're our last hope, in any case."},{"name":"MANAGINGWAY","text":"Keepingway yonder has various materials at paw to craft what is needed. If anyone can do this, it's you."},{"name":"KEEPINGWAY","text":"Here to assist with the matter concerning Thrillingway, yes? Your help is much appreciated! I should have everything you need right here, but I'm afraid the exact process of the desired item's construction is beyond my understanding..."},{"name":"KEEPINGWAY","text":"It seems he requires a pair of shears─but not just any pair. No, he desires blades sharp enough to carve fur clean off! &lt;shudder&gt; See what you can do with these pointy pieces of metal."},{"name":"KEEPINGWAY","text":"He wants a sturdy coil of rope suitable for binding all four limbs of...a “friend,” allegedly. I would prefer not to know any further details, so if you could just see what you can do with this sack of materials here..."},{"name":"KEEPINGWAY","text":"Seems he wants a highly acidic gel for some dubious purpose I did not have the heart to inquire about. Honestly, I think it's best if we don't know. So, uh, see what you can do with these toxic substances..."},{"name":"KEEPINGWAY","text":"When you've finished, please deliver the item to a certain terrified Loporrit in Greatest Endsvale. Just look for a fellow trembling with fear, you can't miss 'em. They'll take over the delivery from there."},{"name":"KEEPINGWAY","text":"Given the unique and trying nature of the request, you may find yourself in need of additional materials. Should that be the case, simply approach the doing supporter yonder for replenishments."},{"name":"SUPPORTER04699","text":"&lt;beep&gt; A request for materials? For <span class=\"emphasis\">this</span> supporter? Aww, you shouldn't have! &lt;bloop&gt; Oh, wait, you really shouldn't have...you already possess a sufficient amount."},{"name":"SUPPORTER04699","text":"&lt;beep&gt; A request for materials? For <span class=\"emphasis\">this</span> supporter? Aww, you shouldn't have! &lt;bloop&gt; Oh, wait, you really shouldn't have...you already possess a sufficient amount."},{"name":"SUPPORTER04699","text":"&lt;beep&gt; A request for materials? For <span class=\"emphasis\">this</span> supporter? Aww, you shouldn't have! &lt;bloop&gt; Oh, wait, you really shouldn't have...you already possess a sufficient amount."},{"name":"SUPPORTER04699","text":"Hello there! Need materials, do you? Well it's your lucky day, because it so happens this supporter has plenty of them available! &lt;beep&gt; Clarification: Replenishing depleted materials is this supporter's programmed function. Luck is not an included parameter."},{"name":"SUPPORTER04699","text":"Hello there! Need materials, do you? Well it's your lucky day, because it so happens this supporter has plenty of them available! &lt;beep&gt; Clarification: Replenishing depleted materials is this supporter's programmed function. Luck is not an included parameter."},{"name":"SUPPORTER04699","text":"Hello there! Need materials, do you? Well it's your lucky day, because it so happens this supporter has plenty of them available! &lt;beep&gt; Clarification: Replenishing depleted materials is this supporter's programmed function. Luck is not an included parameter."},{"name":"LOPORRIT04699","text":"D-D-Did you bring the item Th-Thrillingway requested? Oh sweet Mother Hydaelyn, I'm too afraid to look... &lt;whimper&gt;"},{"name":"LOPORRIT04699","text":"Oh dear, y-you actually made it. But is it safe to deliver it to him? The th-things he'll do... &lt;shiver&gt;"},{"name":"LOPORRIT04699","text":"Oh, bugger. I m-must respect the effort you went through to fulfill his dream. I will deliver it to him as requested. P-Please let Managingway know, and maybe, just maybe...consider sending help."},{"name":"MANAGINGWAY","text":"You're returned! For you to have completed so unusual a request with such aplomb, you truly were the right person for the job."},{"name":"MANAGINGWAY","text":"Thrillingway appears to be quite pleased with the item, but I must say his behavior has grown increasingly erratic. I suppose it will be fine as long as he's happy, and no one gets hurt... No one <span class=\"emphasis\">has</span> been hurt, right?"},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":735,"reputation":60,"items":[{"id":38952},{"num":25,"id":10},{"id":38952},{"num":25,"id":8},{"id":38952},{"num":25,"id":9},{"id":38952},{"num":25,"id":10},{"id":38952},{"num":25,"id":11},{"id":38952},{"num":25,"id":12},{"id":38952},{"num":25,"id":13},{"id":38952},{"num":25,"id":8}]},"reqs":{"beastrank":4,"jobs":[{"lvl":80,"id":33}]}},"partials":[{"type":"npc","id":"1044403","obj":{"i":1044403,"n":"Managingway","l":3711,"q":28}},{"type":"item","id":"38952","obj":{"i":38952,"n":"Loporrit Carat","l":1,"c":"t/65100","t":100}},{"type":"item","id":"38870","obj":{"i":38870,"n":"Occult Paraphernalia Materials","l":1,"c":25919,"t":61}},{"type":"item","id":"38871","obj":{"i":38871,"n":"Occult Paraphernalia","l":430,"c":23001,"t":61}}]}