{"quest":{"name":"Be Carrotful What You Wish For","location":"Mare Lamentorum","id":70236,"patch":6.35,"sort":114,"interval":"daily","repeatable":1,"beast":17,"eventIcon":71222,"issuer":1044403,"target":1044403,"genre":29,"journal":["Managingway's ears are poised to catch word of revolutionary developments.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with the spunky Loporrit in the Carrotorium.","With the chat mode in <span class=\"highlight\">Say</span>, enter any phrase containing “dream bigger” to activate the dream maker.","Report to the spunky Loporrit in the Carrotorium.","Report to Managingway."],"dialogue":[{"name":"MANAGINGWAY","text":"Ah, <span class=\"highlight\">Forename</span>, you couldn't have come at a better time. You see, Inventingway's been tinkering around with one of the supporters─as he is wont to do─and claims to have come up with the next best thing since <span class=\"emphasis\">carrots</span>."},{"name":"MANAGINGWAY","text":"Now, I take no joy in asking yet another favor of you, but it seems he needs help of the non-Loporrit variety with conducting some kind of experiment. Would you be willing to lend the fellow a paw? "},{"name":"MANAGINGWAY","text":"If you are, you'll find his assistant nearby the Carrotorium entrance. He'll be happy to give you all the particulars."},{"name":"LOPORRIT04700","text":"You must be the person we ordered! Oh, don't look at me like that, we've nothing nefarious planned. We just need you to help us run a little test for our latest invention: the <span class=\"emphasis\">dream maker</span>!  "},{"name":"LOPORRIT04700","text":"But what <span class=\"emphasis\">is</span> this dream maker, you ask─or so I imagine you will. Why, it's a marvelous machine that analyzes a subject's mind, and, wait for it─grants them their innermost desire. Brilliant, isn't it?"},{"name":"LOPORRIT04700","text":"Lest you worry, <span class=\"emphasis\">I'm</span> the subject of this experiment. The maker's sensors are regretfully indiscriminate at present, causing it to confuse any old Loporrit that goes near it with me. That's where you come in."},{"name":"LOPORRIT04700","text":"You need simply head west from here, where you'll find the dream maker in standby mode, and input the voice command, “dream bigger.” From there, the maker will execute the experiment as programmed."},{"name":"LOPORRIT04700","text":"It's just west of here, as I mentioned. You need only say “dream bigger” aloud beside it, and the maker should carry out its designed function."},{"name":"SAYTODO","text":"dream bigger"},{"name":"SUPPORTER04700","text":"&lt;bleep&gt; &lt;bloop&gt; Well how do you do! This maker of dreams is feeling awfully useless simply awaiting commands, so just sing out the magic words whenever you're ready and we can get to work!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase containing the words “dream bigger” to activate the dream maker."},{"name":"SUPPORTER04700","text":"&lt;beep&gt; Oh, my! There's the command, right in this maker's auditory inputs! Now activating the dream realization protocol... Performing a remote analysis of the target subject... Oooh, dream <span class=\"emphasis\">identified</span>! How predictable! Carrots!"},{"name":"SYSTEM","text":"The dream maker departed to enact some dubious function in relation to the spunky Loporrit's innermost desire. Return to him to report the results of the experiment."},{"name":"SUPPORTER04700","text":"&lt;boop&gt; Hello again! Thanks to you, another dream has been realized. With that, it's time...this dream maker...went to sleep..."},{"name":"LOPORRIT04700","text":"Ah, you came back. Good thing you did, as I'm feeling awfully perturbed. It beggars belief, but as I stood here pondering what manner of fantastical dream the maker would fulfill, it flew up to me and shoved a bloody <span class=\"emphasis\">carrot</span> in my mouth!"},{"name":"LOPORRIT04700","text":"As the carrot slipped down my throat, I had just enough time to give it a cursory lick─and from its flavor discovered I was choking on what could only be an iron carrot. I feel as if I could hop to Etheirys and back!"},{"name":"LOPORRIT04700","text":"Though that's not of much use to anyone, is it now? I suppose the experiment is a failure, but I'd be lying if I said I've never wished for the strength to tear this thing apart with my bare paws... Only every now and then, mind you."},{"name":"LOPORRIT04700","text":"As my vision blurred, and my desperate gasps for air went unheeded by the maker─focused on plunging the carrot down my throat as it was─my head began to feel light...light as if I'd just eaten a philosopher's carrot! Right now, I bet I could solve any mystery of the great expanse!"},{"name":"LOPORRIT04700","text":"Given the result, we can surely declare the experiment a success. I mean, if <span class=\"emphasis\">this</span> isn't irrefutable proof that Inventingway's visionary designs will lead us to greatness, I don't know what is!"},{"name":"LOPORRIT04700","text":"First I was shocked, then I was scared, until finally, I managed to swallow the damn thing. My gut tells me it was a carrot of happiness, but─ Ah, and there's the warm, fuzzy feeling... Ohohoho! Happiness has come knocking, my friend!"},{"name":"LOPORRIT04700","text":"Eh heh heh heh! The experiment was a success! No, it was a failure! Bahaha, I no longer care!"},{"name":"LOPORRIT04700","text":"I-In any case, the experiment is finished! I'd better return to Inventingway and apprise him of the results─would you mind reporting to Managingway?"},{"name":"MANAGINGWAY","text":"Ah, you're back. How did the experiment go?"},{"name":"MANAGINGWAY","text":"Mhmm...mhmm... I see. Well, the assault by carrot notwithstanding, it sounds like Inventingway and his team are thoroughly enjoying their work on this dream maker of theirs."},{"name":"MANAGINGWAY","text":"I only hope that no ill comes of their good intentions─wouldn't want another nasty incident like that affair with the Big Cheese. At any rate, it seems they've more tests to conduct, so do try to give them a paw again when you can spare the time."}],"reward":{"gil":815,"reputation":60,"items":[{"id":38952}]},"reqs":{"beastrank":4,"jobs":[{"lvl":80,"id":33}]}},"partials":[{"type":"npc","id":"1044403","obj":{"i":1044403,"n":"Managingway","l":3711,"q":28}},{"type":"item","id":"38952","obj":{"i":38952,"n":"Loporrit Carat","l":1,"c":"t/65100","t":100}}]}