{"quest":{"name":"Fungi Frustrations","location":"Mare Lamentorum","id":70239,"patch":6.35,"sort":117,"interval":"daily","repeatable":1,"beast":17,"eventIcon":71222,"issuer":1044403,"target":1044403,"genre":29,"usedItems":[38876,38877],"journal":["Managingway's brow is furrowed in what you can only assume is a Loporrit's expression of grave concern.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the foraging Loporrit at the Chlorophosgrot.","Deliver the requested items to the foraging Loporrit.","Report to Managingway."],"objectives":["Speak with the foraging Loporrit at the Chlorophosgrot.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to the foraging Loporrit at the Chlorophosgrot</span></span>.","Report to Managingway."],"dialogue":[{"name":"MANAGINGWAY","text":"Greetings, <span class=\"highlight\">Forename</span>. I was just thinking about how important this endeavor of ours truly is. You see, one of our fellow Ways was recently inspired to pursue a dream of their own─one they never would have discovered if not for Cookingway's example."},{"name":"MANAGINGWAY","text":"In the end, that's what all of this is about─helping one another find and pursue our individual dreams. Alas, our friend was out in the midst of this pursuit, foraging for culinary ingredients, when their tools broke."},{"name":"MANAGINGWAY","text":"I hate to impose, but since they refuse to return, it would do much to ease our concern if someone like you─a person well accustomed to voyages on the moon's surface─were to search for our willful friend and help them repair their equipment. You'll do it, won't you?"},{"name":"SUPPORTER04703","text":"Greetings and salutations! Normally, this supporter would offer you materials, but is not currently authorized to do so!"},{"name":"LOPORRIT04703","text":"Curse those mushrooms and their sturdy stems! I was just <span class=\"emphasis\">trying</span> to get some <span class=\"emphasis\">samples</span> and now my equipment is buggered to the star and back! ...Managingway did send you, didn't they? I would hate to have done all this ranting at some random passerby."},{"name":"LOPORRIT04703","text":"Anyway, do you think you could make a blade sharp enough to cut through hardy fungi with these steel components? No need to worry about running out of materials─the supporter I brought along has plenty more where that came from!"},{"name":"LOPORRIT04703","text":"Anyway, after nearly losing a paw from my blade rebounding off of those infernal fungi, a nonslip handle has quickly risen to the top of my priorities. Would you be able to make one with these materials? The supporter I brought along has plenty more where that came from, should you need it!"},{"name":"LOPORRIT04703","text":"Anyway, I can't have my tool jamming on me again. Do you think you could prepare some oil with these materials so I can ensure the blade is in perfect form? The supporter I brought along has plenty more where that came from, should you need it!"},{"name":"LOPORRIT04703","text":"When you've finished, please hand the item here so I can complete the repairs. I'm not leaving until I've cut out every last tasty ilm of those mushrooms!"},{"name":"SUPPORTER04703","text":"&lt;beep&gt; You need materials? Are you sure you do? Have you checked your pockets and everything? Because scans indicate that you still have a perfectly sufficient amount."},{"name":"SUPPORTER04703","text":"&lt;beep&gt; You need materials? Are you sure you do? Have you checked your pockets and everything? Because scans indicate that you still have a perfectly sufficient amount."},{"name":"SUPPORTER04703","text":"&lt;beep&gt; You need materials? Are you sure you do? Have you checked your pockets and everything? Because scans indicate that you still have a perfectly sufficient amount."},{"name":"SUPPORTER04703","text":"&lt;beep&gt; Facing a dearth of materials, are you? Never fear─this supporter is happy to serve! Now, if you'd just hold out your hands..."},{"name":"SUPPORTER04703","text":"&lt;beep&gt; Facing a dearth of materials, are you? Never fear─this supporter is happy to serve! Now, if you'd just hold out your hands..."},{"name":"SUPPORTER04703","text":"&lt;beep&gt; Facing a dearth of materials, are you? Never fear─this supporter is happy to serve! Now, if you'd just hold out your hands..."},{"name":"LOPORRIT04703","text":"Finished, have you? Well...have you?"},{"name":"LOPORRIT04703","text":"This is perfect! Once I've installed it into my equipment, I should have no problem collecting samples of those deceptively firm fungi! And when I have...I shall make a dish the likes of which Cookingway himself has never even <span class=\"emphasis\">dreamed</span> of making!"},{"name":"LOPORRIT04703","text":"Ahem. Well, I'm going to go chop up some mushrooms. You should head back and let Managingway know everything here is just fine. This...might take a while."},{"name":"MANAGINGWAY","text":"Welcome back! I take it our foraging friend is okay?"},{"name":"MANAGINGWAY","text":"I neglected to mention this earlier, but their dream is to cook undiscovered species of fungi, and enjoy the twofold thrills of exterminating harmful types of mushrooms whilst simultaneously discovering delectable new ones. And, as I understand, mushroom cuisine is also rather popular on Etheirys. "},{"name":"MANAGINGWAY","text":"Whether they produce a new mouthwatering recipe, or eradicate harmful fungal species first... I suppose we can't complain either way!"}],"reward":{"gil":735,"reputation":60,"items":[{"id":38952},{"num":25,"id":10},{"id":38952},{"num":25,"id":8},{"id":38952},{"num":25,"id":9},{"id":38952},{"num":25,"id":10},{"id":38952},{"num":25,"id":11},{"id":38952},{"num":25,"id":12},{"id":38952},{"num":25,"id":13},{"id":38952},{"num":25,"id":8}]},"reqs":{"beastrank":5,"jobs":[{"lvl":80,"id":33}]}},"partials":[{"type":"npc","id":"1044403","obj":{"i":1044403,"n":"Managingway","l":3711,"q":28}},{"type":"item","id":"38952","obj":{"i":38952,"n":"Loporrit Carat","l":1,"c":"t/65100","t":100}},{"type":"item","id":"38876","obj":{"i":38876,"n":"Loporrit's Gathering Tool Component Materials","l":1,"c":25919,"t":61}},{"type":"item","id":"38877","obj":{"i":38877,"n":"Loporrit's Gathering Tool Component","l":430,"c":21003,"t":61}}]}