{"quest":{"name":"Always Wear Protection","location":"Mare Lamentorum","id":70234,"patch":6.35,"sort":112,"interval":"daily","repeatable":1,"beast":17,"eventIcon":71222,"issuer":1044403,"target":1044403,"genre":29,"usedItems":[38868,38869],"journal":["Managingway is thinking it may be time to suit up.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with Protectingway.","Deliver the requested items to Managingway."],"objectives":["Speak with Protectingway in Bestways Burrow.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Managingway</span></span>."],"dialogue":[{"name":"MANAGINGWAY","text":"Ah, just the person I was looking for. Another bright-eyed dreamer has come to me seeking help─Protectingway."},{"name":"MANAGINGWAY","text":"Her dream is to see that all Loporrit-kind enjoy a long and healthy life abrim with safety. At present, she's hard at work on an invention to protect us from parasitic fungal spores─and the infectious diseases they can induce. Nasty stuff."},{"name":"MANAGINGWAY","text":"The moon's surface is full of all sorts of perils─inhale even one stray spore and we could find ourselves with a runny nose, rashes all over, or heavens, even loss of fur! If she can find some way to prevent such travesties from occurring, I for one would welcome it."},{"name":"MANAGINGWAY","text":"Ah, <span class=\"highlight\">Forename</span>. Do you have a moment to spare? Protectingway has requested your aid once again."},{"name":"MANAGINGWAY","text":"It seems her invention─the parasital infection protection suit, or PIPS for short─works, and now she wishes to bolster its production."},{"name":"MANAGINGWAY","text":"For the sake of all Loporrits present and─well, present, I ask that you meet her in Bestways Burrow, and assist her with the production of this invaluable device."},{"name":"PROTECTINGWAY","text":"Ah, hello there! I take it Managingway sent you here to assist me. Your help is much appreciated!"},{"name":"PROTECTINGWAY","text":"As Managingway undoubtedly informed you, I'm constructing a suit designed to shield the wearer from infectious spores. Unfortunately, I'm short on deft paws able to craft the most essential components─or rather I was, until you came."},{"name":"PROTECTINGWAY","text":"It would be wonderful if you could use these spare metal parts to craft a fastener for the suit to ensure it stays airtight! Should you run out of materials, I'm just a hop, skip, and a jump away!"},{"name":"PROTECTINGWAY","text":"It would be wonderful if you could craft an airtight fabric for the suit─can't have it letting in the stray fungal matter, after all! Should you run out of materials, I'm just a hop, skip, and a jump away!"},{"name":"PROTECTINGWAY","text":"It would be wonderful if you could craft an adhesive to ensure the suit remains airtight! Should you run out of materials, I'm just a hop, skip, and a jump away!"},{"name":"PROTECTINGWAY","text":"When you've finished, please take the component to Managingway. I wish to implement it into the suit straightaway upon my return to the machining station!"},{"name":"PROTECTINGWAY","text":"What's that? You've run out of materials? But... I clearly see you holding them right there!"},{"name":"PROTECTINGWAY","text":"What's that? You've run out of materials? But... I clearly see you holding them right there!"},{"name":"PROTECTINGWAY","text":"What's that? You've run out of materials? But... I clearly see you holding them right there!"},{"name":"PROTECTINGWAY","text":"Run out of materials, have you? Not to worry, I've plenty more here."},{"name":"PROTECTINGWAY","text":"Run out of materials, have you? Not to worry, I've plenty more here."},{"name":"PROTECTINGWAY","text":"Run out of materials, have you? Not to worry, I've plenty more here."},{"name":"MANAGINGWAY","text":"<span class=\"highlight\">Forename</span>! How do matters fare with Protectingway?"},{"name":"MANAGINGWAY","text":"Ah, I see you've already crafted the necessary material. If it were anyone else, I would be inclined to put this through several inspections─but I know we're in good paws with you. Protectingway will doubtless be thrilled."},{"name":"MANAGINGWAY","text":"Still, I wonder why she thought to create a protective suit. Rather than address a symptom of the problem, would it not be more effective to attack its source, and eradicate the infectious fungi in the first place?"},{"name":"MANAGINGWAY","text":"Well, it is not for me to question the dream of another. My thanks for your kind assistance!"}],"reward":{"gil":655,"reputation":60,"items":[{"id":38952},{"num":25,"id":10},{"id":38952},{"num":25,"id":8},{"id":38952},{"num":25,"id":9},{"id":38952},{"num":25,"id":10},{"id":38952},{"num":25,"id":11},{"id":38952},{"num":25,"id":12},{"id":38952},{"num":25,"id":13},{"id":38952},{"num":25,"id":8}]},"reqs":{"beastrank":4,"jobs":[{"lvl":80,"id":33}]}},"partials":[{"type":"npc","id":"1044403","obj":{"i":1044403,"n":"Managingway","l":3711,"q":28}},{"type":"item","id":"38952","obj":{"i":38952,"n":"Loporrit Carat","l":1,"c":"t/65100","t":100}},{"type":"item","id":"38868","obj":{"i":38868,"n":"Parasital Infection Protection Suit Component Materials","l":1,"c":25919,"t":61}},{"type":"item","id":"38869","obj":{"i":38869,"n":"Parasital Infection Protection Suit Component","l":430,"c":21003,"t":61}}]}