{"quest":{"name":"No Chill","location":"Mare Lamentorum","id":70238,"patch":6.35,"sort":116,"interval":"daily","repeatable":1,"beast":17,"eventIcon":71222,"issuer":1044403,"target":1044403,"genre":29,"usedItems":[38874,38875],"journal":["A certain culinary device is in need of repairs, and the desperate look in Managingway's eyes can only portend one thing.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the Loporrit mechanic in the Carrotorium.","Deliver the requested item to the Loporrit mechanic.","Report to Managingway."],"objectives":["Speak with the Loporrit mechanic in the Carrotorium.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to the Loporrit mechanic</span></span>.","Report to Managingway."],"dialogue":[{"name":"MANAGINGWAY","text":"The cooking station has been a smashing success since its grand opening, and I couldn't be more pleased! ...Well, perhaps I <span class=\"emphasis\">could</span> be more pleased should the others stop clambering over one another just to get a taste of Cookingway's culinary twists on the traditional carrot."},{"name":"MANAGINGWAY","text":"Unfortunately, his indispensable carrot chiller has broken down amidst the overwhelming demand, and many of us─myself included─wish for it to be repaired posthaste. The drop in productivity the workshop suffers in its absence is not to be borne."},{"name":"MANAGINGWAY","text":"<span class=\"highlight\">Forename</span>, have you heard? Oh, it's just awful─the carrot chiller you helped to repair has broken down again!"},{"name":"MANAGINGWAY","text":"As you're aware, the cooking station's frozen beverages are the talk of the hold, and nary a soul can keep their paws off of them. Hence, the carrot chiller is─or rather <span class=\"emphasis\">was</span> in perpetual use. Inventingway himself is seeing if he can refine the design to prevent this from happening again."},{"name":"MANAGINGWAY","text":"One of our Ways in charge of overseeing repairs has already gone to inspect it, but surely the process would go faster if you were there to assist them. I urge you to meet with them in the Carrotorium as soon as you are able."},{"name":"SUPPORTER04702","text":"&lt;beep&gt; Hello! Do you have any instructions? This supporter <span class=\"emphasis\">loves</span> instructions!"},{"name":"LOPORRIT04702","text":"What's that? You'll help me with the repairs? Oh, how very kind of you! Well then, give me just a moment to figure out how to distribute the remaining tasks."},{"name":"LOPORRIT04702","text":"Let's see here... Well, the cooling mechanism has seen better days. With your expertise, I wager you could make a suitable replacement in no time. Think you can put one together with these parts?"},{"name":"LOPORRIT04702","text":"Let's see here... Well, the chiller's insulative fabric has deteriorated a good deal, but I have all the necessary materials to stitch a few more yalms together. Think you could manage that?"},{"name":"LOPORRIT04702","text":"Let's see here... Well, the coolant for the chiller seems to have degraded. With your expertise, I wager you could make a much more effective one in no time. Think you can manage that with these ingredients?"},{"name":"SUPPORTER04702","text":"&lt;beep&gt; You require materials? But you have plenty already! Just think of how those poor materials would feel if they went perpetually unused. Go on, think about it."},{"name":"SUPPORTER04702","text":"&lt;beep&gt; You require materials? But you have plenty already! Just think of how those poor materials would feel if they went perpetually unused. Go on, think about it."},{"name":"SUPPORTER04702","text":"&lt;beep&gt; You require materials? But you have plenty already! Just think of how those poor materials would feel if they went perpetually unused. Go on, think about it."},{"name":"SUPPORTER04702","text":"&lt;beep&gt; Oh, do you require additional materials? Acknowledged, acknowledged! Just give this supporter a moment to fire up its transfer protocols!"},{"name":"SUPPORTER04702","text":"&lt;beep&gt; Oh, do you require additional materials? Acknowledged, acknowledged! Just give this supporter a moment to fire up its transfer protocols!"},{"name":"SUPPORTER04702","text":"&lt;beep&gt; Oh, do you require additional materials? Acknowledged, acknowledged! Just give this supporter a moment to fire up its transfer protocols!"},{"name":"LOPORRIT04702","text":"If you run out of materials, the supporter beside me will be able to resupply you with whatever you need."},{"name":"LOPORRIT04702","text":"Oh, have you finished?"},{"name":"LOPORRIT04702","text":"M-My word, this is absolutely remarkable! Fine work, my friend, fine work!"},{"name":"LOPORRIT04702","text":"I will set about getting the chiller up and running again with what you've made. Pray return to Managingway and let them know it will soon be in working order!"},{"name":"LOPORRIT04702","text":"Fret not, I shall see to the carrot chiller's repairs. You need but return to Managingway and let them know it shall soon be in working order!"},{"name":"MANAGINGWAY","text":"Oh, that's wonderful news, <span class=\"highlight\">Forename</span>. It sounds like the machine will be ready much sooner than we'd anticipated. I cannot thank you enough."},{"name":"MANAGINGWAY","text":"Why does the carrot chiller see such fierce demand, you ask? Well, allow me to answer your question with another: how would <span class=\"emphasis\">you</span> react to a delicious beverage comprised of pulverized chilled carrots?"},{"name":"MANAGINGWAY","text":"I thought so. The staff at the cooking station can even combine your favorite carrots and blend them into an original drink to keep you alert and refreshed─or whatever else you fancy, I suppose. Hmmm, perhaps I should put in my next order sooner rather than later..."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":735,"reputation":60,"items":[{"id":38952},{"num":25,"id":10},{"id":38952},{"num":25,"id":8},{"id":38952},{"num":25,"id":9},{"id":38952},{"num":25,"id":10},{"id":38952},{"num":25,"id":11},{"id":38952},{"num":25,"id":12},{"id":38952},{"num":25,"id":13},{"id":38952},{"num":25,"id":8}]},"reqs":{"beastrank":5,"jobs":[{"lvl":80,"id":33}]}},"partials":[{"type":"npc","id":"1044403","obj":{"i":1044403,"n":"Managingway","l":3711,"q":28}},{"type":"item","id":"38952","obj":{"i":38952,"n":"Loporrit Carat","l":1,"c":"t/65100","t":100}},{"type":"item","id":"38874","obj":{"i":38874,"n":"Carrot Chiller Component Materials","l":1,"c":25919,"t":61}},{"type":"item","id":"38875","obj":{"i":38875,"n":"Carrot Chiller Component","l":430,"c":23001,"t":61}}]}