{"quest":{"name":"Prototypical Retrieval","location":"Mare Lamentorum","id":70233,"patch":6.35,"sort":111,"interval":"daily","repeatable":1,"beast":17,"eventIcon":71222,"issuer":1044403,"target":1044403,"genre":29,"journal":["Managingway needs someone to retrieve a machine on the run.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Search for the prototype supporter near Heimdall's Last Sight.","Deliver the prototype supporter to Managingway."],"dialogue":[{"name":"MANAGINGWAY","text":"There's been an emergency call from Inventingway! One of his supporters under development has taken off without warning."},{"name":"MANAGINGWAY","text":"There's been an emergency call from Inventingway! Another one of his supporters has taken off without warning."},{"name":"MANAGINGWAY","text":"We tracked the machine as far as Heimdall's Last Sight, where deadly Allagan weapons are known to prowl."},{"name":"MANAGINGWAY","text":"As much as I dislike delegating dangerous tasks, we need you to find and retrieve the supporter. Please hurry...and be careful!"},{"name":"SYSTEM","text":"The supporter has ceased to function. Managingway will be eager to have it back."},{"name":"MANAGINGWAY","text":"Ah, you're back, and none the worse for the wear, thank goodness. You were able to retrieve our runaway supporter, I hope?"},{"name":"MANAGINGWAY","text":"We're in your debt! Lest you wonder, this machine was designed to serve as our playmate."},{"name":"MANAGINGWAY","text":"In taking off as it did, it appears to have mistakenly identified the Allagan weapons as friends."},{"name":"MANAGINGWAY","text":"We're in your debt─again. It appears the machine still mistakenly identifies the Allagan weapons as friends..."},{"name":"MANAGINGWAY","text":"We all need dreams, and it's a fine thing that Inventingway is dedicated to realizing his. I just wish he didn't create work for others in the process. It rather defeats the purpose of coming up with inventions to make our lives easier."}],"reward":{"gil":655,"reputation":60,"items":[{"id":38952}]},"reqs":{"beastrank":4,"jobs":[{"lvl":80,"id":33}]}},"partials":[{"type":"npc","id":"1044403","obj":{"i":1044403,"n":"Managingway","l":3711,"q":28}},{"type":"item","id":"38952","obj":{"i":38952,"n":"Loporrit Carat","l":1,"c":"t/65100","t":100}}]}