{"quest":{"name":"Pitch Perfect","location":"Mare Lamentorum","id":70230,"patch":6.35,"sort":108,"interval":"daily","repeatable":1,"beast":17,"eventIcon":71222,"issuer":1044403,"target":1044403,"genre":29,"journal":["Managingway wants to spread the joy of music.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with Ridingway.","Ride the moon-hopper to the Carrotorium and perform the hop-step at the designated locations.","Report to Managingway."],"dialogue":[{"name":"MANAGINGWAY","text":"Ever since we built the musicking station, many Ways have developed a liking for music."},{"name":"MANAGINGWAY","text":"Many more, however, remain unaware of the station's pleasures, and I would like you to help spread the word."},{"name":"MANAGINGWAY","text":"If you're willing, please report to Ridingway yonder. He has charge of the advertising effort, and will provide you with instructions."},{"name":"RIDINGWAY","text":"Ah, if it isn't <span class=\"highlight\">Forename</span>. Here to help us advertise the musicking station, yes?"},{"name":"RIDINGWAY","text":"There isn't anything to it, really. You just need to play a spot of music for some Ways out there."},{"name":"RIDINGWAY","text":"Without further ado, ride this moon-hopper over to the Carrotorium. Once there, use its hop-step function near a crowd. The feel-good sound it produces is bound to put a spring in our fellows' steps!"},{"name":"RIDINGWAY","text":"Ride the moon-hopper over to the Carrotorium, and use its hop-step function near a crowd. The feel-good sound it produces is bound to put a spring in our fellows' steps!"},{"name":"SYSTEM","text":"Some Loporrits have gathered here. Speak with Ridingway in Hoper's Hold to mount the moon-hopper, then perform the hop-step in their midst."},{"name":"LOPORRIT4694","text":"(-Playful Loporrit-)Ooh, what agreeable, uplifting music! I can't help but want to rollick!"},{"name":"LOPORRIT4694","text":"(-Playful Loporrit-)We can enjoy such feel-good sounds any time at this musicking station, you say? Thank you, we'll head there at once!"},{"name":"LOPORRIT4694","text":"(-Playful Loporrit-)Oho, if it isn't the feel-good sounds of the musicking station! Such a wonderful place that was! "},{"name":"LOPORRIT4694","text":"(-Playful Loporrit-)It's been too long since my last visit. I'll quickly finish up my work, then head over there again and hop till I drop!"},{"name":"LOPORRIT4694","text":"(-Languid Loporrit-)M-My tail and ears, they move as if they possessed a mind of their own... What in creation was that joyful sound?"},{"name":"LOPORRIT4694","text":"(-Languid Loporrit-)The musicking station... I never knew such a marvelous place existed. I'll pay a visit as soon as I can."},{"name":"LOPORRIT4694","text":"(-Languid Loporrit-)Oh, there it is again, the sound that makes my tail and ears want to dance..."},{"name":"LOPORRIT4694","text":"(-Languid Loporrit-)I must say, I was quite impressed with the musicking station, with its animated atmosphere. I must pay another visit after work."},{"name":"MANAGINGWAY","text":"There you are, <span class=\"highlight\">Forename</span>. My colleagues at the musicking station are pleased to report a measurable increase in guests."},{"name":"MANAGINGWAY","text":"This is no doubt due to your efforts. We hope to advertise the facility on a regular basis, and when next we do so, I trust we can depend on you again."}],"reward":{"gil":735,"reputation":60,"items":[{"id":38952}]},"reqs":{"beastrank":4,"jobs":[{"lvl":80,"id":33}]}},"partials":[{"type":"npc","id":"1044403","obj":{"i":1044403,"n":"Managingway","l":3711,"q":28}},{"type":"item","id":"38952","obj":{"i":38952,"n":"Loporrit Carat","l":1,"c":"t/65100","t":100}}]}