{"quest":{"name":"Craft, Craft, Fashion, Baby","location":"Mare Lamentorum","id":70249,"patch":6.35,"sort":127,"interval":"daily","repeatable":1,"beast":17,"eventIcon":71222,"issuer":1044403,"target":1044403,"genre":29,"usedItems":[38888,38889],"journal":["Where does the future of fashion lie? Inquiring Loporrits─Managingway among them─wish to know.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the restless Loporrit in the Carrotorium.","Deliver the requested item to Managingway."],"objectives":["Speak with the restless Loporrit.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Managingway</span></span>."],"dialogue":[{"name":"MANAGINGWAY","text":"This may come as a shock to you, <span class=\"highlight\">Forename</span>, but it seems our Ways have developed an insatiable interest in clothing!"},{"name":"MANAGINGWAY","text":"Is this not a remarkable achievement of individuality? Why, we have always worn identical garb for as long as I can remember."},{"name":"MANAGINGWAY","text":"Yet as we speak, one of our Ways is busy gathering a range of materials with which to make <span class=\"emphasis\">fashion</span>. I was hoping you might assist them─they asked for you by name, after all. You'll find them in the Carrotorium."},{"name":"LOPORRITA04403","text":"O-Oh! How wonderful to see you again. D-Do you remember me? I was the one who made you and your friends outfits when you first arrived! Um...I-I've practiced quite a lot since then!"},{"name":"LOPORRITA04403","text":"I'm still in the process of gathering supplies, but I thought that maybe...you could craft something for us?"},{"name":"LOPORRITA04403","text":"Thank you for your help the other day! Everyone really liked what you made, so maybe...you could craft something for us again?"},{"name":"LOPORRITA04403","text":"I was thinking something shiny and impressive, like a buckle. Buckles are “in,” right? I have these materials to work with. L-Let me know if you need more."},{"name":"LOPORRITA04403","text":"I was thinking a “chic” accessory might be nice. Did I use that word right? I have these materials to work with. L-Let me know if you need more."},{"name":"LOPORRITA04403","text":"I was thinking something glittery that will make the fabric sparkle. Is that hard to do? I have these materials to work with. L-Let me know if you need more."},{"name":"LOPORRITA04403","text":"When you're done, I'd like you to go and show Managingway what you made. I'll be thinking up “trendy” new designs, if you need anything."},{"name":"LOPORRITA04403","text":"Hi! Did you need something? No? Okay."},{"name":"LOPORRITA04403","text":"Hi! Did you need something? No? Okay."},{"name":"LOPORRITA04403","text":"Hi! Did you need something? No? Okay."},{"name":"LOPORRITA04403","text":"Oh, you've run out of material! It is sort of tricky to twist the thing, isn't it? A-Anyway, here you are."},{"name":"LOPORRITA04403","text":"Oh, you've run out of material! Um, I don't really know what “chic” means, so I'll leave it to you, okay? A-Anyway, here you are."},{"name":"LOPORRITA04403","text":"Oh, you've run out of material! No such thing as too glittery, right? A-Anyway, here you are."},{"name":"MANAGINGWAY","text":"How goes the fashion creation?"},{"name":"MANAGINGWAY","text":"My, how daring! I do believe I would enjoy wearing something like this myself."},{"name":"MANAGINGWAY","text":"I wonder what sort of outfit this will help create. The possibilities seem endless when one stops to consider them. "},{"name":"MANAGINGWAY","text":"That Way is both hardworking and determined, so I have no doubt their journey upon the road of fashion will be long and fruitful. I do hope you will lend them your expertise again!"},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":655,"reputation":60,"items":[{"id":38952},{"num":25,"id":10},{"id":38952},{"num":25,"id":8},{"id":38952},{"num":25,"id":9},{"id":38952},{"num":25,"id":10},{"id":38952},{"num":25,"id":11},{"id":38952},{"num":25,"id":12},{"id":38952},{"num":25,"id":13},{"id":38952},{"num":25,"id":8}]},"reqs":{"beastrank":6,"jobs":[{"lvl":80,"id":33}]}},"partials":[{"type":"npc","id":"1044403","obj":{"i":1044403,"n":"Managingway","l":3711,"q":28}},{"type":"item","id":"38952","obj":{"i":38952,"n":"Loporrit Carat","l":1,"c":"t/65100","t":100}},{"type":"item","id":"38888","obj":{"i":38888,"n":"Fashionable Materials","l":1,"c":25919,"t":61}},{"type":"item","id":"38889","obj":{"i":38889,"n":"Fashionable Thingums","l":430,"c":21003,"t":61}}]}