{"quest":{"name":"By the Muse Forsaken","location":"Mare Lamentorum","id":70247,"patch":6.35,"sort":125,"interval":"daily","repeatable":1,"beast":17,"eventIcon":71222,"issuer":1044403,"target":1044403,"genre":29,"journal":["Managingway would have you assist an artist struggling to find their Way.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Search for the muttering Loporrit in Greatest Endsvale.","Report back to Managingway."],"objectives":["Search for the muttering Loporrit.","Report back to Managingway."],"dialogue":[{"name":"MANAGINGWAY","text":"Some of our artists have been so prolific in their painting that they now claim to lack sufficient inspiration."},{"name":"MANAGINGWAY","text":"One Way in particular has become quite disheartened─so much so that they have taken to conversing with the very nothingness that plagues them. To be frank, I'm more than somewhat concerned."},{"name":"MANAGINGWAY","text":"I do hate to trouble you with such a gloomy affair, but could you perhaps offer them some encouragement? You should find them wandering Greatest Endsvale and muttering sad words."},{"name":"LOPORRIT04711","text":"Sad words... Sad words..."},{"name":"LOPORRIT04711","text":"Aaah! Y-You frightened me. Have you come to hear of my emptiness?"},{"name":"LOPORRIT04711","text":"With these two paws, I have depicted my entire existence. The moon. The Loporrits. The...well, that's about it, really. I have painted <span class=\"emphasis\">everything</span> and now nothing seems new <span class=\"emphasis\">or</span> interesting. Oh, whatever is left for me...?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"How about painting Etheirys?"},{"name":"A2","text":"You could try drawing a person."},{"name":"A3","text":"Bunnies. Lots and lots of bunnies."},{"name":"LOPORRIT04711","text":"Etheirys? But so many Ways have already painted it. A bright, blue orb suspended in unending darkness..."},{"name":"LOPORRIT04711","text":"But wait! If I were to draw the landscapes that may or may not exist <span class=\"emphasis\">upon</span> Etheirys...that could be very lovely!"},{"name":"LOPORRIT04711","text":"A person? If you only knew how many Ways have drawn the people who were meant to join us...the people who never came..."},{"name":"LOPORRIT04711","text":"But wait! If I were to draw a Loporrit <span class=\"emphasis\">as</span> a person...that could be something remarkable!"},{"name":"LOPORRIT04711","text":"Bunnies? What are those?"},{"name":"LOPORRIT04711","text":"Etheirys has Loporrits!? Why haven't I heard of this!? I must draw them straightaway!"},{"name":"LOPORRIT04711","text":"I feel alive again─inspired! I didn't think it possible. Thank you, <span class=\"highlight\">Forename</span>. And thanks to Managingway for sending you!"},{"name":"MANAGINGWAY","text":"Right on schedule! Our muttering friend has gotten straight to work at the imaging station, and I managed to sneak a glance at their progress."},{"name":"MANAGINGWAY","text":"I do believe they are recreating images from Etheirys. Regardless of accuracy, the awe they hold for Mother Hydaelyn's star is palpable in their work."},{"name":"MANAGINGWAY","text":"It is...unique to say the least. “Terrifying,” may be a more accurate word. A beast of neither man nor Loporrit, grinning eerily from the confines of a dark prison...? Ahem."},{"name":"MANAGINGWAY","text":"I do believe they are drawing what you would call a “bunny.” While anatomically questionable, their work exhibits a tangible curiosity and excitement regarding the creatures."},{"name":"MANAGINGWAY","text":"At the end of the day, the priority of art is its creation, not its analysis. So long as our Way remains bright and bushy-tailed, I am quite satisfied."},{"name":"MANAGINGWAY","text":"Still, the flow of inspiration is known to be fickle, so I may call upon you again should our Ways require it. Until next time."}],"reward":{"gil":655,"reputation":60,"items":[{"id":38952}]},"reqs":{"beastrank":6,"jobs":[{"lvl":80,"id":33}]}},"partials":[{"type":"npc","id":"1044403","obj":{"i":1044403,"n":"Managingway","l":3711,"q":28}},{"type":"item","id":"38952","obj":{"i":38952,"n":"Loporrit Carat","l":1,"c":"t/65100","t":100}}]}