{"quest":{"name":"Spatial Cleanse","location":"Mare Lamentorum","id":70245,"patch":6.35,"sort":123,"interval":"daily","repeatable":1,"beast":17,"eventIcon":71222,"issuer":1044403,"target":1044403,"genre":29,"journal":["Managingway wants the Ways to stop painting the town red...and blue and yellow and all the other colors besides.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Clean up unauthorized artwork in Bestways Burrow.","Report back to Managingway."],"dialogue":[{"name":"MANAGINGWAY","text":"<span class=\"highlight\">Forename</span>, might I trouble you for a moment?"},{"name":"MANAGINGWAY","text":"While it warms the heart to see so many Ways excited about painting, it has come to our attention that certain artists are allowing their creativity to overflow the bounds of the imaging station."},{"name":"MANAGINGWAY","text":"It seems as though an enthusiastic artist has been coloring outside the lines once more."},{"name":"MANAGINGWAY","text":"I do not condone the destruction of creative endeavors, but neither can I forgive an infringement of the rules. Would you be so kind as to scrub away the unauthorized artwork?"},{"name":"SYSTEM","text":"The paint melts away with ephemeral beauty. Even cleaning can be creative!"},{"name":"MANAGINGWAY","text":"Thank you for cleaning those up. Another moment and we'd all be subject to Livingway's wrath..."},{"name":"MANAGINGWAY","text":"You may be pleased to hear that our creative culprit has been apprehended and given a strict talking-to."},{"name":"MANAGINGWAY","text":"Apparently, deliberately shirking the rules is an integral part of their artistic process, but such a reason shouldn't belie common courtesy. I must give some thought as to how one manages such a creative desire..."}],"reward":{"gil":655,"reputation":60,"items":[{"id":38952}]},"reqs":{"beastrank":6,"jobs":[{"lvl":80,"id":33}]}},"partials":[{"type":"npc","id":"1044403","obj":{"i":1044403,"n":"Managingway","l":3711,"q":28}},{"type":"item","id":"38952","obj":{"i":38952,"n":"Loporrit Carat","l":1,"c":"t/65100","t":100}}]}