{"quest":{"name":"Whisks for Whiskers","location":"Mare Lamentorum","id":70241,"patch":6.35,"sort":119,"interval":"daily","repeatable":1,"beast":17,"eventIcon":71222,"issuer":1044403,"target":1044403,"genre":29,"usedItems":[38878,38879],"journal":["Managingway is an ally to aspiring chefingways and believes you should be too.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the flustered Loporrit in the Carrotorium.","Deliver the requested items to Managingway."],"objectives":["Speak with the flustered Loporrit.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Managingway</span></span>."],"dialogue":[{"name":"MANAGINGWAY","text":"Recently, Cookingway's culinary enterprises have been on fire! To borrow a colloquialism, of course. I assure you that nothing in our cooking station is unduly alight."},{"name":"MANAGINGWAY","text":"Many Loporrits have expressed an interest in cuisine, but we simply don't have enough whisks and spoons to go around."},{"name":"MANAGINGWAY","text":"Perhaps you could lend your crafting expertise to our plight? One of Cookingway's sous-chefs should be feverishly assembling the necessary kitchen implements in the Carrotorium, but I am sure they would be glad of the help."},{"name":"LOPORRIT04705","text":"You've come to make kitchen items for us? Oh, thank you! My fur's been in quite the ruffle over our shortage."},{"name":"LOPORRIT04705","text":"We're quite short on metal mixers, you see. And have you tried whipping cream by paw? We can't have another fainting Way. Tell me if you need more supplies, but if you could start working at once, I would be forever grateful."},{"name":"LOPORRIT04705","text":"We don't have nearly enough happiness dishes, you see. Everyone's been very polite about it, but you can see it in their eyes when they have to use a <span class=\"emphasis\">regular</span> dish... Tell me if you need more supplies, but if you could start working at once, I would be forever grateful."},{"name":"LOPORRIT04705","text":"We're almost out of this miraculous substance that allows you to control the sense of taste. Have you heard of “spice” before? Anyway, tell me if you need more supplies, but if you could start working at once, I would be forever grateful."},{"name":"LOPORRIT04705","text":"Take what you've made back to Hoper's Hold, and Managingway will see it delivered to the cooking station. Oh, cooking station... How I long for you..."},{"name":"LOPORRIT04705","text":"You have what you need, don't you? Then hurry! The Ways are depending on us!"},{"name":"LOPORRIT04705","text":"You have what you need, don't you? Then hurry! The Ways are depending on us!"},{"name":"LOPORRIT04705","text":"You have what you need, don't you? Then hurry! The Ways are depending on us!"},{"name":"LOPORRIT04705","text":"Yes, chef! More supplies, coming up!"},{"name":"LOPORRIT04705","text":"Yes, chef! More supplies, coming up!"},{"name":"LOPORRIT04705","text":"Yes, chef! More supplies, coming up!"},{"name":"MANAGINGWAY","text":"How goes the kitchenware assembly? Our aspiring cooks seem eager to get started."},{"name":"MANAGINGWAY","text":"Splendid! Cookingway will be ecstatic to hear that more Ways can now try their paws at his passion."},{"name":"MANAGINGWAY","text":"We have noted a direct correlation between bouts of vigorous rhythmic hopping and subsequent traffic to the cooking station. The relationship between music and food seems ripe with exciting new possibilities, don't you agree?"},{"name":"MANAGINGWAY","text":"Not to mention Cookingway's tireless efforts to create new menu items. Often have I seen him quizzing our Ways in regards to their preferences. Watching such collaboration is food for the soul...to borrow another colloquialism, of course."},{"name":"MANAGINGWAY","text":"Not to mention Cookingway's tireless efforts to create new menu items. It seems he keeps in regular contact with Jammingway about the Last Dregs' more popular dishes. Watching such collaboration is food for the soul...to borrow another colloquialism, of course."}],"reward":{"gil":655,"reputation":60,"items":[{"id":38952},{"num":25,"id":10},{"id":38952},{"num":25,"id":8},{"id":38952},{"num":25,"id":9},{"id":38952},{"num":25,"id":10},{"id":38952},{"num":25,"id":11},{"id":38952},{"num":25,"id":12},{"id":38952},{"num":25,"id":13},{"id":38952},{"num":25,"id":8}]},"reqs":{"beastrank":5,"jobs":[{"lvl":80,"id":33}]}},"partials":[{"type":"npc","id":"1044403","obj":{"i":1044403,"n":"Managingway","l":3711,"q":28}},{"type":"item","id":"38952","obj":{"i":38952,"n":"Loporrit Carat","l":1,"c":"t/65100","t":100}},{"type":"item","id":"38878","obj":{"i":38878,"n":"Kitchen Materials","l":1,"c":25919,"t":61}},{"type":"item","id":"38879","obj":{"i":38879,"n":"Popular Kitchen Goods","l":430,"c":21005,"t":61}}]}