{"quest":{"name":"Every Anden of the Rainbow","location":"Il Mheg","id":70252,"patch":6.3,"sort":4010,"unlocksFunction":1,"eventIcon":71341,"issuer":1044547,"target":1044560,"genre":116,"journal":["Anden is deep in thought...or so one may assume. His face remains inscrutably leafy."],"objectives":["Speak with Anden.","Travel to Fanow and wait for Anden to arrive.","Speak with Anden in Lydha Lran."],"dialogue":[{"name":"ANDEN","text":"You, <span class=\"highlight\">Forename</span>, travel far and wide as Ardbert once did..."},{"name":"ANDEN","text":"Tell me─what sort of encounter would leave one so forthright at a loss for words?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Meeting a talking shrub might do it."},{"name":"A1","text":"One with a person all too like myself."},{"name":"A1","text":"If you mean to ask about Ardbert, why not consult Seto instead?"},{"name":"ANDEN","text":"That makes sense, given the circumstances. It's not every day one encounters a vocal leafman, or so I'm told."},{"name":"ANDEN","text":"Oooh, yes, that would certainly warrant some shock. Can you imagine another me running around somewhere, folious head and all? &lt;shudder&gt;"},{"name":"ANDEN","text":"Leafman hybrids notwithstanding, to meet your own reflection would be a rare experience indeed..."},{"name":"ANDEN","text":"Seto? Where have I heard that na─ Oh! Ardbert's amaro, was it?"},{"name":"ANDEN","text":"Wait a moment... I recognize a certain irony in my asking, but are you suggesting that this amaro can <span class=\"emphasis\">speak</span>?"},{"name":"ANDEN","text":"That's highly unusual, to say the least! I daresay <span class=\"emphasis\">I</span> would be the one in shock if we ever were to meet."},{"name":"ANDEN","text":"Hmm... Rare occurrences... Unexpected meetings..."},{"name":"ANDEN","text":"...OOOH! That's why none of Eo Tyr's glamours felt quite right."},{"name":"ANDEN","text":"<span class=\"highlight\">Forename</span>! Call the faerie king─I think I've remembered who I am!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Feo Ul! My most beautiful and beloved branch, I need you!"},{"name":"A2","text":"Work your magic, Feo Ul!"},{"name":"A2","text":"I call upon thy power, O great faerie king!"},{"name":"FEOUL","text":"(-Feo Ul-)Oh, to be called so passionately by my sweetest sapling! My spirit is all song!"},{"name":"FEOUL","text":"Of course, of course! Your branch has come to offer up the full extent of their power, just as they promised."},{"name":"FEOUL","text":"Leafman─heed me well. If these magicks are to fail, you will melt into the earth as naught but an amalgamation of soil and grime. Have you remembered your true form, marrow to soul?"},{"name":"ANDEN","text":"Y-Yes! Yes, I have. I think!"},{"name":"FEOUL","text":"Very well, then. Let us see what you become!"},{"name":"ANDEN","text":"<span class=\"emphasis\">It worked</span>! I'm a person! A real person!"},{"name":"ANDEN","text":"Just look at me! I haven't got roots or leaves or anything anymore! I'm free!"},{"name":"EOTYR","text":"Ooooooh, Anden! <span class=\"emphasis\">True</span> Anden! How I have missed you most of all Andens!"},{"name":"ANDEN","text":"It makes sense, doesn't it? We men are hardly a common sight even amongst our own people. I'm sure Ardbert never expected to meet one of us out here!"},{"name":"ANDEN","text":"It makes sense, doesn't it? Men such as I are hardly a common sight even amongst our own people. I'm sure Ardbert never expected to meet one of us out here!"},{"name":"ANDEN","text":"It's all coming back to me now... I left the Greatwood to explore the outside world, came to Voeburt, met my very first sheep...and the rest is history."},{"name":"ANDEN","text":"I was truly happy as a shepherd. If it were not for the Flood..."},{"name":"ANDEN","text":"O-Of course─the Flood! My village, did it survive? I...I must go and see what became of it."},{"name":"EOTYR","text":"You're leaving, Anden? But you've never left...not even when those white beasties came to slurp you up and crunch your bones!"},{"name":"FEOUL","text":"Leafless man─understand, we pixies are not wont to release the mortals we adore."},{"name":"FEOUL","text":"As you yourself are one so favored by the fae, I grant you permission to remain in the Kingdom of Rainbows, if such is your wish. In your true and rightful form, of course."},{"name":"FEOUL","text":"However, you are no longer bound to our land. You are free to travel the wide realm as does my brave sapling. Think carefully upon your decision, mortal, that you have no cause to regret it."},{"name":"FEOUL","text":"Oh, I have so enjoyed this time with you, my adorable, dearest sapling. Let us meet again soon─yes, very soon!"},{"name":"EOTYR","text":"Foolish, foolish Anden! Oooh, I can't let him leave... I shan't!"},{"name":"ANDEN","text":"Have you ever been to the Rak'tika Greatwood, <span class=\"highlight\">Forename</span>? I don't imagine you've had cause to visit the Viis settlements there..."},{"name":"ANDEN","text":"An ally of Ronka!? And you've been to Fanow! Well, then..."},{"name":"ANDEN","text":"My village is far deeper in the woods, but Fanow might well be a good place to start."},{"name":"ANDEN","text":"Would you be willing to accompany me that far? To be honest, I'm not sure I could explain myself with any credibility, if questioned..."},{"name":"ANDEN","text":"Thank you! Your presence is more reassuring than you know."},{"name":"EOTYR","text":"No! No, no, no, no, <span class=\"emphasis\">no</span>! How could you, Anden!?"},{"name":"EOTYR","text":"After I tried so hard to keep you safe! After I told the others to give you leaves and roots so those awful monsters couldn't touch you! So you could live happily ever after with your precious sheep!"},{"name":"ANDEN","text":"Y-You─? You turned me into a leafman to protect me?"},{"name":"ANDEN","text":"Oh, Eo Tyr..."},{"name":"ANDEN","text":"...My apologies, <span class=\"highlight\">Forename</span>. I think Eo Tyr and I need some time to speak alone. Go on ahead to Fanow, would you? I'll meet you there."},{"name":"ANDEN","text":"There's no need to fret, Eo Tyr. I'm just going to visit, nothing more."},{"name":"EOTYR","text":"Oooh, I've heard <span class=\"emphasis\">that</span> one before! They say Fanow is filled with pretty, pretty Viis! Lady Viis! You're going to leave forever and forget all about me!"},{"name":"EOTYR","text":"I forbid it! You mustn't go! Oooh, Anden, please don't go!"},{"name":"ANDEN","text":"There you are! I hope you weren't waiting overlong. It's been quite some time since I've navigated these woods...or had legs..."},{"name":"TELLINA","text":"(-Intimidating Voice-)You, there! Halt!"},{"name":"TELLINA","text":"(-Intimidating Woman-)...An unidentified male blundering gracelessly through the trees like a child. You're lucky the scout thought to call me before anyone else."},{"name":"TELLINA","text":"(-Intimidating Woman-)But to think we would meet again, Gilltet..."},{"name":"ANDEN","text":"Gilltet...?"},{"name":"ANDEN","text":"Ah, of course! Gilltet. Which makes you...Tellina?"},{"name":"ANDEN","text":"Er, it just came back to me─“Anden” is an assumed name, you see. My birth name is “Gilltet,” and this person who looks quite a lot like me is..."},{"name":"TELLINA","text":"Tellina. Gilltet's younger sister. 'Tis an honor to make your acquaintance, ally of Ronka."},{"name":"TELLINA","text":"The forest spoke to me of your departure, but after the Flood... I had given up on ever seeing you again."},{"name":"TELLINA","text":"And to willingly part with your name is one thing, but to forget it entirely... What did the outside world <span class=\"emphasis\">do</span> to you, Brother?"},{"name":"ANDEN","text":"Er... I-I don't know how to explain..."},{"name":"TELLINA","text":"I hardly believe what I'm hearing, Gilltet."},{"name":"TELLINA","text":"While <span class=\"emphasis\">we</span> were fleeing immitigable disaster, <span class=\"emphasis\">you</span> were too captivated with your sheep to so much as seek shelter. Spared certain death only by the caprice of the fae, you've spent the intervening time as a leafman, blissfully unaware of your own existence..."},{"name":"ANDEN","text":"“Immitigable disaster”? So our village, it..."},{"name":"TELLINA","text":"Painful though it was, abandoning the village when we did spared many a fate worse than death."},{"name":"TELLINA","text":"...Many, but not all. Some fell to sin eaters, while others have since left the woods as you did. You may not find many you recognize here, Gilltet."},{"name":"TELLINA","text":"If you decide to return to the Greatwood even so, however, I would welcome you."},{"name":"ANDEN","text":"I, er, had best return to Il Mheg. Someone needs to look after the sheep."},{"name":"ANDEN","text":"I also owe a great debt to someone there. The very same someone who transformed me, actually."},{"name":"ANDEN","text":"I too assumed that they had made me into a leafman on a whim, but that's not the case. It was all to ensure that I wouldn't become something far worse─that even part of the true me might safely live on."},{"name":"ANDEN","text":"To turn my back on them after that seems...gauche. But I would never abandon my little sister, either! Perhaps I can visit as my duties allow?"},{"name":"TELLINA","text":"Unfettered yet honor-bound. Not even being changed into a bush could shake that from you, I see. Very well─come and visit when you have the chance. I'm sure the other girls would be glad of it."},{"name":"TELLINA","text":"Good Viis boys─or any Viis boys, for that matter─are in low supply these days, so I suggest you leave ere you find yourself swarmed by suitors. Unless that sounds like better fun than your sheep?"},{"name":"TELLINA","text":"That goes for you as well, ally of Ronka. Between the two of you, I daresay you're the better catch."},{"name":"ANDEN","text":"Your sage guidance is noted, Sister! Truly, Tellina─I am glad to see you well. Let us speak again soon!"},{"name":"TELLINA","text":"I had best return to the hunt...but you have my thanks."},{"name":"EOTYR","text":"&lt;sniffle&gt; He came back... &lt;hic&gt; Anden came hooome! &lt;sob&gt;"},{"name":"ANDEN","text":"I'm glad we got out of there without any fuss. That smirk of Tellina's did not bode well for me..."},{"name":"ANDEN","text":"I can't believe our village is gone...but I'm grateful to have seen my sister again."},{"name":"ANDEN","text":"I even remembered my birth name! Always liked it, but when I left the forest I thought taking a local name would strengthen my resolve."},{"name":"ANDEN","text":"Thus, “Anden the shepherd” was born! A good, Voeburtite sheep-keep with a good, Voeburtite name."},{"name":"ANDEN","text":"And seeing as I am <span class=\"emphasis\">still</span> a Voeburtite sheep-keep─or close enough to one, anyway─I think I'll stay Anden for the time being."},{"name":"ANDEN","text":"Oooh, my thoughts are finally clear! Finally, I feel like my own self, true and whole. Thank you for helping me, <span class=\"highlight\">Forename</span>─I simply couldn't have done it without you."},{"name":"EOTYR","text":"Oooh, I'm so happy you came back, Anden! I was ready to throw you into a scary, sticky dream if you didn't."},{"name":"ANDEN","text":"Just as I promised. I can't wait to get back to shepherding─and I have a debt or two to repay where you're concerned, Eo Tyr."},{"name":"EOTYR","text":"Tee hee hee! Silly Anden─you don't owe me anything at all."},{"name":"EOTYR","text":"Don't you remember? You used to leave out little offerings of sheep's milk and sweeties all the time. Say that you remember!"},{"name":"ANDEN","text":"Oooh, I did, didn't I! I had heard tales of pixies that lived in these parts, so I made a point to leave them little things I thought they might enjoy. Call it a force of habit from my days attending woodland spirits. But you don't mean to say..."},{"name":"EOTYR","text":"I do, Anden! Long ago, this land was ruled by people, and those people never <span class=\"emphasis\">really</span> believed we pixies were anything more than clever little stories. And why should they? We always kept ourselves snugly out of sight with glamours."},{"name":"EOTYR","text":"But <span class=\"emphasis\">you</span> believed in us. Kind, sweet, trusting Anden would always leave us treats and milk. Oooh, I'd never known such happiness."},{"name":"EOTYR","text":"So I watched over you always, Anden. Even when it was hard to─even when you were in such peril, but refused to leave your flock!"},{"name":"EOTYR","text":"I couldn't watch you turn into one of those monsters. I had to do something to repay all your kind and generous gifts! <span class=\"emphasis\">That's</span> why I turned you into a leafman. So you could stay safe and whole with the sheep you loved most."},{"name":"EOTYR","text":"But if you wish to thank me with bushels and bushels of adorable little things, Anden, I shan't say “no.” I can't say “no”! Not to you, my True and Lovely Anden!"},{"name":"ANDEN","text":"Oooh, that flattery of yours! But I can tell it would make you happy, and that rather makes <span class=\"emphasis\">me</span> happy, so I'll prepare some milk and sweets for you again sometime."},{"name":"EOTYR","text":"Ahahaha! That's right, Anden! Dearest Anden! Let us live happily and together, forever and ever─and ever after and on!"},{"name":"ANDEN","text":"Well, the king said I should think carefully, and I believe I've reached a decision that suits me well."},{"name":"ANDEN","text":"Better than ever, in fact─mortals are fine, I suppose, but I feel freer amongst these fae folk. And now that I can <span class=\"emphasis\">hold</span> things again, I can craft and trade for whatever my flock might need."},{"name":"ANDEN","text":"...The lurking leafmen iterations of my former colleagues─not to mention myself─are still rather unnerving, though!"},{"name":"ANDEN","text":"Come to think of it, as long as I'm here, I may as well serve as a sort of guide for any mortals who unwittingly stumble into Il Mheg."},{"name":"ANDEN","text":"It's been quite awhile since I've had to consider such things, but...what <span class=\"emphasis\">are</span> people wearing these days? No, wait─it may be best if you show me. If you find something that would make me look welcoming and approachable, I would be most happy to try it!"},{"name":"SYSTEM","text":"Future requests will be selected at random from all those you have seen thus far, with the list refreshed once a week (Earth time)."},{"name":"SYSTEM","text":"You may review the items currently in demand at any time by speaking with Anden and selecting <span class=\"highlight\">Make a delivery</span>."},{"name":"SYSTEM","text":"Note that lovely boxes of pretty things, lovely knickknacks, and Il Lydhas will earn you particularly handsome rewards. Whenever they make an appearance, the effort to procure them will be worth your while."},{"name":"SYSTEM","text":"Furthermore, Anden's appearance may now be altered through the use of glamours."}],"reward":{"gil":1359,"items":[{"num":3,"id":36060},{"num":3,"id":36061}]},"reqs":{"jobs":[{"lvl":80,"id":35}],"quests":[70251]},"next":[70253]},"partials":[{"type":"npc","id":"1044547","obj":{"i":1044547,"n":"Anden","l":2956,"q":1}},{"type":"npc","id":"1044560","obj":{"i":1044560,"n":"Anden","l":2956,"q":1}},{"type":"item","id":"36060","obj":{"i":36060,"n":"Tsai tou Vounou","l":554,"c":24417,"t":46}},{"type":"item","id":"36061","obj":{"i":36061,"n":"Sideritis Cookie","l":554,"c":24051,"t":46}},{"type":"quest","id":"70251","obj":{"i":70251,"n":"That's So Anden","g":111,"l":"The Crystarium","s":4001,"f":1}},{"type":"quest","id":"70253","obj":{"i":70253,"n":"A Labor of Leaf","g":116,"l":"Il Mheg","s":4020,"f":1}}]}