{"quest":{"name":"Allergic to Sunshine","location":"Limsa Lominsa","id":70259,"patch":6.3,"sort":222,"icon":101233,"eventIcon":71221,"issuer":1045005,"target":1045009,"genre":201,"journal":["Mayaru Moyaru is calling upon all adventurers to join the hottest event of the year.<br>※This quest is available for a limited time only.","Eorzea bakes under the sun like an egg over a hot flame, and during such times it falls upon the Adventurers' Guild to offer the realm succor through merriment in the form of the Moonfire Faire. Mayaru Moyaru informs you that in addition to the acclaimed Eorzean Nimble Warrior course, the festivities are being guarded by a brave hero called the Sunshine Savior. However, there are always more hands needed at Costa del Sol, and he encourages you to report to Haermaga if the spirit of volunteering stirs within you.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","As a fellow member of the guild, Haermaga welcomes you with open arms. He asks for your help in solving a pressing issue with the fledgling Sunshine Savior. The chaperone explains that a young man named Reeve was recruited for the role, but his spirits took a turn for the worse after he arrived in Costa del Sol. Haermaga seems to think a bit of guidance will bolster his confidence, and you agree to offer what aid you can. The young man is standing by near the aetheryte, and Haermaga asks you to follow him there to make introductions.","The future guardian of Costa del Sol makes an awkward first impression, revealing that the source of his distress is an aversion to having his face exposed to prying eyes. Haermaga does not skip a beat, however, and seems to have a potential solution to the problem at the ready. He asks Reeve to follow him to a nearby storehouse and asks that you await their return on the shores of the beach.","The pair arrive to meet you with Reeve bedecked in a garish costume, the design of which was apparently commissioned by Haermaga himself─a design understandably met with much scorn by his fellow chaperones. Regardless of the outfit's tastefulness, it seems to have restored Reeve's confidence, and the young man stands ready to protect the Moonfire Faire's revelers.","Reeve's spirits are in high supply, and he is eager to prove himself worthy of the title of Sunshine Savior. However, he acknowledges that he yet has much to learn, and asks that you assist him until he can stand on his own two feet as the beach's protector. If the events of previous Moonfire Faires are any indicator, it will not be long until he is tested."],"objectives":["Speak with Haermaga in Costa del Sol.","Speak with Haermaga again.","Wait at the designated location.","Speak with Reeve."],"dialogue":[{"name":"MAYARUMOYARU","text":"Ah, my prayers are answered! As the sun beat down upon my brow, my flagging spirits were kept aloft by the hope of your return. Now that you're here, I can say that the Moonfire Faire's success is assured!"},{"name":"MAYARUMOYARU","text":"Come one, come all! The Moonfire Faire is here to offer the realm's beleaguered citizens a diversion from the sun's scorching rays, and seeks volunteers from among the Adventurers' Guild's ranks!"},{"name":"MAYARUMOYARU","text":"Our festival has a long and storied history that hardly bears repeating, but for all intents and purposes, it's become the premier event of our guild. We hope to stoke the fires of adventurous hearts young, old, and all ages in between!"},{"name":"MAYARUMOYARU","text":"This season's main event has become a favorite among adventurers and revelers alike: the Eorzean Nimble Warrior course! Keeping vigil over the proceedings is the Sunshine Savior, guardian of the sandy beaches!"},{"name":"MAYARUMOYARU","text":"Who is the Sunshine Savior, you ask? If your interest has been piqued, then I encourage you to make haste to Costa del Sol, where Haermaga stands at the ready to apprise eager volunteers of the details!"},{"name":"MAYARUMOYARU","text":"Haermaga awaits to induct eager volunteers for this year's Moonfire Faire. Attend to him and you may even be fortunate enough to meet the fabled Sunshine Savior yourself!"},{"name":"HAERMAGA","text":"Well, if it isn't <span class=\"highlight\">Forename</span>, as sure a guest to the Moonfire Faire as this stifling heat! Did Mayaru Moyaru's mention of the Sunshine Savior stir that heroic spirit of yours?"},{"name":"HAERMAGA","text":"Welcome to the Moonfire Faire! It's always a treat to see a new face, and one from the guild doubly so. Did Mayaru Moyaru's mention of the Sunshine Savior stir the spirit of heroism within you?"},{"name":"HAERMAGA","text":"I should hope so, because between you and me, we're in a bit of a bind. If you wouldn't mind lending an ear to our troubles, I'd appreciate the opinion of a fellow adventurer."},{"name":"HAERMAGA","text":"Much obliged. You see, the faire's been no stranger to difficulties, make no mistake. People swimming where they shouldn't be, monsters treating the beaches like a bloody banquet, and all manner of other perils have put a damper on what's meant to be a time for celebration."},{"name":"HAERMAGA","text":"To combat this, I came up with the idea of the Sunshine Savior, a brave soul whose duty would be to nip such problems in the bud before they become everyone's headache."},{"name":"HAERMAGA","text":"Not only would they keep our patrons safe, but their deeds would raise the esteem of the guild as well. Not only that, but it would be the perfect opportunity to give our fresh blood a chance to shine."},{"name":"HAERMAGA","text":"So I went looking for a stout arm from within our ranks, and after a process of stringent vetting, settled on an eager youth by the name of Reeve."},{"name":"HAERMAGA","text":"The lad seemed a perfect fit, but his spirits have taken a sharp dive since he arrived in Costa del Sol. Whatever the cause of his troubles, it's plain he needs a guiding hand or two to see him through them."},{"name":"HAERMAGA","text":"So, if you've got the time and the inclination, I'd like you to help set him on the right path. Once he's found his footing, I won't ask you to dote on him any longer. How about it?"},{"name":"HAERMAGA","text":"You're a lifesaver, friend. Now then, follow me and I'll make introductions. Reeve should be somewhere near the aetheryte─let's go find him, eh?"},{"name":"HAERMAGA","text":"Apologies, but the lad seems to be missing. I explicitly told him to wait here..."},{"name":"MOB","text":"(-Surly Voice-)Get yer bloody hands off of my goods!"},{"name":"REEVE","text":"(-Tremulous Youth-)S-S-Sorry, terribly sorry! I only thought to help... The crates looked awfully heavy, you see..."},{"name":"REEVE","text":"(-Tremulous Youth-)B-But you're right to be wroth at me! Yes, for why would you need <span class=\"emphasis\">my</span> aid, with my arms thinner than sprouting reeds... I see the error of my ways. I shall shovel buffalo dung as punishment!"},{"name":"MOB","text":"Ah, lad, sorry for snappin' at ye. Appreciate the thought, but the contents of these crates are my livelihood─can't trust just any passersby with their safe carriage, ye understand."},{"name":"MOB","text":"And truth be told, you came at me like a chocobo takin' its first steps. You need to strut with a bit o' confidence if you don't want people lookin' at you crosswise, see?"},{"name":"MOB","text":"Ye've a good heart, lad. Anyone can see that. Work on yer manner and I reckon yer next attempt at charity'll go jus' fine."},{"name":"HAERMAGA","text":"Hmm. I can hazard a guess at what happened here, but I'd like to hear your side of the story nonetheless. Mind filling me in, Reeve?"},{"name":"REEVE","text":"Oh, Master Haermaga! And who is this...?"},{"name":"REEVE","text":"It can't be... Is this <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> my replacement!? Heavens forfend, I've been dismissed before my duty has even begun."},{"name":"HAERMAGA","text":"There's no need for all that. <span class=\"highlight\">Forename</span> here is a member of the guild, and <span class=\"alternative-container\"><span class=\"alternative\">she's</span><span class=\"alternative\">he's</span></span> here to help. But first, we need to know what's going on."},{"name":"REEVE","text":"I, ah... You see, I was awaiting orders like you asked, but then I spied that man struggling to carry his goods. I thought to offer a helping hand, but...well, you saw how the rest went."},{"name":"HAERMAGA","text":"...I see. I can't fault you for trying to do good, lad, but what he said was right: your manner is bloody strange, and has been ever since you set foot on these sands. I don't recall you being so timid when first we met─if something's weighing on you, you needn't shy away from sharing the burden."},{"name":"REEVE","text":"You're...too kind..."},{"name":"REEVE","text":"The truth is...I just can't bear to have my face seen by others. All those eyes on me...it's dreadful. Under a helmet, I have the confidence of a captain, but this heat has left me with no choice but bare my naked face to all and sundry."},{"name":"REEVE","text":"I'm afraid I'm likely to do more harm than help if I can't get my nerves under control. But the festivities are due to start soon, and I can scarcely stand to look even you in the eyes... "},{"name":"HAERMAGA","text":"So that's the way of it. I appreciate your candor, lad."},{"name":"HAERMAGA","text":"If it's as simple as covering your face, we can get you sorted straightaway. Come with me to the storehouse. I have something there that I think you'll like."},{"name":"HAERMAGA","text":"As for you, <span class=\"highlight\">Forename</span>, you'd better wait on the beach for our return. Don't worry, we'll be back before you can break a sweat."},{"name":"HAERMAGA","text":"And here we are! Feast your eyes upon Costa del Sol's Sunshine Savior!"},{"name":"HAERMAGA","text":"Blinded by its brilliance, aren't you? I had this lovely piece made the moment I conceived of the Sunshine Savior. A special commission from the Weavers' Guild!"},{"name":"HAERMAGA","text":"But genius isn't always obvious, I discovered. My colleagues claimed the coloring was too bold, the design too daring. I believe the word “gaudy” was tossed about. And so, with a heavy heart, I set it aside─until today, that is."},{"name":"REEVE","text":"By the gods, I feel a whole fulm taller! The fabric is so light it's like I'm wearing naught but my nameday suit! I'm ready to take on the world and then some!"},{"name":"HAERMAGA","text":"Masks are usually for hiding one's true nature, but this is the Reeve I remember. If you ask me, he looks the spitting image of a hero. But what do you think, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It certainly...suits him."},{"name":"A1","text":"I'm not sure if this is an improvement."},{"name":"A1","text":"Are you bringing back the Go Go Posing Rangers?"},{"name":"REEVE","text":"I'm overjoyed that you think so! Mark my words, the sands of Costa del Sol shall remain safe under the watchful eyes of the Sunshine Savior!"},{"name":"REEVE","text":"Really? I'm quite taken with it─I'm particularly fond of the avian motif. With this, festival-goers can rest assured that they shall be safe under the watchful eyes of the Sunshine Savior!"},{"name":"HAERMAGA","text":"So you remember that, eh? Truth be told, the thought hadn't crossed my mind when designing the costume, but now that you mention it..."},{"name":"REEVE","text":"Ah, the Go Go Posing Rangers, I know their story well! Those dauntless heroes pitted themselves against the Bombards for the safety of the realm!"},{"name":"REEVE","text":"And just as the flames of the Bombards were extinguished, the Rangers disappeared like a ship over the horizon. Hearing how they risked life and limb with no expectation of reward or fame is what inspired me to join the guild!"},{"name":"HAERMAGA","text":"Is that so? It warms my heart to know they left such a lasting impression on at least one young mind."},{"name":"HAERMAGA","text":"Now then, Reeve, consider this your official appointment as the Sunshine Savior. Go forth, and remember that you carry the reputation of the Adventurers' Guild on your shoulders. Don't crumble under the weight, lad."},{"name":"HAERMAGA","text":"Become a savior worthy of your namesake, and our guests will soon forget the countless monsters and maladies that lurk beneath the tides. I know you won't disappoint!"},{"name":"REEVE","text":"Thank you, Master Haermaga!"},{"name":"HAERMAGA","text":"Reeve has a gods-honest chance to make a good run of it now, but that depends on him."},{"name":"REEVE","text":"As the Sunshine Savior, I must bear all the responsibilities that the title implies. I can do this...I can become an adventurer that others speak of in awe!"},{"name":"REEVE","text":"By the way, I'd like to apologize for my embarrassing conduct before..."},{"name":"REEVE","text":"I admit a part of me is scared almost all of the time, but I can't let that dictate my life and my duty. Whatever happens, I swear to do all in my power to make this Moonfire Faire the safest yet!"},{"name":"REEVE","text":"That being said, I realize I still have much to learn, and would very much appreciate the aid of a seasoned adventurer such as yourself. Will you help me?"},{"name":"REEVE","text":"Thank you, <span class=\"highlight\">Forename</span>! I look forward to growing under your wing!"}],"reward":{"gil":673},"reqs":{"jobs":[{"lvl":30,"id":1}]},"next":[70260]},"partials":[{"type":"npc","id":"1045005","obj":{"i":1045005,"n":"Mayaru Moyaru","l":28,"q":1,"t":"Moonfire Faire Chaperone"}},{"type":"npc","id":"1045009","obj":{"i":1045009,"n":"Reeve","l":32,"q":1}},{"type":"quest","id":"70260","obj":{"i":70260,"n":"I Am the Sunshine","g":201,"l":"Eastern La Noscea","s":223}}]}