{"quest":{"name":"Sparking Artist","location":"Mare Lamentorum","id":70250,"patch":6.35,"sort":128,"interval":"daily","repeatable":1,"beast":17,"eventIcon":71222,"issuer":1044403,"target":1044403,"genre":29,"journal":["Managingway is gazing at you, nose twitching in anxiety.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with Sparkingway in northern Mare Lamentorum.","Hit Sparkingway with a carrotsine tank.","Hit Sparkingway with a carrotsine tank again.","Report back to Managingway."],"dialogue":[{"name":"MANAGINGWAY","text":"<span class=\"highlight\">Forename</span>. I am in desperate need of your assistance."},{"name":"MANAGINGWAY","text":"We have recently discovered a genius among our Ways. Her indubitable skill and logic-defying innovation have quickly shown her to be a paragon of the Loporrit art world."},{"name":"MANAGINGWAY","text":"Consider my distress, then, when she came to me seeking an assistant. Though all our Ways possess eagerness and creativity in bounds, none, I fear, could understand her vision. None, perhaps, except you."},{"name":"MANAGINGWAY","text":"Her name is Sparkingway, and I have been told to direct you to the Striking Brand in northern Mare Lamentorum where she waits. I cannot claim to understand the methods of a genius, but I beg that you assist her with whatever she requires."},{"name":"MANAGINGWAY","text":"Sparkingway, our resident artistic genius, has requested your assistance once more. It seems she was greatly impressed by your dedication last time."},{"name":"MANAGINGWAY","text":"She says she will be waiting for you by the Striking Brand, as before. Take care, <span class=\"highlight\">Forename</span>. And thank you."},{"name":"SPARKINGWAY","text":"You must be <span class=\"highlight\">Forename</span>. Managingway said you would come. My name is Sparkingway."},{"name":"SPARKINGWAY","text":"I hear you are comfortable with handling explosive materials. That is comforting to hear, indeed. Here. Throw this at me."},{"name":"SPARKINGWAY","text":"There is no need to look so alarmed. As far as carrotsine tanks go, it is rather small. Although just as liable to ignite upon impact."},{"name":"SPARKINGWAY","text":"Art is pain, <span class=\"highlight\">Forename</span>. And pain is inspiration. So throw it at me. Throw with all your might!"},{"name":"SPARKINGWAY","text":"<span class=\"highlight\">Forename</span>. How good it is to see you again."},{"name":"SPARKINGWAY","text":"Our artistic gains from last time proved well worth the singed fur. The wonders I created were unlike any I have ever produced. But the dream of an artist is not to rest upon her laurels. We are always hungry, <span class=\"highlight\">Forename</span>. Aching for the next idea."},{"name":"SPARKINGWAY","text":"Aching as my body will once you hit me with this carrotsine tank. Now throw, my friend. Throw with the strength of art!"},{"name":"SPARKINGWAY","text":"Come! Strike me!"},{"name":"SPARKINGWAY","text":"Guwahaaa! &lt;gasp&gt;"},{"name":"SPARKINGWAY","text":"...O-Once more. I have not seen it yet. Not felt it sear my eyes. Hit me, <span class=\"highlight\">Forename</span>! One more time!"},{"name":"SPARKINGWAY","text":"Be not afraid of greatness! Throw!"},{"name":"SPARKINGWAY","text":"Eyaaagh! Kch! &lt;cough&gt; &lt;cough&gt;<br>...I have it."},{"name":"SPARKINGWAY","text":"O spark of inspiration... With this broken form...I shall create you..."},{"name":"SPARKINGWAY","text":"Thank you, <span class=\"highlight\">Forename</span>. Managingway will see that you are duly rewarded. I must return to my atelier before the light of my eyes or inspiration fades..."},{"name":"MANAGINGWAY","text":"I believe I heard an explosion... Erm, I trust Sparkingway was satisfied with your assistance?"},{"name":"MANAGINGWAY","text":"Well, you do often hear of artists suffering for their craft, so I imagine the scale for geniuses must exceed all supposition. I do hope she manages to finish her art before art finishes her, as it were."},{"name":"MANAGINGWAY","text":"I shall check upon her later to see if she requires any further assistance. In the meantime, please accept this as thanks for supporting the proliferation and success of Loporrit fine art."}],"reward":{"gil":735,"reputation":60,"items":[{"id":38952}]},"reqs":{"beastrank":6,"jobs":[{"lvl":80,"id":33}]}},"partials":[{"type":"npc","id":"1044403","obj":{"i":1044403,"n":"Managingway","l":3711,"q":28}},{"type":"item","id":"38952","obj":{"i":38952,"n":"Loporrit Carat","l":1,"c":"t/65100","t":100}}]}