{"quest":{"name":"Chaos, Carnage, Eggs","location":"Gridania","id":70258,"patch":6.3,"sort":223,"icon":101232,"eventIcon":71221,"issuer":1044977,"target":1044974,"genre":199,"journal":["Hamlyn is quivering in his excitement.<br>※This quest is available for a limited time only.","It turns out that Hamlyn's master plan to restore peace to the plundered caravan is strikingly similar─if not utterly identical─to the plan you carried out not moments ago. If it will solve your sylph dilemma long enough to get your hands on some glorious eggs, however, you're willing to give it the old Archon try. You head to the Central Shroud and prepare to combat the sylphs' jealous mood with some green of your own.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.<br>※The FATE “Don't Be Sylphish” can only be completed as a Disciple of War or Magic.","After a frantic scuffle involving sylphs, a giant mammet, and more shuffling than is comfortable for the average tonberry, you manage to recover the scattered Archon eggs. Panting from exertion and pleased to be free of your sweaty guise (once more pawed off you by an overzealous Hamlyn), you trek back to Gridania to give Jihli the good news.","Hamlyn is singing your praises─or, more accurately, the noble tonberry's praises─with phlegmy excitement when you arrive, lamenting only the absence of large crowds who might have witnessed the miraculous feats performed by his adorable idols. As it turns out, enough townsfolk were present to warrant extending personal thanks for returning their precious eggs─which they ought to decorate <span class=\"emphasis\">as</span> tonberries to prevent any further sylph shenanigans, Hamlyn helpfully suggests. While Hamlyn could not be less subtle in his tonberry touting, you can't deny the modicum of truth in his suggestion, and really, you'd just like to get on with it already. Jihli smiles and officially proclaims the start of Hatching–tide─let the eggy, eggy, stabby fun begin!"],"objectives":["Complete the FATE “Don't Be Sylphish” in the Central Shroud.","Report to Jihli Aliapoh."],"dialogue":[{"name":"JIHLIALIAPOH","text":"I beg you, <span class=\"highlight\">Forename</span>─speak with Hamlyn and see how we might recover those Archon eggs!"},{"name":"NONOTTA","text":"All those eggs... All those beautifully decorated─and <span class=\"emphasis\">expensive</span>─eggs..."},{"name":"HAMLYN","text":"You wish to lend your strength to my brilliant plan, do you? &lt;snort&gt; Very well. Our divine mission is as follows─we must adorn ourselves in the guise of the tonberry, and scare the sylphs away from the fallen eggs!"},{"name":"HAMLYN","text":"...Ahem, it may seem like a rather familiar tactic, but terror cuts as sharply as a knife in the right hands. As does the power of the tonberry! &lt;snort&gt; We shall remind those sylphs of what adorable horror lurks in the shadow."},{"name":"HAMLYN","text":"It is time to take the tonberry's naturally winsome and captivating visage and transform it into a mask of pure evil."},{"name":"HAMLYN","text":"Observe!"},{"name":"NONOTTA","text":"I...suppose that makes sense. But what of the delivery mammet? In its panicked state, it may easily mistake us for naught but common egg-thieves─er, perhaps not so common, considering the guises."},{"name":"HAMLYN","text":"That's where <span class=\"highlight\">Forename</span>'s participation is crucial. &lt;snort&gt; Even an overexcited automaton is no match for an adventurer versed in the arts of warfare!"},{"name":"HAMLYN","text":"Of course, I shan't be so cruel as to send you into battle as defenseless as a swaddled tonbabe."},{"name":"HAMLYN","text":"You may rely upon me to perform the necessary &lt;shlorp&gt; <span class=\"emphasis\">enhancements</span> upon your guise, that shall grant any stabby sweetheart the ability to withstand even the harshest of electrified zaps! ...In theory, anyway."},{"name":"HAMLYN","text":"In the midst of adversity lies opportunity, as they say─or rather, in the midst of scattered Archon eggs stands the noble tonberry, that all might witness its triumphant glory!"},{"name":"JIHLIALIAPOH","text":"Very well. Let us proceed with Hamlyn's plan and see that our eggs are recovered safely."},{"name":"HAMLYN","text":"Hmhm, excellent! &lt;snort&gt; I shall commence the enhancement of this guise at once and have it ready for deployment in two flicks of a tonberry's blade. <span class=\"highlight\">Forename</span>─let us meet where the bells of destiny toll. To arms!"},{"name":"JIHLIALIAPOH","text":"I shall contact the Adventurers' Guild to see if any there are willing to help as well."},{"name":"NONOTTA","text":"You'll find the caravan by the Mirror Planks in the Central Shroud. You can't miss it─not even if you tried."},{"name":"NONOTTA","text":"You did it, <span class=\"highlight\">Forename</span>! You truly did it!"},{"name":"HAMLYN","text":"'Twas sheer majesty, the likes of which I have never seen! &lt;heavy breathing&gt;"},{"name":"JIHLIALIAPOH","text":"And here comes our hero now! Hamlyn has just been regaling us with the tale of your valor, <span class=\"highlight\">Forename</span>."},{"name":"NONOTTA","text":"We can't thank you enough for recovering those Archon eggs. Truly─from the bottom of our hearts and purses─thank you!"},{"name":"HAMLYN","text":"My single regret is that no rapturous bystanders were present in those solitary woods to witness such valorous displays."},{"name":"HAMLYN","text":"Alas, the tonberry's majesty will once again pass unacknowledged. Yet, such is often the way with true goodness. &lt;snort&gt; The hero that works in secrecy for the betterment of all? My friends, their name is tonberry."},{"name":"NONOTTA","text":"(-Nonotta-)Profound, I'm sure. I must say, Hamlyn, your unflagging devotion to all things tonberry is both remarkable and admirable..."},{"name":"RESIDENTSB04722","text":"(-???-)Erm, pardon me!"},{"name":"RESIDENTSB04722","text":"<span class=\"emphasis\">We</span> were in those solitary woods! And we saw what you did for us. ...Er, what the <span class=\"emphasis\">tonberries</span> did for us."},{"name":"RESIDENTSB04722","text":"I was heartbroken when a sylph snatched away the Archon egg that my friend had given me..."},{"name":"RESIDENTSB04722","text":"...But thanks to you, it was recovered safely. You tonberries have my eternal thanks."},{"name":"RESIDENTSB04722","text":"I only wish you didn't have to scare the sylphs so badly. The poor things... Is there no other way to deter their mischief?"},{"name":"Q1","text":"What will you say?"},{"name":"A2","text":"Sylph-repellant, perhaps?"},{"name":"A2","text":"My tonberry senses are tingling..."},{"name":"HAMLYN","text":"Indeed! &lt;snort&gt; Consider this─if we decorate our eggs with a tonberry theme, the sylphs wouldn't dare snatch or sabotage them!"},{"name":"NONOTTA","text":"A dark green coat on a large egg with two golden circles for eyes? Not bad at all. Perhaps even...cute!"},{"name":"NONOTTA","text":"Jihli, perhaps <span class=\"emphasis\">this</span> is what your dream foretold. Not just tonberry guises, but tonberry eggs and decorations as well!"},{"name":"NONOTTA","text":"In which case, we should send word to our Ul'dahn goldsmiths that we'd like another batch of Archon eggs in some striking shades of tonberry."},{"name":"JIHLIALIAPOH","text":"Of course, all our eggs are packaged during transit, meaning the sylphs will likely continue their mischief outside the city. I'm tempted to send a tonberry guard with the caravan, but the road from Ul'dah is far too long to attempt in such a guise."},{"name":"JIHLIALIAPOH","text":"We shall continue to consider possible alternatives, but in the meantime, should you happen to come across another waylaid shipment, I hope I can count on your assistance. Er...as a tonberry, of course."},{"name":"JIHLIALIAPOH","text":"Well, seeing as our Archon eggs have finally arrived, I daresay it is time to officially get <span class=\"emphasis\">cracking</span>! Let the Hatching–tide festivities begin! "},{"name":"SYSTEM","text":"You have unlocked the Egg Hunter Riggy mini-game. To play mini-games, open the toy chest found in any inn room."}],"reward":{"gil":660,"items":[{"id":39500}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[70257]}},"partials":[{"type":"npc","id":"1044977","obj":{"i":1044977,"n":"Hamlyn","l":53,"q":1}},{"type":"npc","id":"1044974","obj":{"i":1044974,"n":"Jihli Aliapoh","l":53,"q":2}},{"type":"item","id":"39500","obj":{"i":39500,"n":"Ballroom Etiquette - Unnerving Undulations","l":1,"c":26435,"t":85}},{"type":"quest","id":"70257","obj":{"i":70257,"n":"Get Along and Play Knife","g":199,"l":"Gridania","s":222}}]}