{"quest":{"name":"The Spectacle of Inspection","location":"Radz-at-Han","id":70254,"patch":6.35,"sort":310,"icon":101238,"unlocksFunction":1,"eventIcon":71341,"issuer":1042558,"target":1042573,"genre":71,"journal":["Delion is ready to embark on another crusade for the <span class=\"emphasis\">Truth</span>.","Inspector's Log:<br>The Case of the Silent Correspondent continues! After a traditionally dynamic reunion with Father, and the disintegration of my remaining dashing clones, I, Hildibrand Helidor Maximilian Manderville, have returned from the moon to embark on a search for Master PuPu's uncommunicative comrade. With stout heart and stalwart associates, there is not a mote of doubt in my Mandervillian mind that we shall be successful in this endeavor.<br>　　　　　　　　　　　　*　*　*<br>Both pleased by and suspicious of your timely arrival, Delion reiterates his desire to expose PuPu's presumably well-disguised plans for invasion. Inspector Hildibrand's keen inspector's sense has, it seems, led him to Palaka's Stand, which gives Delion─and you─the perfect chance to continue tracking the little blue man's movements.","Regrettably, instinct alone has failed to provide a more precise location for PuPu's missing friend. Thus does the inspector summarily recruit you to question the locals of Palaka's Stand regarding recent sightings of unusual─and hopefully alien─nature.","The inhabitants of Palaka's Stand gladly share with you their encounters of the unsettling kind, and all signs point to a possible alien presence in the west of the jungle. Inspector Hildibrand will surely welcome this supplementary guidance.","A comparison of eyewitness accounts reveals sightings across the entire Shroud of the Samgha, prompting Delion to suggest─with some reluctance─splitting the group that you might more efficiently scour the area. Fortuitously, reinforcements appear in the form of Godbert, who is more than happy to join his son in his latest escapade. Hildibrand assigns teams and directions, pairing you with PuPu and charging you with scouring the jungle's western reaches.","With a solid lead on his friend's whereabouts at last, PuPu is eager to follow you into the jungle.<br><br>※You must be accompanied by PuPu to complete this task. Speak with him again should you become separated.","You survey what appears to be ufiti territory, but see no trace of PuPu's comrade. Perhaps further to the west...?<br><br>※You must be accompanied by PuPu to complete this task. Speak with him again should you become separated.","You continue onwards and come across a colony of hanuman langurs...but no alien compeer. Further to the west it is.<br><br>※You must be accompanied by PuPu to complete this task. Speak with him again should you become separated.","Alas, your efforts yield not so much as a vaguely starcraft-shaped circle in the grass. It is then that you receive a call from Nashu, who may have spotted PuPu's friend near Purusa. You rush over with all haste, only to find that the figure in question was a mandragora. Several mandragoras, in fact. Actually, an entire gang of infamous seedkin, known literally as the Mandragoras. Accompanied by a zombie gentleman (to Delion's shock and delight), the villainous vegetables came to Thavnair in search of their own friend─an individual who, it transpires, was mistakenly abducted by PuPu. The contrite mandragora-napper releases his “sample,” and the reunited Mandragoras take their leave.<br><br>In the wake of the mandragora misunderstanding, Delion muses aloud on the limitations of Hildibrand's “keen” inspector's sense. PuPu takes the editor's idle wish for a Hildibrand army to heart, and fires up his matter duplication facility. The defective machine ultimately breaks down, but not before producing one singularly blocky replication of Inspector Hildibrand. Encouraged by his new clone's dissimilar appearance, an enthusiastic Hildibrand recruits “Brandihild” to aid in the investigation.","As the dust settles and the chaos dies down, you find your already eclectic party joined by a “charming new contemporary.” Brandihild is eager to be a part of it all─or so he says. But as you well know, Hildibrand's chicanery is not to be taken lightly..."],"objectives":["Speak with Hildibrand at Palaka's Stand.","Question the villagers of Palaka's Stand.","Speak with Hildibrand.","Speak with PuPu and have him accompany you.","Survey the area while accompanied by PuPu.","Survey the next area while accompanied by PuPu.","Survey yet another area while accompanied by PuPu.","Speak with Hildibrand."],"dialogue":[{"name":"DELION","text":"<span class=\"highlight\">Forename</span>, what suspiciously auspicious timing. I was just thinking of you, and suddenly you appear."},{"name":"DELION","text":"As I'm sure you recall, Master PuPu claimed his purpose in coming to our world was to search for a missing comrade."},{"name":"DELION","text":"Which is, of course, merely a cover for his true objective: laying the groundwork for a full-scale invasion!"},{"name":"DELION","text":"But I understand the skeptical masses will demand proof of this sinister operation. Thus did I decide to bide my time, keep my eyes open, and let things play out..."},{"name":"DELION","text":"...And no sooner had I resolved to do so, when I received word concerning the inspector. It seems they've made progress in tracking down our alien friend's...friend. This could be my chance!"},{"name":"DELION","text":"I say “my” chance, but I can hardly stand against this cosmic conspiracy alone. You are coming along, yes?"},{"name":"Q6","text":"What will you say?"},{"name":"A6","text":"I wouldn't dream of letting you <span class=\"emphasis\">investigate</span> PuPu by yourself..."},{"name":"A6","text":"The truth will out! Or something truth-adjacent, at the very least."},{"name":"DELION","text":"Then let us be on our way. They were headed to Palaka's Stand, and we don't want to miss even the smallest development!"},{"name":"NASHUMHAKARACCA","text":"<span class=\"highlight\">Forename</span>, you came! The lunar crew is back together!"},{"name":"PALAKASMAN04718","text":"It's the same number of sacks... Always the same."},{"name":"PALAKASWOMAN04718","text":"Are these boxes empty or full...?"},{"name":"HILDIBRAND","text":"My loyal associates! Come to admire the spectacle of inspection, have you? As well you should!"},{"name":"NASHUMHAKARACCA","text":"Look, Master PuPu! <span class=\"highlight\">Forename</span> has come to help!"},{"name":"KOYOKOYO","text":"Thank you, <span class=\"highlight\">Forename</span>! You're too kind!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"What!? No more “PuPu”ing!?"},{"name":"A1","text":"You speak our language now? No Echo or universal translator wotsits required?"},{"name":"KOYOKOYO","text":"It was no great chore to master your tongue. The grammar and syntax is relatively simplistic."},{"name":"DELION","text":"Such a terrifying intellect. What hope do we have to prevail against it...?"},{"name":"DELION","text":"Ahem, so, how did you narrow down the search to this particular area, exactly?"},{"name":"HILDIBRAND","text":"Why, my tried-and-true inspector's sense, my dear fellow. All the perceptible and imperceptible signs pointed me in this direction...although they did neglect to include a precise location."},{"name":"HILDIBRAND","text":"For that, we must rely on another tried-and-true inspecting technique: interrogation! Spread out, everyone, and question the locals on any PuPu-shaped sightings!"},{"name":"HILDIBRAND","text":"If I may, have you perchance come across an individual resembling this delightful blue ragamuffin here...?"},{"name":"KOYOKOYO","text":"Ragamuffin...?"},{"name":"NASHUMHAKARACCA","text":"Zzz... No, the syrup goes <span class=\"emphasis\">over</span> the pancakes..."},{"name":"DELION","text":"“Inspector's sense,” he says! Clearly he's just following a gut feeling. Unless...could it be that he is in fact channeling a higher power...?"},{"name":"PALAKASMAN04718","text":"Now that you mention it, I <span class=\"emphasis\">did</span> see something like that in the west of the Shroud."},{"name":"PALAKASMAN04718","text":"Might have mistaken it for a small child if not for the way it moved... Sort of a furtive scamper? Creepy."},{"name":"PALAKASWOMAN04718","text":"Oh, yes, I spotted just such an odd little creature in the jungle, on my way back from the city markets. Only, it wasn't alone."},{"name":"PALAKASWOMAN04718","text":"It was in the company of a rather unusual gentleman. Sickly pale, he was, and radiating an unpleasant smell... I felt obliged to keep my distance. "},{"name":"PALAKASMAN04718","text":"I think I'll stay out of the jungle for a while... The western reaches, at least."},{"name":"PALAKASWOMAN04718","text":"You plan on tracking down this unsettling pair, then? You're a braver soul than I."},{"name":"KOYOKOYO","text":"Any promising leads?"},{"name":"DELION","text":"Perhaps the inspector has instinctively tapped into an invisible cosmic energy flow that is attuned to the aliens' auras. But if so, the implications are fascinating indeed..."},{"name":"HILDIBRAND","text":"<span class=\"highlight\">Forename</span>. Have your investigations borne fruit?"},{"name":"HILDIBRAND","text":"Mine own carefully crafted queries place an individual of Master PuPu's proportions in the south of the Shroud."},{"name":"HILDIBRAND","text":"To the west, your sources say...?"},{"name":"DELION","text":"I asked around, and there have been a few sightings in the jungle, somewhere to the north."},{"name":"HILDIBRAND","text":"Hmmm. If we have sightings to the north, south, <span class=\"emphasis\">and</span> west, then that must mean..."},{"name":"HILDIBRAND","text":"...Master PuPu has more friends here than he realized!"},{"name":"KOYOKOYO","text":"I am not that gregarious. I have precisely one friend on this world."},{"name":"DELION","text":"Could it be doppelgangers...? No, no. Too simple, too obvious. It's more likely the same alien wandering the jungle, being spotted in different locations by different eyewitnesses."},{"name":"DELION","text":"Which just means we need to─ugh, I can't believe I'm suggesting this─split up and search the whole area."},{"name":"HILDIBRAND","text":"A fair proposition. Very well, then..."},{"name":"GODBERT","text":"(-Godbert-)Oho, are we launching a search party?"},{"name":"HILDIBRAND","text":"F-Father!? Have you been following me?"},{"name":"GODBERT","text":"Nothing of the sort. I was engaging in feats of physicality while my mind grappled with the mysteries of Mandervillian weapon forging. Hoping to turn perspiration into inspiration, as it were."},{"name":"GODBERT","text":"But I am afraid the Burning Field's wooden men are poor muses when compared to the stimulus a worthy opponent provides..."},{"name":"GODBERT","text":"Hmmm. Mayhap if I join you─and the indomitable <span class=\"highlight\">Forename</span>─in your endeavor, then happenstance will deliver the challenge I require."},{"name":"GODBERT","text":"You are continuing “The Case of the Silent Correspondent,” yes? Have you need of an extra pair of eyes?"},{"name":"HILDIBRAND","text":"As many as you can spare. I was about to assign teams to the search, as a matter of fact."},{"name":"HILDIBRAND","text":"This village sits in the Shroud's east, so let us divvy up the remaining directions, shall we? Nashu and I will head south."},{"name":"HILDIBRAND","text":"<span class=\"highlight\">Forename</span> and Master PuPu, to the west, if you please."},{"name":"HILDIBRAND","text":"Delorian, you and my father have the north."},{"name":"DELION","text":"Ahem, that's “Delion.” Also, hmph. Also, the Shroud of the Samgha is awfully big. How are we to keep in contact, much less coordinate our efforts?"},{"name":"NASHUMHAKARACCA","text":"I had special linkpearls made for just such an occasion! We can chatter in each other's ears as much as we like!"},{"name":"DELION","text":"Are you mad!? The Sharlayans will listen in on everything we're saying."},{"name":"NASHUMHAKARACCA","text":"Really? All the way out here? I shouldn't think their hearing is that good. But seeing as you mislike linkpearls so much, Lord Godbert can hold the one for your team."},{"name":"HILDIBRAND","text":"Linkpearls! What tremendous foresight! Now, let us proceed with our investigation!"},{"name":"KOYOKOYO","text":"The inspector wishes us to search in the west of the jungle, yes? I will follow your lead."},{"name":"SYSTEM","text":"PuPu is now accompanying you. Keep him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"You can leave PuPu behind by entering a different area, or by speaking with him and selecting the option to part ways."},{"name":"SYSTEM","text":"If you wish to have PuPu join you again, return and speak with him at the original location."},{"name":"Q2","text":"What will you do?"},{"name":"A2","text":"Talk."},{"name":"A2","text":"Part ways."},{"name":"A2","text":"Nothing."},{"name":"KOYOKOYO","text":"Strange... I did not note the passage of time in your absence. Shall we continue the search?"},{"name":"KOYOKOYO","text":"Etheirys must be a wonderful star to call home. So rich in resources..."},{"name":"A3","text":"<span class=\"highlight\">Discuss the river.</span>"},{"name":"KOYOKOYO","text":"A river flowing right at our feet..."},{"name":"KOYOKOYO","text":"Many stars have I visited in the cosmos, but precious few have such a bounty of water as this one. Your home is a rare treasure."},{"name":"A3","text":"<span class=\"highlight\">Discuss the rocky outcrops.</span>"},{"name":"KOYOKOYO","text":"The rock formations on this island remind me of my home star. They have the same vibrant hues, the same stark beauty. If only..."},{"name":"KOYOKOYO","text":"Ahem, but never mind that. We have a friend to find."},{"name":"SYSTEM","text":"Are you sure you wish to part ways with PuPu?"},{"name":"KOYOKOYO","text":"And you must attend to this matter immediately? Understood. I will be waiting at Palaka's Stand."},{"name":"SYSTEM","text":"You must be accompanied by PuPu and have him at your side in order to proceed with quest objectives."},{"name":"SYSTEM","text":"PuPu has yet to arrive. Be sure he is at your side before attempting to continue."},{"name":"KOYOKOYO","text":"I see no trace of my comrade..."},{"name":"KOYOKOYO","text":"But what of these black-furred beings? Are they friends of yours─fellow people of Etheirys?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"Those are a type of sasquatch. By which I mean no."},{"name":"A4","text":"Vaguely people-shaped, perhaps, but not people. Not particularly friendly either."},{"name":"KOYOKOYO","text":"There is a greater variety of species here than I anticipated. I shall have to collect more samples..."},{"name":"KOYOKOYO","text":"Let's keep moving."},{"name":"KOYOKOYO","text":"No sign of my friend here either..."},{"name":"KOYOKOYO","text":"But these white-furred individuals─they are surely one of your civilized races, yes?"},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"Those are beastkin. Monkeys."},{"name":"A5","text":"Also not people. Mind the poop throwing."},{"name":"KOYOKOYO","text":"Hmmm. I find it difficult to tell the difference. One semi-intelligent life-form is much the same as another."},{"name":"KOYOKOYO","text":"Well, never mind. Moving on."},{"name":"KOYOKOYO","text":"Nothing. Not even a little burnt circle in the grass..."},{"name":"KOYOKOYO","text":"The friend I'm looking for, we grew up together. We were always together."},{"name":"KOYOKOYO","text":"We even shared the same dream: to roam the great expanse of the cosmos."},{"name":"KOYOKOYO","text":"We worked hard, and supported one another until we both had starships of our very own. Then the universe was ours to explore."},{"name":"KOYOKOYO","text":"How fleeting that feeling of triumph..."},{"name":"KOYOKOYO","text":"Ah, but that is another tale entirely. I simply wished to express how dear this friend is to me."},{"name":"NASHUMHAKARACCA","text":"(-Nashu Mhakaracca-)Hello? Is this thing on? This is Nashu!"},{"name":"NASHUMHAKARACCA","text":"(-Nashu Mhakaracca-)We think we may have found PuPu's friend. Come to Purusa, as quickly as you can!"},{"name":"KOYOKOYO","text":"Yes! Let's take my starship─it's the fastest way!"},{"name":"SYSTEM","text":"Meanwhile, at Purusa..."},{"name":"HILDIBRAND","text":"Hail, dear comrade of Master PuPu! We come in peace. Pray reveal yourself."},{"name":"HILDIBRAND","text":"W-Wait, you... You're the Mandragoras!"},{"name":"ZOMBIEA","text":"(-???-)Uggggggh! I know that gentlemanly overlord's voice..."},{"name":"ZOMBIEA","text":"Master Zombibrand! They said you were trapped in slumber, but I rejoice to see that is no longer the case!"},{"name":"DELION","text":"Gods, it's one of the <span class=\"emphasis\">walking dead</span>!"},{"name":"ZOMBIEA","text":"Greetings, friends, I am a proud member of the Gentle Dead Men and disciple of Master Zombibrand."},{"name":"HILDIBRAND","text":"What brings you here to Thavnair, and in the company of La Noscea's infamous vegetable menace, no less!?"},{"name":"ZOMBIEA","text":"Allow me some few precious moments of your lifespan to explain."},{"name":"ZOMBIEA","text":"It was a time when the maggots in my skull grew restless and wriggly. Tales of spoiled seedkin terrorizing the region of Bozja reached our undead fraternity, and so on their behalf I traveled afar to recruit a rotten mandragora."},{"name":"ZOMBIEA","text":"After making his acquaintance, the festering fellow wished to introduce me to his brethren, who he assured me were no less rotten. Thus did I make next for La Noscea, that I might extend a fetid hand in friendship."},{"name":"ZOMBIEA","text":"When I arrived, however, I learned that one of their companions had been abducted by a strange flying vessel. What was a Gentle Dead Man to do but aid in the search!"},{"name":"ZOMBIEA","text":"I turned to <span class=\"emphasis\">The Thavnairian Truth</span>, that reliable bastion of supernatural rumormongering, and lo and behold, an alien craft matching the seedkin's description had been spotted here on this isle. Needless to say, we embarked on our journey forthwith."},{"name":"DELION","text":"Ah, one of our faithful readers! I'm pleased to see that even in undeath, the hunger for truth is not wholly subsumed by the hunger for brains."},{"name":"HILDIBRAND","text":"So, we find ourselves on the Case of the Misappropriated Mandragora. This abductor will not evade my powers of discernment."},{"name":"NASHUMHAKARACCA","text":"Soon we'll need a case to carry all these cases!"},{"name":"DELION","text":"An “abductor”... I have a feeling we won't need to look far."},{"name":"KOYOKOYO","text":"Ah. That may have been me..."},{"name":"KOYOKOYO","text":"Forgive me for taking your friend. In my sample-collecting frenzy, I must have mistaken him for an edible plant of some kind."},{"name":"ZOMBIEA","text":"Understandable! You would not be the first to confuse a mandragora with a salad ingredient. The main thing is that he is returned to us unharmed─and uneaten."},{"name":"ZOMBIEA","text":"All's well that ends well. Now, if you will excuse us, we should be getting back to Thanalan. Rotting flesh and humidity is an unpleasant combination."},{"name":"HILDIBRAND","text":"My apologies, Master PuPu. We seem to have missed the mark this time, but I swear to you, I shall not rest until you are reunited with your comrade!"},{"name":"DELION","text":"I almost believed your “keen inspector's sense” to be a form of prognostication, but it really was just...following your gut. And I'm afraid vague inspectorial feelings will take us only so far."},{"name":"DELION","text":"We have an entire world to search, and for that we'd need─oh, I don't know─a veritable army of inspectors."},{"name":"KOYOKOYO","text":"An army of inspectors..."},{"name":"KOYOKOYO","text":"Of course! I can simply clone a multitude of Hildibrands as I did before!"},{"name":"HILDIBRAND","text":"Now, now, let's not do anything rash..."},{"name":"KOYOKOYO","text":"Oh dear. The ship's matter duplication facility has been temperamental for a while, and now it's broken down completely. This clone is the last it will ever produce."},{"name":"BRADIHILND","text":"(-Failed Hildiclone-)Name... My name... Is Brandi...Hild."},{"name":"NASHUMHAKARACCA","text":"Inspector Brandihild? Why is he so...blocky?"},{"name":"KOYOKOYO","text":"The cloning process must have failed partway through. Allow me to euthanize this abnormality."},{"name":"HILDIBRAND","text":"Now, now, let's not do anything rash."},{"name":"HILDIBRAND","text":"Unlike my former replicas, this one is highly unlikely to be mistaken for me. And seeing as we were looking for extra helpers, I say we press this undefined fellow into service!"},{"name":"HILDIBRAND","text":"Welcome to the team, Inspector Brandihild!"},{"name":"BRADIHILND","text":"A pleasure... To make... Your acquaintance."},{"name":"NASHUMHAKARACCA","text":"Blocky, blocky Brandihild!"},{"name":"KOYOKOYO","text":"I knew the duplicator had been unstable, but I pushed it to perform anyway. Now look at what I've wrought: not only is this clone a poor imitation of the inspector in form, but in force of personality as well."},{"name":"DELION","text":"Blocky though this inspector may be, that Master PuPu could so easily attempt to replicate a living, thinking being... Alien technology is so advanced, I can scarce differentiate it from magic."},{"name":"GODBERT","text":"Ohohoho, never a dull moment around the Manderville men!"},{"name":"BRADIHILND","text":"Assistance... Please. Allow me. To be of assistance."},{"name":"HILDIBRAND","text":"We made quite a mess of that temple ruin, but thanks to Father, it looks as good as new. Or would that be “as good as old”? In any event, I look forward to tackling the remainder of the case with my charming new contemporary!"},{"name":"BRADIHILND","text":"I am...delighted. To be a part of it."},{"name":"NASHUMHAKARACCA","text":"Oh, look how shy he is. He really is very charming!"}],"reward":{"gil":1518},"reqs":{"jobs":[{"lvl":90,"id":34}],"quests":[70178]},"next":[70255]},"partials":[{"type":"npc","id":"1042558","obj":{"i":1042558,"n":"Delion","l":3707,"q":1}},{"type":"npc","id":"1042573","obj":{"i":1042573,"n":"Hildibrand","l":3709,"q":2}},{"type":"quest","id":"70178","obj":{"i":70178,"n":"The Imperfect Gentleman","g":71,"l":"Mare Lamentorum","s":220,"f":1}},{"type":"quest","id":"70255","obj":{"i":70255,"n":"Generational Bonding","g":71,"l":"Thavnair","s":320,"f":1}}]}