{"quest":{"name":"Generational Bonding","location":"Thavnair","id":70255,"patch":6.35,"sort":320,"icon":101239,"unlocksFunction":1,"eventIcon":71341,"issuer":1042573,"target":1044765,"genre":71,"journal":["An unperturbed Hildibrand seeks to resume the search for PuPu's comrade.","The irrepressible Hildibrand is eager to resume the search for PuPu's missing comrade, and your newest recruit, the clone Brandihild, proposes a brilliant strategy. Instead of pursuing the alien individual, you will investigate saucer sightings, and exclude those you can say with confidence were of PuPu himself. Delion embraces this idea, suggesting a return to his workroom in Radz–at–Han that he and PuPu might sift through old issues of <span class=\"emphasis\">The Thavnairian Truth</span> and the many accounts they have received.","A process of elimination has determined that the only saucer sighting outside of the regions PuPu visited was reported from Garlemald. The next logical step, it seems, is to journey to Camp Broken Glass, before setting out to find the author of this eyewitness account─an imperial soldier by the name of Numerious.","Delion, arriving somewhat late to your rendezvous in Camp Broken Glass, explains that he has spoken with the contingent officers and learned that Numerious was on their duty roster. The editor in chief once again takes the lead, herding your ragtag party towards the imperial soldier's posting at Forum Patens.","Although thrilled to be meeting the <span class=\"emphasis\">Truth</span>'s editor in chief, Numerious has little to add to his prior bare-bones account. His imperial comrade, on the other hand, relates how he bore witness to the same silvery saucer─before shooting it out of the sky. Using various parameters provided by the artillerist, Brandihild swiftly calculates where the stricken starship most likely crash-landed. Flabbergasted by the clone's mathematical genius, you and your companions take this unexpected advice, and turn your attention towards a point one thousand three hundred and sixty yalms northeast of your current location.","A search for the saucer turns up a scorched exterior panel, but no trace of PuPu's friend. The ensuing discussion about the vessel's probable fate is interrupted, however, when a familiar fragrant young stalker rushes over in a panic, desperate to inform you of Nashu's kidnapping. Perpetrated by a henchman of Doctor Lugae, the crime is accompanied by a message, demanding that you─<span class=\"highlight\">Forename</span>─present yourself at the Tower of Babil. Or else. Hildibrand and Godbert naturally disregard these very specific instructions to speed off in the direction of the designated meeting spot, leaving you behind with Delion, PuPu, and a nonplussed Inspector Brandihild.","Somewhat late off the mark, you hurry to the specified servicing facility, only to find that the Manderville men have concluded their mortal combat with a heavily modified “Suprae-Lugae.” One can only imagine what spectacular carnage preceded your arrival...","Once more reduced to a disembodied head, Lugae nevertheless refuses to admit defeat. He unleashes a deadly nasal laser in your direction, only to have Brandihild intervene, the clone's wondrous geometrical calculations redirecting the beam back to its source. With a little extra assistance from the Mandervilles, this provides you the perfect opening to execute a powerful kick, and send the gleaming skull rocketing away into the distance. A seemingly unharmed and well-rested Nashu then chooses this moment to wander in from an adjoining chamber, and, thus reunited, your intrepid team retires to Radz–at–Han.","Scarcely have you set foot back in the city when Hildibrand throws himself wholeheartedly back into the Case of the Silent Correspondent. His exit is mirrored by the equally enthusiastic Nashu and PuPu, with Brandihild belatedly joining in the chase. Godbert, for his part, appears sufficiently inspired to resume his Manderville weaponry endeavor, and invites you to lend a hand should your schedule permit. This leaves Delion, who, despite a complete lack of supporting evidence, remains determined to expose PuPu's cleverly disguised conspiracy. With your help, of course."],"objectives":["Speak with Hildibrand in Radz–at–Han.","Speak with Hildibrand at Camp Broken Glass.","Speak with Delion.","Search for the starship wreckage.","Speak with Brandihild.","Speak with Hildibrand in Radz–at–Han."],"dialogue":[{"name":"NASHUMHAKARACCA","text":"Blocky, blocky Brandihild!"},{"name":"KOYOKOYO","text":"I knew the duplicator had been unstable, but I pushed it to perform anyway. Now look at what I've wrought: not only is this clone a poor imitation of the inspector in form, but in force of personality as well."},{"name":"DELION","text":"Blocky though this inspector may be, that Master PuPu could so easily attempt to replicate a living, thinking being... Alien technology is so advanced, I can scarce differentiate it from magic."},{"name":"GODBERT","text":"Ohohoho, never a dull moment around the Manderville men!"},{"name":"BRADIHILND","text":"I am...delighted. To be of assistance."},{"name":"HILDIBRAND","text":"An unexpected but invaluable addition to our ranks! With our numbers thus bolstered, I say we are ready once more to dive into the fray!"},{"name":"DELION","text":"Perhaps, but what of our strategy? We need a new approach..."},{"name":"BRADIHILND","text":"Ahem...if I may?"},{"name":"BRADIHILND","text":"Assuming Master PuPu's acquaintance pilots a craft of similar design, then might we not instead attempt to locate the starship? Such a striking vessel will have drawn more attention than the comparatively tiny being in question."},{"name":"DELION","text":"He has a point. The <span class=\"emphasis\">Truth</span> receives a large number of reports from readers claiming to have observed unidentified flying objects."},{"name":"BRADIHILND","text":"We could review said reports─those that meet the criteria of shiny, silver, and saucer-like, naturally─and then remove instances which we know to have been Master PuPu. That should narrow things down considerably."},{"name":"DELION","text":"Indeed! What a fantastic idea!"},{"name":"HILDIBRAND","text":"Ah...hah hah hah! Just the kind of brilliance one might expect of one's clone. I was about to make the very same suggestion!"},{"name":"NASHUMHAKARACCA","text":"Well done, Inspector!"},{"name":"BRADIHILND","text":"Ah...hah hah. I hope I've not overstepped my bounds. I am but a shadow of the original, after all."},{"name":"DELION","text":"I have a stack of back issues stored in the workroom I use in the city. PuPu can help me sift through them, and cross off the sightings that were definitely him. Shall we?"},{"name":"NASHUMHAKARACCA","text":"Inspector Hildibrand inspected Inspector Brandihild with unexpected introspection... Ouch, I think I just twisted my tongue."},{"name":"OKKAKE","text":"Argh! ...I mean, don't mind me! Just keeping a watchful eye on Miss Nashu. You never know what kind of unsavory knaves are out there!"},{"name":"HILDIBRAND","text":"Dorian has taken Master PuPu to peruse his store of past publications. Let us enjoy a brief interlude until they return with the results of their investigation."},{"name":"DELION","text":"We've finished going through all the back issues."},{"name":"DELION","text":"If we discount the areas we know PuPu to have visited, it turns out that there was only one other sighting of a flying saucer. In Garlemald."},{"name":"DELION","text":"The account itself was sent to me by an imperial soldier named Numerious, who appears to be a loyal fan of the <span class=\"emphasis\">Truth</span>."},{"name":"BRADIHILND","text":"All the way from the Empire? Your publication has an impressively wide readership."},{"name":"DELION","text":"Our audience has always been universal. After all, the desire to know the unknown transcends all borders and creeds!"},{"name":"KOYOKOYO","text":"The saucer was spotted during the imperial war of succession. Beyond that, there were no meaningful details."},{"name":"HILDIBRAND","text":"Then we must visit this soldier fellow in Garlemald, and wring from him the entire tale!"},{"name":"DELION","text":"I agree. This is our only lead, and we've no choice but to follow up on it. To Camp Broken Glass!"},{"name":"NASHUMHAKARACCA","text":"C-Cor, it never gets any w-warmer here, does it?"},{"name":"HILDIBRAND","text":"Everyone present and accounted for?"},{"name":"BRADIHILND","text":"Ah, we appear to be missing Master Delion..."},{"name":"DELION","text":"My apologies, but I had a hunch that I thought might save us some time."},{"name":"DELION","text":"I spoke with some contingent officers, you see, and our Numerious is on the roster of allied imperial troops."},{"name":"HILDIBRAND","text":"That does certainly make things easier. And were they able to point you in the direction of this Numerous chap's posting?"},{"name":"DELION","text":"Yes. <span class=\"emphasis\">Numerious</span> is currently with his unit, organizing the supply dump at Forum Patens."},{"name":"DELION","text":"We should head over there, and hope he can spare a few moments to talk."},{"name":"DELION","text":"...Ugh, the chill here seeps right into your bones. How are you all not shivering in that unseasonal attire?"},{"name":"GODBERT","text":"Ohohoho, a Manderville man on a mission feels neither heat nor cold!"},{"name":"DELION","text":"I'm not sure how one's frame of mind can overcome the reality of frostbite, but then again...reality always seems relative around the Mandervilles."},{"name":"DELION","text":"Hello! Is there a Numerious here? I am Delion, the editor in chief of <span class=\"emphasis\">The Thavnairian Truth</span>─I've come to follow up on your eyewitness account."},{"name":"NUMERIUS","text":"The editor in chief himself!? What an honor!"},{"name":"NUMERIUS","text":"I wish there was more to the story, but everything I know was in my submission. I've naught left to tell..."},{"name":"NUMERIUS","text":"...Unless you've something else to share? Didn't you say you saw the saucer as well?"},{"name":"FORMERSOLDIER04718","text":"Oh, I did more than just see it. This was around the time when the fighting with Nerva's faction had escalated into all-out war, you understand."},{"name":"FORMERSOLDIER04718","text":"I'd been assigned to an anti-aircraft cannon, and was actively surveying for enemies when this silver vessel flew into view."},{"name":"FORMERSOLDIER04718","text":"Some new kind of warmachina, I presumed. So I opened fire, and knocked it out of the sky."},{"name":"DELION","text":"“Presumed”? You mean you never got a look at the wreckage?"},{"name":"FORMERSOLDIER04718","text":"We were at war. I wasn't about to venture onto the battlefield to indulge my curiosity. It's probably still out there. Somewhere."},{"name":"HILDIBRAND","text":"We have to find that flying─or should I say, fallen─silvery saucer. Do you have an idea of where it crashed?"},{"name":"FORMERSOLDIER04718","text":"Not an exact location, no..."},{"name":"DELION","text":"Then we'd best have the gods' own luck. Garlemald's capital region encompasses malms and malms of icy wilderness."},{"name":"BRADIHILND","text":"If I may. Do you happen to remember the approximate speed and bearing of the saucer? And the position and firing angle of the cannon?"},{"name":"FORMERSOLDIER04718","text":"More or less, I think. An artillerist without a head for numbers wouldn't be long for the profession."},{"name":"BRADIHILND","text":"...That should be sufficient, thank you."},{"name":"BRADIHILND","text":"I have it! The starship impacted the earth one thousand three hundred and sixty yalms to the northeast of our current location. Give or take a few yalms."},{"name":"DELION","text":"How in the seven hells did you arrive at that conclusion!?"},{"name":"BRADIHILND","text":"Elementary algebra, my dear Delion. Assuming the craft belonging to Master PuPu's comrade is of similar construction, determining its trajectory is trivial."},{"name":"HILDIBRAND","text":"Ah...hah hah hah! My brilliant clone, ladies and gentlemen! I was about to offer the selfsame conclusion, but once again, he has beaten me to the punch..."},{"name":"NASHUMHAKARACCA","text":"Hooray for Inspector Brandihild!"},{"name":"BRADIHILND","text":"Ah...hah hah. I seem to have stolen my progenitor's thunder. My apologies."},{"name":"DELION","text":"One thousand three hundred and sixty or so yalms to the northeast of here! That improves the chances of our search from near hopeless to rather hopeful. Let's go and find this fallen saucer, shall we?"},{"name":"HILDIBRAND","text":"Ah, tut-tut! Silence, please! I must still my mind and quest afield with my senses..."},{"name":"KOYOKOYO","text":"Wherever could it be...?"},{"name":"NASHUMHAKARACCA","text":"Zzz... Hot soup... Zzz... Blazing hearth..."},{"name":"DELION","text":"Oh, to always have such precise coordinates when hunting otherworldly phenomena..."},{"name":"GODBERT","text":"Ohohoho, such an invigorating climate!"},{"name":"BRADIHILND","text":"Had someone thought to record the wind speed and direction, I might have calculated the crash site to the nearest ilm instead..."},{"name":"SYSTEM","text":"A pot, half-buried in the snow. Nothing alien to speak of."},{"name":"SYSTEM","text":"Although promising at first glance, a closer inspection reveals this debris to be the wreckage of some vanquished warmachina."},{"name":"SYSTEM","text":"A scorched and twisted scrap of metal plating. A starship like PuPu's could well have been reduced to a similar state were it hit by artillery rounds..."},{"name":"HILDIBRAND","text":"Oho, what have you found there, <span class=\"highlight\">Forename</span>?"},{"name":"KOYOKOYO","text":"An exterior panel!"},{"name":"KOYOKOYO","text":"This is from my friend's starship, I am sure of it. Debris from the crash landing..."},{"name":"BRADIHILND","text":"I see no other pieces in the immediate vicinity, which means the vessel may have weathered the barrage and made good its escape."},{"name":"BRADIHILND","text":"Another possibility is that your comrade recovered most of the wreckage...or some as-yet-unknown party did."},{"name":"HILDIBRAND","text":"You're saying someone may have made off with our cosmic visitor, saucer and all? I say, this is an altogether different kind of “alien abduction.”"},{"name":"DELION","text":"Hm? Has anyone seen Nashu...?"},{"name":"HILDIBRAND","text":"Now that you mention it, where <span class=\"emphasis\">is</span> my loyal assistant?"},{"name":"OKKAKE","text":"H-Help! You have to help! My beloved Miss Nashu has been kidnapped!"},{"name":"OKKAKE","text":"Some cad claiming to be an agent of Doctor Lugae came and took her away!"},{"name":"OKKAKE","text":"He told me to tell you, and I quote: “If you want your precious companion returned alive, then <span class=\"highlight\">Forename</span> must present <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> at the Tower of Babil. Specifically, the magitek servicing facility─don't forget that part.”"},{"name":"HILDIBRAND","text":"The gall! The temerity! The <span class=\"emphasis\">audacity</span>! My stalwart aid, spirited away under my very nose!"},{"name":"DELION","text":"My apologies, but who are you? A close acquaintance of Nashu, I assume?"},{"name":"OKKAKE","text":"Me!? Oh, no. I wish. I mean, uh, I just happened to be passing through...this snowfield. I'm a...snowflake inspector, you see. No two alike and all that. Anyway, enough about me─you need to go and save Miss Nashu!"},{"name":"GODBERT","text":"At last, a chance to stretch my legs."},{"name":"GODBERT","text":"What say you, my son? Shall we get this rescue mission underway?"},{"name":"HILDIBRAND","text":"Indeed, we shall!"},{"name":"BRADIHILND","text":"They left without us. Even though this doctor fellow asked for <span class=\"emphasis\">you</span> by name. Curious."},{"name":"KOYOKOYO","text":"Forget the missing starship for now! Nashu is in imminent danger!"},{"name":"DELION","text":"Another abduction. And yet all I can do is wonder who that odd young man was...and why he smelled so strongly of cheese."},{"name":"BRADIHILND","text":"I've collected what evidence remained of the crash, but solving this mystery will have to wait. The Case of the Abducted Assistant calls!"},{"name":"SYSTEM","text":"You must be a Disciple of War or Magic of level 90 or above to proceed."},{"name":"SYSTEM","text":"Meanwhile, at the Tower of Babil..."},{"name":"LUGAE","text":"Wee hee hee! All shall fall before Suprae-Lugae! With this new and improved body, revenge will finally be mine..."},{"name":"HILDIBRAND","text":"You will release Nashu this instant!"},{"name":"LUGAE","text":"What are you two doing here!? I <span class=\"emphasis\">specifically</span> asked for the adventurer! Begone, before I unleash my fury prematurely..."},{"name":"GODBERT","text":"Ohoho, this promises to be a proper battle."},{"name":"GODBERT","text":"I see no reason to trouble <span class=\"highlight\">Forename</span>. We tackle this menace as father and son─the Manderville men─together!"},{"name":"HILDIBRAND","text":"Agreed!"},{"name":"LUGAE","text":"Bah, I'll not waste my appetite for vengeance on the side dishes! Hired thugs, time to earn your pay!"},{"name":"GODBERT","text":"Oho. A little warm-up before the main event."},{"name":"LUGAE","text":"Get! Them!"},{"name":"HILDIBRAND","text":"Now's our chance!"},{"name":"HILDIBRAND","text":"WaaaAAAaaahhhHHHhhh!"},{"name":"LUGAE","text":"GaaaAAAaaahhhHHHhhh!"},{"name":"HILDIBRAND","text":"The Manderville men!"},{"name":"GODBERT","text":"Victorious again!"},{"name":"BRADIHILND","text":"Ah... Things seem to be well in hand."},{"name":"LUGAE","text":"(-???-)Wee hee hee! Don't get ahead of yourself!"},{"name":"LUGAE","text":"(-Lugae-)There you are, my loathsome nemesis! I saved something special, just for you!"},{"name":"LUGAE","text":"(-Lugae-)Noooooooooooooooooo!"},{"name":"NASHUMHAKARACCA","text":"&lt;yawn&gt; That was a lovely nap."},{"name":"NASHUMHAKARACCA","text":"Oh. Did someone build a magitek servicing facility while I was asleep?"},{"name":"HILDIBRAND","text":"Nicely done, Inspector Brandihild! Once more the clone has put the original to shame!"},{"name":"BRADIHILND","text":"Inspector, please... I am but a pale imitation of your ideal..."},{"name":"GODBERT","text":"Hah! I knew keeping company with the famous <span class=\"highlight\">Forename</span> would lead me to a worthy challenge. Worthy of breaking a sweat, at least."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You've done all the work for me!"},{"name":"A1","text":"You've done all the work for me..."},{"name":"GODBERT","text":"Work? This? 'Twas but a playful skirmish compared to your usual do-or-die dilemmas."},{"name":"GODBERT","text":"Ohohoho, 'twas rude of us not to share a slice of the action! Yet even vaunted champions such as yourself must rest their bodies and let others rise to the occasion from time to time."},{"name":"HILDIBRAND","text":"The villain is vanquished, and Nashu is returned to us safe and sound. I say we head back to Radz–at–Han to regroup and rethink our position."},{"name":"HILDIBRAND","text":"Your comrade yet lives, Master PuPu, I am certain of it. Take heart, and let us continue the search."},{"name":"NASHUMHAKARACCA","text":"I remember standing in the snow, and dreaming of being warm...then suddenly, I wasn't cold anymore. Isn't that odd? Maybe I should fall asleep in uncomfortable places more often!"},{"name":"OKKAKE","text":"Phew... I don't know what I would have done had Miss Nashu been harmed. Clearly I need to track her comings and goings even <span class=\"emphasis\">more</span> closely!"},{"name":"HILDIBRAND","text":"To Garlemald and back have we journeyed, yet this is just the beginning of the Case of the Silent Correspondent!"},{"name":"HILDIBRAND","text":"Come, my friends! The shard of saucer we secured shall lead us onwards to new discoveries!"},{"name":"NASHUMHAKARACCA","text":"Wait for me, Inspector! I don't know which way is “onwards”!"},{"name":"BRADIHILND","text":"I...should follow him, shouldn't I?"},{"name":"BRADIHILND","text":"W-Wait! Wait for me!"},{"name":"GODBERT","text":"That bracing melee was just what the chirurgeon ordered! A spot of exertion to stimulate the mind, and I find myself ready to grapple with the finer points of forging again."},{"name":"GODBERT","text":"Your assistance in this historic reproduction of Manderville weaponry would be, as always, most welcome."},{"name":"GODBERT","text":"A final word from yours truly, if I may?"},{"name":"GODBERT","text":"The complexities of Godbrand's techniques had me flummoxed, I confess, but I do believe this recent spot of exertion has provided just the inspiration I required."},{"name":"GODBERT","text":"When you are ready to proceed with our endeavor, pray drop a word in Master Gerolt's ear. I shall make myself available forthwith."},{"name":"GODBERT","text":"Until our next meeting!"},{"name":"DELION","text":"Thank you for assisting with my investigations, <span class=\"highlight\">Forename</span>."},{"name":"DELION","text":"Once again, our travels were rife with inexplicable phenomena, and yet I am no closer to exposing PuPu's well-concealed conspiracy."},{"name":"DELION","text":"He will slip up one day, though, and you and I will be there to catch him! "},{"name":"SYSTEM","text":"Meanwhile, somewhere in Thavnair..."},{"name":"MYSTERIOUSMAN","text":"(-Mystery Man-)You took my coin and you failed. What audacity that you should return, seeking my largesse once more."},{"name":"LUGAE","text":"(-Lugae-)I deserve your scorn. But I promise you, your plans are in danger so long as that tenacious pest yet lives."},{"name":"LUGAE","text":"(-Lugae-)I know of a path to victory─a forbidden path. One which demands the manifestation of the divine..."},{"name":"MYSTERIOUSMAN","text":"(-Mystery Man-)...You have my attention."},{"name":"SYSTEM","text":"Alien friends with strange technology♪"},{"name":"SYSTEM","text":"Cloning yourself can lead to tragedy♪"},{"name":"SYSTEM","text":"But sometimes you get♪<br>What you don't expect♪<br>A blocky man of quality─Inspector Brandihild♪"},{"name":"SYSTEM","text":"Flat-faced for sure but still sharp as a tack♪"}],"reward":{"gil":3330},"reqs":{"jobs":[{"lvl":90,"id":34}],"quests":[70254]},"next":[70261]},"partials":[{"type":"npc","id":"1042573","obj":{"i":1042573,"n":"Hildibrand","l":3709,"q":2}},{"type":"npc","id":"1044765","obj":{"i":1044765,"n":"Hildibrand","l":3707,"q":1}},{"type":"quest","id":"70254","obj":{"i":70254,"n":"The Spectacle of Inspection","g":71,"l":"Radz-at-Han","s":310,"f":1}},{"type":"quest","id":"70261","obj":{"i":70261,"n":"Well-oiled","g":72,"l":"Radz-at-Han","s":201,"f":1}}]}