{"quest":{"name":"Inheritance","location":"Ul'dah","id":70256,"patch":6.3,"sort":215,"icon":101209,"eventIcon":71221,"issuer":1044847,"target":1044854,"genre":198,"journal":["The royal seneschal has a new event in mind to bring smiles to all the princesses of the realm.<br><br>※This quest is available for a limited time only.","The royal seneschal informs you that for this year's Little Ladies' Day celebration, he and Aldiytha Thorne have formulated a plan to distribute replicas of an antique folding fan to all who attend the day's festivities. Seeking to learn more about the fan, Aldiytha took it upon herself to investigate its origins, but has since been forced to halt her investigation due to her frail constitution. To lighten her burden, the royal seneschal entreats you to go to her aid, to which you promptly agree. With relief in his voice, he directs you to the Gold Court in the Steps of Thal, where he believes she is resting on a bench.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You find Aldiytha downcast, frustrated that she is unable to meet with two people she had arranged appointments with due to her sickly state. Bringing you up to speed, she explains that the plan for this year's celebration came into fruition when she found an antique folding fan in her home, the Thorne manor. After some research, she discovered that a fan of identical design was once used by Princess Edvya more than three centuries ago, when the audacious princess used it to perform a dance. Aldiytha, charmed by the tale, informed the royal seneschal of her desire to replicate the storied fan and incorporate it into the festivities, and so the plan to distribute fans to festival-goers was born. It was at this juncture, however, that the artisan in charge of the reproduction revealed that the fan itself was one of recent make, and not in fact from the era of the Thorne Dynasty. Desperate for answers, and unable to turn to her father, Aldiytha instead arranged to meet with a historian and a reporter with knowledge on the subject. Unable to rise to the occasion, she bids you meet with them in her stead.","True to your word, you meet with the historian and reporter, but nothing could have prepared you for the revelations you would discover. You learn that the fan not only belonged to Aldiytha's mother, but that such fans in particular have traditionally been used in the Little Ladies' Dance, a dance passed down from mother to daughter in the Thorne family for generations. Eager to deliver the news to Aldiytha, and simultaneously perplexed as to how she is unaware of her own family's legacy, you make for the Gold Court. ","Aldiytha, visibly distressed by your report, confesses that she had no idea the fan belonged to her mother, nor that it was used in a long-standing family tradition. While she suspects her father had his reasons for withholding the truth from her, she is nevertheless determined to uncover it for herself, and begs your assistance once more. To learn more of her mother, Claudia Thorne, and the Little Ladies' Dance, she bids you speak with well-to-do individuals in the vicinity of the Sapphire Avenue Exchange and Eshtaime's Aesthetics.","You speak with two nobles who, as fortune would have it, knew Claudia Thorne, and discover that she seldom attended social functions as a result of her having had a delicate constitution. Yet despite her frequent bouts of illness, she left her mark on these two individuals, such that they well remember their interactions with her. One noblewoman─who, in turn, reveals herself to be an old friend of Claudia's─reflects fondly on the time she learned the Little Ladies' Dance, and is inspired to teach it to Aldiytha when she learns of her predicament. Meanwhile, a restless nobleman conversely recalls a bittersweet memory of Claudia─of a time when she performed the Little Ladies' Dance for him during a Little Ladies' Day celebration many years ago, only to collapse from exhaustion. Aldiytha would surely wish to be apprised of your discoveries, and so you make ready to return to the Gold Court once more.","You return to Aldiytha, and learn that the noblewoman from earlier indeed stopped by to teach her the dance. Delighted, you present your findings to her. Upon hearing what you have to say, she begins to suspect that her father has been keeping secrets from her out of concern for her health, but is interrupted in the midst of her musings by Rodolph's sudden arrival. He informs you both that her father, Fortin, has been worried sick about her since she disappeared from the manor, and is presently searching for her in the vicinity of the Ruby Road Exchange. Asking that you stay by her side so that she can muster the courage to face her father, you set off to meet the stringent head of House Thorne.","Much to your surprise, you discover that the restless nobleman you met earlier was in fact Aldiytha's father, Fortin. He reveals that he hid the truth from Aldiytha because the folding fan and Little Ladies' Dance served as painful reminders of losing the woman he loved. Aldiytha expresses sympathy for how he feels, and then to his amazement, performs the dance to perfection, bringing him back to a Little Ladies' Day long ago, when Claudia once did the same for him. Moved by his daughter's performance, he at last gives in to her wishes, pledging to serve as her seneschal for the remainder of the celebration─as long as she agrees not to push herself. Grateful for your unending support, Aldiytha offers you a replica of the fan and instructions on how to perform the dance yourself. Before you go, she announces her intention to distribute fans and share the history of the dance with as many people as possible, in hopes of making this Little Ladies' Day one to be remembered."],"objectives":["Speak with Aldiytha at the Gold Court.","Show the Thorne Dynasty-era folding fan to the grizzled historian.","Show the Thorne Dynasty-era folding fan to the <span class=\"emphasis\">Mythril Eye</span> reporter.","Return the Thorne Dynasty-era folding fan to Aldiytha at the Gold Court.","Gather information on the Steps of Thal.","Speak with Aldiytha.","Speak with Fortin at the Ruby Road Exchange."],"dialogue":[{"name":"BUTLER","text":"Ah, greetings, my friend! 'Tis good to see you─very good indeed, as it just so happens there is a matter with which I require assistance."},{"name":"BUTLER","text":"As you will be aware, another Little Ladies' Day is upon us, and we are celebrating all ladies as princesses, attending to their every need."},{"name":"BUTLER","text":"Begging your pardons, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, but you are an adventurer, are you not? If so, I should be much obliged for your kind assistance."},{"name":"BUTLER","text":"I am the royal seneschal, and it is my honor to oversee Little Ladies' Day. In case you are unfamiliar, the festival celebrates all the maidens of the realm, and my duty is to see that each and every lady is treated as a princess."},{"name":"BUTLER","text":"For this year's celebration, we are planning to distribute replicas of an antique folding fan to participants."},{"name":"BUTLER","text":"Wishing to learn more about said fan, Miss Aldiytha, a scion of House Thorne, has taken it upon herself to investigate its origins."},{"name":"BUTLER","text":"Alas, she has ever had a frail constitution and is feeling unwell. For now she rests at my insistence, but passionate as she is about the celebration, I worry that she won't stay put."},{"name":"BUTLER","text":"Thus would I turn to you for help. In order to take the burden off my lady─who is also a treasured princess this day─might I prevail upon you to assist with her investigation?"},{"name":"BUTLER","text":"I'm truly grateful! Now, Miss Aldiytha should be resting on a bench in the Gold Court, so pray seek her out there. I leave her in your capable hands."},{"name":"BUTLER","text":"Miss Aldiytha should be resting on a bench in the Gold Court, so pray seek her out there. I leave her in your capable hands."},{"name":"ALDIYTHA","text":"&lt;sigh&gt;"},{"name":"ALDIYTHA","text":"Oh, my apologies. I didn't notice you there."},{"name":"ALDIYTHA","text":"It's been quite some time. You are well, I trust? If you are looking to partake in the festivities, I would be happy to point you in the direction of the royal seneschal."},{"name":"ALDIYTHA","text":"Pardon me, but I do not believe we've met. Is there something you require?"},{"name":"ALDIYTHA","text":"So the royal seneschal sent you... Well, I would be lying if I said that I didn't need the help. I'm in a worse way than I had realized..."},{"name":"ALDIYTHA","text":"&lt;sigh&gt; I'm supposed to meet with two people as part of my investigation, but loath as I am to admit it, I'm in no condition to be up and about."},{"name":"ALDIYTHA","text":"As you may already know, I'm investigating the origins of an antique folding fan─the very one beside me─which I found in the Thorne manor one day."},{"name":"ALDIYTHA","text":"Curious about the design, which is unseen in Ul'dah, I turned to the history books─and discovered that it is of a style used in the palace during the Thorne Dynasty."},{"name":"ALDIYTHA","text":"Further research revealed that Princess Edvya, my ancestor who gave rise to Little Ladies' Day, once used such a fan in a dance she performed at a royal soirée."},{"name":"ALDIYTHA","text":"It was very beautiful, by all accounts, and I should have liked to see it."},{"name":"ALDIYTHA","text":"Inspired by this discovery, I consulted the royal seneschal, and it was decided that we would make replicas of the fan as gifts for this year's celebration."},{"name":"ALDIYTHA","text":"However, when we showed the fan to the artisan we hired, he declared that, while undeniably designed in the Thorne style, it was crafted much more recently─no more than a few decades ago at most."},{"name":"ALDIYTHA","text":"This led me to wonder: who had this fan made, and why? With my mother no longer with us, I went and asked my father, but he claimed to know nothing about it and said no more."},{"name":"ALDIYTHA","text":"Though he married into the family, he is the present head of House Thorne. If even he does not know, then I have to seek answers elsewhere."},{"name":"ALDIYTHA","text":"Additionally, if we learned how the fan was used during Princess Edvya's time, I thought that we could share the knowledge during the celebration. Thus did I arrange to meet with people who are versed in the history of our family."},{"name":"ALDIYTHA","text":"As I am now, however, I can scarcely stand without feeling faint. I'm sorry to impose, but might I trouble you to attend the appointments in my stead?"},{"name":"ALDIYTHA","text":"I'm in your debt. Now, you will want to take the fan with you."},{"name":"ALDIYTHA","text":"Please show it when you meet the individuals in question. One is a reporter from the <span class=\"emphasis\">Mythril Eye</span>, who will be at Arrzaneth Ossuary, and the other is a historian, who will be at the Quicksand."},{"name":"ALDIYTHA","text":"Lest you forget, the reporter is at Arrzaneth Ossuary, and the historian the Quicksand. Please show them the fan and learn what you can about it."},{"name":"FESPDYARCHAEOLOGIST04720","text":"Can I help you with something? I'm actually supposed to meet someone here, but she appears to be late..."},{"name":"FESPDYARCHAEOLOGIST04720","text":"Ah, so you've come on Miss Aldiytha's behalf. And this is the fan she wished me to inspect... Indeed, it is of a style hailing from the Thorne Dynasty."},{"name":"FESPDYARCHAEOLOGIST04720","text":"It is said that Princess Edvya carried such a fan when she attended functions."},{"name":"FESPDYARCHAEOLOGIST04720","text":"In those days, it was considered meet for noblewomen to cover their faces, to which end they carried folding fans on their persons."},{"name":"FESPDYARCHAEOLOGIST04720","text":"But as the Legend of the Lost Lady would attest, Princess Edvya didn't concern herself with social norms. And at a royal soirée, far from using her fan to cover her face, she used it to perform an impromptu dance!"},{"name":"FESPDYARCHAEOLOGIST04720","text":"The sultan and his retinue of seneschals looked on aghast, but the guests were captivated by her performance, and erupted into rapturous applause when she finished."},{"name":"FESPDYARCHAEOLOGIST04720","text":"That dance came to be known as the “Little Ladies' Dance,” and it is said to have been passed down through the women of House Thorne. The fan you hold, I expect, was crafted for that very purpose."},{"name":"FESPDYARCHAEOLOGIST04720","text":"Curious, though... As a daughter of House Thorne, it seems to me that Miss Aldiytha should be aware of this legacy. In any case, I hope I was able to be of some help to her. Pray pass along my regards."},{"name":"FESPDYJOURNALIST04720","text":"Where could Aldiytha be...?"},{"name":"FESPDYJOURNALIST04720","text":"Erm... Can I help you?"},{"name":"FESPDYJOURNALIST04720","text":"This fan... Aldiytha sent you, I take it. Very well, then, I'll tell you what I know."},{"name":"FESPDYJOURNALIST04720","text":"When Aldiytha reached out about an antique fan she found, I was instantly reminded of a similar one that I saw long ago."},{"name":"FESPDYJOURNALIST04720","text":"By her description alone, I couldn't be certain, but to see it here and now, there's no doubt in my mind: this fan once belonged to Aldiytha's mother, Claudia."},{"name":"FESPDYJOURNALIST04720","text":"She was still half a girl at the time─fifteen summers old, perhaps─when I interviewed her for a Little Ladies' Day article. That day, she had this very fan with her."},{"name":"FESPDYJOURNALIST04720","text":"She was out of sorts, though, and begged to sit down and rest. As tired as she looked, I decided to cut the interview short and ended up writing about something else."},{"name":"FESPDYJOURNALIST04720","text":"I must say, I find it a little strange that Aldiytha should ask me about the fan. It belonged to her mother, after all. Surely she would know about it?"},{"name":"ALDIYTHA","text":"Ah, you are returned. Thank you for attending the appointments in my stead. So, did you learn aught of interest?"},{"name":"ALDIYTHA","text":"What? The fan...was my mother's?"},{"name":"ALDIYTHA","text":"And it was used to perform the Little Ladies' Dance─a dance passed down through the women of our line?"},{"name":"ALDIYTHA","text":"I..."},{"name":"ALDIYTHA","text":"Forgive me, but I'm not sure what to think. I never knew about any of this─about neither the fan nor the dance. Why didn't my mother share the tradition with me?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Perhaps she was also unaware of it."},{"name":"A1","text":"Perhaps she didn't have the chance."},{"name":"ALDIYTHA","text":"If this fan belonged to my mother, I'm inclined to believe she inherited the tradition, or was at least aware of it. But even if she'd wished to pass it on to me, she succumbed to illness when I was little..."},{"name":"ALDIYTHA","text":"Yes, I feel that is the only plausible explanation. My mother succumbed to illness when I was little. Even if she had wished to pass on the tradition, she never had the chance to do so..."},{"name":"ALDIYTHA","text":"Be that as it may, my father must have known something."},{"name":"ALDIYTHA","text":"I know not why he claimed otherwise and feigned ignorance about the fan, nor do I expect that he would willingly talk."},{"name":"ALDIYTHA","text":"Still...I want to know. About the dance, and about my mother. I'm sorry to impose yet again, adventurer, but won't you help me find the answers?"},{"name":"ALDIYTHA","text":"This means a lot to me. Thank you."},{"name":"ALDIYTHA","text":"Now then, if my mother appeared at Little Ladies' Day with her fan, it seems likely that she performed the dance there. On that assumption, I propose we look for those who knew my mother around when she was involved in the festival. For this, wealthy middle-aged folk seems a likely place to start. Chances are they at least crossed paths with her in social circles."},{"name":"ALDIYTHA","text":"To that end, could you please try approaching affluent-looking individuals at the Sapphire Avenue Exchange and Eshtaime's Aesthetics? I shall await you here."},{"name":"ALDIYTHA","text":"In Ul'dah, those with wealth are wont to put it on display. I am counting on as much to lead us to someone who knew my mother."},{"name":"FESPDYWOMAN04720","text":"What's that? Do I know Claudia Thorne...and the dance she used to perform? May I ask who is asking?"},{"name":"FESPDYWOMAN04720","text":"Goodness me, to think Aldiytha had no idea... I was good friends with her mother, I'm proud to say, and would be glad to share what I know."},{"name":"FESPDYWOMAN04720","text":"She was quite frail, was Claudia, and constantly took ill. As a result, she seldom attended social functions, and certainly never performed the Little Ladies' Dance in them."},{"name":"FESPDYWOMAN04720","text":"She did, however, show it to me in private, and I consider myself blessed. It was so beautiful, I begged to learn it from her."},{"name":"FESPDYWOMAN04720","text":"She kindly taught me, and she would have dearly loved to teach Aldiytha too, I'm sure. It breaks my heart that she never had the chance..."},{"name":"FESPDYWOMAN04720","text":"But if Aldiytha is keen to learn the dance, nothing would please me more than to teach it, a poor substitute though I may be for her mother."},{"name":"FESPDYWOMAN04720","text":"She awaits at the Gold Court, yes? I shall go and find her there at once!"},{"name":"FORTIN","text":"Where in the world did she disappear to...?"},{"name":"FORTIN","text":"Wh-What? Did I ever see the dance performed by Claudia Thorne!? As it happens...yes. Yes, I did..."},{"name":"FORTIN","text":"It was during a Little Ladies' Day celebration many years ago. Claudia was participating for the first time, and I had the honor of being her guide."},{"name":"FORTIN","text":"By way of thanks for my company, she showed me the dance. Flourishing her fan, she moved with such majestic grace, I was left utterly transfixed."},{"name":"FORTIN","text":"\"A dance so lovely should be seen by all. Won't you perform it on stage at the festival?“ I suggested. And to my delight, she agreed with a smile."},{"name":"FORTIN","text":"But no sooner did she finish enrapturing the crowds than she retreated out of sight, and all but collapsed to the ground."},{"name":"FORTIN","text":"It was then that I learned of her frail constitution. Though I hadn't been aware, I felt no less terrible for making her overexert herself. I apologized profusely, begging her not to push herself ever again, and the sad look on her face when she nodded is something I've not forgotten to this day..."},{"name":"FORTIN","text":"Ah, but look at me prattle on to a complete stranger. My apologies. Now then, I was in the midst of looking for someone, so I shall excuse myself..."},{"name":"FESPDYLADY04720","text":"A Thorne woman who once danced at the festival? I'm afraid I'm not familiar. Little Ladies' Day has always been a commonfolk's festival, after all."},{"name":"FESPDYLADY04720","text":"If anyone were to know, I daresay it would be the head of the Thorne family. 'Tis under their auspices that the celebrations take place."},{"name":"FESPDYLADY04720","text":"If anyone were to know about a Thorne woman who danced at Little Ladies' Day, it would be the head of the Thorne family. 'Tis under their auspices that the celebrations take place."},{"name":"ALDIYTHA","text":"Oh, there you are. A woman was here just now. She told me she was a friend of my mother's, and kindly taught me how to perform the Little Ladies' Dance."},{"name":"ALDIYTHA","text":"It's as beautiful as I imagined it would be, and I cannot thank you enough for finding this person. Now then, were you able to learn aught from anyone else?"},{"name":"ALDIYTHA","text":"So my mother once performed the dance before a crowd, but the exertion was too much for her..."},{"name":"ALDIYTHA","text":"From what I've now seen, the movements may indeed be trying for those of poor health."},{"name":"ALDIYTHA","text":"Those such as myself. Thus did my father choose to keep the dance a secret from me─out of concern for my well-being."},{"name":"ALDIYTHA","text":"...Or so I speculate, at any rate."},{"name":"RODOLPH","text":"Lady Aldiytha! Thank heavens I found you!"},{"name":"ALDIYTHA","text":"Rodolph!? Wh-What are you doing here?"},{"name":"RODOLPH","text":"What am <span class=\"emphasis\">I</span> doing here? Begging your pardons, my lady, but you disappeared from the manor without a word! Both your father and I have been worried sick!"},{"name":"RODOLPH","text":"But all's well that ends well, and I see now that you were in good hands. Thank you, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, for looking after the young mistress once more."},{"name":"RODOLPH","text":"But all's well that ends well, and it seems that you were on hand for the young mistress. As her seneschal, allow me to express my heartfelt gratitude."},{"name":"RODOLPH","text":"Now then, my lady. Even as we speak, your father searches for you in the city. If you feel strong enough, let us seek him out together. It would set his mind at ease."},{"name":"ALDIYTHA","text":"...Yes, of course."},{"name":"ALDIYTHA","text":"Thanks to you, I've discovered things I never knew about my family, and I would have you at my side when I meet with my father. Will you come with me?"},{"name":"ALDIYTHA","text":"Thank you. Your presence will give me the courage to seek the truth."},{"name":"RODOLPH","text":"Master Fortin should be somewhere in the Ruby Road Exchange. Please follow me."},{"name":"ALDIYTHA","text":"I told Father that I am perfectly fine, but he nevertheless insisted that I sit down..."},{"name":"RODOLPH","text":"Master Fortin was beside himself with worry over the young mistress's health. He wishes to thank you for attending her."},{"name":"FORTIN","text":"You... You're the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> from earlier. I should have guessed you were the one who aided my daughter..."},{"name":"FORTIN","text":"I said what I said not realizing you had come at her behest, but what's done is done. Now, allow me to properly introduce myself. Fortin Thorne, head of the Thorne family, at your service."},{"name":"ALDIYTHA","text":"No more secrets, Father. Why did you hide the truth from me?"},{"name":"FORTIN","text":"I couldn't bring myself to tell you. Even as that fan and that dance hold fond memories of your mother, they are a painful reminder that she is gone."},{"name":"FORTIN","text":"I couldn't bear to lose you as well. So please, return the fan, and forget about the dance."},{"name":"ALDIYTHA","text":"Father... I understand full well why you feel this way. Were I in your position, I would likely feel the same."},{"name":"ALDIYTHA","text":"But as much as I'm touched by your concern, I know about everything now. About Mother, about the fan, and even the dance..."},{"name":"FORTIN","text":"C-Claudia...?"},{"name":"RODOLPH","text":"Lady Aldiytha, that was extraordinary! Where in the world did you learn how to dance so beautifully?"},{"name":"ALDIYTHA","text":"An old friend of Mother's taught me. Despite all these years, she still remembered the entire dance down to smallest flourish."},{"name":"ALDIYTHA","text":"Mother brought you great joy when she danced for you that day. On coming to understand this, I knew that I wanted you to experience that joy again."},{"name":"FORTIN","text":"Aldiytha..."},{"name":"FORTIN","text":"Like I once apologized to your mother, I must now apologize to you."},{"name":"FORTIN","text":"It was wrong of me to hide the fan and the dance from you, and I hope you find it in your heart to forgive me. If it is your desire to carry on the tradition, then I will not stand in your way."},{"name":"ALDIYTHA","text":"Thank you. But you know, Father...it <span class=\"emphasis\">is</span> Little Ladies' Day. Rather than an apology, is there not a more appropriate gesture for the occasion?"},{"name":"FORTIN","text":"As you say, my princess. As you say. I, Fortin Thorne, head of the Thorne family, do hereby pledge to serve as your royal seneschal. Your every wish is my command."},{"name":"FORTIN","text":"...Except, perhaps, when I judge that you are overexerting yourself. After all, Your Highness's well-being is my foremost priority."},{"name":"ALDIYTHA","text":"I shall bear that in mind. Without further ado, then, my first wish is to instruct festival staff in the Little Ladies' Dance, that we may share it with all who participate in the festivities."},{"name":"FORTIN","text":"If that is your wish, then it is mine as well. On this day, all ladies are princesses, and everyone should by rights inherit the dance passed down in our family."},{"name":"ALDIYTHA","text":"I have a gift for you, adventurer, as a token of my gratitude. It isn't much, but please accept these instructions for the dance, along with a replica of my mother's fan."},{"name":"ALDIYTHA","text":"Now then, there's no time to waste. We must distribute these fans to as many people as possible, and share with them the history of the dance. This will be a Little Ladies' Day to remember, oh yes it will!"},{"name":"BUTLER","text":"（★未使用／削除予定★）"},{"name":"ALDIYTHA","text":"（★未使用／削除予定★）"},{"name":"ALDIYTHA","text":"（★未使用／削除予定★）"},{"name":"ALDIYTHA","text":"（★未使用／削除予定★）"},{"name":"FESPDYARCHAEOLOGIST04720","text":"（★未使用／削除予定★）"},{"name":"ALDIYTHA","text":"（★未使用／削除予定★）"},{"name":"ALDIYTHA","text":"（★未使用／削除予定★）"},{"name":"BUTLER","text":"（★未使用／削除予定★）"},{"name":"FESPDYJOURNALIST04720","text":"（★未使用／削除予定★）"},{"name":"ALDIYTHA","text":"（★未使用／削除予定★）"},{"name":"ALDIYTHA","text":"（★未使用／削除予定★）"},{"name":"FORTIN","text":"（★未使用／削除予定★）"},{"name":"ALDIYTHA","text":"（★未使用／削除予定★）"}],"reward":{"gil":344,"items":[{"id":39497}]},"reqs":{"jobs":[{"lvl":15,"id":1}]}},"partials":[{"type":"npc","id":"1044847","obj":{"i":1044847,"n":"Royal Seneschal","l":40,"q":1}},{"type":"npc","id":"1044854","obj":{"i":1044854,"n":"Fortin","l":40,"q":1}},{"type":"item","id":"39497","obj":{"i":39497,"n":"Ballroom Etiquette - Fan Fare","l":1,"c":26435,"t":85}}]}