{"quest":{"name":"A Far Eastern Yarn","location":"Unnamed Island","id":70265,"patch":6.3,"sort":111,"icon":101220,"eventIcon":71221,"issuer":1044156,"genre":89,"journal":["A familiar beeping noise is emitting from the curious courier.","Noticing its excited beeping noises, you speak with the curious courier, who informs you that Tataru is on her way with mysterious guests in tow once more. The ecstatic mammet directs you to await her arrival on the islet inlet.","You do not have to wait long before Tataru arrives on the beach with Cirina and Sadu at her side. The pair inform you that they have begun a tour of Eorzea at Lyse's suggestion, to behold all it has to offer now that some semblance of peace has settled throughout the realm. As they have come all this way, Tataru suggests that you show the pair around the island, to which you agree with a characteristic nod. After an extensive examination of the local sheep, they seem well satisfied, and offer you a souvenir from the Azim Steppe─traditional garments adjusted for warm climes. With the island once more to yourself, you may focus wholeheartedly on its continued development."],"objectives":["Await Tataru's arrival at the designated location."],"dialogue":[{"name":"OPERATORMAMMET","text":"Contact! Contact from Mistress Tataru!"},{"name":"OPERATORMAMMET","text":"She's sent word that she's headed this way, and with guests once again! If you wait on the inlet to the west, she should come into view in no time! "},{"name":"OPERATORMAMMET","text":"I can't believe it happened again!"},{"name":"TATARU","text":"<span class=\"highlight\">Forename</span>!"},{"name":"TATARU","text":"Thanks for coming out to meet us!"},{"name":"CIRINA","text":"It is good to see you well, <span class=\"highlight\">Forename</span>. Please forgive us for coming uninvited."},{"name":"CIRINA","text":"We are given to understand that this beautiful isle is your domain, and you have taken to farming, foraging, and erecting quaint monoliths?"},{"name":"SADU","text":"You claim dominion over tiny ironmen, they say. That, at least, is befitting of a khagan."},{"name":"CIRINA","text":"...But you are doubtless curious as to how we came to know all of this. In truth, it was Lyse who first invited me to tour Eorzea. She told me of the many wonderful things that I have yet to see in this land─sights as beautiful as those found in the Steppe."},{"name":"TATARU","text":"Lyse's hands are unfortunately full with her duties in Gyr Abania, however, so I offered to show off the realm's hottest sights. And there's nothing hotter than an island paradise!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"And you two opted to journey together?"},{"name":"A1","text":"Where's our “little sun”?"},{"name":"CIRINA","text":"Our previous visits to this realm have been under the shadow of war. We both wished to take this opportunity to see what joys it has to offer."},{"name":"SADU","text":"Cirina had a mind to journey alone at first."},{"name":"SADU","text":"I knew trouble would find her, so I invited myself along. With luck, we may encounter an adversary who offers us sport."},{"name":"CIRINA","text":"...Pardon? Do you mean Magnai?"},{"name":"CIRINA","text":"Ah, if you wish to see him, you should find him at the Dawn Throne, as ever. I regret to say that I may have neglected to invite him..."},{"name":"SADU","text":"She much prefers my company to that of the preening fool."},{"name":"CIRINA","text":"Now that we are here, I should quite like to see the pasture you mentioned, Mistress Tataru."},{"name":"CIRINA","text":"Oh, and the wild sheep roaming the isle! I must know if they are as replete with wool as those on the Steppe..."},{"name":"TATARU","text":"Why not show them around yourself, <span class=\"highlight\">Forename</span>? That way, they can get a close and personal look at everything your sanctuary has to offer."},{"name":"CIRINA","text":"If it's truly no bother, we would be delighted!"},{"name":"CIRINA","text":"How enlightening! To think sheep can thrive in so remote a place as this..."},{"name":"CIRINA","text":"Those inhabiting this isle do appear somewhat lean, with perhaps less fleece or fat than those of the Steppe. Yet they seem content with their grazing habits, different though their fodder may be. I cannot thank you enough for the opportunity to meet them."},{"name":"SADU","text":"You have fertile land here. A fine domain─if only it weren't so insufferably humid. I see now why Cirina insisted on these fabrics."},{"name":"CIRINA","text":"Speaking of which, we brought you something!"},{"name":"CIRINA","text":"These garments are of the traditional style, but I did my utmost to make them suitable for hotter climes. I hope you will find them to your liking."},{"name":"CIRINA","text":"We had best be on our way now, but we thank you for the gracious hospitality you have shown us."},{"name":"SADU","text":"You would be wise to invite us again. I will prepare a Dotharli gift."},{"name":"TATARU","text":"Each time I visit, I'm amazed by what you've accomplished here. I can't wait to see what else you've achieved when next I return!"}],"reward":{"items":[{"id":39247},{"id":39248},{"id":39249},{"id":39250},{"id":39251}]},"reqs":{"quests":[70181]}},"partials":[{"type":"npc","id":"1044156","obj":{"i":1044156,"n":"Curious Courier","l":4043,"q":2}},{"type":"item","id":"39247","obj":{"i":39247,"n":"Isle Shepherd's Headdress","l":1,"c":56529,"t":34,"p":100}},{"type":"item","id":"39248","obj":{"i":39248,"n":"Isle Shepherd's Tunic","l":1,"c":42908,"t":35,"p":100}},{"type":"item","id":"39249","obj":{"i":39249,"n":"Isle Shepherd's Wristdress","l":1,"c":56047,"t":37,"p":100}},{"type":"item","id":"39250","obj":{"i":39250,"n":"Isle Shepherd's Bottoms","l":1,"c":47939,"t":36,"p":100}},{"type":"item","id":"39251","obj":{"i":39251,"n":"Isle Shepherd's Sandals","l":1,"c":49534,"t":38,"p":100}},{"type":"quest","id":"70181","obj":{"i":70181,"n":"The Land, Wind, and Sea","g":89,"l":"Unnamed Island","s":101}}]}