{"quest":{"name":"A Golden Opportunity","location":"Ul'dah","id":70263,"patch":6.3,"sort":202,"icon":101214,"eventIcon":71221,"issuer":1044881,"target":1045053,"genre":200,"journal":["Kipih Jakkya needs help penning her next hit article.<br>※This quest is available for a limited time only.","Kipih Jakkya informs you that her publication, <span class=\"emphasis\">The Raven</span>, has been invited to write an article to promote the exciting event underway at the Gold Saucer. She seeks another perspective to add a bit of spice to her report, and she requests the insight of an adventurer─namely, you. She asks that you meet her at the entrance to the Gold Saucer, where a member of the staff awaits to greet you.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You arrive at the Gold Saucer to see that two other reporters have been invited, and the attendant Ollier explains that he wishes for each to write a piece espousing the locale's charm to their respective audiences. He then reveals that a mammet hunt has been arranged for the guests, and that the reporter to find the most wind-up Godberts will be granted an exclusive interview with the Gold Saucer's owner. To even the odds, the other two reporters team up, and quickly set off into the din of their surroundings. Eager to win this once-in-a-career opportunity, Kipih Jakkya wishes to discuss strategy sooner rather than later.","Kipih Jakkya suggests a divide and conquer strategy, with each of you searching two sections of the massive casino for the mammets. You are tasked with searching Wonder Square and Round Square for any sign of the miniature Mandervilles.","After a thorough search, you manage to find both mammets before your opponents. Kipih managed to find one herself, and with your victory now assured, she instructs you to meet her back at the entrance so you can report to Ollier.","You and Kipih present the three mammets to Ollier, and he declares you the winners of the exclusive interview with Godbert Manderville. The attendant stands ready to call upon the elusive goldsmith, and while Kipih Jakkya seems eager to avail herself of her prize, the sounds of clinking coins and revelry call to you from deeper within the Gold Saucer."],"objectives":["Speak with Kipih Jakkya at the Gold Saucer.","Speak with Kipih Jakkya again.","Search for the wind-up Godberts.","Deliver the wind-up Godberts to Ollier."],"dialogue":[{"name":"KIPIHJAKKYA","text":"As I live and breathe─is that <span class=\"highlight\">Forename</span>!? What a pleasant surprise!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You're that reporter, right? Kip... Uh..."},{"name":"A1","text":"Have we met before?"},{"name":"A1","text":"Is your brother Nhagi well?"},{"name":"KIPIHJAKKYA","text":"Yes, yes, Kipih Jakkya, at your service. Or rather, at <span class=\"emphasis\">The Raven</span>'s service, I suppose. I never had the chance to thank you properly for before─the article I wrote with your help drew eyes from across the realm and beyond to our tabloid."},{"name":"KIPIHJAKKYA","text":"Don't tell me you've forgotten who I am? It's me, Kipih Jakkya, reporter─and dare I say wordsmith─for <span class=\"emphasis\">The Raven</span>. Did you even read the article you helped me write? Too busy adventuring, I suppose. "},{"name":"KIPIHJAKKYA","text":"It was the highlight of my already illustrious career, and I'm overjoyed to see you again. Actually, I'm in need of help to write my latest piece, and since fortune has placed you before me, I wonder if you wouldn't lend me a hand."},{"name":"KIPIHJAKKYA","text":"How do you know my brother? I don't recall telling you his name... Now that you mention it, he did recently send me a letter..."},{"name":"KIPIHJAKKYA","text":"Ah, but this is no time to be speaking of such things. I'm in need of help to write my latest piece, and since fortune has placed you before me, I wonder if you wouldn't lend me a hand."},{"name":"KIPIHJAKKYA","text":"You there, you have the look of the adventuring sort. I've been looking for someone like you to help me with my new piece."},{"name":"KIPIHJAKKYA","text":"This is your golden opportunity to be immortalized within the pages of <span class=\"emphasis\">The Raven</span>, Eorzea's preeminent tabloid. Rest assured that unlike reporters for more unsavory rags, I, Kipih Jakkya, credit all who contribute to my articles."},{"name":"KIPIHJAKKYA","text":"What do you say? I promise that at the very least, you'll leave this experience more enriched and with an appreciation for the finer aspects of journalism."},{"name":"KIPIHJAKKYA","text":"Your contribution shall be much appreciated, I'm sure. Now then, the matter at hand is this invitation, which was sent to <span class=\"emphasis\">The Raven</span> offices from the Gold Saucer."},{"name":"KIPIHJAKKYA","text":"We have been asked to write a piece on the festivities currently underway at the establishment. Naturally, as <span class=\"emphasis\">The Raven</span>'s most senior reporter, I was chosen for this privileged task."},{"name":"KIPIHJAKKYA","text":"I carry the reputation of my publication on my shoulders, and there's no shame in recruiting an assistant or two with whom to share the weight. I need someone with keen skills of observation and a dazzling insight."},{"name":"KIPIHJAKKYA","text":"Judging by our previous adventures, there is none more suited for this task than you, dear <span class=\"highlight\">Forename</span>! So, how about it? Can I count on you?"},{"name":"KIPIHJAKKYA","text":"And judging by my previous experiences with adventurers, you should be well equipped for this task! So, how about it? Can I count on you?"},{"name":"KIPIHJAKKYA","text":"Very good! Well then, let's depart to the Gold Saucer at once. The invitation states that a member of the staff awaits our arrival at Entrance Square."},{"name":"KIPIHJAKKYA","text":"If you've never visited the Gold Saucer, go and speak with that young man over there. Earlier he was handing out free tickets with abandon, and you'll need one lest our journey be short-lived indeed."},{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the quest “It Could Happen to You,” which can be undertaken at level 15."},{"name":"OLLIER","text":"Yes... It seems all the invited reporters have arrived... Understood, I shall proceed as planned..."},{"name":"DURALTHARAL","text":"If only we at the <span class=\"emphasis\">Mythril Eye</span> could deliver an exclusive interview to our readers..."},{"name":"PETYRWINSOME","text":"Here we are in Ul'dah's premier center of leisure and entertainment. The readers of the <span class=\"emphasis\">Harbor Herald</span> will be eager for an inside look at the revels which take place in these gleaming halls."},{"name":"KIPIHJAKKYA","text":"There you are, adventurer! Let's not keep our host waiting."},{"name":"OLLIER","text":"Ah, you must be from <span class=\"emphasis\">The Raven</span>. Allow me to welcome you personally to the Gold Saucer."},{"name":"OLLIER","text":"Oh, I did not expect to see you there, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! You are always welcome as our honored guest."},{"name":"KIPIHJAKKYA","text":"An honored guest, is it? It seems I picked the right adventurer for the job."},{"name":"OLLIER","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span> is helping you? Well, I must say, this gives <span class=\"emphasis\">The Raven</span> a significant advantage."},{"name":"OLLIER","text":"With your arrival, all of our guests are present. Now, if I could have but a moment of your time..."},{"name":"OLLIER","text":"Illustrious reporters of Eorzea, I welcome you one and all to the Gold Saucer. My name is Ollier, and I have the distinct pleasure of serving as an attendant here."},{"name":"OLLIER","text":"As you are well aware, we are currently holding our most fabulous event of the year─the Make It Rain Campaign."},{"name":"OLLIER","text":"During its duration, guests may receive up to fifty percent more MGP, a currency which can be exchanged within these gilded walls for a bevy of fantastic goods. People of all stripes pour into the Gold Saucer during this event, eager to take their piece of the generous bounty we offer."},{"name":"OLLIER","text":"However, some in Eorzea have yet to grace us with their patronage, which is why we have invited the most esteemed reporters in the realm to partake in our festivities...and prepared sizable compensation for your resulting articles."},{"name":"OLLIER","text":"Of course, a simple tour would hardly suffice to satisfy such curious minds as yours. So we have taken the liberty of preparing a little diversion for the occasion."},{"name":"OLLIER","text":"Behold this masterful mammet, made in the precise likeness of Godbert Manderville. We have hidden four throughout the Gold Saucer─one in each section, excluding Chocobo Square."},{"name":"OLLIER","text":"Use your keen reporter's sense to seek them out. And to the one who finds the most mammets..."},{"name":"OLLIER","text":"We shall reward an exclusive interview with the man himself, President Godbert Manderville of Manderville & Manderville, famed goldsmith and proprietor of dreams!"},{"name":"DURALTHARAL","text":"No paper has ever succeeded in securing a personal interview with Godbert Manderville! Can you believe our luck!?"},{"name":"KIPIHJAKKYA","text":"He's right─an interview with Godbert Manderville would draw more eyes to <span class=\"emphasis\">The Raven</span> than news of another Calamity! This isn't a competition to be taken lightly!"},{"name":"PETYRWINSOME","text":"Hmm... The reward is worthwhile, to be sure, but both Master Tharal and I have come here alone, while <span class=\"emphasis\">The Raven</span> seems to have sent two reporters."},{"name":"PETYRWINSOME","text":"I propose that the <span class=\"emphasis\">Harbor Herald</span> and the <span class=\"emphasis\">Mythril Eye</span> join forces. That would even the odds enough, methinks."},{"name":"KIPIHJAKKYA","text":"I've no objection to that. To the winners go Manderville's secrets─to the losers, pitiful ignorance. Let's keep our eyes well peeled, adventurer!"},{"name":"OLLIER","text":"Then let us make an addendum to the rules─in the case both teams find the same number of mammets, the swiftest to return will be judged the victor."},{"name":"OLLIER","text":"Now, let the mammet hunt begin! Search every corner of our establishment, and may you find the bounties you seek."},{"name":"KIPIHJAKKYA","text":"If there are four wind-up Godberts hidden out there, we should each search for two."},{"name":"KIPIHJAKKYA","text":"You take Wonder Square and Round Square, and I'll cover the remaining two sections. An equal division of labor!"},{"name":"KIPIHJAKKYA","text":"If anything happens, we can stay in touch via this linkpearl. Now, let's find those mammets and win that interview!"},{"name":"OLLIER","text":"Which team of reporters will prove to have the keenest eyes and sharpest senses? I look forward to finding out."},{"name":"PETYRWINSOME","text":"Since the mammet hidden in Entrance Square cannot be seen from the threshold, it can only be in Card Square. Heh heh, the interview is as good as mine."},{"name":"DURALTHARAL","text":"Godbert, Godbert, where is the Godbert? Hmm... Nowhere, it seems."},{"name":"PETYRWINSOME","text":"Where could one hide in such an open space? If I were a mammet..."},{"name":"DURALTHARAL","text":"Godbert, oh Godbeeert... Ugh, where are you?"},{"name":"SYSTEM","text":"You found a wind-up Godbert!"},{"name":"KIPIHJAKKYA","text":"(-Kipih Jakkya-)Bad news, adventurer. It seems I wasn't quick enough to find the mammet in Entrance Square. Please tell me you're faring better than I. "},{"name":"KIPIHJAKKYA","text":"(-Kipih Jakkya-)You found one!? Thank goodness! We're still in the running. I'll make haste to Event Square─godsspeed in finding your final mammet!"},{"name":"SYSTEM","text":"You found a wind-up Godbert!"},{"name":"KIPIHJAKKYA","text":"(-Kipih Jakkya-)Adventurer, good news this time! I found the mammet in Event Square!"},{"name":"KIPIHJAKKYA","text":"(-Kipih Jakkya-)You found yours, too? Then it's settled! That interview is mine─oh, is <span class=\"emphasis\">ours</span>, of course."},{"name":"KIPIHJAKKYA","text":"(-Kipih Jakkya-)We must report our victory to Ollier at once. See you at Entrance Square!"},{"name":"KIPIHJAKKYA","text":"There you are! Quite impressive work, I must say. To think we would trounce the opposition so convincingly─all thanks to your eagle eyes!"},{"name":"PETYRWINSOME","text":"Just a moment after I spied the mammet, I spied the reporter from <span class=\"emphasis\">The Raven</span> picking it up. Oh, if only I didn't stop for refreshments..."},{"name":"DURALTHARAL","text":"It seems I was no match for you, adventurer. You found both mammets before I even had a chance to take the lay of the land. I know who to call upon next time I need to search for treasure."},{"name":"OLLIER","text":"Welcome back. Mistress Jakkya has informed me that you were able to find two mammets?"},{"name":"OLLIER","text":"Indeed! Exactly two likenesses. The final results are as follows─three mammets found by the reporters of <span class=\"emphasis\">The Raven</span> and one mammet by the reporters of the <span class=\"emphasis\">Mythril Eye</span> and the <span class=\"emphasis\">Harbor Herald</span>."},{"name":"OLLIER","text":"Which means that <span class=\"emphasis\">The Raven</span> shall be rewarded with an exclusive interview with Lord Manderville! Congratulations to you both!"},{"name":"OLLIER","text":"Once you have sufficiently prepared yourselves, simply speak to me and I shall summon him forthwith."}],"reward":{"gil":277},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[66043,66064]},"next":[70264]},"partials":[{"type":"npc","id":"1044881","obj":{"i":1044881,"n":"Kipih Jakkya","l":40,"q":1}},{"type":"npc","id":"1045053","obj":{"i":1045053,"n":"Ollier","l":1484,"q":2}},{"type":"quest","id":"66043","obj":{"i":66043,"n":"The Gridanian Envoy","g":1,"l":"Gridania","s":86}},{"type":"quest","id":"66064","obj":{"i":66064,"n":"The Ul'dahn Envoy","g":1,"l":"Ul'dah","s":88}},{"type":"quest","id":"70264","obj":{"i":70264,"n":"Hearts of Gold","g":200,"l":"The Gold Saucer","s":203}}]}