{"quest":{"name":"I Am the Sunshine","location":"Eastern La Noscea","id":70260,"patch":6.3,"sort":223,"icon":101234,"eventIcon":71221,"issuer":1045008,"target":1045018,"genre":201,"journal":["Haermaga is eager to send the Sunshine Savior forth into the sands of Costa del Sol.<br>※This quest is available for a limited time only.","Reeve informs Haermaga that you have agreed to help him learn the ins and outs of helping those in need. The chaperone is keen on this idea, and instructs him to keep watch over the revelers on the northeastern shores of Costa del Sol. Your task is to help the youth spot any signs of trouble, and offer advice on how best to keep the peace.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","With your steady hand to guide him, Reeve can now count several deeds of heroism of his own. Every savior needs rest, however, and Beaudefoin soon arrives to take over watch duty. The youth is eager to share tidings of his success with Haermaga and asks you to accompany him.","Haermaga is pleased with Reeve's progress, and explains that his costume is modeled after the Phoenix of legend. Just like that legendary bird, the chaperone hopes that Reeve can be reborn, and thus recover his lost confidence. This hope is soon tested when an enormous shark emerges from the ocean depths, and Reeve is forced to drive it back in an impressive display of bravery. After the fight, Reeve stands dumbfounded at his own actions, and you somehow get the feeling he may require one final nudge in the right direction.","Your presence returns Reeve to his senses, and he is at last able to look the people he saved in the eyes. While he seems to have suffered no more than surface wounds, Haermaga instructs him to get checked nonetheless. The chairman asks you to join him in awaiting Reeve's return, while you both keep watch for any further fiends.","Reeve returns with a triumphant smile on his face. For your part in bringing the young adventurer into his own, Haermaga makes you an honorary Sunshine Savior, rewarding you with the selfsame costume that gave Reeve the confidence for heroics. You are now free to enjoy the Moonfire Faire and all its pleasures, for the savior of the sands' watch has only just begun."],"objectives":["Speak with Beaudefoin.","Speak with Haermaga.","Speak with Reeve.","Speak with Haermaga."],"dialogue":[{"name":"REEVE","text":"I'm ready to start whenever you are, <span class=\"highlight\">Forename</span>!"},{"name":"HAERMAGA","text":"Reeve looks every ilm the hero, and no mistake. But looks aren't worth a damn if his heart isn't in it."},{"name":"HAERMAGA","text":"How're you feeling under that mask, lad? Up for the work ahead?"},{"name":"REEVE","text":"About that... As much as I'd like to jump right into the thick of things, I can't help but harbor some small doubts."},{"name":"REEVE","text":"The incident with the merchant earlier made me realize that it's one matter to want to aid those in need, but another matter entirely to know who <span class=\"emphasis\">needs</span> it."},{"name":"REEVE","text":"Fortunately, I have <span class=\"highlight\">Forename</span> by my side─a seasoned adventurer who's helped <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> fair share of troubled souls. I've asked <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to take me under <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> wing for a bit, and I hope to be a quick study."},{"name":"HAERMAGA","text":"That's a capital idea, lad. Every adventurer has a few stories of being rewarded with scorn instead of coin. Strange as it sounds, a helping hand must be deft besides. "},{"name":"HAERMAGA","text":"Well then, let's revise your tasks, eh? Give you a chance to sharpen that nose of yours to the scent of unrest."},{"name":"HAERMAGA","text":"Why don't you stand watch over the revelers gathered at the northeastern shores? If you spot trouble brewing, put a lid on it before it spills over."},{"name":"HAERMAGA","text":"<span class=\"highlight\">Forename</span> will attend you in a supervisory capacity. Before leaping into action, ask <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> for advice on how to conduct yourself. <span class=\"alternative-container\"><span class=\"alternative\">She'll</span><span class=\"alternative\">He'll</span></span> guide you well, I've no doubt."},{"name":"HAERMAGA","text":"Now then, off with you! The battlefield on the beach awaits─make me proud, you two, make me proud!"},{"name":"HAERMAGA","text":"A guild member by the name of Beaudefoin is standing by for someone to relieve him of his duty. Speak with him first, then show the realm the measure of a Sunshine Savior!"},{"name":"REEVE","text":"This is it, <span class=\"highlight\">Forename</span>! It's time to prove myself worthy!"},{"name":"HAERMAGA","text":"Beaudefoin should be patrolling somewhere nearby, assuming he hasn't caught a nap under some shade. Relieve him of his post─I'll be here waiting for tidings of your success!"},{"name":"BEAUDEFOIN","text":"Why, if it isn't the Sunshine Savior, protector of the summer sands! Please, please, I release the beaches of Costa del Sol to your stewardship!"},{"name":"SYSTEM","text":"The following event cannot be skipped. You may wish to cancel any pending Duty Finder registrations."},{"name":"Q50","text":"Relieve Beaudefoin of his duty?"},{"name":"BEAUDEFOIN","text":"Ah, yes. Before I go, allow me to furnish you with these linkpearls. A crucial tool for a pair of strapping guardians such as yourselves. Godsspeed, saviors!"},{"name":"REEVE","text":"And now our watch begins! Go on, <span class=\"highlight\">Forename</span>, tell me what you see. If there is trouble lurking about, the Sunshine Savior shall rise to action!"},{"name":"Q1","text":"What do you see?"},{"name":"A1","text":"A young Miqo'te lad and lass look like a sellsword just stole their lunch."},{"name":"A1","text":"A shifty pirate lass is sizing up a nearby man. Quite intensely, by the looks of it."},{"name":"RFHULTIA","text":"Grrrggg...I failed again. I'll never master the course at this rate..."},{"name":"RMAJHA","text":"C'mon Fhul, I believe in you!"},{"name":"RMAJHA","text":"...But nothing I say seems to help. I wish I knew how to cheer you up..."},{"name":"REEVE","text":"The lad looks absolutely crestfallen. From what I can gather, he's having some difficulties with the Eorzean Nimble Warrior course. I know what it's like to feel success slip from one's grasp time and again..."},{"name":"Q2","text":"What should Reeve do?"},{"name":"A2","text":"Show him how a Sunshine Savior does it!"},{"name":"A2","text":"Give him some words of encouragement!"},{"name":"A2","text":"Leave him be. He'll learn more by lifting himself up."},{"name":"REEVE","text":"You want <span class=\"emphasis\">me</span> to attempt the course? I'm equal to the challenge, you can be sure, but that would mean leaving my charges unprotected."},{"name":"REEVE","text":"If you ask me, it looks like the lad needs but a few words of encouragement. Yes, that should do the trick. <span class=\"highlight\">Forename</span>, wait there─I'll be back in a flash!"},{"name":"REEVE","text":"You read my mind, <span class=\"highlight\">Forename</span>! Encouragement is my forte! A few carefully placed words should lift this lad over the obstacle in his path. Wait there─I'll be back in a flash!"},{"name":"REEVE","text":"I see the wisdom in that, truly I do. But I can't help but recall my own struggles─where would I have ended up if you and Master Haermaga didn't come along with a few encouraging words?"},{"name":"REEVE","text":"Surely it couldn't hurt, could it? Wait here, <span class=\"highlight\">Forename</span>─I'll be back before you can think of a reason to object!"},{"name":"REEVE","text":"The pair were thankful enough, and the lad seemed once again eager to tackle the course. All in all, a success for the Sunshine Savior!"},{"name":"RHOSWEN","text":"Bloody Carvallain, thinks he's too good for a pirate, does he?"},{"name":"RHOSWEN","text":"I'll make him see, I will. If I just ask him all nice-like..."},{"name":"RHOSWEN","text":"\"Fancy a stroll on the beach, Carvallain?“ or some such... Bah, he'll just think I'm itchin' fer a duel!"},{"name":"REEVE","text":"She's mumbling to herself an awful lot. The menacing provocations of a pirate, no doubt. What do you think, <span class=\"highlight\">Forename</span>?"},{"name":"Q3","text":"What should Reeve do?"},{"name":"A3","text":"Just ask if something's the matter."},{"name":"A3","text":"Don't worry about her. Worry about the man!"},{"name":"A3","text":"We should watch from a safe distance."},{"name":"REEVE","text":"I think you have the right of it, <span class=\"highlight\">Forename</span>. Even I can see that this has the look of something dangerous. I'd best insinuate myself into the matter before it takes a turn. "},{"name":"REEVE","text":"Ah, you're right! Anyone staring daggers like that can only have ill intent. I'll warn the man at once!"},{"name":"REEVE","text":"The pirate ran off with nary a word of explanation. I can't help but feel as if I interrupted something... Ah, well, there's no telling what could've happened, so as far as I'm concerned, the Sunshine Savior can mark down a victory in his ledger."},{"name":"REEVE","text":"Are you certain? This has the scent of danger...or perhaps something foul has washed ashore. Ah, no matter, I shall trust your advice. It's what you're here for, after all!"},{"name":"REEVE","text":"Hmm, I'm beginning to understand. She wishes to say something, but it's caught in her throat like a bone."},{"name":"REEVE","text":"...Ah, she's given up. Judging from her manner, she may have the same reservations as I concerning showing her face to others. A kindred spirit, in need of aid..."},{"name":"REEVE","text":"Alas, I have but a single mask, so I couldn't have helped even if I wanted. But you knew all of that, didn't you? Remarkable foresight, my friend, truly remarkable!"},{"name":"REEVE","text":"Well, I see nothing amiss in this area. What about over there?"},{"name":"Q4","text":"What do you see?"},{"name":"A4","text":"A group of revelers are entranced by the Eorzean Nimble Warrior course."},{"name":"A4","text":"Some muscular fellows are slumped over on the ground."},{"name":"MOBA04724","text":"(-Faire Reveler-)Go on, jump! Jump like your life depends on it!"},{"name":"MOBA04724","text":"(-Faire Reveler-)You'll never make it from there! Watch out or you'll eat sand!"},{"name":"MOBB04724","text":"(-Faire Reveler-)Oh no, is he all right!? I think I heard a snap..."},{"name":"Q5","text":"What should Reeve do?"},{"name":"A5","text":"You have to act!"},{"name":"A5","text":"Help him!"},{"name":"REEVE","text":"I'm coming!"},{"name":"REEVE","text":"Phew... Apologies for not waiting for your guidance, <span class=\"highlight\">Forename</span>. I dived into the ocean without a thought for what would come next..."},{"name":"REEVE","text":"Before I knew it, there was water under my mask. I was sure I'd meet my end then and there...but somehow, I found my bearings, and brought that man ashore. I suppose fortune favors the reckless, eh?"},{"name":"MOBC04724","text":"(-Muscle-bound Men-)&lt;huff&gt; &lt;huff&gt;"},{"name":"KHLOEALIAPOH","text":"Are you all right, sirs?"},{"name":"MOBD04724","text":"(-Muscle-bound Roegadyn-)My muscles burn for more... But gods, I can barely see straight..."},{"name":"ZHLOEALIAPOH","text":"Oh no, that's not good! Should I call upon one of the chaperones!?"},{"name":"REEVE","text":"I suppose this heat and intense exercise mix as well as oil does with water. Should I offer assistance?"},{"name":"Q6","text":"What should Reeve do?"},{"name":"A6","text":"Tell them to find a spot of shade to rest in."},{"name":"A6","text":"Tell them to drink plenty of fluids."},{"name":"A6","text":"Look at all those muscles. They'll be fine."},{"name":"REEVE","text":"You're quite right! Even the strongest of us will wither before the sun without water and rest. I'll go and tell them as much!"},{"name":"REEVE","text":"I see that, but what use are muscles before the pitiless rays of the sun? At the very least, I should recommend a short constitutional. "},{"name":"REEVE","text":"I had a word with the men, and they insisted there was nothing to worry about. Still, my duty is to dig out the roots of trouble before they break soil, so in that respect I consider this a success."},{"name":"REEVE","text":"Speaking of which, I see no further signs of distress along the beach. I believe our relief should be along soon, and truth be told I'm glad for it. I can't bear this stifling heat for much longer..."},{"name":"REEVE","text":"Still, better to be baking under the hot sun than drowning under the ocean waves. Every breath I took invited more water into my lungs... If one of the seven hells lies on the ocean floor, doubtless its doors were cast open for my arrival."},{"name":"REEVE","text":"But I'm grateful to be alive and well, and with a few feats of derring-do under my belt besides. That's in no small part thanks to you, <span class=\"highlight\">Forename</span>─your sound guidance led me to take action where I might have been paralyzed by doubt."},{"name":"REEVE","text":"I have Haermaga's costume to thank, too. It may very well have some special power to turn the timid into the lionhearted..."},{"name":"BEAUDEFOIN","text":"Impressive work, you two! I say you've earned some rest, eh? Allow me to watch over our patrons─I can only hope my stretch is half as eventful as yours was!"},{"name":"REEVE","text":"Much appreciated, Master Beaudefoin!"},{"name":"REEVE","text":"I suspect Master Haermaga will want to hear of our successes here. Let's go and make our report."},{"name":"REEVE","text":"I know I yet have a long journey ahead of me, but I hope that I've taken at least a few bounding strides toward my goal."},{"name":"HAERMAGA","text":"Ah, there you are! The stories of your deeds precede you─revelers up and down the beaches are taken with your bravery."},{"name":"HAERMAGA","text":"The one you plucked from the sea even came to offer his personal thanks. By all accounts, your lost confidence has been restored, and more besides. I reckon you're ready to set off on your own, but I won't force it upon you if you've got lingering reservations."},{"name":"REEVE","text":"I... Well, truth be told, I wouldn't have been able to do it without <span class=\"highlight\">Forename</span>'s help. And this mask, of course─donning it makes me forget the meaning of the word “impossible.”"},{"name":"HAERMAGA","text":"Hmm... You have to realize that <span class=\"highlight\">Forename</span> won't be around forever, so inclined to adventuring abroad as <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is. A savior needs to be able to carry their burden alone if they're to earn the trust of others."},{"name":"HAERMAGA","text":"You know, you never did tell us <span class=\"emphasis\">why</span> you're so frightened of showing your face. Something tells me you didn't crawl out of your mother's womb with your hands covering your eyes. Am I right?"},{"name":"REEVE","text":"...Aye. It happened when I was just getting my feet wet as an adventurer, during a job that should have been unremarkable..."},{"name":"REEVE","text":"We were tasked with guarding a merchant caravan, which naturally drew the attention of a terrible, slavering beast. Instead of sticking it with a spear like I was supposed to, I was knocked senseless within moments."},{"name":"REEVE","text":"When I regained my senses, I saw that my partner had been dealt a grievous wound and the caravan was in shambles─the job was an utter failure. For a blessing, none lost their lives, but <span class=\"emphasis\">I</span> lost all standing in the eyes of my allies and employers."},{"name":"REEVE","text":"They blamed me for their injuries and the damage to their goods, and rightfully so. The memory of their scornful gazes is etched in my mind, and I see them every time I look another in the eyes."},{"name":"HAERMAGA","text":"So you coped with your fear by hiding behind a helm. It's starting to make sense..."},{"name":"HAERMAGA","text":"You know, Reeve, that suit's more than a masterwork of comfort. There's a meaning behind its design, if you can believe it..."},{"name":"HAERMAGA","text":"See, it's meant to evoke the image of the Phoenix. That legendary bird symbolizes rebirth, rising from the ashes over and over again, each time shining brighter than before."},{"name":"HAERMAGA","text":"Seeing your triumphs as a Sunshine Savior has made me certain that the Phoenix's fire burns within <span class=\"emphasis\">you</span>, Reeve. And when those flames are stoked, you'll be reborn with more courage than you ever could've imagined."},{"name":"REEVE","text":"All this time, I was wrapped in the Phoenix's embrace... Yes, if there's a chance I might be born anew, then the path ahead of me is clear!"},{"name":"REEVE","text":"I'm heading back to the beach─this time without a mask!"},{"name":"HAERMAGA","text":"Something on your mind? Did I lay it on too thick?"},{"name":"HAERMAGA","text":"When you get to my age, you can't help but light fires under those that need it."},{"name":"HAERMAGA","text":"And that lad needed it something fierce, so I lit a raging bonfire under his arse! Just had to work with the embers that were already there─that burning desire of his to help the downtrodden."},{"name":"MOBA04724","text":"(-Distant Scream-)Y-Ye gads! Somebody, help!"},{"name":"REEVE","text":"Ungh... What's...wrong with me...?"},{"name":"HAERMAGA","text":"Not so fast, <span class=\"highlight\">Forename</span>! If someone jumps to his rescue again, that fire I just lit will be snuffed out. We need to think of a way to help him that doesn't involve doing all the heavy lifting."},{"name":"Q30","text":"What will you shout?"},{"name":"A30","text":"The Sunshine Savior never backs down!"},{"name":"A30","text":"Rise from the ashes of defeat, and be reborn!"},{"name":"A30","text":"No monster can stand against Reeve!"},{"name":"A30","text":"If you can't do it, no one can!"},{"name":"MOB04724","text":"(-Moonfire Reveler-)<span class=\"alternative-container\"><span class=\"alternative\">She's</span><span class=\"alternative\">He's</span></span> right! You're <span class=\"emphasis\">our</span> Sunshine Savior! So save us!"},{"name":"MOB04724","text":"(-Moonfire Reveler-)Give that beast what for!"},{"name":"REEVE","text":"They really...have faith in <span class=\"emphasis\">me</span>?"},{"name":"REEVE","text":"I can't let them down. I must uphold the reputation of the Sunshine Savior!"},{"name":"REEVE","text":"Gyaaaaaahhh!"},{"name":"REEVE","text":"Bathe in the flames of my rebirth! Bathe in the flames of the Phoenix!"},{"name":"HAERMAGA","text":"The lad looks unharmed─a small miracle, all things considered."},{"name":"BEAUDEFOIN","text":"I came as fast as I could, but it seems I was not needed. Reeve really made stew out of that shark, didn't he? It seems Haermaga was right about him."},{"name":"KHLOEALIAPOH","text":"That was so scary! I thought it would eat me!"},{"name":"ZHLOEALIAPOH","text":"Thank the heavens he was here! I don't know what I'd do if Khloe came to any harm..."},{"name":"TKEBBE","text":"Are you hurt, Khloe?"},{"name":"REEVE","text":"Um... Are you okay?"},{"name":"KHLOEALIAPOH","text":"That was so frightening, but so exciting at the same time! I'm gonna write about you in my diary!"},{"name":"ZHLOEALIAPOH","text":"Thank you, thank you, thank you! Khloe's safe, and it's all because of you!"},{"name":"REEVE","text":"But I was only─ Ah, never mind that. You're most welcome, of course."},{"name":"REEVE","text":"I'm not sure what to call what just happened, but the word “miracle” comes to mind. Did I truly vanquish that bloodthirsty brute of a shark?"},{"name":"HAERMAGA","text":"That you did, and without a single scratch on our guests. You showed them what the Sunshine Savior stands for and gave them a display they won't soon forget. All on your own, too."},{"name":"HAERMAGA","text":"But even a savior isn't invincible, eh? Go with Beaudefoin and get yourself checked. Wouldn't want you to be done in by a few scrapes."},{"name":"HAERMAGA","text":"<span class=\"highlight\">Forename</span> and I will keep an eye on things here in case any other seaborne predators decide to try their luck."},{"name":"HAERMAGA","text":"Ah, you've returned."},{"name":"HAERMAGA","text":"Thanks to you two, talk of the Adventurers' Guild is on the lips of all in Costa del Sol. As far as I'm concerned, we can consider the Sunshine Savior a rousing success and a boon for the guild."},{"name":"HAERMAGA","text":"Reeve here deserves a standing ovation for the bravery he displayed. Taking down a fiend like that and keeping the younglings safe is a feat very few can boast of."},{"name":"REEVE","text":"As my vision dimmed, I heard <span class=\"highlight\">Forename</span> call out to me. It was <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> words that delivered me from the brink, and allowed me to go further still."},{"name":"REEVE","text":"They might call me the Sunshine Savior, but you're the true hero of the day. You've given me the courage to go on alone, and for that there is no way I can repay you."},{"name":"HAERMAGA","text":"Indeed our savior had a savior of his own. A fact we're all grateful for."},{"name":"HAERMAGA","text":"I'm of a mind to make you an honorary Sunshine Savior, suit and all. Wear it well, and don't ask me how many more of these I have stashed away."},{"name":"HAERMAGA","text":"Now go on, forget your worries and take in your fill of the festivities, for the Moonfire Faire is safe so long as Reeve stands as its guardian!"},{"name":"REEVE","text":"Aye, I shall remain vigilant for any signs of trouble. And if aught appears to threaten the peace..."},{"name":"REEVE","text":"<span class=\"emphasis\">I'll</span> be there to stop it!"}],"reward":{"gil":530,"items":[{"id":39245},{"id":39246}]},"reqs":{"jobs":[{"lvl":30,"id":1}],"quests":[70259]}},"partials":[{"type":"npc","id":"1045008","obj":{"i":1045008,"n":"Haermaga","l":32,"q":1,"t":"Moonfire Faire Chairman"}},{"type":"npc","id":"1045018","obj":{"i":1045018,"n":"Haermaga","l":32,"q":1,"t":"Moonfire Faire Chairman"}},{"type":"item","id":"39245","obj":{"i":39245,"n":"Phoenix Riser Helmet","l":1,"c":"t/56563","t":34}},{"type":"item","id":"39246","obj":{"i":39246,"n":"Phoenix Riser Suit","l":1,"c":42944,"t":35}},{"type":"quest","id":"70259","obj":{"i":70259,"n":"Allergic to Sunshine","g":201,"l":"Limsa Lominsa","s":222}}]}