{"quest":{"name":"Well-oiled","location":"Radz-at-Han","id":70261,"patch":6.35,"sort":201,"icon":101235,"unlocksFunction":1,"eventIcon":71341,"issuer":1043890,"target":1043890,"genre":72,"usedItems":[38940],"journal":["Gerolt isn't immediately shooing you away, which means he must have something to share.<br>※Changing classes or jobs will prevent progress during this quest.","Godbert is ready to proceed with the refinement of his family's weaponry, and to that end, the goldsmith informs you that yet another type of meteoritic material is needed to enhance your armament's aetherial conductivity. According to his ancestor's manual, however, the true key to the process is something rather more intangible: a clarity achieved in the aftermath of an invigorating victory. Godbert claims to have already gained such battle-based enlightenment through his encounter with Doctor Lugae, and insists that Gerolt undergo his own form of martial meditation. You are to accompany the blacksmith to Windweft, where Godbert has prepared for him the perfect opponent.<br><br>※You may not proceed with a class or job that is different from when you accepted this quest.","Godbert introduces you to Gerolt's opponent: an adorable axe-wielding mammet. Despite his obvious advantage in size and strength, Gerolt loses the initial bout, but a generous application of Salamanderville empowers him to overcome the surprisingly agile automaton. Fired up by his win, the blacksmith can hardly wait to stoke the flames of his furnace. It seems you had best acquire the necessary materials swiftly, before the glow of victory fades...<br><br>Chunks of complementary chondrite can be obtained from Jubrunnah at the aetheryte plaza in Radz–at–Han.","You deliver the chunks of chondrite to Gerolt, and the world seems to grow dark as you anxiously await the outcome. When the hammering stops, however, you find yourself in possession of a successfully augmented Manderville masterpiece. Gerolt then inquires as to how long the entire refinement process is likely to take─a question to which Godbert has no present answer. In breaking the cipher, Godbert has realized that the manual is but the first part of an incomplete set, and that locating the remainder of Godbrand's instructions will be a quest unto itself. Until the continuation of the guide is found, you must content yourself with your as-yet-imperfect weaponry."],"objectives":["Wait at the designated location.","<span class=\"alternative-container\"><span class=\"alternative\">Obtain chunks of complementary chondrite</span><span class=\"alternative\">Manderville Knuckles and Manderville Kite Shield</span><span class=\"alternative\">Manderville Knuckles</span><span class=\"alternative\">Manderville Axe</span><span class=\"alternative\">Manderville Spear</span><span class=\"alternative\">Manderville Harp Bow</span><span class=\"alternative\">Manderville Cane</span><span class=\"alternative\">Manderville Rod</span><span class=\"alternative\">Manderville Index</span><span class=\"alternative\">Manderville Codex</span><span class=\"alternative\">Manderville Knives</span><span class=\"alternative\">Manderville Revolver</span><span class=\"alternative\">Manderville Zweihander</span><span class=\"alternative\">Manderville Torquetum</span><span class=\"alternative\">Manderville Samurai Blade</span><span class=\"alternative\">Manderville Rapier</span><span class=\"alternative\">Manderville Gunblade</span><span class=\"alternative\">Manderville Chakrams</span><span class=\"alternative\">Manderville Scythe</span><span class=\"alternative\">Manderville Milpreves</span><span class=\"alternative\">With  in your inventory or Armoury Chest, deliver the chunks of complementary chondrite to Gerolt</span></span>."],"dialogue":[{"name":"SYSTEM","text":"Please note that upon completing the quest “Well-oiled,” you will receive a Manderville weapon for <span class=\"alternative-container\"><span class=\"alternative\">an [Job]</span><span class=\"alternative\">a [Job]</span></span>."},{"name":"SYSTEM","text":"Please ensure you have changed to your desired job before speaking with Gerolt."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Undertake this quest as another job."},{"name":"A1","text":"Undertake this quest as <span class=\"alternative-container\"><span class=\"alternative\">an [Job]</span><span class=\"alternative\">a [Job]</span></span>."},{"name":"SYSTEM","text":"Be advised that once you have undertaken this quest, you may not proceed with a class or job that is different from when you accepted it."},{"name":"SYSTEM","text":"Please speak with Gerolt again when you are ready to undertake this quest."},{"name":"SYSTEM","text":"In order to accept the quest “Well-oiled,” please ensure that [Error] and [Error] are either equipped, in your Armoury Chest, or in your inventory."},{"name":"SYSTEM","text":"In order to accept the quest “Well-oiled,” please ensure that [Error] is either equipped, in your Armoury Chest, or in your inventory."},{"name":"GEROLT","text":"<span class=\"highlight\">Forename</span>. How're ye findin' that Manderville weaponry o' yers?"},{"name":"GEROLT","text":"Seein' as mine was the hand at the forge, the answer yer lookin' for is “bloody marvelous.”"},{"name":"GEROLT","text":"Still, it can always be better. And it sounds like Godbert's ready to build on the bare bones o' what we've produced so far."},{"name":"CRAFTER04653","text":"I shall call upon his lordship..."},{"name":"GODBERT","text":"<span class=\"highlight\">Forename</span>! So good of you to come!"},{"name":"GODBERT","text":"I've had my nose buried in that mystifying manual for what feels an age or more, but my decoding efforts have at last borne delicious fruits."},{"name":"GODBERT","text":"'Twould seem that to further enhance the aetherial conductivity of our weaponry, we must apply yet another variety of meteorite─much as one produces sparks by smashing one rock against another. A rare chondrite, in this case."},{"name":"GODBERT","text":"The true key to the process, however, is something rather more intangible..."},{"name":"GEROLT","text":"Well, don't leave us hangin', ye overdramatic peacock. Tell us already!"},{"name":"GODBERT","text":"My ancestor's tome is...well, it is as much journal as it is instructional guide, and Godbrand details a history of failure to elevate his creations."},{"name":"GODBERT","text":"As he was an accomplished warrior as well, he thus removed himself to the furthest reaches of the wilds, where he sought to vent his frustrations upon the most fearsome fiends that crossed his path."},{"name":"GODBERT","text":"Post-battle clarity filled his spirit, and, miracle of miracles, his very next attempt at augmentation was a resounding success."},{"name":"GODBERT","text":"So you see, the missing ingredient in Godbrand's recipe for refinement was the sublime tranquility achieved in the wake of an invigorating victory."},{"name":"GODBERT","text":"I, myself, received the blessings of battle-based enlightenment on my travels with <span class=\"highlight\">Forename</span>, following a mildly strenuous encounter with one Doctor Lugae."},{"name":"GODBERT","text":"However! I contend, Master Gerolt, that your martial meditation is as yet woefully inadequate!"},{"name":"GEROLT","text":"Eh!? Ye think me smashin' skulls instead o' ingots'll somehow improve me forgin' instincts!?"},{"name":"GODBERT","text":"I guarantee it! In fact, until you triumph over this trial, I suspect the next rung of Manderville mastery will forever remain beyond your reach."},{"name":"GODBERT","text":"Not that I expect you to charge blindly into fisticuffs. Nay, sir, I have prepared for you the perfect opponent."},{"name":"GODBERT","text":"<span class=\"highlight\">Forename</span>, if you would be so kind as to join Master Gerolt at Windweft, I shall be with you momentarily."},{"name":"GEROLT","text":"He wants me to fight some poor sap out at Windweft...? Waste o' bloody time, if ye ask me."},{"name":"GEROLT","text":"Well, here I am. So where's me “perfect opponent”?"},{"name":"GODBERT","text":"Eager to begin, I see. Capital! Follow me, and we can get this clarifying combat underway."},{"name":"GEROLT","text":"Pfft. A flimsy little mammet? Now, I ain't a warrior, but feast yer eyes on these corded arms. If this were a tavern brawl, the smart coin'd be on the smitty."},{"name":"GODBERT","text":"As it should be! Which is why I've set this fellow's battle parameters to the maximum level."},{"name":"GEROLT","text":"R-Right, then! Let's do this!"},{"name":"GEROLT","text":"Tricky...little bastard..."},{"name":"GODBERT","text":"Hm. I know what this calls for..."},{"name":"GODBERT","text":"A generous application of Manderville-mandated lubrication!"},{"name":"GEROLT","text":"What did ye jus' slather me with!?"},{"name":"GODBERT","text":"Only the finest Salamanderville, my good man! Feel it sink into your muscles and augment your natural prowess. 'Tis the oil of champions!"},{"name":"GEROLT","text":"Ye know, I <span class=\"emphasis\">do</span> feel oddly powerful..."},{"name":"GEROLT","text":"Hah! Take that, tin man!"},{"name":"GEROLT","text":"What a rush─I've never wanted to forge summat so badly. Is this that “battle enlightenment” ye was on about?"},{"name":"GODBERT","text":"The very same. In your heightened state of awareness, our enhancements are sure to be flawless."},{"name":"GEROLT","text":"Then let's get to work. As before, yer job is to bargain for meteorite chunks from Jubrunnah. Rowena knows to supply her with the chondrite we need."},{"name":"GEROLT","text":"I'll head back an' warm up the furnace!"},{"name":"GODBERT","text":"Ohohoho! Even at its weakest, watching my mammet do battle is always a treat."},{"name":"GODBERT","text":"Yes, I actually had this axe-wielding gentleman set to his lowest parameters. And while the Salamanderville does stimulate circulation, it has no other special effects."},{"name":"GODBERT","text":"The most daunting opponent, you see, is the prison of the mind. Even should the battle itself be a charade, the positive momentum one gains from prevailing in what was perceived to have been a mighty struggle is no less real."},{"name":"GODBERT","text":"Now, if you would kindly see to procuring the chondrite, I must attend to my part of the preparations."},{"name":"SYSTEM","text":"Chunks of complementary chondrite can be obtained from Jubrunnah at the aetheryte plaza in Radz–at–Han."},{"name":"GEROLT","text":"Where's the chondrite? Three chunks ought to do it, but make it quick─I don't want to lose me fightin' focus!"},{"name":"SYSTEM","text":"Chunks of complementary chondrite can be obtained from Jubrunnah at the aetheryte plaza in Radz–at–Han."},{"name":"GEROLT","text":"Ye've got the chondrite? And I'll need ye to unbuckle the weaponry afore I can work on it, ye daft sod."},{"name":"GEROLT","text":"The furnace is roarin' an' ready. Let's have them new space rocks, then."},{"name":"GEROLT","text":"Right. Send for his lordship, an' we can break out the hammer an' tongs!"},{"name":"GODBERT","text":"Success!"},{"name":"GEROLT","text":"Our collaborative masterpiece, taken to new heights..."},{"name":"GEROLT","text":"[Error] an' [Error]!"},{"name":"GEROLT","text":"[Error]!"},{"name":"GODBERT","text":"What did I tell you! 'Tis the undeniable results of your martial awakening!"},{"name":"GEROLT","text":"I still have me doubts on that front, but aye, 'tis a thing o' beauty, nonetheless."},{"name":"GODBERT","text":"On the topic of masterpieces, <span class=\"highlight\">Forename</span>, should you desire to refine any other Manderville armaments in your possession, then pray call upon my artisanal protégé here."},{"name":"GODBERT","text":"He, too, has found enlightenment in the crucible of battle, and stands ready with a clear mind and steady hand."},{"name":"GEROLT","text":"Aye, well...I'll be around, as usual, to make sure it all meets me demandin' standards."},{"name":"GODBERT","text":"Are you pleased with your weaponry's new appearance, by the by? Or were you mayhap more enamored with its previous incarnation?"},{"name":"GODBERT","text":"Ohoho, I do understand the attraction of simple elegance."},{"name":"GODBERT","text":"Which is why we've begun offering a line of Manderville weapon replicas!"},{"name":"GODBERT","text":"I am opening a storefront here on a trial basis, so please, do bless us with your patronage if you feel so inclined."},{"name":"GEROLT","text":"An' I thought Rowena was a glutton for commerce."},{"name":"GODBERT","text":"Our work is as aesthetically pleasing as it is practical. 'Twould be foolish to leave such an obvious business venture untapped."},{"name":"GEROLT","text":"Merchant talk aside, how much longer until we properly perfect yer ancestor's creation? I get the feelin' we've scarce scratched the surface."},{"name":"GODBERT","text":"An excellent question...and a difficult one to answer. In breaking the cipher, I've come to realize that the manual is but the first part of an incomplete set."},{"name":"GEROLT","text":"Incomplete? Ye can't be serious! Where's the bloody rest of it, then?"},{"name":"GODBERT","text":"Presently unknown. Finding the continuation of Godbrand's guide shall consume my waking hours."},{"name":"GEROLT","text":"Bah, then occupyin' a table at the meyhane will consume mine. Yer lucky they've got an impressive selection of spirits..."},{"name":"GODBERT","text":"Once again, I do apologize for the interminable delays."},{"name":"GODBERT","text":"Fare thee well, my friends. I shall depart on my quest without further ado."},{"name":"SYSTEM","text":"Manderville weapon replicas can now be purchased from the House Manderville vendor."}],"reward":{"items":[{"id":39144},{"id":39163},{"id":39145},{"id":39146},{"id":39147},{"id":39148},{"id":39152},{"id":39153},{"id":39154},{"id":39155},{"id":39149},{"id":39150},{"id":39151},{"id":39156},{"id":39157},{"id":39158},{"id":39159},{"id":39160},{"id":39162},{"id":39161}]},"reqs":{"jobs":[{"lvl":90,"id":191}],"questsType":"all","quests":[70255,70188]},"next":[70262]},"partials":[{"type":"npc","id":"1043890","obj":{"i":1043890,"n":"Gerolt","l":3707,"q":1}},{"type":"item","id":"39144","obj":{"i":39144,"n":"Amazing Manderville Sword","l":630,"c":"t/30660","t":2}},{"type":"item","id":"39163","obj":{"i":39163,"n":"Amazing Manderville Kite Shield","l":630,"c":"t/30250","t":11}},{"type":"item","id":"39145","obj":{"i":39145,"n":"Amazing Manderville Knuckles","l":630,"c":"t/30825","t":1}},{"type":"item","id":"39146","obj":{"i":39146,"n":"Amazing Manderville Axe","l":630,"c":"t/31234","t":3}},{"type":"item","id":"39147","obj":{"i":39147,"n":"Amazing Manderville Spear","l":630,"c":"t/31636","t":5}},{"type":"item","id":"39148","obj":{"i":39148,"n":"Amazing Manderville Harp Bow","l":630,"c":"t/32025","t":4}},{"type":"item","id":"39152","obj":{"i":39152,"n":"Amazing Manderville Cane","l":630,"c":"t/32454","t":9}},{"type":"item","id":"39153","obj":{"i":39153,"n":"Amazing Manderville Rod","l":630,"c":"t/32869","t":7}},{"type":"item","id":"39154","obj":{"i":39154,"n":"Amazing Manderville Index","l":630,"c":"t/33373","t":10}},{"type":"item","id":"39155","obj":{"i":39155,"n":"Amazing Manderville Codex","l":630,"c":"t/33378","t":98}},{"type":"item","id":"39149","obj":{"i":39149,"n":"Amazing Manderville Knives","l":630,"c":"t/33611","t":84}},{"type":"item","id":"39150","obj":{"i":39150,"n":"Amazing Manderville Zweihander","l":630,"c":"t/34388","t":87}},{"type":"item","id":"39151","obj":{"i":39151,"n":"Amazing Manderville Revolver","l":630,"c":"t/34484","t":88}},{"type":"item","id":"39156","obj":{"i":39156,"n":"Amazing Manderville Torquetum","l":630,"c":"t/34984","t":89}},{"type":"item","id":"39157","obj":{"i":39157,"n":"Amazing Manderville Samurai Blade","l":630,"c":"t/36539","t":96}},{"type":"item","id":"39158","obj":{"i":39158,"n":"Amazing Manderville Rapier","l":630,"c":"t/36838","t":97}},{"type":"item","id":"39159","obj":{"i":39159,"n":"Amazing Manderville Gunblade","l":630,"c":"t/36081","t":106}},{"type":"item","id":"39160","obj":{"i":39160,"n":"Amazing Manderville Chakrams","l":630,"c":"t/36280","t":107}},{"type":"item","id":"39162","obj":{"i":39162,"n":"Amazing Manderville Scythe","l":630,"c":"t/37250","t":108}},{"type":"item","id":"39161","obj":{"i":39161,"n":"Amazing Manderville Milpreves","l":630,"c":"t/37048","t":109}},{"type":"item","id":"38940","obj":{"i":38940,"n":"Complementary Chondrite","l":1,"c":21243,"t":61}},{"type":"quest","id":"70255","obj":{"i":70255,"n":"Generational Bonding","g":71,"l":"Thavnair","s":320,"f":1}},{"type":"quest","id":"70188","obj":{"i":70188,"n":"Make It a Manderville","g":72,"l":"Radz-at-Han","s":101,"f":1}},{"type":"quest","id":"70262","obj":{"i":70262,"n":"The Next Mander-level","g":72,"l":"Radz-at-Han","s":251,"r":1,"f":1}}]}